{
  "source": "AC 20-151C.md",
  "chunks": [
    "# Advisory Circular U.S. Department Of Transportation Federal Aviation Administration\n\nDate: 07/21/2017 \nAC No: 20-151C \nInitiated by: AIR-100 \nChange: \nSubject: Airworthiness Approval of Traffic Alert and Collision Avoidance Systems (TCAS II), Versions 7.0 & 7.1 and Associated Mode S Transponders \n\n## Foreword",
    "## Foreword\n\nThis AC provides guidance for applicants seeking airworthiness approval for TCAS II certified to technical standard order (TSO) C119c, TSO-C119d or TSO-C119e, Traffic Alert and Collision Avoidance System (TCAS) Airborne Equipment, TCAS II with Hybrid Surveillance. If you have suggestions for improving this AC, you may use the form at the end of this document. Susan J. M. Cabler Manager, Design, Manufacturing, & Airworthiness Division, Aircraft Certification Service",
    "## Table Of Contents",
    "Chapter 1. General Information. .................................................................................................. 1-1",
    "1.1 Purpose of this Advisory Circular................................................................................. 1-1 1.2 Who this AC applies to. ................................................................................................ 1-1 1.3 Cancellation. ................................................................................................................. 1-1 1.4 Significant Changes.",
    "1-1 1.4 Significant Changes. ..................................................................................................... 1-1 1.5 Scope.",
    "............................................................................................................................ 1-2 \nChapter 2. TCAS II SYSTEM ..................................................................................................... 2-1 \n2.1 System Description. ...................................................................................................... 2-1",
    "2.1.1 Description of a TCAS II System. .................................................................... 2-1 2.1.2 System Advisories. ........................................................................................... 2-1 2.1.3 System Flight Deck Displays. \n........................................................................... 2-1 \n2.1.4 Mode S Transponder. \n........................................................................................ 2-2",
    "........................................................................................ 2-2 \n2.1.5 Hybrid Surveillance. ......................................................................................... 2-2 \n2.2 System Components and Requirements........................................................................ 2-2 \n2.2.1 Mode S Transponder. \n........................................................................................ 2-2 \n2.2.2 Pilot Control.",
    "2.2.2 Pilot Control. \n..................................................................................................... 2-3 \n2.2.3 Antennas. .......................................................................................................... 2-4 2.2.4 Structural analysis. \n............................................................................................ 2-5",
    "............................................................................................ 2-5 \n2.2.5 The TCAS Processor......................................................................................... 2-5 2.2.6 Traffic Display. ................................................................................................. 2-5 2.2.7 Resolution Advisory Display. \n........................................................................... 2-6",
    "........................................................................... 2-6 \n2.2.8 Caution/Warning Lights.................................................................................... 2-7 2.2.9 Aural Alert Requirements. ................................................................................ 2-7 2.2.10 Failures, TCAS and Transponder. .................................................................... 2-9 \n2.3 Airworthiness Considerations.",
    "2.3 Airworthiness Considerations. \n.................................................................................... 2-10 \n2.3.1 Certification Program...................................................................................... 2-10 2.3.2 Certification plan. ........................................................................................... 2-10 2.3.3 Equipment Compatibility Requirements. \n........................................................ 2-10",
    "........................................................ 2-10 \n2.3.4 Aircraft Performance Considerations. ............................................................ 2-12 2.3.5 Evaluating Aircraft Performance. ................................................................... 2-12",
    "2.3.6 How Aircraft Systems Should Interface with TCAS II. ................................. 2-18 2.3.7 Verifying and Validating TCAS II Software. ................................................. 2-20 2.3.8 Failure Conditions System Safety Assessment and Design Assurance. ......... 2-22 \n2.3.9 Maintenance Considerations for Hybrid Surveillance Functionality (TSO-C119d \nand later). ........................................................................................................ 2-23",
    "2.3.10 Populating Mode S Transponder registers 4016 and 6216 (if implemented). \n... 2-24 \nChapter 3. Test and Evaluation (Initial Approval). \n...................................................................... 3-1 \n3.1 General. \n......................................................................................................................... 3-1 \n3.2 Create a Test Plan. ........................................................................................................ 3-1",
    "3.2.1 Basic Ground Tests. .......................................................................................... 3-1 \n3.2.2 Basic Flight Tests. \n............................................................................................. 3-3 \n3.2.3 Planned Encounter Flight Tests. ....................................................................... 3-5 3.2.4 Mode S Transponder Tests. .............................................................................. 3-6",
    "Chapter 4. Follow-on Approvals.................................................................................................. 4-1 \n4.1 General \n.......................................................................................................................... 4-1",
    "4.2 Ground Tests and Evaluations. ..................................................................................... 4-1 4.3 Flight Tests.................................................................................................................... 4-3 4.4 Upgrading an Existing TCAS II Installation. ............................................................... 4-5 4.5 Upgrading an Existing Mode S Transponder Installation............................................. 4-5",
    "Chapter 5. Airplane Flight Manual Supplement .......................................................................... 5-1 \n5.1 Content of an AFMS. \n.................................................................................................... 5-1 \n5.2 TCAS V7.1 AFMS Example. ....................................................................................... 5-1",
    "Appendix A. Example TCAS II V7.1 AFMS ............................................................................. A-1 Appendix B. Transponder Ground Tests & Evaluations. ............................................................B-1 Appendix C. Historical Information on Development of TCAS. ................................................C-1 \nEarly TCAS. \n..................................................................................................................C-1",
    "Recent TCAS Developments. .......................................................................................C-1 Accident history related to the development and evolution of TCAS. .........................C-3 \nAppendix D. Related Documents. .............................................................................................. D-1",
    "14 CFR Parts. ............................................................................................................... D-1 FAA ACs. .................................................................................................................... D-2 FAA TSOs. .................................................................................................................. D-2 FAA Other.",
    "D-2 FAA Other. .................................................................................................................. D-3 RTCA Inc. Publications. .............................................................................................. D-3 SAE International......................................................................................................... D-3 AERONAUTICAL RADIO, INC. (ARINC)............................................................... D-4",
    "## Chapter 1. General Information.",
    "1.1 \nPurpose of this Advisory Circular.  We wrote this advisory circular (AC) to guide \napplicants seeking airworthiness approval for TCAS II version 7.1 (V7.1) certified to technical standard order (TSO) C119c, TSO-C119d or TSO-C119e, Traffic Alert and \nCollision Avoidance System (TCAS) Airborne Equipment, TCAS II with Hybrid",
    "Surveillance.  This AC also provides guidance for applicants seeking airworthiness approval for stand-alone Mode S transponders certified to TSO-C112e, Air Traffic Control Radar Beacon System/Mode Select (ATCRBS/Mode S) Airborne Equipment. You can also use the guidance in this AC for seeking airworthiness approval for TCAS II version 7.0 (V7.0) certified to TSO-C119b, Traffic Alert and Collision Avoidance System (TCAS) Airborne Equipment, TCAS II and associated Mode S transponders.",
    "This AC is not mandatory and does not constitute a regulation.  In it, we describe an acceptable means, but not the only means, to gain airworthiness approval of TCAS II versions 7.0 and 7.1 systems.  However, if you use the means described in the AC, you must follow it in all important respects.  The term \"must\" is used to indicate mandatory requirements when following the guidance in this AC. The terms \"should\" and \"recommend\" are used when following the guidance is recommended but not",
    "AC. The terms \"should\" and \"recommend\" are used when following the guidance is recommended but not required to comply with this AC.",
    "1.2 \nWho this AC applies to.  Applicants seeking a type certificate (TC), amended type",
    "certificate, or supplemental type certificate (STC) under Title 14 of the Code of Federal Regulations (14 CFR) part 25 for initial approval and follow-on approvals of TCAS II systems or stand-alone Mode S transponder systems.  References to 14 CFR part 25 are appropriate when TCAS II is installed on transport category airplanes.  When TCAS II is to be certified for non-transport category airplanes, use the equivalents to the above 14 CFR part 25 sections in other parts of the regulations.",
    "use the equivalents to the above 14 CFR part 25 sections in other parts of the regulations.  Although this AC is intended for TCAS II installed on transport category airplanes, it provides useful guidance for part 23 installations if you refer to the equivalent ACs and sections of 14 CFR part 23.",
    "1.3 \nCancellation.  This revision cancels AC 20-151B, dated March 18, 2014. \n1.4 \nSignificant Changes. This revision of the AC does the following: \n1.4.1 \nMitigates spurious RAs with installation of TSO-C119e TCAS II units. \n1.4.2 \nAdds guidance for implementing select functionality associated with extended squitter, elementary and enhanced Mode S surveillance messaging. \n1.4.3",
    "1.4.3 \nElaborates on and clarifies the failure condition classification of TCAS II systems, particularly with regard to missing RAs (failure to provide an RA, or providing one late, when a threat is present). \n1.4.4 \nSets policy and provides guidance to annunciate TCAS and transponder failures in the primary field of view as an advisory level alert. \n1.5 \nScope. What this AC Covers. \n1.5.1",
    "In this AC, we cover design aspects, characteristics, mechanization, testing, and the criticality of system failure cases for TCAS II V7.0 and V7.1 and associated Mode S transponders.  Our guidance focuses on systems that provide traffic advisories (TA) and resolution advisories (RA) in the vertical sense only (TCAS II), and where operational performance standards are defined in technical documents developed by a joint air transport industry-government group (the RTCA, Inc. Special Committee",
    "developed by a joint air transport industry-government group (the RTCA, Inc. Special Committee SC-147).",
    "1.5.2 \nWe also cover TCAS II hybrid surveillance, which is now included in a TCAS II \nsystem. \n1.5.3 \nWe do not cover traffic symbology for traffic displays in systems that integrate TCAS and Airborne Separation Applications System (ASAS).  Guidance for airworthiness approvals of ADS-B Out and ADS-B In can be found in Advisory Circulars 20-165B and 20-172B respectively. \n1.5.4",
    "1.5.4 \nWe also cover implementation of certain messaging capability of extended squitter and ELS/EHS Mode S Transponders, specifically, Selected Vertical Intention (BDS register 4016) and Target State and Status Information (BDS register 6216). \n1.5.5",
    "1.5.5 \nFor more thorough guidance on Mode S Elementary surveillance, refer to Joint Aviation Authorities (JAA) Temporary Guidance Leaflet (TGL) 13 Revision 1, Certification of Mode S Transponder Systems for Elementary Surveillance, and EASA Certification Specification and Acceptable Means of Compliance - Airborne Communication Navigation and Surveillance, (CS-ACNS). \n1.5.6",
    "1.5.6 \nFor more thorough guidance on Mode S Enhanced surveillance, refer to Acceptable Means of Compliance (AMC) 20-13, Certification of Mode S Transponder Systems for Enhanced Surveillance, and EASA CS-ACNS. \n1.5.7 \nThis advisory circular provides applicants with guidance for obtaining an airworthiness approval for TCAS II.  Integration with flight guidance systems in an aircraft is out of \nscope for this document.  For guidance on integration with an aircraft's flight guidance",
    "scope for this document.  For guidance on integration with an aircraft's flight guidance \nsystem, refer to Advisory Circular 25.1329-1C, *Approval of Flight Guidance Systems*.",
    "## Chapter 2. Tcas Ii System 2.1 System Description.",
    "2.1.1",
    "Description of a TCAS II System.  TCAS II is an airborne traffic alert and collision avoidance system that interrogates air traffic control (ATC) transponders in nearby aircraft and uses computer processing to identify and display potential and predicted collision threats.  The system is designed to protect a volume of airspace around the TCAS II equipped aircraft.  The system will provide appropriate aural and visual advisories to the flight crew to take action to ensure adequate separation",
    "aural and visual advisories to the flight crew to take action to ensure adequate separation when the computer analysis of the intruding aircraft transponder replies predict a penetration of the protected airspace.",
    "The TCAS II system can only generate RAs for intruders equipped with responding Mode S or Mode C transponders, which provide information on the altitude of the threat aircraft.  Traffic advisories can be generated for any aircraft equipped with an operative Mode S or an ATCRBS transponder, regardless of its ability to provide information on the intruder aircraft's altitude. We view TCAS II systems as a supplement to the pilot who has the primary responsibility for avoiding midair collisions.",
    "as a supplement to the pilot who has the primary responsibility for avoiding midair collisions.  The TCAS II system provides no protection from threat aircraft without operative transponders.  TCAS II does not alter or diminish the pilot's basic authority and responsibility to ensure safe flight. Nevertheless, TCAS II is a safety-enhancing system that has been introduced and refined in response to accident experience, and it is required by operating rules for certain aircraft.  Therefore, we",
    "to accident experience, and it is required by operating rules for certain aircraft.  Therefore, we consider it important for TCAS II systems to perform their intended function with adequate reliability, and for flight crews to be made aware promptly and conspicuously when TCAS failure or loss of function occurs.  It is important to note that own-ship and intruder aircraft transponders are a vital part of the system.",
    "2.1.2 \nSystem Advisories.  The system provides two types of advisories: \n2.1.2.1 \nTAs indicate the relative positions of intruding aircraft that are approximately 20 - 48 seconds from the closest point of approach (CPA), depending on the sensitivity level (SL), and may a short time later require a RA.  TAs also give the flight crew the opportunity to visually acquire the intruding aircraft out-the-window. \n2.1.2.2",
    "2.1.2.2 \nRAs provide a vertical avoidance maneuver to increase separation when the computer predicts the threat aircraft is between 15-35 seconds from the closest point of approach, depending on the SL. \n2.1.3 \nSystem Flight Deck Displays.  The system provides two types of flight deck displays: \n2.1.3.1 \nA traffic display depicts the relative position of ATC transponderequipped aircraft. \n2.1.3.2",
    "A traffic display depicts the relative position of ATC transponderequipped aircraft. \n2.1.3.2 \nAn RA display for each pilot indicates the appropriate vertical maneuver to avoid a threat.  The RA display provides the pilot with information on the vertical speed or pitch angle to fly in order to avoid a threat.  The RA display is typically implemented on an instantaneous vertical speed",
    "indicator (IVSI), a vertical speed tape that is part of a Primary Flight Display (PFD), or using pitch cues displayed on the PFD. \n2.1.4 \nMode S Transponder. \n2.1.4.1 \nThe TCAS II aircraft must be equipped with a Mode S ATC transponder, which provides air-to-air communications for coordinating the resolution maneuvers between TCAS II equipped aircraft. \n2.1.4.2 \nThe Mode S transponder also provides discrete-address replies to",
    "2.1.4.2 \nThe Mode S transponder also provides discrete-address replies to \ninterrogations from ground stations and other aircraft equipped with TCAS II. \n2.1.5",
    "Hybrid Surveillance.  Hybrid surveillance is a function of TCAS used as a means to decrease Mode S interrogations.  Aircraft may use passive surveillance instead of active surveillance to track intruders that meet validation criteria and are not projected to be near-term collision threats.  Active surveillance uses the standard TCAS transponder interrogation that provides range, bearing and altitude to the intruder.  Passive surveillance uses automatic dependent surveillance-broadcast (ADS-B)",
    "to the intruder.  Passive surveillance uses automatic dependent surveillance-broadcast (ADS-B) data broadcast from other aircraft.    The passive surveillance data is broadcast and received through the use of Mode S Extended Squitter, that is, 1090 megahertz (MHz) ADS-B.  Hybrid surveillance does not degrade the performance of TCAS active surveillance.  This is a requirement and is tested by ensuring active surveillance performs as specified by the TCAS II performance standards.",
    "## 2.2 System Components And Requirements.",
    "2.2.1 \nMode S Transponder. \n2.2.1.1",
    "A Mode S transponder is required for TCAS II operation.  It is an enhanced version of the ATCRBS transponder design that is interoperable and compatible with ATCRBS.  Each aircraft equipped with a Mode S transponder is assigned a discrete address code.  Mode S also provides the air-to-air data link between TCAS II-equipped aircraft to coordinate resolution maneuvers.  This ensures the RA displayed in one TCAS II- equipped aircraft is compatible with the maneuver displayed in the other TCAS II",
    "in one TCAS II- equipped aircraft is compatible with the maneuver displayed in the other TCAS II equipped aircraft.  For example, two TCAS equipped aircraft involved in a conflict may coordinate with each other so that the aircraft at the higher altitude issues a \"climb\" command, while the aircraft at the lower altitude issues a \"descend\" command, to prevent the two aircraft's flight paths from crossing.  The Mode S transponder has the capability to provide a data link between the equipped",
    "crossing.  The Mode S transponder has the capability to provide a data link between the equipped aircraft and the ground, in addition to all of other transponder functions.  A Mode S transponder may be installed independently or with a TCAS II installation.  The performance standard for Mode S installed independently of TCAS is provided in TSO-C112e, Requirements, paragraph 3.",
    "2.2.1.2 \nFor each aircraft in which a Mode S transponder is installed, the discrete aircraft address for the Mode S transponder must be obtained from the appropriate airworthiness authority of the country in which the aircraft is registered.  For U.S. registered aircraft, obtain the discrete aircraft address from the Federal Aviation Administration, Mike Monroney Aeronautical Center, Aircraft Registration Information, AFS-750, PO Box 25504, Oklahoma City, OK 73125, Telephone: (405) 954-3116.",
    "Note: The ICAO 24-bit aircraft address is a uniquely assigned aircraft identification that also identifies the country of registration.  For civil aircraft registered in the U.S., the ICAO 24-bit aircraft address is established as a function of the aircraft's registration number (for example, N1234A).  There have been occurrences where two airplanes report identical ICAO 24-bit aircraft addresses.  This problem can happen when a change in registration numbers occurs.  When you change an",
    "This problem can happen when a change in registration numbers occurs.  When you change an airplane's registration number, you should verify that the ICAO 24-bit aircraft address and the new registration number have a one-to-one correspondence.",
    "2.2.2 \nPilot Control.  A pilot control for the TCAS and transponder equipment must be provided. \n2.2.2.1 \nProvide a means to select the following: \n2.2.2.1.1 \nOperation of TCAS II in the TA/RA mode and Mode S transponder simultaneously. \n2.2.2.1.2 \nOperation of TCAS II in the TA mode and Mode S transponder simultaneously. \n2.2.2.1.3 \nOperation of TCAS II in the standby mode. \n2.2.2.2 \nAlso, provide the following additional features: \n2.2.2.2.1",
    "2.2.2.2 \nAlso, provide the following additional features: \n2.2.2.2.1 \nA means to select the assigned ATCRBS (MODE A 4096) code. \n2.2.2.2.2 \nA means to initiate the transponder \"IDENT\" function. \n2.2.2.2.3 \nA means to initiate the TCAS II self-test. \n2.2.2.2.4 \nA means to suppress transponder altitude (Mode C) reporting. \n2.2.2.3 \nThe following optional controls may be provided: \n2.2.2.3.1 \nSelection of the weather radar only. \n2.2.2.3.2",
    "2.2.2.3.1 \nSelection of the weather radar only. \n2.2.2.3.2 \nControl to select the display of traffic within selected altitude bands. \n2.2.2.3.3 \nSelection of the weather radar and traffic display simultaneously. \n2.2.2.3.4 \nSelection of actual flight level (FL) or relative altitude of traffic. \n2.2.2.3.5 \nSelection of TCAS traffic information on multi-function displays.",
    "2.2.2.3.5 \nSelection of TCAS traffic information on multi-function displays. \nNote: AC 20-172 ( ), *Airworthiness Approval for ADS-B In Systems and Applications*, provides guidance addressing integration of controls for TCAS and ADS-B In installations.",
    "2.2.3 \nAntennas. The Mode S transponder must have a top and bottom omnidirectional antenna (also known as diversity antennas) when installed in an aircraft with TCAS II.  \nThe TCAS II must have a top directional antenna and a bottom omnidirectional or \ndirectional antenna. \n2.2.3.1 \nDirectional antennas. \n2.2.3.1.1 \nFor an aircraft installation, locate the TCAS II directional antenna on the top, forward fuselage as close to the centerline as possible. \n2.2.3.1.2",
    "2.2.3.1.2 \nIf the TCAS II has more than one directional antenna, locate the second antenna in a similar manner on the lower fuselage. \n2.2.3.1.3 \nMount the TCAS II antennas on the aircraft with at least 20 decibel (dB) isolation from other L-band antennas. \n2.2.3.1.4 \nSince the antenna diameter may be large, some structural considerations may be necessary and a centerline offset resulting in an angular offset of up to 5 degrees is acceptable. \n2.2.3.1.5",
    "2.2.3.1.5 \nThe maximum height of the directional antenna is approximately 1 inch, and therefore should not be susceptible to icing effects in the general area of the proposed installation.  If the antenna height is more than approximately 1 inch, consider anti-icing provisions. RTCA/DO-185, Section 3, Volume I, provides antenna selection and performance criteria. \n2.2.3.1.6",
    "2.2.3.1.6 \nFor propeller-driven aircraft, investigate the location and performance of the directional antenna for minimum blockage and to ensure that the propellers do not interfere with system operation. \n2.2.3.2 \nOmni-directional antennas.",
    "2.2.3.2 \nOmni-directional antennas. \nMount the TCAS II omni-directional antenna on the bottom of the aircraft fuselage as close to the centerline as possible with at least 20 dB isolation from other L-band antennas.  Mount the Mode S transponder antennas at locations chosen for adequate isolation and signal coverage.",
    "2.2.4 \nStructural analysis.  Submit a structural analysis of the antenna installations showing compliance with the applicable regulations of 14 CFR to the FAA. \n2.2.5 \nThe TCAS Processor.  The TCAS II processor unit uses both transponder reply",
    "information and information from the aircraft to identify and to display potential and predicted collision threats, and to issue RAs to avoid the threat aircraft.  The TCAS II processor unit must comply with the environmental qualification requirements and minimum performance standards specified in TSO-C119( ).  A manufacturer of TSO equipment can obtain authorization to produce equipment that deviates from the detailed criteria of the TSO as provided for in 14 CFR § 21.609.  The FAA ACO",
    "deviates from the detailed criteria of the TSO as provided for in 14 CFR § 21.609.  The FAA ACO approving the initial installation of the TCAS II equipment must verify that the TCAS II processor design does not differ from the criteria specified in RTCA/DO-185A or RTCA/DO-185B as applicable.  The TCAS II processor also includes hybrid",
    "surveillance functionality which only applies to TSO C119c/d/e (optional for TSO-\nC119c, required for TSO-C119d and TSO-C119e). \n2.2.6 \nTraffic Display. \n2.2.6.1 \nPurpose.",
    "The primary purpose of the traffic display is to aid the flight crew in the out-the-window visual acquisition of transponder-equipped aircraft.  This is accomplished by displaying the intruder aircraft's horizontal and, if altitude information is available, vertical position relative to the TCAS II equipped aircraft.  The TCAS II systems provide traffic information on Mode A (no altitude data available), Mode C, and Mode S transponderequipped aircraft.  A secondary purpose of the traffic",
    "available), Mode C, and Mode S transponderequipped aircraft.  A secondary purpose of the traffic display is to give the flight crew confidence in proper system operation and time to prepare to maneuver the aircraft if TCAS II issues a RA.",
    "2.2.6.2 \nDescription.",
    "Traffic displays may take several forms.  They may be independent, stand alone, integrated and time-shared with digital color radar, integrated with IVSI, or integrated with other displays such as electronic horizontal situation indicators (EHSI), navigation, or other multifunction displays.  If the traffic display uses a multifunction display shared with other services such as aircraft communications addressing and reporting system (ACARS), the traffic display function must be immediately",
    "addressing and reporting system (ACARS), the traffic display function must be immediately available for display by a single selection accessible to both pilots.",
    "2.2.6.3 \nSymbology/feature criteria.",
    "The FAA worked closely with the Air Transport Association (ATA), now known as Airlines for America (A4A), National Aeronautical and Space Administration (NASA), and both the SAE S-7 and G-10 Committees to standardize TCAS II symbology and features.  The consensus we reached for TCAS II symbols is provided in RTCA/DO-185().  You can use other symbology and features if you use human factors methodology to demonstrate that a clear and substantial benefit can be derived.  Otherwise, the traffic",
    "to demonstrate that a clear and substantial benefit can be derived.  Otherwise, the traffic display must depict or provide the symbology, features, or information provided in RTCA/DO-185A or RTCA/DO-185B, Section 2.2.6 as applicable.",
    "## 2.2.7 Resolution Advisory Display.\n\n2.2.7.1 \nPurpose. \nThe purpose of the RA display is to give each pilot the information to readily correct the aircraft flight path or to prevent a maneuver that would significantly reduce the vertical separation between the pilot's aircraft \n(own-ship) and a threat aircraft.",
    "2.2.7.2 \nDescription. \nYou may integrate the RA display with the two primary IVSIs on the flight deck, or integrate it into the PFD, or incorporate it into a head-up display (HUD).  Refer to RTCA/DO-185A or RTCA/DO-185B Section 2.2.6 as applicable for descriptions and requirements for the various resolution advisory display implementations.",
    "2.2.7.3 \nSymbology.",
    "We worked closely with A4A, NASA, and both the SAE S-7 and G-10 Committees to standardize TCAS II RA features.  The consensus we reached for TCAS II RA displays is in RTCA/DO-185().  You can use other symbology and features if you use human factors methodology to demonstrate that a clear and substantial benefit can be derived.  Otherwise, the RA display must depict or provide the symbology, features, or information shown in RTCA/DO-185A or RTCA/DO-185B Section 2.2.6 as applicable.  The use of",
    "or information shown in RTCA/DO-185A or RTCA/DO-185B Section 2.2.6 as applicable.  The use of new TCAS symbology will require testing throughout the flight envelope to determine accuracy, over/under shoot tendencies, flight technical error, and potential confusion resulting from the proposed symbology.  If you are using new symbology, contact the appropriate FAA ACO early in the development cycle.",
    "2.2.7.4 \nFailures. \n2.2.7.4.1 \nProvide indications for TCAS II failures (specifically including TCAS II unable to generate RAs), as specified in Section 2.2.10 below.  Provide annunciation for the TA only mode.  Electrical IVSI failures must also be annunciated. \n2.2.7.4.2",
    "2.2.7.4.2 \nDesign the TCAS II system to prevent incorrect RAs, missing RAs (including late issuance of an RA, i.e. not within nominal timing parameters for the CAS logic declaring and posting an RA), and false RAs, as defined in Appendix E, Section E.1, Definitions.  Section 2.3.8 \ncontains system safety assessment standards for the TCAS II system design.",
    "## 2.2.8 Caution/Warning Lights.",
    "2.2.8.1 \nYou may install discrete caution and/or warning lights that are separate from the traffic display.  The purpose of these additional indicators is to annunciate the presence of potentially threatening intruder aircraft at times \nwhen the pilot's attention may be diverted from the primary TCAS \ndisplay.  You can use two different discrete TCAS II annunciators: \n2.2.8.1.1",
    "display.  You can use two different discrete TCAS II annunciators: \n2.2.8.1.1 \nA discrete amber (or yellow) caution annunciator, which indicates the presence of a TCAS II TA.  Installation of this discrete caution \nannunciator is optional.  When installed, it must be in each pilot's primary \nfield of view and be inhibited below 400 feet above ground level (AGL). \n2.2.8.1.2",
    "field of view and be inhibited below 400 feet above ground level (AGL). \n2.2.8.1.2 \nA discrete red warning annunciator that indicates the presence of a TCAS II RA.  This red warning must be in each pilot's primary field of view and be inhibited below 900 feet AGL.  An IVSI with a lighted red arc or an alphanumeric message on the electronic attitude display indicator (EADI) is acceptable instead of this discrete warning annunciator. \n2.2.8.2",
    "2.2.8.2 \nBecause of the number of TCAS II advisories expected in service, you should not interface the basic aircraft master caution and warning system with TCAS II caution/warning alerts provided for intruder and threat aircraft.  Overuse of the primary aircraft caution and warning system tends to reduce its effectiveness in annunciating non-TCAS II system failures. \n2.2.8.3",
    "2.2.8.3 \nDiscrete visual alerts should remain on until the pilot cancels them or until TCAS II no longer considers the aircraft an intruder or a threat.",
    "## 2.2.9 Aural Alert Requirements.",
    "2.2.9.1",
    "Annunciate each TCAS II aural alert by a dedicated voice message over a cockpit speaker at a volume adequate for clear understanding at high cockpit noise levels, but not excessively loud at low noise levels.  The evaluation includes the case where a flight crew member is wearing a headset, covering the outboard ear when appropriate.  In turbo-prop aircraft where the aircrew utilizes headsets via the aircraft audio distribution panel, the aural messages should hold the same acceptable volume",
    "the aircraft audio distribution panel, the aural messages should hold the same acceptable volume and intelligibility during both low and high cockpit noise levels.",
    "2.2.9.2 \nAnnunciate TCAS II TAs by the voice message \"TRAFFIC, TRAFFIC\" \nstated once for each TA. \n2.2.9.3 \nAnnunciate TCAS II RAs by the following voice messages, as appropriate: \n2.2.9.3.1 \n\"CLIMB, CLIMB\"-- climb at the rate depicted by the green (fly to) arc or line on the IVSI or other suitable indicator. \n2.2.9.3.2 \n\"DESCEND, DESCEND\"-- descend at the rate depicted by the green (fly \nto) arc or line on the IVSI or other suitable indicator. \n2.2.9.3.3",
    "to) arc or line on the IVSI or other suitable indicator. \n2.2.9.3.3 \n\"MONITOR VERTICAL SPEED\"-- ensure that vertical speed is out of the illuminated IVSI red arc or line, or other suitable indication. \n2.2.9.3.4 \n\"ADJUST VERTICAL SPEED, ADJUST\"-- modify the vertical speed to a value within the illuminated green arc or line, or outside the prohibited area on other suitable indications.  Only V7.0 TCAS II units provide this aural. \n2.2.9.3.5",
    "2.2.9.3.5 \n\"LEVEL OFF, LEVEL OFF\" -- reduce vertical speed to zero feet per minute.  A green arc or line will be illuminated beginning at zero feet per minute.  The system can issue this as the initial RA or as a subsequent RA. Only V7.1 TCAS II units provide this aural. \n2.2.9.3.6 \n\"CLEAR OF CONFLICT\"-- range is increasing, and separation is adequate; expeditiously return to the applicable clearance, unless ATC directs otherwise. \n2.2.9.3.7",
    "2.2.9.3.7 \n\"CLIMB, CROSSING CLIMB, CLIMB, CROSSING CLIMB\"-- climb at the rate depicted by the green (fly to) arc or line on the IVSI or other suitable indicator.  The aircraft will best achieve safe separation by climbing through the threat's flight path. \n2.2.9.3.8 \n\"DESCEND, CROSSING DESCEND, DESCEND, CROSSING",
    "2.2.9.3.8 \n\"DESCEND, CROSSING DESCEND, DESCEND, CROSSING \nDESCEND\"--descend at the rate depicted by the green (fly to) arc or line on the IVSI or other suitable indicator.  The aircraft will best achieve safe separation by descending through the threat's flight path. \n2.2.9.3.9",
    "2.2.9.3.9 \n\"MAINTAIN VERTICAL SPEED, MAINTAIN\"-- maintain the existing climb or descent rate as depicted by the green (fly to) arc or line on the IVSI or other suitable indicator. The aircraft will best achieve safe separation by not altering the existing vertical speed. \n2.2.9.3.10",
    "2.2.9.3.10 \n\"MAINTAIN VERTICAL SPEED, CROSSING MAINTAIN\"-- maintain the existing climb or descent rate as depicted by the green (fly to) arc or line on the IVSI or other suitable indicator.  The aircraft will best achieve safe separation by not altering the existing vertical speed and climbing or descending through the threat's flight path. \n2.2.9.4",
    "2.2.9.4 \nThe TCAS II must provide the following voice messages to annunciate enhanced TCAS II maneuvers when the initial RA does not provide sufficient vertical separation.  The tone and inflection must connote increased urgency. \n2.2.9.4.1",
    "2.2.9.4.1 \n\"INCREASE CLIMB, INCREASE CLIMB\"--climb at the rate depicted by the green (fly to) arc or line on the IVSI or other suitable indicator. Received after \"CLIMB\" advisory, and indicates the aircraft needs to climb faster to achieve safe vertical separation from a maneuvering threat \naircraft. \n2.2.9.4.2",
    "aircraft. \n2.2.9.4.2 \n\"INCREASE DESCENT, INCREASE DESCENT\"--descend at the rate depicted by the green (fly to) arc or line on the IVSI or other suitable indicator.  Received after \"DESCEND\" advisory, and indicates the aircraft needs to descend faster to achieve safe vertical separation from a maneuvering threat aircraft. \n2.2.9.4.3 \n\"CLIMB - CLIMB NOW, CLIMB - CLIMB NOW\"--climb at the rate \ndepicted by the green (fly to) arc or line on the IVSI or other suitable",
    "depicted by the green (fly to) arc or line on the IVSI or other suitable \nindicator.  Received after a \"DESCEND\" RA and indicates the aircraft needs to reverse its vertical direction to achieve safe vertical separation from a maneuvering threat aircraft. \n2.2.9.4.4",
    "2.2.9.4.4 \n\"DESCEND - DESCEND NOW, DESCEND - DESCEND NOW\"--- descend at the rate depicted by the green (fly to) arc or line on the IVSI or other suitable indicator.  Received after a \"CLIMB\" RA and indicates the aircraft needs to reverse its vertical direction to achieve safe vertical separation from a maneuvering threat aircraft. \n2.2.9.4.5 \nThe system must inhibit all TCAS II aural alerts below 400 ft AGL while descending and below 600 ft AGL while climbing. \n2.2.9.4.6",
    "2.2.9.4.6 \nThe system must aurally annunciate both increases and decreases in the threat level. \n2.2.9.4.7 \nIn general, we will evaluate other messages that are clear and unambiguous on an individual basis.  Do not use messages that contain negatives (for example, \"DON'T CLIMB\").",
    "## 2.2.10   Failures, Tcas And Transponder.  14 Cfr Sections 25.1302, 25.1309(C), And 25.1322",
    "contain requirements for flight crew alerting.  For purposes of compliance with Sec. 25.1322(b) with regard to a TCAS II and or Mode S transponder system, accident experience has shown that loss of TCAS II or Mode S transponder functionality requires flight crew awareness and may require subsequent flight crew response.  This response includes checking for proper TCAS II system settings and operation as well as Mode S transponder settings and operation.  Therefore, for new installations of TCAS",
    "as well as Mode S transponder settings and operation.  Therefore, for new installations of TCAS II and/or transponders, to meet Sec. 25.1322 requirements for the TCAS II installation, the following failures must be annunciated in yellow/amber in the pilots' primary field of",
    "view, and are recommended to be interfaced with the aircraft's master caution and \nwarning system to provide alerts for: \n2.2.10.1 \nA transponder failure. \n2.2.10.2 \nTransponder in the standby mode. \n2.2.10.3 \nA TCAS II failure. \n2.2.10.4 \nTCAS II in the standby mode. \nNote 1: Guidance for compliance with 14 CFR Sections 25.1302, and 25.1322 is contained in AC 25.1302-1, *Installed Systems and Equipment for Use by the Flightcrew* and AC 25.1322-1, *Flightcrew Alerting*.",
    "Note 2: For the purposes of this subsection, a new installation is considered to be: 1) \nInstallation of a Mode S transponder in an aircraft that does not currently have one fitted; 2) Installation of a TCAS II system in an aircraft that does not currently have one fitted or 3) A new aircraft, i.e. one that has not received a type certificate. \n\n## 2.3 Airworthiness Considerations.",
    "2.3.1",
    "Certification Program.  This AC will guide your installation of TCAS II V7.0 or V7.1 systems and Mode S transponder systems.  TCAS II system installations include the TCAS, the Mode S system, antennas, control panel and display components.  Mode S transponder installations include the Mode S transponder, antennas, and control panel. These components are all certified initially as a single installed system with a defined configuration.  Any change to the defined configuration requires either a",
    "system with a defined configuration.  Any change to the defined configuration requires either a new Initial Approval or a Follow-On Approval.  The system displays information and provides advisories in a number of formats.  The degree of system integration to perform these functions is extensive and as a result, you must direct your program toward airworthiness approval through the type certification or supplemental type certification process.",
    "2.3.2 \nCertification plan.  Develop a comprehensive certification plan.  Include how you'll comply with the applicable certification requirements, and list the substantiating data and necessary tests in your plan.  Include a system description and an estimated time schedule.  A well-developed certification plan will be of significant value both to you (the applicant) and the appropriate FAA certification office.",
    "## 2.3.3 Equipment Compatibility Requirements.",
    "2.3.3.1",
    "Make an evaluation to show that the TCAS II system communicates with other manufacturers' approved TCAS II systems.  Include a TCAS II to TCAS II coordination demonstration, or equivalent, with at least one other manufacturer's approved TCAS II system in your evaluation.  If you can show for a specific design that communication link failures are no more hazardous than encountering a Mode C intruder, then these tests are not necessary.  Also, after completing mature bench tests, future",
    "C intruder, then these tests are not necessary.  Also, after completing mature bench tests, future certification experience may show that these tests are no longer necessary.  Submit evidence to show that you performed TCAS/transponder interoperability bench tests using the same TCAS/transponder pairing (the same part",
    "numbers) as the installation seeking certification. You can satisfy interoperability bench tests by either of the following:",
    "2.3.3.2 \nConduct the following RTCA/DO-185A or RTCA/DO-185B tests as \napplicable, using the actual TCAS unit and Mode S transponder seeking certification: \n\n2.4.2.2.3.1\n\n2.4.2.2.3.2,\n\n2.4.2.2.4.1,\n\n2.4.2.2.4.2.1,\n\n2.4.2.2.4.2.3,\n\n2.4.2.2.4.2.5,\n\n2.4.2.2.4.2.6,\n\n2.4.2.2.4.2.7,\n\n2.4.2.2.4.2.8, and,\n\n2.4.2.2.5.\n2.3.3.3 \nConduct the following tests in RTCA/DO-181E as applicable, Minimum \nOperational Performance Standards for Air Traffic Control Radar Beacon",
    "Operational Performance Standards for Air Traffic Control Radar Beacon \nSystem/Mode Select (ATCRBS/Mode S) Airborne Equipment, using the actual TCAS unit and Mode S transponder seeking certification: \n\nProcedure 30,\n\nProcedure 31 a-d,\n\nProcedure 32a-c and d (1 & 2),\n\nProcedure 34,\n\nProcedure 36 a and c, and,\n\nProcedure 37 a and b.\n2.3.3.4 \nIn addition, conduct the following RTCA/DO-181E tests as applicable, using a TCAS simulator coupled with the actual Mode S transponder: \n",
    "\nProcedure 31e,\n\nProcedure 32d (3-16),\n\nProcedure 33,\n\nProcedure 35,\n\nProcedure 36b,\n Procedure 37c and,  Procedure 38. \nNote: These equipment compatibility requirements are only necessary for the initial approval.",
    "2.3.4 \nAircraft Performance Considerations.  Use paragraphs 2.3.4 through 2.3.5 and Table 1 of this AC to help you evaluate the need to inhibit TCAS II CLIMB and/or INCREASE CLIMB RAs resulting from inadequate aircraft climb performance.  The collision avoidance maneuvers the TCAS II commands as RAs assume an aircraft's ability to \nsafely achieve them.  If it's likely the required response to CLIMB and INCREASE",
    "safely achieve them.  If it's likely the required response to CLIMB and INCREASE \nCLIMB RAs are beyond the performance capability of the aircraft, then TCAS II must know beforehand so it can change strategy and issue an alternative RA.  The aircraft \ninterface and discrete settings relative to altitude and/or aircraft configuration must",
    "interface and discrete settings relative to altitude and/or aircraft configuration must \nprovide these performance limits to TCAS II.  However, carefully consider the need to inhibit TCAS II CLIMB or INCREASE CLIMB RAs since the alternative RAs may not provide the optimum solution to the encounter.  Inhibiting these RAs will increase the likelihood of TCAS II: \n2.3.4.1 \nIssuing crossing maneuvers (crossing through an intruder's altitude), thus",
    "2.3.4.1 \nIssuing crossing maneuvers (crossing through an intruder's altitude), thus \nincreasing the probability that an RA may be thwarted by the intruder maneuvering, \n2.3.4.2 \nCausing an increase in DESCEND RAs at low altitude, and \n2.3.4.3 \nProviding no RAs if below the descend inhibit altitude of 1200 feet AGL during takeoff and 1000 feet AGL on approach. \n2.3.5",
    "2.3.5 \nEvaluating Aircraft Performance.  The configuration interface may need switches or sensors, besides the basic airplane flap position switches, to prevent unnecessary TCAS II inhibits.  For example, if you need to inhibit CLIMB RAs for the maximum takeoff flap setting only, and no switch exists to sense that position, install an additional switch instead of simply using one that may exist at lesser flap angle settings. \n2.3.5.1",
    "Because TCAS II can only accept a limited number of inputs related to airplane performance, it's not possible to automatically inhibit CLIMB and INCREASE CLIMB RAs in all cases where it may be appropriate to inhibit such RAs.  In these cases, TCAS II may command maneuvers that may significantly reduce stall margins or result in stall warnings. Conditions where this may occur include bank angles greater than 15 degrees, weight/altitude/temperature combinations outside the envelope shown in Table",
    "than 15 degrees, weight/altitude/temperature combinations outside the envelope shown in Table 1, initial speeds below those shown in Table 1, one engine inoperative, leaving the aircraft configuration fixed for climb RAs on landing transition to go-around, and abnormal configurations such as landing gear not retractable.  Provide information concerning this aspect of TCAS in the airplane flight manual (AFM) or airplane flight manual supplement (AFMS) so that flight crews may take appropriate",
    "manual (AFM) or airplane flight manual supplement (AFMS) so that flight crews may take appropriate action.",
    "2.3.5.2 \nAircraft configuration, true airspeed available during initial climb (to safely trade for climb rate if needed), and the initial airspeed margin from the current stall speed all significantly affect an aircraft's low altitude climb capability during takeoff, approach, or landing. \n2.3.5.2.1 \nTable 1, Conditions 1 through 3 apply to the takeoff and initial climb configuration analysis. \n2.3.5.2.2",
    "2.3.5.2.2 \nTable 1, Conditions 4 through 6 apply to the approach flap configuration analysis when operating in the terminal area with the flaps set at less than the landing flaps. \n2.3.5.2.3 \nTable 1, Conditions 7 through 9 apply to the landing flight regime \nanalysis.  To be consistent with normal operation, indicate in the AFM or",
    "analysis.  To be consistent with normal operation, indicate in the AFM or \nAFMS that when a climb RA occurs with the aircraft in the landing configuration, the pilot should initiate the normal go-around procedure when complying with the TCAS II RA.  Therefore, you can assume that the flaps are retracted from the landing position to the go-around position when evaluating Table 1, Conditions 7 through 9. \n2.3.5.3",
    "2.3.5.3 \nTo prevent very unlikely combinations of events, such as weight/altitude/temperature limiting conditions, in conjunction with low airspeed, high drag configurations, and unusual encounter geometries causing climb inhibits when the aircraft's performance is more than adequate, Table 1 places the entry and exit conditions and RAs into two classes of encounters. \n2.3.5.3.1",
    "2.3.5.3.1 \nManeuvers A and B represent reasonably severe combinations of entry conditions and RAs, and restricts the exit conditions to an airspeed of 1.2VS1 (or 1.13VSR1 for those airplanes that use reference stall speed (VSR) in lieu of stalling speed (VS)). \n2.3.5.3.2 \nManeuver C represents reasonably worst-case combinations of entry conditions and RAs, and this very unlikely event may require flying near stall warning conditions through the recovery. \n2.3.5.3.3",
    "Airspeeds between 1.2VS1 (or 1.13VSR1 for those airplanes that use reference stall speed (VSR) in lieu of stalling speed (VS)) and stall warning represent a range of usable airspeeds that the flight crew can trade for climb performance (the same as current wind shear recovery procedures recommend) for evaluation of this low probability event.  The altitude/temperature envelope represents a range of values that exist at busy airports in the continental United States.  Operations outside this",
    "of values that exist at busy airports in the continental United States.  Operations outside this envelope may require special crew procedures if the normal AFM weight, altitude, temperature, and configuration limitations are not sufficiently compensating, such as operation at Mexico City.",
    "2.3.5.4 \nFor those airplanes that may routinely operate at low climb airspeeds during the clean configuration, enroute phase of flight, such as propeller commuter airplanes, consider providing a discrete to the TCAS II based on airspeed.  Such an input, derived from a TCAS II interface system, would",
    "provide for CLIMB or INCREASE CLIMB RA inhibits when the airplane is in the clean configuration and operating below a certain airspeed.  We consider such a scheme appropriate instead of an across-the-board inhibit for the clean configuration regardless of flight regime (which does not provide the best overall level of safety for other configurations). \n2.3.5.5",
    "2.3.5.5 \nExcess power (propeller-driven) or excess thrust (turbojet) and true airspeed (that may be available to safely trade for climb rate) are also \nsignificant factors in aircraft's climb capability when operating at or near \nmaximum approved operating altitude.  The system should not inhibit",
    "climb RAs if the aircraft has adequate performance available or because it may exceed its maximum certificated altitude by several hundred feet during an RA.  Table 1, Conditions 10 and 11, shows configurations that you should evaluate in this flight regime.  If the aircraft has approval for significant alternative configurations, (such as spare engine pod and gear down operation,) then the initial airspeed you use for the analysis should",
    "be appropriate for them.  In the analysis of the aircraft's ability to \naccelerate and return to the initial speed and altitude following the RA, an undershoot of approximately 200 feet is permissible. \n2.3.5.6",
    "In icing conditions, the aircraft limited performance weights are lower, and sometimes the operating speeds are higher, to account for icing system bleeds and residual ice drag on the unprotected surfaces.  Therefore, the capability to perform the TCAS II maneuvers remains essentially unchanged, eliminating the need to provide additional RA inhibits under these circumstances.  However, if a particular aircraft design shows marginal capability to operate in the icing environment, consider",
    "particular aircraft design shows marginal capability to operate in the icing environment, consider additional RA inhibits enabled by icing system activation.",
    "2.3.5.7",
    "If Table 1, Maneuver A causes operation at airspeeds below the minimum, then inhibit the CLIMB RA.  If Table 1, Maneuver B or C causes operation at airspeeds below the minimum, then inhibit the INCREASE CLIMB RA.  However, early recovery of 1 to 2 seconds is of little or no consequence on the collision avoidance maneuver and the system will achieve a higher overall level of safety if it does not provide inhibits under these circumstances, as this AC has previously discussed in paragraph 2.3.4.",
    "## Maneuvers",
    "WEIGHT \nFLIGHT \nALTITUDE, \nMINIMUM \nTHRUST \nFLAPS \nGEAR \nINITIAL \nAIRSPEED2 \nAIRSPEED2 \nREGIME \nTEMPERATUR\nE1 \nCONDITION \n| Maximum rated takeoff        | All takeoff    | Up      | V             |\n|------------------------------|----------------|---------|---------------|\n| 2                            |                |         |               |\n| +20                          |                |         |               |",
    "| +20                          |                |         |               |\n| 4                            |                |         |               |\n|                              | 1.2V           |         |               |\n| S1                           |                |         |               |\n| 5                            |                |         |               |\n| thru RA                      | A              | 1       | Takeoff       |",
    "| thru RA                      | A              | 1       | Takeoff       |\n| limit                        |                |         |               |\n| Maximum rated takeoff        | All takeoff    | Up      | V             |\n| 2                            |                |         |               |\n| +20                          |                |         |               |\n| 4                            |                |         |               |",
    "| 4                            |                |         |               |\n|                              | 1.2V           |         |               |\n| S1                           |                |         |               |\n| 5                            |                |         |               |\n| thru RA                      | B              | 2       | Takeoff       |\n| limit                        |                |         |               |",
    "| limit                        |                |         |               |\n| C                            | 3              | Takeoff | Part 25 Climb |\n| limit                        |                |         |               |\n| 15° bank to stall            |                |         |               |\n| warning                      |                |         |               |\n| 7                            |                |         |               |",
    "| 7                            |                |         |               |\n| thru                         |                |         |               |\n| recovery                     |                |         |               |\n| Maximum rated takeoff        | All takeoff    | Up      | AFM all-      |\n| engine                       |                |         |               |\n| takeoff                      |                |         |               |",
    "| takeoff                      |                |         |               |\n| speed                        |                |         |               |\n| 6                            |                |         |               |\n|                              |                |         |               |\n| Up                           | 1.6V           |         |               |\n| S1                           |                |         |               |",
    "| S1                           |                |         |               |\n|                              | 1.2V           |         |               |\n| S1                           |                |         |               |\n| 5                            |                |         |               |\n| thru RA                      | A              | 4       | Approach      |\n| limit                        |                |         |               |",
    "| limit                        |                |         |               |\n| Less than                    |                |         |               |\n| landing                      |                |         |               |\n| Spin up to max go-around     |                |         |               |\n| thrust during maneuver       |                |         |               |\n| from thrust for level flight |                |         |               |",
    "| from thrust for level flight |                |         |               |\n| Up                           | 1.6V           |         |               |\n| S1                           |                |         |               |\n|                              | 1.2V           |         |               |\n| S1                           |                |         |               |\n| 5                            |                |         |               |",
    "| 5                            |                |         |               |\n| thru RA                      | B              | 5       | Approach      |\n| limit                        |                |         |               |\n| Less than                    |                |         |               |\n| landing                      |                |         |               |\n| Spin up to max go-around     |                |         |               |",
    "| Spin up to max go-around     |                |         |               |\n| thrust during maneuver       |                |         |               |\n| from thrust for level flight |                |         |               |\n| Up, or                       | C              | 6       | Approach      |\n| limit                        |                |         |               |\n| Less than                    |                |         |               |",
    "| Less than                    |                |         |               |\n| landing                      | down           |         |               |\n| Spin up to max go-around     |                |         |               |\n| thrust during maneuver       |                |         |               |\n| from thrust for level flight | to up          |         |               |\n| 15° bank to stall            |                |         |               |",
    "| 15° bank to stall            |                |         |               |\n| warning                      |                |         |               |\n| 7                            |                |         |               |\n| thru                         |                |         |               |\n| recovery                     |                |         |               |\n| Min.                         |                |         |               |",
    "| Min.                         |                |         |               |\n| maneuver                     |                |         |               |\n| speed from                   |                |         |               |\n| training                     |                |         |               |\n| procedures                   |                |         |               |\nWEIGHT \nFLIGHT \nALTITUDE, \nMINIMUM \nTHRUST \nFLAPS \nGEAR \nINITIAL \nAIRSPEED2 \nAIRSPEED2 \nREGIME \nTEMPERATUR\nE1",
    "ALTITUDE, \nMINIMUM \nTHRUST \nFLAPS \nGEAR \nINITIAL \nAIRSPEED2 \nAIRSPEED2 \nREGIME \nTEMPERATUR\nE1 \nCONDITION \n| Down                        | V        |\n|-----------------------------|----------|\n| REF                         |          |\n| +  10                       | 1.2V     |\n| S1                          |          |\n| 5                           |          |\n| thru RA                     | A        |\n| limit                       | to up    |\n| 7                           | Landing, |",
    "| limit                       | to up    |\n| 7                           | Landing, |\n| Transition to               |          |\n| Go-Around at                |          |\n| RA                          |          |\n| Spin up to max go-around    |          |\n| thrust during maneuver      |          |\n| from thrust required for 3° |          |\n| glideslope                  |          |\n| Transition                  |          |\n| from                        |          |",
    "| Transition                  |          |\n| from                        |          |\n| landing flap                |          |\n| to go-                      |          |\n| around flap                 |          |\n| Down                        | V        |\n| REF                         |          |\n| +  10                       | 1.2V     |\n| S1                          |          |\n| 5                           |          |\n| thru RA                     | B        |",
    "| 5                           |          |\n| thru RA                     | B        |\n| limit                       | to up    |\n| 8                           | Landing, |\n| Transition to               |          |\n| Go-Around at                |          |\n| RA                          |          |\n| Spin up to max go-around    |          |\n| thrust during maneuver      |          |\n| from thrust required for 3° |          |\n| glideslope                  |          |",
    "| from thrust required for 3° |          |\n| glideslope                  |          |\n| Transition                  |          |\n| from                        |          |\n| landing flap                |          |\n| to go-                      |          |\n| around flap                 |          |\n| Down                        | C        |\n| limit                       | to up    |\n| 15° bank to stall           |          |\n| warning7 thru               |          |",
    "| 15° bank to stall           |          |\n| warning7 thru               |          |\n| recovery                    |          |\n| 9                           | Landing, |\n| Transition to               |          |\n| Go-Around at                |          |\n| RA                          |          |\n| Spin up to max go-around    |          |\n| thrust during maneuver      |          |\n| from thrust required for 3° |          |\n| glideslope                  |          |",
    "| from thrust required for 3° |          |\n| glideslope                  |          |\n| Transition                  |          |\n| from                        |          |\n| landing flap                |          |\n| to go-                      |          |\n| around flap                 |          |\n| VREF  +                     |          |\n| airspeed                    |          |\n| addition from               |          |\n| training                    |          |",
    "| addition from               |          |\n| training                    |          |\n| procedures                  |          |\n| A                           | Up       |\n| cruise                      |          |\n| 10                          | En Route |\n| giving 0.3g to              |          |\n| buffet onset                |          |\n| Thrust for level flight     |          |\n| increased to max            |          |\n| continuous, if required     |          |",
    "| increased to max            |          |\n| continuous, if required     |          |\n| Higher of                   |          |\n| 1.2VS5 if                   |          |\n| defined or                  |          |\n| buffet onset                |          |\n| B                           | Up       |\n| cruise                      |          |\n| 11                          | En Route |\n| giving 0.3g to              |          |\n| buffet onset                |          |",
    "| giving 0.3g to              |          |\n| buffet onset                |          |\n| Thrust for level flight     |          |\n| increased to max            |          |\n| continuous, if required     |          |\n| Higher of                   |          |\n| 1.2VS5 if                   |          |\n| defined or                  |          |\n| buffet onset                |          |",
    "## Notes:\n\n1. Weight = Lesser of climb limit or structural; Airport Pressure Altitude = sea level to 5300 ft; Temperature = ISA ± 50 °F; Evaluate \nconditions 1 through 3 700 ft above airport; evaluate conditions 4 - 9 1700 ft above airport. \n2. For those airplanes that use reference stall speed (VSR) in lieu of stalling speed (VS), replace 1.2 VS1 with 1.13 VSR1, 1.2VS with \n1.13VSR and 1.6 VS1 with 1.5 VSR1. \n\n## 3. Maneuvers:",
    "a. Maneuver A evaluates the TCAS II CLIMB RA.  From the initial steady-state condition, after a 3-second pilot-reaction time \ndelay, rotate the aircraft at 1.25 g to attain +1500 feet per minute climb.  Hold until the total duration of the RA of 25 seconds has elapsed. Recover to attain the initial trim airspeed. \nb. Maneuver B evaluates the TCAS II INCREASE CLIMB RA following a CLIMB RA.  From the initial steady-state condition,",
    "after a 3-second pilot-reaction time delay, rotate the aircraft at 1.25 g to attain +1500 feet per minute climb.  Hold until 15 \nseconds has elapsed from when the CLIMB RA was issued.  Then, after a 1-second pilot reaction time-delay to the \nINCREASE CLIMB RA, rotate the aircraft again at 1.25 g to attain +2500 feet per minute climb and hold until the total duration of the RA of 25 seconds has elapsed.  Recover to attain the initial trim airspeed.",
    "c. Maneuver C evaluates a maximum duration TCAS II INCREASE CLIMB RA following a minimum duration CLIMB RA.",
    "From the initial steady-state condition, after a 3-second pilot-reaction time delay, rotate the aircraft at 1.25 g targeting +1500 feet per minute climb until 6 seconds has elapsed from when the the system issued the CLIMB RA.  Then, after a 1-second pilot-reaction time delay to the INCREASE CLIMB RA, rotate the aircraft again at 1.25 g to attain +2500 feet per minute climb and hold until the total duration of the RA of 25 seconds has elapsed.  Recover to attain the initial trim airspeed.",
    "4. VY + 10 for nontransport category aircraft without a defined V2. 5. For those airplanes where the power-on stalling speed is significantly lower than the power-off stalling speed, use 1.1VS or \n1.08VSR for those airplanes that use reference stall speed (VSR) in lieu of stalling speed (VS). \n6. VY for nontransport category aircraft without a defined V2 7. For those airplanes where the power-on stalling speed is significantly lower than the power-off stalling speed, use VS1 or 0.94VSR1",
    "for those airplanes that use reference stall speed (VSR) in lieu of stalling speed (VS).",
    "2.3.5.8 \nA summary of the system inhibits (limitations) programmed into the TCAS II computer is given in Table 2 below. \n\n## System Inhibits",
    "| INHIBIT                                                   | PARAMETERS                                                    |\n|-----------------------------------------------------------|---------------------------------------------------------------|\n| Increase Descent RA                                       |                                                               |",
    "| Inhibited below 1650 ft AGL while climbing and inhibited  |                                                               |\n| below 1450 ft AGL while descending.                       |                                                               |\n| Descend RA                                                |                                                               |",
    "| Inhibited below 1200 ft AGL while climbing and inhibited  |                                                               |\n| below 1000 ft AGL while descending.                       |                                                               |\n| TA Voice Messages                                         |                                                               |",
    "| Inhibited below 400 ft AGL while descending and inhibited |                                                               |\n| below 600 ft AGL while climbing.                          |                                                               |\n| RAs                                                       |                                                               |",
    "| Inhibited below 1100 ft AGL while climbing, and inhibited |                                                               |\n| below 900 ft AGL while descending. (TCAS automatically    |                                                               |\n| reverts to TA only).                                      |                                                               |",
    "| Self-Test                                                 | Can be inhibited when airborne.                               |\n| Advisory Priority                                         |                                                               |\n| Automatically reverts to TA only when higher priority     |                                                               |",
    "| advisories (such as GPWS/TAWS and windshear) occur.       |                                                               |\n| Climb RA                                                  | Can be inhibited, based upon aircraft performance capability. |\n| Increase Climb RA                                         | Can be inhibited, based upon aircraft performance capability. |",
    "## 2.3.6 How Aircraft Systems Should Interface With Tcas Ii.",
    "2.3.6.1 \nPressure altitude information.",
    "The pressure altitude data must be from the most accurate source available in the aircraft and it must be the same data the associated Mode S transponder transmits.  The accuracy of the altitude data must be at least that specified in RTCA/DO-185A or RTCA/DO-185B, paragraph 3.2.8 as applicable.  You must show that the resolution of the altimetry source is compatible with TCAS II.  The altitude source with the finest compatible resolution must be used.  When available, the resolution should be",
    "with the finest compatible resolution must be used.  When available, the resolution should be in increments of 10 feet or less.  Also provide information to indicate when the pressure altitude information is invalid.",
    "2.3.6.2 \nRadio altitude information. \n2.3.6.2.1 \nProvide radio altitude information to the TCAS II to inhibit: \n2.3.6.2.2 \nINCREASE DESCENT RAs below 1650 ft AGL while climbing and below 1450 ft AGL while descending, \n2.3.6.2.3 \nDESCEND RAs below 1200 ft AGL while climbing and below 1000 ft \nAGL while descending, \n2.3.6.2.4 \nAll TA voice messages (aural traffic advisories) below 400 ft AGL while descending and below 600 ft AGL while climbing, and \n2.3.6.2.5",
    "2.3.6.2.5 \nAll RAs below 1100 ft AGL while climbing and below 900 ft AGL while descending, to allow automatic sensitivity level selection when close to the ground, and to determine that individual targets are on the ground. \n2.3.6.2.6 \nAlso provide information to indicate when the radio altitude information is \ninvalid. \n2.3.6.3 \nAircraft configuration.",
    "invalid. \n2.3.6.3 \nAircraft configuration. \nUse discrete information from flaps, slat, landing gear, and/or other aircraft configuration sensors to ensure that TCAS II appropriately inhibits CLIMB and INCREASE CLIMB RAs to the airplane performance limits as described in paragraph 2.3.4 and 2.3.5.",
    "2.3.6.4 \nAircraft identification. \nProvide discrete information to the Mode S transponder for the unique aircraft Mode S identification code and its maximum airspeed capability.",
    "2.3.6.5 \nAttitude. \nThe system may provide aircraft pitch and roll attitude to assist with stabilization of the directional antenna function to assure surveillance and to ensure normal aircraft maneuvers don't affect TA display data.  If TCAS II uses attitude information, provide information to indicate when the attitude data are invalid.",
    "2.3.6.6 \nHeading. \nThe system may provide aircraft heading for the TA display reference presentation. If it does, it must also indicate when the heading data are invalid. \n\n2.3.6.7 \nSystem failure display. \nProvide an appropriate level alert in accordance with Section 2.2.10 to indicate when RAs are not possible due to failure of the TCAS II equipment or any of its sensors or displays.",
    "Note: Section 2.3.8.2 has system safety analysis requirements for failure to provide an RA when required without indication of loss of RA capability. \n\n2.3.6.8 \nAltitude alerter data. \nYou may provide the current clearance altitude from the altitude alerter to enable TCAS II to select RAs that are more consistent with the aircraft's altitude clearance once it resolves the immediate collision threat.",
    "Note: Altitude alert functionality is optional per RTCA/DO-185A and RTCA/DO-185B.  Not all TSO-C119( ) TCAS II units will have this option available.",
    "2.3.6.9 \nMode S Transponder Gillham altitude input requirements.",
    "The Gillham format uses 11 discrete wires that, depending on which wires are turned off or on, represent an altitude value.  The Gillham format is sometimes called a blind encoder, as there is no error detection and/or correction on the wires.  For this reason, ARINC 718, Mark 3 Air Traffic Control Transponder (ATCRBS/MODE S), dated December 1989, states: \"Pins have been reserved to permit the direct application of Gillham code data to the transponder.  This practice is not encouraged because",
    "application of Gillham code data to the transponder.  This practice is not encouraged because of concerns that a \"stuck bit\" in the coded input could be the cause of serious errors in TCAS II resolution advisories.\"  This is a failure mode peculiar to the Gillham code against which protection is virtually impossible.  If you cannot avoid using Gillham coded altitude for the TCAS II installations, you must connect two sources of altitude information to the transponder and compare their values.",
    "you must connect two sources of altitude information to the transponder and compare their values.  The system must annunciate all transponder altitude comparator failures.",
    "2.3.6.10 \nHybrid surveillance failure annunciations (TSO-C119d and later units). \nFor aircraft equipped with centralized alert and warning system and or an onboard maintenance system, you should consider integrating the hybrid surveillance alerting functionality into the system so as to alert the crew with an appropriate failure annunciation.  Refer to section 2.3.9 for more information.",
    "2.3.7",
    "Verifying and Validating TCAS II Software.  For the first installation of a manufacturer's TCAS II equipment, you must verify and validate TCAS II software using the procedures below.  Also, apply these procedures to subsequent software changes to a manufacturer's TCAS II equipment.  A manufacturer may provide a design that partitions the software that affects RAs from other software, such as that necessary for the traffic display.  The TCAS II manufacturer may not use the minor change",
    "as that necessary for the traffic display.  The TCAS II manufacturer may not use the minor change authority of the TSO system to change any software in the same partition as the software that affects RAs.",
    "2.3.7.1 \nVerification and validation of TCAS II software represents a unique challenge.  A formal statechart representation in the CAS requirements specification (CRS) in RTCA/DO-185A, Volume II and RTCA/DO-185B, Volume II, specifies collision avoidance algorithms, commonly called \"the CAS logic,\" in detail.  In addition, Attachment A of Volume II provides a",
    "software design specification in pseudocode that meets these requirements.  We require this level of detail because the coordination algorithms in the CAS logic assume that the software that all manufacturers implement will have exactly the same CAS logic.",
    "However, the manufacturer of the TCAS II equipment must develop the surveillance software necessary to establish and maintain the relative tracks of nearby transponder-equipped aircraft and the software necessary to provide the interface with the Mode S transponder and with other aircraft sensors and displays.  This hybrid approach to the specification of the software requirements means that the FAA and our contractors have satisfied the application of the software criteria in RTCA/DO-178B,",
    "FAA and our contractors have satisfied the application of the software criteria in RTCA/DO-178B, Software Considerations in Airborne Systems and Equipment Certification, dated December 1, 1992, for the detailed CAS requirements and the pseudocode software design, while the remaining requirements of RTCA/DO-178B (considering any applicable provisions of AC 20-115C, Airborne Software Assurance, dated July 19, 2013) or DO-178C, dated December 13, 2011, as applicable, are the responsibility of the",
    "July 19, 2013) or DO-178C, dated December 13, 2011, as applicable, are the responsibility of the manufacturer.",
    "2.3.7.2",
    "If the system uses software for the display of TCAS II RAs or in the operation of the Mode S transponder data link, you must do the verification and validation of this software to Level B requirements, as defined in RTCA/DO-178B/C.  Also, apply these procedures when the TCAS II manufacturer develops the software requirements for the TCAS II processor associated with functions other than surveillance or the CAS logic.  With the software design specified in RTCA/DO-185A, Volume II or",
    "surveillance or the CAS logic.  With the software design specified in RTCA/DO-185A, Volume II or RTCA/DO-185B, Volume II, the manufacturer of the TCAS II processor should conduct code walk-throughs and develop and perform module tests and module integration tests to verify that the implementation of the specified software design is correct.  This includes the surveillance software necessary to establish and maintain the relative tracks of nearby transponder-equipped aircraft.",
    "2.3.7.3",
    "The functional tests required by TSO-C119b and TSO-C119c/d/e, as described in RTCA/DO-185A, Volume I and RTCA/DO-185B, Volume I respectively, do not provide complete testing for the TCAS II processor software.  However, coverage analysis performed on the CAS test suite, described in Volume I, demonstrated that the CAS test suite tests each column of every transition table and macro, and each identity transition in the CAS requirements specification in RTCA/DO-185A, Volume II or RTCA/DO-185B,",
    "transition in the CAS requirements specification in RTCA/DO-185A, Volume II or RTCA/DO-185B, Volume II.  Thus, the CAS test suite provides more than full decision coverage (but not full condition coverage) as defined in RTCA/DO-178B.  TCAS II manufacturers must develop additional functional tests that correspond to the detailed requirements that they develop for the TCAS II processor.  The potential consequences of software errors in the TCAS II processor or resolution display require the",
    "consequences of software errors in the TCAS II processor or resolution display require the manufacturer to provide a structural coverage analysis showing single",
    "condition test coverage of all instructions at the source code that can affect the generation and display of RAs.  These tests may be a combination of module tests, module integration tests and functional tests.",
    "2.3.7.4 \nEquipment produced under a TSO has obtained FAA concurrence that the software for the equipment was developed in accordance with RTCA/DO- 178B/C to the software level the TSO specifies.  Subsequent installations of the same TCAS II equipment on other aircraft types do not require any additional verification if the software and the interface is not changed. \n2.3.8",
    "2.3.8 \nFailure Conditions System Safety Assessment and Design Assurance.  Unannunciated failures of the TCAS II equipment, its associated transponder, or sensors or displays that could generate an incorrect or false RA, or result in a missing RA, must be \nimprobable.  This can be accomplished using the methods described in AC 25.1309-1A,",
    "improbable.  This can be accomplished using the methods described in AC 25.1309-1A, \nSystem Design and Analysis.  A functional hazard assessment (FHA), a failure modes and effects analysis (FMEA), and a quantitative probability analysis of the TCAS II equipment, Mode S transponder, displays, and sensors (including altitude information sources) will normally be necessary to show that the system design meets the probabilities specified for the following failure conditions.",
    "Note: Appendix E, Section E.1, Definitions, gives the definitions of a missing RA, incorrect RA, and false RA.",
    "2.3.8.1 \nThe probability of failure of the installed system to perform its intended function from a reliability and availability perspective should be shown to \nbe no greater than 1.0 x10-3 per flight hour. \n2.3.8.2 \nThe probability of a missing RA, without indication of loss of capability to \ngenerate an RA, should be shown to be no greater than 1.0 x 10-4 per flight \nhour in the terminal environment and 1.0 x 10-5 per flight hour in the \nenroute environment. \n2.3.8.3",
    "enroute environment. \n2.3.8.3 \nThe probability of a false RA aural and visual alert due to a failure of the \nsystem should be shown to be no greater than 1.0 x 10-4 per flight hour in \nthe terminal environment and 1.0 x 10-5 per flight hour in the enroute \nenvironment. \n2.3.8.4 \nSoftware that presents incorrect RA aural and visual alerts, or results in a missing RA, is considered a hazardous failure condition.  Develop software involved in generating RAs to RTCA/DO-178B/C, Level B standards.",
    "2.3.8.5 \nThe probability of an incorrect RA aural and visual alert due to a failure of \nthe hardware should be shown to be no greater than 1.0 x 10-4 per flight hour in the terminal environment and 1.0 x 10-5 per flight hour in the \nenroute environment. \n2.3.8.6",
    "enroute environment. \n2.3.8.6 \nThe frequency of encounters where another aircraft could present a potential threat depends on the density of aircraft in the airspace.  In terminal airspace, you may assume the frequency to be once every 10 hours and, in enroute airspace, it may be once every 200 hours.  You may",
    "establish different frequencies based on operational data.  Provide these analyses for the first installation of TCAS II equipment on a new model aircraft.  For subsequent installations of the same equipment in other aircraft, you may use some of the same analyses paying particular attention to the differences in the altitude sensors that are used. \n2.3.9 \nMaintenance Considerations for Hybrid Surveillance Functionality (TSO-C119d and later). \n2.3.9.1",
    "Maintenance Considerations for Hybrid Surveillance Functionality (TSO-C119d and later). \n2.3.9.1 \nRTCA/DO-300A section 2.2.10, Monitoring Requirements, provides a \nmeans for annunciation or recording of failures of own-ship latitude, longitude and/or ground speed inputs.  Note that a failure of any of these inputs will not cause TCAS to fail, but it will disable the hybrid surveillance functionality. \n2.3.9.2",
    "To ensure that latent failures don't exist in airborne TCAS II units for long periods of time, the system must annunciate failures of hybrid surveillance to the flight crew, or there must be periodic scheduled maintenance tasks to check hybrid surveillance functionality.  The instructions for continued airworthiness (ICA) must also require operators to periodically report reliability of the hybrid surveillance functionality.  Depending on the level of avionics integration in the aircraft, you",
    "surveillance functionality.  Depending on the level of avionics integration in the aircraft, you can use different methods to ensure the continued airworthiness of the hybrid surveillance such as:",
    "2.3.9.2.1 \nFor those aircraft equipped with an engine indicating and crew alerting (EICAS) system (or other similar annunciation system) integrate the failure information into the warning system such that a failure of hybrid surveillance is annunciated to the flight crew. \n2.3.9.2.2",
    "2.3.9.2.2 \nFor aircraft equipped with an onboard maintenance computer interfaced with TCAS, add a scheduled maintenance task to the aircraft's maintenance program to check for presence of any existing or past failures of hybrid surveillance.  Take corrective action as specified by the TCAS manufacturer. \n2.3.9.2.3 \nFor aircraft without a centralized warning system and/or an onboard \nmaintenance computer, add a scheduled maintenance task to the aircraft's",
    "maintenance computer, add a scheduled maintenance task to the aircraft's \nmaintenance program to check for presence of any existing or past failures of hybrid surveillance and to ensure hybrid surveillance is functional. Take corrective action as specified by the TCAS manufacturer. \n2.3.9.2.4 \nIf a scheduled maintenance task is employed, the installer must establish the initial frequency of the task in conjunction with the manufacturer of",
    "the TCAS equipment but on a frequency not to exceed two calendar years between tasks.  Operators can use normal maintenance escalation procedures later to extend the maintenance frequency if they provide adequate justification to do so to the responsible ACO.  Coordinate any such extension request with the ACO prior to implementation of changes.",
    "2.3.9.3 \nThe ICA must require operators of TCAS equipment with hybrid surveillance to report hybrid surveillance maintenance history to the TCAS manufacturer periodically but not to exceed 18 calendar months between reports. \n\n## 2.3.10 Populating Mode S Transponder Registers 4016 And 6216 (If Implemented).",
    "Some airspace regulations require the transponder to report short term intent data, such as the Selected Altitude data, in transponder replies or via ADS-B. For example, 14 CFR § 91.225 requires that by Jan 1, 2020 specific message elements must be broadcast.  Some of those elements are contained in the BDS 6216 register, such as SIL and NACP.  Refer to AC 20-165B, Airworthiness Approval of ADS-B Out *Systems*, for more information on compliance with the requirements of 14 CFR 91.225 and 14 CFR",
    "Out *Systems*, for more information on compliance with the requirements of 14 CFR 91.225 and 14 CFR § 91.227. When complying with either the EU Enhanced Surveillance rule or the U.S. ADS-B rule, the short term intent fields are only required to be implemented if the data is available on the aircraft via a digital interface.  For example, there is no expectation that a new autopilot must be installed to comply with reporting Selected Altitude if it is not available from the existing system on",
    "to comply with reporting Selected Altitude if it is not available from the existing system on the aircraft.  Any data that is not available on the aircraft should be reported as zero.",
    "2.3.10.1 \nSelected Vertical Intention (BDS register 4016).  If available, interface the transponder to the aircraft systems that provide vertical intention information for the various subfields in register 4016 e.g. MCP/FCU selected altitude, FMS selected altitude, etc.  Appendix F provides guidance for interfacing to these systems. \n2.3.10.2",
    "2.3.10.2 \nTarget State and Status Information (BDS register 6216).  If available, interface the transponder to the aircraft systems that provide the transponder with state and status information for the various subfields in register 6216 e.g. SIL supplement, NACP, NICBARO, barometric pressure setting, selected heading, etc.  Appendix F  provides guidance for interfacing to these systems.",
    "## Chapter 3. Test And Evaluation (Initial Approval).\n\n3.1 \nGeneral. \n\nTest the first installation of a manufacturer's TCAS II or Mode S transponder system.  \nThis will verify the design and installation performs its intended function under the expected operating conditions, and that there are no adverse interactions between the TCAS II or Mode S transponder and existing aircraft systems.  The test will also show that other aircraft equipment has not been adversely affected.",
    "3.2 \nCreate a Test Plan.",
    "Provide a test plan that includes adequate testing to perform this verification.  This test plan will generally require a combination of ground tests, basic flight tests, and flight tests involving planned encounters with another TCAS II equipped aircraft.  You can use an aircraft other than a transport category aircraft for either the TCAS II installation or for the air-to-air cooperative flights.  The rest of this chapter lists and explains the minimum elements of the test plan.",
    "3.2.1 \nBasic Ground Tests. \n3.2.1.1 \nBearing accuracy.",
    "Demonstrate the bearing estimation accuracy of the TCAS II system as installed in the aircraft.  Measure the bearing accuracy using a calibrated antenna range that allows precise echo controlled, far field, angle-of-- arrival measurements at or slightly above zero degrees elevation and over 360 degrees in azimuth.  You may also measure the bearing accuracy using a fixed transponder location while rotating the test aircraft on a compass rose while measuring the bearing angles at 30-degree",
    "while rotating the test aircraft on a compass rose while measuring the bearing angles at 30-degree intervals. Alternately, you may keep the airplane in a fixed position and move the transponder (refer to Appendix B for cautionary note on testing).  You may do a manual readout of the bearing estimate directly from a plan position display on the traffic advisory display.  Alternatively, you may automatically record the bearing estimates or read them from a special test display.  A maximum error",
    "record the bearing estimates or read them from a special test display.  A maximum error of ±15 degrees in azimuth is acceptable; however, larger errors are acceptable in the area of the tail (for example, within ±45 degrees of the tail) when that area is not visible from the cockpit.  In this case, aircraft structure may interfere with the signal path.",
    "3.2.1.2 \nSensor failures. \nEvaluate simulated failures of the aircraft sensors integrated with TCAS II to determine that the resulting system failure state agrees with the predicted results.  These tests should be part of the ground test plan.",
    "3.2.1.3 \nElectromagnetic Compatibility (EMC).",
    "Demonstrate that the TCAS II equipment is electromagnetically compatible with previously installed systems or equipment, and is not a source of adverse conducted or radiated interference, and that conducted or radiated interference from previously installed systems and equipment does not adversely affect operation of the TCAS II equipment. Specifically demonstrate that the TCAS II equipment is electromagnetically compatible with the weather radar, particularly if operating in the C-band.",
    "3.2.1.4 \nEvaluate the general arrangement and operation of controls, displays, circuit breakers, annunciators, and placards of the TCAS II system.  \nConduct a human factors evaluation of the controls, displays and annunciators. Evaluate the TCAS controls and the controls of installed",
    "systems that interact with TCAS (for example, transponders) to determine that the control design and location prevents inadvertent actuation. Evaluate TCAS displays and annunciations to determine that they support flight crew awareness of TCAS status changes which could result from TCAS mode selections, intentional pilot actuation of other installed systems, or inadvertent pilot actions with TCAS or other installed systems. Evaluate TCAS displays to ensure all information is, at a minimum,",
    "TCAS or other installed systems. Evaluate TCAS displays to ensure all information is, at a minimum, legible, unambiguous, and attention-getting (as applicable).  In particular, where transponder functions are integrated with other system controls, ensure that unintended transponder mode switching, especially switching to STANDBY or OFF, is not possible.  Pay close attention to line select keys, touch screens or cursor controlled trackballs as these can be susceptible to unintended mode",
    "keys, touch screens or cursor controlled trackballs as these can be susceptible to unintended mode selection resulting from their location in the flight deck (for example proximity to a foot rest or adjacent to a temporary stowage area).",
    "3.2.1.5 \nEvaluate the TCAS II self-test features and failure mode displays and annunciators. \nVerify that a TCAS failure and TCAS in the standby mode are properly annunciated in accordance with sections 2.2.10 of this AC.",
    "3.2.1.6 \nVerify proper interface of the pressure altitude source and radio altimeter with the TCAS II equipment. \n3.2.1.7",
    "Verify that the windshear and the ground proximity warning system/terrain awareness warning system (GPWS/TAWS) warnings along with any other higher priority alerts and TCAS II voice alerts are compatible.  Also, verify that the flight crew can clearly understand windshear or GPWS/TAWS warnings and that TCAS II automatically switches to the TA Only mode when TCAS II and windshear voice or GPWS/TAWS announcements simultaneously occur.  The alert priorities should be windshear, GPWS/TAWS and then",
    "announcements simultaneously occur.  The alert priorities should be windshear, GPWS/TAWS and then TCAS II.",
    "3.2.1.8 \nVerify the performance of TCAS II traffic display by observing any available area traffic. \n3.2.1.9 \nEvaluate the TCAS II system installation for satisfactory identification, \naccessibility, and visibility during both day and night conditions. \n3.2.1.10 \nDetermine that any configuration of discretes associated with the TCAS II logic, including inhibits of climb RAs, operate properly.  (Changes in logic or function with aircraft configuration, altitude, or speed.) \n3.2.1.11",
    "3.2.1.11 \nVerify that the ICAO 24-bit aircraft address and maximum airspeed are correct. Additionally, verify that other features, which may be optional, such as extended squitter, aircraft identification reporting or other data \nlink uses also function correctly.  Verify that the transponder and data",
    "link uses also function correctly.  Verify that the transponder and data \nsources meet the requirements of the failure condition classifications associated with the features.  For example, an unannunciated failure of the transponder extended squitter resulting in transmission of erroneous information is at least a major failure condition. \n3.2.1.12",
    "3.2.1.12 \nIf connected, verify that the altitude alerter is providing correct data to TCAS and that the TCAS II V7.0 or V7.1 logic, as applicable, correctly weakens or strengthens the displayed RA using the altitude alerter input. \n3.2.1.13 \nVerify that the air/ground inputs are connected properly.",
    "CAUTION:  When the aircraft is on the ground, the system must inhibit the Mode S transponder from replying to any Mode A, Mode C, Mode A/C/S all-call interrogations and Mode S-only all-call interrogations. You can usually accomplish this inhibit via an appropriate transponder pin connected through the weight-on-wheels switch, but you might also implement it through other automatic means (for example, velocity/altitude algorithm, etc.).  You must verify the inhibit during ground testing.",
    "Note: While on the ground, the transponder normally should stop output of acquisition squitters (short squits), and should continue output of extended squitters (known as long squits or ADS-B) in the surface format, and it should reply to any discretely-addressed aircraft interrogations. You should also verify this during ground testing.  DO-181E section 2.2.18.2.6, Acquisition Squitter Protocols, specifies the exact conditions for transmission of acquisition squitter.",
    "## 3.2.2 Basic Flight Tests.",
    "3.2.2.1 \nDuring all phases of flight, determine if there is any mutual interference with any other aircraft system.  Have all installed systems, including the weather radar, operating during the flight test. \n3.2.2.2",
    "3.2.2.2 \nEvaluate TCAS II aural messages for acceptable volume and intelligibility during both low and high cockpit noise levels (idle descent at low speed and high power at maximum operating limit speed Vmo) with headset covering outboard ear only (when appropriate) and without headsets.  In",
    "the case of turbo-prop aircraft where the aircrew utilizes headsets via the aircraft audio distribution panel, the aural messages should hold the same acceptable volume and intelligibility during both low and high cockpit noise levels.  If you use the TCAS II TEST to simulate voice announcements, ensure that use of the TEST function does not change the audio level. \n3.2.2.3",
    "3.2.2.3 \nDemonstrate that traffic information remains valid and usable when the aircraft is pitched ±15 degrees and rolled approximately 30 degrees during \nnormal maneuvers by observing area traffic in the traffic advisory display. \n3.2.2.4 \nEvaluate the effective surveillance range of the traffic display, including target azimuth reasonableness and track stability.  Use of targets of opportunity or a non-transport category (low speed) aircraft as a target for these tests is permissible.",
    "3.2.2.5 \nDetermine that any configuration discretes (changes in logic or function with aircraft configuration, altitude, or speed) associated with the TCAS II logic, including inhibits of climb RAs, operate properly unless you have previously demonstrated them during ground tests. \n3.2.2.6 \nPerform the additional flight tests in RTCA/DO-185A or RTCA/DO- 185B, paragraph 3.4.4 as applicable, unless previously accomplished under TSO-C119b or TSO-C119c/d/e respectively. \n3.2.2.7",
    "3.2.2.7 \nEvaluate TCAS II for noninterference during coupled autopilot and flight director (FD) approaches to the lowest minimums approved for the aircraft. \n3.2.2.8 \nBefore any cooperative flight tests at any altitude involving the TCAS II- equipped aircraft and another aircraft, fly both aircraft in close formation to ensure matched altimetry readouts.  You should fly these checks at the speeds and altitudes you will use for the tests. \n3.2.2.9",
    "3.2.2.9 \nEvaluate all selectable modes of the TCAS II to determine that they perform their intended function and that the system clearly and uniquely annunciates the operating mode. \n3.2.2.10 \nRe-evaluate any previously installed aircraft systems that required changes as a result of the TCAS II installation.  (For example, electronic flight instrument system (EFIS), FD, PFD, navigation displays (ND), IVSI, interface etc.) \n3.2.2.11",
    "3.2.2.11 \nIf you include hybrid surveillance functionality, perform the flight tests in RTCA/DO-300, dated December 13, 2006 (including Change 2, dated December 15, 2015) or DO-300A, dated March 20, 2013 (including Change 1, dated December 15, 2015), MOPS for Traffic Alert and \nCollision Avoidance System II (TCAS II) Hybrid Surveillance, paragraph 3, as appropriate unless previously accomplished under TSO-C119c, TSO- C119d or TSO-C119e. \n3.2.3",
    "Planned Encounter Flight Tests. The objective of these flight tests is to demonstrate adequate TCAS II surveillance and to verify smooth, predictable TCAS II performance.  First establish the appropriate safety rules, static system leak test (if needed due to having opened the system), and altimeter correlation between the encounter aircraft and the TCAS aircraft.  You should fly the following encounters between the TCAS II aircraft and a dedicated intruder aircraft to assure that the TCAS II",
    "between the TCAS II aircraft and a dedicated intruder aircraft to assure that the TCAS II aircraft system performs its intended function by generating TAs and RAs, and is consistent with RTCA/DO-185A or RTCA/DO-185B as applicable, and RTCA/DO-300 (including Change 2) or RTCA/DO-300A (including Change 1) as appropriate.  The intruder aircraft must have a previously approved transponder installation capable of Mode A, Mode C, and for those tests necessary, Mode S, TCAS II and ADS-B Mode S",
    "capable of Mode A, Mode C, and for those tests necessary, Mode S, TCAS II and ADS-B Mode S Extended Squitter if appropriate.  These tests are also to expose the installed TCAS II system to a reasonable number of carefully controlled encounters that are likely to occur in service.  This matrix covers the envelope of encounter speeds, altitudes, and geometries that have in the past identified flaws in surveillance, logic, and antenna mechanization that bench tests did not detect earlier.  Fly the",
    "in surveillance, logic, and antenna mechanization that bench tests did not detect earlier.  Fly the following encounters:",
    "3.2.3.1 \nIntruder overtaking TCAS II aircraft (from the aft quadrants). \n3.2.3.2 \nHead-on. \n3.2.3.2.1 \nLow and high closure speeds. \n3.2.3.2.2 \nAbove climb limit, TCAS II to TCAS II. \n3.2.3.2.3 \nTCAS II against Mode C with TCAS II above intruder and above climb limit (intent is to force TCAS II aircraft to descend.) \n3.2.3.2.4 \nAt 3000 feet over calm water to evaluate multipath protection. \n3.2.3.3 \nConverging. \n3.2.3.3.1 \nCrossing (intruder above TCAS II, descending or vice versa.)",
    "3.2.3.3 \nConverging. \n3.2.3.3.1 \nCrossing (intruder above TCAS II, descending or vice versa.) \n3.2.3.3.2 \nEvaluate the TA-only mode during planned encounters. \n3.2.3.3.3 \nEvaluate a mix of intruder transponder modes (A, C, S and S with extended squitter) but primary emphasis should be on  \nTCAS II-to-TCAS II coordination, and on Mode C replies from the intruder aircraft.",
    "3.2.3.3.4 \nEvaluate a mix of encounters with TCAS II both above and below the \nintruder. \n3.2.3.3.5 \nIf a flight test is necessary to ensure compatibility with other designs, verify correct air-to-air coordination between the test TCAS II and another manufacturer's previously approved equipment (refer to paragraph 2.3.3). \n3.2.3.3.6",
    "3.2.3.3.6 \nEvaluate the effect of electrical transients (bus transfer) during encounters. The TCAS II should not experience adverse effects.  Electrical transients should not result in generation of any false TAs or RAs.  Normal TCAS II \nfunctions and displays should be restored within approximately three \nseconds.",
    "## 3.2.4 Mode S Transponder Tests.",
    "3.2.4.1 \nThis section provides select guidance for certain extended squitter and ELS/EHS surveillance messaging.  Refer to the EASA and JAA publications mentioned in paragraph 1.5 for guidance on ELS/EHS capabilities. \n3.2.4.2",
    "3.2.4.2 \nYou can use the tests in these paragraphs to obtain the certification of a stand-alone Mode S transponder installation (an installation without TCAS II).  You should also use these tests to evaluate a Mode S transponder installed as part of a TCAS II installation.  The tests primarily verify the installed antenna(s) are compatible with the Mode S transponder and provide an adequate response to ground radar interrogations during normal aircraft maneuvers. \n3.2.4.3",
    "Additionally, these tests demonstrate that the Mode S transponder functions properly as installed and does not interfere with other aircraft electronic equipment.  You don't need to do as much detailed flight test when the Mode S transponder and antenna installation are identical or similar to that of a previously approved ATCRBS transponder installation. If you are upgrading a previously installed and certified transponder, you don't necessarily need to follow all of the guidance in this",
    "and certified transponder, you don't necessarily need to follow all of the guidance in this section to approve the upgrade.  You should accomplish a careful examination of the proposed transponder upgrade to determine which of the tests in this section are necessary and appropriate.  Typical testing associated with the initial installation and certification of a new transponder may not be necessary when upgrading a previously approved transponder.  For example, if you are considering a software",
    "when upgrading a previously approved transponder.  For example, if you are considering a software upgrade that would add extended squitter functionality to a transponder in a previously approved installation, you won't need detailed flights if appropriate ground testing adequately evaluates the added functionality.",
    "CAUTION:  When conducting flight testing of the transponder or TCAS",
    "system, you must prevent being a source of interference to ATC or other TCAS aircraft operating in the area.  For example, using a fixed transponder to simulate an intruder aircraft can cause transmission of data which produce false targets for the ground ATC surveillance systems or airborne TCAS aircraft.  These false indications of \"intruder aircraft\" could result in unnecessary ATC communications and possibly in TCAS induced aircraft maneuvers.  Therefore, conduct such testing in",
    "communications and possibly in TCAS induced aircraft maneuvers.  Therefore, conduct such testing in coordination with ATC.",
    "Note: The conduct of this test requires cooperation with ATC controllers.  \nCoordination with ATC is important before the flight test for any necessary approval of the flight and agreement with the flight test procedures.  During the flight test, the test crew will need to communicate with the controller monitoring the aircraft and reporting transponder performance data.",
    "3.2.4.4",
    "If the Mode S transponder uses a top mounted antenna in addition to a bottom mounted antenna installed at, or near, the same location used by a previously approved ATCRBS transponder antenna, conduct a comprehensive ground test and evaluation in accordance with Appendix B and perform a functional flight test.  The transponder code, altitude reporting and \"IDENT\" features of the transponder should be exercised during normal maneuvering.  The ATC controller should not observe any objectionable",
    "be exercised during normal maneuvering.  The ATC controller should not observe any objectionable behavior.",
    "3.2.4.5 \nIf a Mode S transponder is installed in an aircraft which does not have a previously approved ATCRBS transponder installation, or that uses a bottom mounted antenna location which differs significantly from that used by a previously approved ATCRBS transponder antenna, conduct the following ground and flight tests:",
    "Note: References to the radar facility are references to the radar that provides the data used by the ATC controller(s) during the flight test for monitoring the aircraft and reporting transponder performance data.  In other words, these refer to where the radar antenna/interrogator is located, not the displays used by the controllers.",
    "3.2.4.6 \nConduct ground tests and evaluations per Appendix B. \n3.2.4.7 \nClimb and Distance Coverage.",
    "3.2.4.7 \nClimb and Distance Coverage. \nBegin at a distance of at least 10 nautical miles (NM) from, and an altitude of 2000 to 3000 feet above, the radar facility. Using a transponder code assigned by ATC, fly on a heading that will pass the aircraft over the radar facility.  At a distance of 5 to 10 NM beyond the radar facility, fly the aircraft at its normal maximum climb attitude to within 90 percent of the certificated altitude for the aircraft, maintaining the aircraft heading within",
    "5 degrees of the track from the radar facility.  After reaching the maximum altitude for which the aircraft is certificated, fly level at the maximum altitude to 160 NM for turbojet and some turboprop powered airplanes (or 80 NM for most other aircraft) from the radar facility.  (Distance from the radar facility is a function of the airplane's maximum certificated altitude.)",
    "Communicate with the ATC controller to check for evidence of transponder dropout.  During the flight, check the \"IDENT\" mode of the ATC transponder to assure that it is performing its intended function. There should be no unexpected dropouts (no return for two or more sweeps).  Uncontrollable ringing that hinders use of the ground radar is unsatisfactory.",
    "3.2.4.8 \nLong Range Reception. \nAt 90 percent of maximum certificated altitude, perform left and right 360-degree turns, at bank angles of 8 to 10 degrees.  The aircraft should be at least 160 (or 80) NM from the radar facility.  During these turns, request that the ATC controller monitor the radar displays.  There should be no dropouts (no return for two or more sweeps).",
    "3.2.4.9 \nHigh Angle Reception.",
    "Perform two 360-degree turns, one to the right and one to the left, at bank angles of 8 to 10 degrees with the airplane at a distance of 50 to 70 NM from the radar facility and at an altitude of at least 35,000 feet or within 90 percent of the maximum altitude for which the aircraft is certificated. There should be no dropouts (no return for two or more sweeps).  Switch the transponder to a new code assigned by the ATC controller.  The aircraft secondary return on the ATC controller's radar",
    "code assigned by the ATC controller.  The aircraft secondary return on the ATC controller's radar display should indicate a Mode A code change.",
    "3.2.4.10 \nHigh Altitude Cruise. \nWithin 90 percent of the aircraft's maximum certificated altitude or its maximum operating altitude beginning at a point 160 (or 80) NM from the radar facility, fly on a course that will pass over the radar facility.  The ATC controller should report no unexpected transponder dropout or \"ring around.\"",
    "3.2.4.11 \nSurveillance Approach.",
    "Beginning at or above 90 percent of the certificated maximum altitude for the aircraft, perform a letdown and approach to a runway of an airport served by Airport Surveillance Radar (ASR) having an ATCRBS facility. Make the approach at the maximum normal rate of descent.  Normal approach and landing configuration for the aircraft should continue down to an altitude of 200 feet or less above the ground radar antenna elevation. Not more than one dropout should occur for any 10 sweeps during final",
    "radar antenna elevation. Not more than one dropout should occur for any 10 sweeps during final approach. Uncontrolled ringing that hinders use of the ground radar is unsatisfactory.",
    "3.2.4.12 \nHolding and Orbiting Patterns. \n3.2.4.12.1 \nAt an altitude of 2000 feet above the radar antenna or minimum obstruction clearance altitude (whichever is greater) with landing flaps and gear extended, fly left and right 360-degree turns approximately 10 miles from the radar facility.  There should be no signal dropouts. \n3.2.4.12.2",
    "3.2.4.12.2 \nAt an altitude of 2000 feet above the radar antenna or minimum obstruction clearance altitude (whichever is greater), fly 45 degree sectors of left and right 10 mile orbital patterns around a radar facility with gear \nand landing flaps extended.  There should be no signal dropouts. \n3.2.4.13 \nAltitude Reporting.",
    "and landing flaps extended.  There should be no signal dropouts. \n3.2.4.13 \nAltitude Reporting. \nConduct a functional test of the altitude encoder by comparison with ATC displayed altitudes.  Verify correspondence at several altitudes between ATC readings and the Captain's altimeter, when set at or corrected to \n29.92 inches of mercury (or equivalent).",
    "3.2.4.14 \nVerify that a transponder failure and transponder in the standby mode are properly annunciated in accordance with sections 2.2.10 of this AC.\n\n## Chapter 4. Follow-On Approvals (Stcs Or Amended Stc Or Amended Tc) - The Need For Tests And A Plan.\n\nThis section provides guidance for follow-on approvals of TCAS and Mode S transponders. \n\n## 4.1 General",
    "4.1.1 \nProvide a test plan including adequate aircraft ground testing and evaluations to verify that the design and installation performs its intended function when you install it in a different aircraft type under the expected operating conditions.  There should be no adverse interactions between the TCAS II or Mode S transponder and existing aircraft systems, and the installation should not compromise prior approvals of present aircraft",
    "equipment.  This test plan will generally require a combination of ground tests, basic \nflight tests, and flight tests involving planned encounters with a Mode C equipped aircraft, or the use of a suitably located fixed transponder.  The test plan should contain, as a minimum, the elements of paragraph 3.2.1.3 and 3.2.4 and those in the next paragraphs.  \n4.1.2",
    "You may need to conduct flight testing of TCAS II or Mode S transponder systems for follow-on approvals (previously approved TCAS II or Mode S transponder equipment installed in a different aircraft type or change to the defined configuration of a previously approved system installation) to verify that the design and installation performs its intended function under the expected operating conditions.  Determine that there are no adverse interactions between the TCAS II or Mode S transponder and",
    "Determine that there are no adverse interactions between the TCAS II or Mode S transponder and existing aircraft systems, and that the installation does not compromise prior approvals of present aircraft equipment.",
    "CAUTION:  When flight testing the transponder or TCAS system, you must prevent being a source of interference to ATC or other TCAS aircraft operating in the area.  For example, using a fixed transponder to simulate an intruder aircraft can cause transmission of data which produce false targets for the ground ATC surveillance systems or airborne TCAS aircraft.  False indications of \"intruder aircraft\" could result in unnecessary ATC communications and possibly in TCAS induced aircraft maneuvers.",
    "could result in unnecessary ATC communications and possibly in TCAS induced aircraft maneuvers.  Conduct such testing in coordination with ATC.",
    "## 4.2 Ground Tests And Evaluations.",
    "4.2.1",
    "Evaluate the general arrangement and operation of controls, displays, circuit breakers, annunciators, and placards of the TCAS II system.  Conduct a human factors evaluation of the controls, displays and annunciators.  Evaluate the TCAS controls and the controls of installed systems that interact with TCAS (for example, transponders) to determine that the control design and location prevents inadvertent actuation.  Evaluate TCAS displays and annunciations to determine that they support flight",
    "actuation.  Evaluate TCAS displays and annunciations to determine that they support flight crew awareness of TCAS status changes which could result from TCAS mode selections, intentional pilot actuation of other installed systems, or inadvertent pilot actions with TCAS or other installed systems.  Evaluate TCAS displays to ensure all information is, at a minimum,",
    "legible, unambiguous, and attention-getting (as applicable).  In particular, where transponder functions are integrated with other system controls, ensure that unintended transponder mode switching, especially switching to STANDBY or OFF, is not possible.  Pay close attention to line select keys, touch screens or cursor controlled trackballs as these can be susceptible to unintended mode selection resulting from their location in the flight deck (for example proximity to a foot rest or adjacent",
    "resulting from their location in the flight deck (for example proximity to a foot rest or adjacent to a temporary stowage area).",
    "4.2.2 \nEvaluate the TCAS II self-test features and failure mode displays and annunciators. For forward fit or new installations (as defined in the note to section 2.2.10), verify that a TCAS failure and TCAS in the standby mode are properly annunciated in accordance with sections 2.2.10 of this AC. \n4.2.3 \nVerify proper interface of the pressure altitude source and radio altimeter with the \nTCAS II equipment. \n4.2.4",
    "TCAS II equipment. \n4.2.4 \nMeasure the performance of the directional antenna for 360 degrees coverage at 30 degree intervals, as specified under basic ground tests, paragraph 3.2.1.1. \n4.2.5 \nEvaluate the TCAS II system installation for satisfactory identification, accessibility, and visibility during both day and night conditions. \n4.2.6",
    "4.2.6 \nDetermine that any configuration discretes (changes in logic or function with aircraft configuration, altitude, or speed) associated with the TCAS II logic, including inhibits of climb RAs, operate properly. \n4.2.7 \nVerify that the ICAO 24-bit aircraft address and maximum airspeed are correct.  Verify that the transponder and data sources meet the requirements of the failure condition classifications associated with the features. \n4.2.8",
    "4.2.8 \nVerify that the windshear and GPWS/TAWS warnings and TCAS II voice alerts are compatible.  Also, verify that the flight crew can clearly understand windshear and GPWS/TAWS warnings and that TCAS II automatically switches to the TA Only mode when TCAS II and windshear voice or GPWS/TAWS announcements simultaneously occur.  The alert priorities should be windshear, GPWS/TAWS, and then TCAS II. \n4.2.9",
    "4.2.9 \nIf connected, verify that the altitude alerter is providing correct data to TCAS and that the TCAS II logic correctly weakens or strengthens the displayed RA using the altitude alerter input. \n4.2.10 \nVerify proper connection of the air/ground inputs. \nCAUTION:  When the aircraft is on the ground, the system must inhibit the Mode S \ntransponder from replying to any Mode A, Mode C, Mode A/C/S all-call interrogations and Mode S-only all-call interrogations.",
    "Note 1: You can usually implement this inhibit via an appropriate transponder pin connected through the weight-on-wheels switch, but you might also implement it through some other automatic means (for example, velocity/altitude algorithm, etc.). You must verify the inhibit implementation during ground testing.",
    "Note 2: While on the ground the transponder normally should stop output of acquisition squitters (short squits), and should continue output of extended squitters (known as long squits or ADS-B) in the surface format and it should reply to any discretely addressed aircraft interrogations. You should also verify this during ground testing.  DO-181E, paragraph 2.2.18.2.6, Acquisition Squitter Protocols, specifies the exact conditions for transmission of acquisition squitter.",
    "4.2.11 \nFor forward fit or new installations (as defined in the note to section 2.2.10), verify that a transponder failure and transponder in the standby mode are properly annunciated in accordance with sections 2.2.10 of this AC. \n\n## 4.3 Flight Tests.",
    "4.3.1 \nThe certification policy for follow-on approvals (STC or amended STC) of TCAS II V7.0 or V7.1 units is that you may not need to do flight tests, if you perform the appropriate testing on the ground to certify that you correctly installed the V7.0 or V7.1 unit and that any new interfaces operate correctly with the TCAS II logic. \n4.3.2 \nIf we determine that you need to do certification flight-testing, demonstrate the following: \n4.3.2.1",
    "4.3.2.1 \nVerify proper operation of the traffic display by observing proximate traffic, at least one TA and at least one RA.  Confirm that the appropriate aural alerts occur correctly with the TA and RA.  You may generate the advisories by: \n4.3.2.1.1 \nPlanned encounters with an intruder aircraft operating a transponder with Mode C capability.",
    "Planned encounters with an intruder aircraft operating a transponder with Mode C capability. \nNote: Before any cooperative flight tests at any altitude involving the TCAS II equipped aircraft and another aircraft, fly both aircraft in close formation to assure matched altimetry readouts.  You should fly these checks at the speeds and altitudes you will use for the tests.",
    "4.3.2.1.2 \nEncounters with an operating Mode C transponder installed at a fixed ground location, which reports an appropriate test altitude.",
    "CAUTION:  When flight testing the transponder or TCAS system, you must prevent being a source of interference to ATC or other TCAS aircraft operating in the area.  For example, using a fixed transponder to simulate an intruder aircraft can cause transmission of data which produce false targets for the ground ATC surveillance systems or airborne TCAS aircraft.  These false indications of \"intruder aircraft\" could result in unnecessary ATC communications and possibly in TCAS induced aircraft",
    "aircraft\" could result in unnecessary ATC communications and possibly in TCAS induced aircraft maneuvers.  Conduct such testing in coordination with ATC.",
    "4.3.2.1.3 \nEncounters with aircraft targets of opportunity. \n4.3.2.1.4 \nThe use of suitable test equipment during ground tests.",
    "4.3.2.1.4 \nThe use of suitable test equipment during ground tests. \nCAUTION:  When ground testing the transponder or TCAS system, you must take precautions to prevent being a source of interference to ATC or other TCAS aircraft operating in the area.  Ground maintenance checks or ramp testing (such as altimetry or bearing accuracy testing) can cause transmission of data which produce false targets for the ground ATC surveillance systems or airborne TCAS aircraft.  These false indications of",
    "\"intruder aircraft\" could result in unnecessary ATC communications and possibly in TCAS induced aircraft maneuvers.  Conduct such testing in coordination with ATC and use antenna shielding (transmission absorption covers or caps) to prevent the system from transmitting test data that could generate false intruder information.  Using high-powered, hangar-mounted transponders to conduct ramp testing is not an acceptable means to test either transponder or TCAS.  As an alternative to the use of",
    "is not an acceptable means to test either transponder or TCAS.  As an alternative to the use of antenna shielding, radiated testing can be used provided that a) if in Air Mode, the Mode C code, Mode S altitude reporting downlink formats, and ADS-B altitude reports all respond with an altitude that is at least 600 feet below ground level or an altitude above 90,000 feet above ground level, and b) if aircraft is in a normal pre-dispatch configuration (in On Ground Mode and transponder set to",
    "b) if aircraft is in a normal pre-dispatch configuration (in On Ground Mode and transponder set to \"TRANSPONDER\" mode), the Mode C code, Mode S altitude reporting downlink formats, and ADS-B altitude reports all respond with an altitude at ground level.",
    "4.3.2.2 \nDuring all phases of flight, determine if there is any mutual interference with any other aircraft system. \n4.3.2.3",
    "Evaluate TCAS II aural messages for acceptable volume and intelligibility during both low and high cockpit noise levels (idle descent at low speed and high power at Vmo) with and without headsets, covering the outboard ear where appropriate.  In turbo-prop aircraft where the aircrew uses headsets via the aircraft audio distribution panel, the aural messages should hold the same acceptable volume and intelligibility during both low and high cockpit noise levels.  If the TCAS II TEST is used to",
    "and intelligibility during both low and high cockpit noise levels.  If the TCAS II TEST is used to simulate voice announcements, ensure that use of the TEST function does not change the audio level.",
    "4.3.3 \nEvaluate the effective surveillance range of the traffic display, including target azimuth reasonableness and track stability.  You may use a non-transport (low speed) Mode C equipped aircraft as a target or a fixed transponder or suitable test equipment for these tests.",
    "CAUTION:  When flight testing the transponder or TCAS system, you must prevent being a source of interference to ATC or other TCAS aircraft operating in the area.  For example, using a fixed transponder to simulate an intruder aircraft can cause transmission of data which produce false targets for the ground ATC surveillance systems or airborne TCAS aircraft.  These false indications of \"intruder aircraft\" could result in unnecessary ATC communications and possibly in TCAS induced aircraft",
    "aircraft\" could result in unnecessary ATC communications and possibly in TCAS induced aircraft maneuvers.  Conduct such testing in coordination with ATC.",
    "4.3.4 \nEvaluate the Mode S transponder air-to-ground ATCRBS function against an appropriate ground facility. \n4.3.5 \nDetermine that any configuration discretes associated with the TCAS II logic, including inhibits of aural annunciations and RAs, operate properly unless you previously demonstrated this during ground tests.  (These include changes in logic or function with aircraft configuration, altitude, or speed.) \n4.3.6",
    "4.3.6 \nEvaluate TCAS II for noninterference during coupled autopilot and flight director \napproaches to the lowest minimums approved for the aircraft. \n4.3.7 \nEvaluate all selectable modes of the TCAS II to determine that they perform their intended function. \n4.3.8 \nReevaluate any previously installed aircraft systems that have required changes as a result of the TCAS II installation (such as CMC, EFIS, EICAS FD, PFD, ND, IVSI, and interface). \n4.4 \nUpgrading an Existing TCAS II Installation.",
    "If you are upgrading an existing approved TCAS II installation to a higher TCAS II version (i.e., V7.0 or V7.1), and the higher version installation is only a software change, then you don't need to do any additional certification flight tests to obtain a follow-on STC or amended STC or an amended TC.  The appropriate aircraft ground tests of paragraph 4.2 are sufficient to ensure that the higher version TCAS II software is operating properly.  However, if the upgrade to a higher version TCAS",
    "version TCAS II software is operating properly.  However, if the upgrade to a higher version TCAS II unit involves changes other than a software change (such as the addition of new interfaces), you may need to do flight tests in accordance with paragraph 4.3.2.",
    "4.5",
    "Upgrading an Existing Mode S Transponder Installation As stated in Section 3.2.4.3, typical testing associated with the initial installation and certification of a new transponder may not be necessary when upgrading a previously approved transponder. Examination of the proposed transponder upgrade should be accomplished to determine which tests are necessary and appropriate.  For example, when upgrading an existing approved Mode S transponder installation to add ADS-B Out functionality and the",
    "an existing approved Mode S transponder installation to add ADS-B Out functionality and the upgrade is only a software change, if ground testing adequately evaluates the added functionality, then no additional certification flight tests are required to support a follow-on STC, amended STC, or amended TC.",
    "## Chapter 5. Airplane Flight Manual Supplement 5.1 Content Of An Afms. The Afms Should Provide The Appropriate System Limitations And Procedures, And A Comprehensive Description Of All Normal Modes Of Operation, Including Expected Flight Crew Actions. 5.2 Tcas V7.1 Afms Example. Refer To 0 For An Example Of The Elements And Extent Of Detail That A Typical Afms May Show (Specific Performance Data, Inhibits And Procedures May Vary With System Design And Aircraft Type). Appendix A. Example Tcas",
    "Inhibits And Procedures May Vary With System Design And Aircraft Type). Appendix A. Example Tcas Ii V7.1 Afms Introduction.",
    "You may, when appropriate, replace descriptive material and procedures in this Airplane Flight Manual Supplement (AFMS) example by reference in the AFMS to the TCAS II equipment supplier's pilot operating guide.  However, the AFMS reference to this guide must specify date and revision level; and not be open ended, such as, \"or later revision,\" unless the pilot's guide is specifically FAA approved.  Also, the AFMS must define the specific configuration approved from the various options contained",
    "Also, the AFMS must define the specific configuration approved from the various options contained in the pilot's guide; for example, which model control panel, whether the pilot initiated self-test is available in flight, range features, TA vertical display features, and so forth.",
    "## -Example- Airplane Flight Manual Supplement\n\n(Example for an aircraft equipped with IVSI/RA displays) \n\n## Description.",
    "The TCAS II is an on-board collision avoidance and traffic situation display system with computer processing to identify and display intruding and threatening collision aircraft, and issue resolution advisories in the form of vertical maneuver guidance on the pilot and copilot's instantaneous vertical speed indicators (IVSI).  From the transponder replies, TCAS II determines relative altitude, range, and bearing of any ATCRBS or Mode S equipped aircraft with altitude reporting.  From this, TCAS",
    "and bearing of any ATCRBS or Mode S equipped aircraft with altitude reporting.  From this, TCAS II will determine the level of advisory using standardized algorithms.  The TCAS II will resolve multiple aircraft encounters.  ATCRBS equipped aircraft that only reply with Mode A information will not provide altitude information; therefore, TCAS II will not issue resolution advisories for these aircraft but can issue traffic advisories.  The TCAS II will not detect aircraft that are not equipped",
    "but can issue traffic advisories.  The TCAS II will not detect aircraft that are not equipped with transponders.",
    "The TCAS II installation consists of one TCAS II processor, one top mounted directional antenna, one bottom mounted blade (or directional antenna), one Mode S transponder with control panel and top and bottom antennas, one traffic advisory display with control panel (if not combined with the IVSI/RA indicators), two resolution advisory displays, one overhead speaker for voice messages, (caution/warning lights), and associated wiring.",
    "The TCAS II provides two levels of advisories:",
    "1.  If the traffic gets within 25 to 48 seconds, depending upon altitude, of projected Closest Point of Approach (CPA), TCAS II then considers it an intruder, and issues an aural and visual traffic advisory (TA).  This level calls attention to what may develop into a collision threat using the TA display and the voice message, \"TRAFFIC - TRAFFIC.\"  It permits mental and physical preparation for a possible maneuver to follow and assists the pilot in achieving visual acquisition of the intruding",
    "possible maneuver to follow and assists the pilot in achieving visual acquisition of the intruding aircraft.",
    "2.  If the intruder gets within 15 to 35 seconds, depending upon altitude, of CPA, TCAS II \nthen considers it a threat, and issues an aural and visual resolution advisory (RA).  This level provides a recommended vertical maneuver using modified IVSIs and voice messages to provide adequate vertical separation from the threat aircraft or prevents initiation of a maneuver that would place the TCAS II aircraft in jeopardy.  TCAS II is a backup system to the \"SEE AND",
    "AVOID\" concept and ATC surveillance.  TCAS II annunciates RAs by the following voice messages, as appropriate, along with the expected pilot response: \n(1)  \"CLIMB, CLIMB\"--climb at the rate depicted by the green (fly to) arc on the IVSI, nominally between 1,500 and 2,000 fpm.",
    "(2)  \"DESCEND, DESCEND\"--descend at the rate depicted by the green (fly to) arc on the IVSI, nominally between 1,500 and 2,000 fpm. \n\n(3)  \"MONITOR VERTICAL SPEED\"--ensure that vertical speed is out of the illuminated IVSI red arc until the RA is completed. \n\n(4)  \"LEVEL OFF, LEVEL OFF\" -- reduce vertical speed to zero feet per minute.  A \ngreen arc will appear, beginning at zero feet per minute.  The system can issue this as the initial RA or as a subsequent RA.",
    "(5)  \"CLEAR OF CONFLICT\"--range is increasing, and separation is adequate. \n\nExpeditiously return to the applicable ATC clearance, unless ATC directs otherwise. \n\n(6)  \"CLIMB, CROSSING CLIMB, CLIMB, CROSSING CLIMB\"--climb at the rate depicted by the green (fly to) arc on the IVSI, nominally between 1,500 and 2,000 fpm.  You will best achieve safe separation by climbing through the threat's flight path.",
    "(7)  \"DESCEND, CROSSING DESCEND, DESCEND, CROSSING DESCEND\"--\ndescend at the rate depicted by the green (fly to) arc on the IVSI, nominally between 1,500 and 2,000 fpm. You will best achieve safe separation by descending through the intruder's flight path.",
    "(8)  \"MAINTAIN VERTICAL SPEED, MAINTAIN\"--continue the existing climb or descent rate, or other vertical speed, as depicted by the green (fly to) arc on the IVSI.  You will best achieve safe separation by not altering the existing vertical speed.",
    "(9)  \"MAINTAIN VERTICAL SPEED, CROSSING MAINTAIN\"--continue the existing climb or descent rate, or other vertical speed, as depicted by the green (fly to) arc on the IVSI.  You will best achieve safe separation by not altering the existing vertical speed and climbing or descending through the threat's flight path.",
    "The following voice messages annunciate enhanced TCAS II maneuvers when initial RA does not provide sufficient vertical separation.  The tone and inflection indicate increased urgency. \n\n(1) \"INCREASE CLIMB, INCREASE CLIMB\"--climb at the rate depicted by the green \n(fly-to) arc on the IVSI, nominally between 2,500 and 3,000 fpm.  Received after \"CLIMB\" advisory, and indicates you need to climb faster to achieve safe vertical separation from a maneuvering aircraft.",
    "(2) \"INCREASE DESCENT, INCREASE DESCENT\"--descend at the rate depicted by the green (fly-to) arc on the IVSI, nominally between 2,500 and 3,000 fpm.  Received after \"DESCEND\" advisory, and indicates you need to descend faster to achieve safe vertical separation from a maneuvering aircraft.",
    "(3) \"CLIMB - CLIMB NOW, CLIMB - CLIMB NOW\"--climb at the rate depicted by the green (fly-to) arc on the IVSI, nominally between 1,500 and 2,000 fpm.  Received after a \"DESCEND\" resolution advisory and indicates you need to reverse your vertical direction to achieve safe vertical separation from a maneuvering threat aircraft.",
    "(4) \"DESCEND - DESCEND NOW, DESCEND - DESCEND NOW\"-descend at the rate depicted by the green (fly-to) arc on the IVSI, nominally between 1,500 and 2,000 fpm. Received after a \"CLIMB\" resolution advisory and indicates you need to reverse your vertical direction to achieve safe vertical separation from a maneuvering threat aircraft.",
    "TEST  \nHolding the TCAS II/Transponder function selector in TEST for 2 to 3 seconds will activate the system test sequence.  In the TEST position, read maintenance messages on the display.  Use discretion when selecting TEST in flight, since this inhibits both TCAS II and the transponder for approximately 20 seconds.  The function selector is spring loaded to STBY. \nSTBY  \nActivates TCAS II and XPDR warmup cycles. \nXPDR  \nTransponder is on.  TCAS II is in warmup cycle. \nTA",
    "XPDR  \nTransponder is on.  TCAS II is in warmup cycle. \nTA  \nTransponder is on.  Only the \"Traffic Advisory\", or \"TA\" function \nof the TCAS II is on.  You will not receive any \"Resolution \nAdvisories\" in this position.  The written warning \"TA ONLY\" \nwill appear on the display, and the yellow \"RA OFF\" flag will be in view on both IVSIs. \nTA/RA",
    "will appear on the display, and the yellow \"RA OFF\" flag will be in view on both IVSIs. \nTA/RA  \nTransponder is on.  All TCAS II functions are on.  No TCAS II flags should be present on either IVSI. Indicates a transponder system failure when the transponder is on.  \nComes on during \"TEST\", but goes off after approximately 3 \nseconds if the transponder is OK. \nXPDR Fail Light \n(Amber)  \nIndicates code selected with the code selectors. \nCode \nIndicator IDENT",
    "(Amber)  \nIndicates code selected with the code selectors. \nCode \nIndicator IDENT  \nCauses the word IDENT to flash in the aircraft data block on the ATC display. \n ALT \nRPTG  \nProvides automatic altitude reporting to ATC. \nTEST  \nHolding the TCAS II/Transponder function selector in TEST for 2 to 3 seconds will activate the system test sequence.  In the TEST position, read maintenance messages on the display.  Use",
    "discretion when selecting TEST in flight, since this inhibits both TCAS II and the transponder for approximately 20 seconds.  The function selector is spring loaded to STBY. \nCode \nSelectors  \nSelect the transponder code.  Left and right selectors consist of a large knob and a small knob. Each knob controls one digit of the code.",
    "Arrow indicates that the target is climbing ↑ or descending ↓ at a rate of at least \n500 fpm. \n\nRelative altitude is displayed in the proximity of the aircraft symbol in hundreds of feet. A \"+\" preceding the relative altitude indicates the target is above you and a \"-\" indicates it is below you. \n\n \n\nUnfilled white diamond.  Non-threatening traffic without altitude reporting.  If altitude reporting, the altitude data will be displayed.",
    "Arrow indicates that the target is climbing ↑ or descending ↓ at a rate of at least \n500 fpm.",
    "REL \nALT  \nPaddle switch is spring loaded to the center position.  Display shows \nrelative altitude \"REL ALT\" in hundreds of feet above (+) or below (- ) your aircraft. \nFL",
    "relative altitude \"REL ALT\" in hundreds of feet above (+) or below (- ) your aircraft. \nFL  \nAllows display of traffic flight levels, referenced to 29.92, for 15 seconds.  Your FL is displayed in lower left corner.  Display shows three digits, except for negative flight levels that are shown as - xxx. When the current barometric pressure is not available and the TCAS II aircraft is below FL 180, the system automatically inhibits display of FL. \nRANGE",
    "RANGE  \nSets the maximum forward range on the traffic display.  Ranges of 3, \n5, 10, 20 NM are available and the traffic display shows the selected \nrange in the upper right corner of the display. \nBRT Knob  \nControls brightness of the display.",
    "## Above/Norm/Below Switch",
    "ABOVE  \nDisplays altitude-reporting traffic from 2700 feet below to 9900 feet \nabove the TCAS II aircraft.  In this mode, ABOVE shows on the traffic display.  This selection has no effect on the functioning of the collision avoidance logic. \nNORM  \nDisplays altitude reporting traffic from 2700 feet below to 2700 feet above the TCAS II aircraft.  \nBELOW",
    "BELOW  \nDisplays altitude-reporting traffic from 2700 feet above to 9900 feet below the TCAS II aircraft.  In this mode, BELOW shows on the traffic display.  This selection has no effect on the functioning of the collision avoidance logic.",
    "OFF-SCALE TRAFFIC ADVISORY - If TCAS II tracks an intruder that is outside the selected range of the display but that has entered the Caution or Warning areas, one-half of the appropriate symbol will appear at the appropriate bearing at the edge of the display area.  The symbol will appear in its proper color and its data tag will show, if there is room.  For example, a TA intruder with a high closure rate, and which is directly ahead and 300 feet below your airplane will appear as an",
    "a high closure rate, and which is directly ahead and 300 feet below your airplane will appear as an amber-filled half circle at the 12 o'clock position on the edge of the display area.  The data tag \"-03\" will appear below the half symbol.  If this intruder is above your altitude, the data tag is not visible.  An off-scale RA intruder will appear as a red-filled half square, with data tag if room permits.",
    "NO BEARING ADVISORIES - When TCAS II cannot track the bearing of an intruder, the traffic advisory will appear in the lower center of the display just below the own-airplane symbol.  The advisory will present appropriate color-coded traffic information.  This phenomenon usually is a result of either temporary antenna shielding (due to steep bank angles) or a failure in the TCAS II bearing antenna.  The display can show up to two lines of information.  \"TA 5.2 -06↑\" for example means an intruder",
    "The display can show up to two lines of information.  \"TA 5.2 -06↑\" for example means an intruder is creating a Traffic Advisory 5.2 nautical miles away, 600 feet below, and climbing in excess of 500 FPM.  This advisory is displayed in amber or yellow.  \"RA 0.6 00\" means resolution advisory traffic is 0.6 nautical miles away at the same altitude.  This advisory is displayed in red.  Lack of bearing information does *not* degrade TCAS II's ability to compute a traffic or resolution advisory.",
    "Indicates vertical speed in feet per minute.  The IVSI is a normal instantaneous vertical speed indicator, and the presence of the lights or the flags will not interfere with the ability of the needle to indicate vertical speeds. \n\nilluminate as part of a TCAS II \"RESOLUTION ADVISORY\", or system safe traffic separation.  The green lights form a wider band than red lights.",
    "T \nR \nA \nC \nO \nA \nF F \nWHITE \"RA OFF\" FLAG.  Always displayed when TCAS \nII/TRANSPONDER function selector is in STBY, XPDR, or TA.  Will also \nbe displayed with selector in RA/TA if RAs are not available. \nS \n\n\n## Section I - Limitations.\n\n(1)  Pilots are authorized to deviate from their current ATC clearance to comply with a TCAS II resolution advisory (RA). \n\n(2)  Maneuvers based solely on a traffic advisory (TA) or on information displayed on the traffic display are not authorized.",
    "## Section Ii - Emergency Procedures.\n\nNo change from basic airplane flight manual. \n\n## Secion Iii - Procedures. (1)  Tcas Ii Flight Procedures:\n\nCompliance with a TCAS II resolution advisory (RA) is necessary unless the pilot considers it unsafe to do so, or unless the pilot has information about the cause of the RA and can maintain safe separation for example visual acquisition of, and safe separation from, a nearby aircraft on a parallel approach.",
    "WARNING:  Once you get a non-crossing RA, you could compromise safe separation if you change the current vertical speed, except as necessary to comply with the RA.  This is because TCAS II-to-TCAS II coordination may be in progress with the intruder airplane, and any change in vertical speed that does not comply with the RA may negate the effectiveness of the other airplane's compliance with its RA.",
    "WARNING:  Noncompliance with a crossing RA by one airplane may result in reduced vertical separation; therefore, you must also ensure safe horizontal separation by visual means.",
    "Because of the limited number of inputs to TCAS II for airplane performance inhibits, in some instances where inhibiting RAs may be appropriate it is not possible to do so.  In these cases, TCAS II may command maneuvers that may significantly reduce stall margins or result in stall warning.  Therefore, you must respect the stall warning stick shaker when following an RA. Conditions where this may occur include:",
    "(a)  Bank angle in excess of 15 degrees. (b)  One engine inoperative. (c)  Abnormal configurations such as landing gear not retractable, etc. (d)  Leaving airplane in inappropriate configurations when climb RA occurs. (e)  Operation at airports outside of 0 to 5,300 feet MSL or temperatures outside of \nISA ±50°F.",
    "(f)  Speeds below normal operating speeds. (g)  Buffet margin less than 0.3 g.",
    "The TCAS II RA algorithms assume that the pilot initiates an initial 0.25 g acceleration maneuver within approximately 5 seconds.  The pilot must respond within approximately 2.5 seconds if the system issues an additional RA.  (You should fly any increase rate and rate reversal RAs using a 0.35 g acceleration maneuver.)  Because of these requirements and the rate limits of the autopilots, you must disengage the autopilot and autothrottles and hand-fly all RA responses.",
    "Note: You should limit evasive maneuvering to the minimum required to comply with the RA.  Excessive responses to RAs are not desirable or appropriate because of other potential traffic and ATC consequences.  From level flight, proper response to an RA typically results in an overall altitude deviation of 300 to 500 feet in order to successfully resolve a traffic conflict.",
    "After the crew has completed its response to an initial advisory and the TCAS II system projects that the airplane will have adequate altitude separation from the intruder, the system will post modified advisories if necessary.  The initial RA will \"weaken\", indicating that the crew may return towards the original flight path or clearance.  When the initial advisory weakens, the green arc repositions to indicate level flight, the magnitude of the red arc decreases, and the system announces",
    "to indicate level flight, the magnitude of the red arc decreases, and the system announces \"LEVEL OFF, LEVEL OFF\".  The modified RA indicates a return to level flight so that the flight crew can minimize altitude deviation in response to the initial RA.  This RA will remain displayed until the TCAS II issues a \"CLEAR OF CONFLICT\" aural annunciation. Following the weakening advisory will greatly reduce the ultimate altitude deviation caused by the original corrective resolution advisory.",
    "If the system issues a \"CLIMB\" RA while the aircraft is in the landing configuration, initiate normal go-around procedures.",
    "Note: Initiating go-around procedure for a \"CLIMB\" RA does not mandate a missed approach.  The purpose of initiating the go-around procedure in this case is to ensure proper airplane configuration for the TCAS II maneuver.  In most cases, the aircraft will be clear of conflict with only minor deviation to the intended flight path, and sufficient time and altitude may exist to recover safely to the desired flight path.",
    "The pilot should not initiate evasive maneuvers using information from the traffic display only or on a traffic advisory (TA) only without visually sighting the traffic.  These displays and advisories are intended only for assistance in visually locating the traffic.   They lack the flight path trends necessary for use in evasive maneuvering.",
    "TCAS II can issue unnecessary resolution advisories when other aircraft are operating at an altitude adjacent to the one assigned to the climbing or descending TCAS aircraft.  When climbing or descending in an environment where these unnecessary advisories are considered likely to occur (based on either airspace design, air traffic communications, visual acquisition or utilization of traffic displays), the flight crew should reduce vertical velocity until reaching the assigned altitude.  As",
    "the flight crew should reduce vertical velocity until reaching the assigned altitude.  As appropriate, the flight crew should reduce vertical velocity to a rate between 500 and 1,500 ft/min, when approaching an altitude between 1,000 and 2,000 ft. above or below the altitude assigned in the ATC instruction or clearance.",
    "After deviating from an ATC clearance or instruction in response to a TCAS II RA, notify ATC of the deviation as soon as possible. \n\nFollowing a TCAS II \"CLEAR OF CONFLICT\" advisory, the pilot should expeditiously return to the applicable ATC clearance unless otherwise directed by ATC. \n\nNote: The TCAS II may lose the threat aircraft track or altitude information during an RA.  If so, the RA will terminate without a \"CLEAR OF CONFLICT\" annunciation.",
    "## (2)  Tcas Ii Operation: Pilot-Initiated Tcas Ii Self-Test:\n\n(a)  Test the TCAS II using the pilot-initiated self-test feature during cockpit preparation.  (**Test pass results from particular TCAS II system**) indicates a successful test. \n\n(b)  Use of the self-test function in flight will inhibit TCAS II operation for up to \n(**provide time for a particular TCAS II system**) seconds. \n\n(c)  The ATC transponder will not function during some portion of the self-test sequence.",
    "(c)  The ATC transponder will not function during some portion of the self-test sequence. \n\n(d)  All aircraft systems providing information to TCAS II must be operating in their normal mode during the Self-Test. \n\n## Ground Operation: (A)  (**When Equipped With A Tso-C119C Or Earlier Tcas Ii Unit**)",
    "## Ground Operation: (A)  (**When Equipped With A Tso-C119C Or Earlier Tcas Ii Unit**)\n\n(1)  To preclude unnecessary transponder interrogations and possible interference with ground surveillance systems, do not activate TCAS (TA or TA/RA mode) until taking the active runway for departure.  Selection of XPDR is adequate for ATC and nearby Automatic Dependent Surveillance-Broadcast equipped aircraft to \"see\" the aircraft while taxiing on the airport surface.",
    "(2)  After landing and clearing of the runway, de-select from TA or TA/RA \nmode.  Select XPNDR while taxiing to the ramp area.  Upon shutdown, select STBY on the transponder. \n\n## (B)  (**When Equipped With A Tso-C119D Or Later Tcas Unit,**)",
    "## (B)  (**When Equipped With A Tso-C119D Or Later Tcas Unit,**)\n\n(1)  To preclude unnecessary transponder interrogations and possible interference with ground surveillance systems, do not activate TCAS (TA or TA/RA mode) until taking the active runway for departure.  Selection of XPDR is adequate for ATC and nearby Automatic Dependent Surveillance-Broadcast equipped aircraft to \"see\" the aircraft while taxiing on the airport surface.",
    "Note: The TCAS II will not annunciate the TA symbol for any target while own-ship is on the ground when TA or TA/RA mode is selected. \n\n(2) After landing and clearing of the runway, de-select from TA or TA/RA mode.  Select XPNDR while taxiing to the ramp area.  Upon shutdown, select STBY on the transponder. \n\n## Ta Mode:\n\n(a) Use TA mode only to preclude unnecessary RAs when intentionally operating near other aircraft such as to closely spaced parallel runways (less than 1200 feet apart).",
    "(b) In TA mode, TCAS II will not issue RAs. \n\n## Wx-Only Mode:\n\n(a) When the crew selects WX-ONLY mode, TCAS II inhibits traffic information, traffic advisories, and resolution advisories on the weather radarscope.  Therefore, use this mode only in the event TCAS interferes with weather information.  (This example is to show the kind of procedure to be developed.  Procedures will vary depending upon installation; such as pop-up display modes, PFD/ND implementation, etc.)",
    "## (3)  Tcas Ii System Characteristics:\n\n(a) TCAS II inhibits \"CLIMB\" RAs with flaps greater than XX degrees. (b) When below 1000 feet AGL, the TCAS II will automatically switch into the TA \nonly mode. \n\n(c) TCAS II inhibits \"INCREASE CLIMB\" RAs with flaps greater than YY degrees. (d) TCAS II inhibits \"DESCEND\" RAs below 1200 feet AGL while climbing and below 1000 feet AGL while descending.",
    "(e) TCAS II inhibits \"INCREASE DESCENT\" RAs below 1450 feet AGL. (f) TCAS II inhibits voice messages below 600 feet AGL while climbing and below \n400 feet AGL while descending.",
    "(g) The TCAS II surveillance may not function at distances less than 900 feet. (h) During windshear and/or GPWS/TAWS warnings, TCAS II switches automatically into a TA only mode and inhibits aural annunciation.  In this mode, the system does not issue RAs, and current RAs become TAs.  The TCAS II remains in TA Only mode for 10 seconds after removal of the windshear or GPWS/TAWS warning.  TCAS II re-enables aural annunciations immediately following the removal of the windshear or GPWS/TAWS",
    "II re-enables aural annunciations immediately following the removal of the windshear or GPWS/TAWS warning aural annunciation.",
    "## (4)  Tcas Ii Abnormal Procedures:\n\nNote: These examples are to show the kinds of abnormal procedures the applicant should develop.  Procedures will vary depending upon the installation, such as dual Mode S and integration with the master caution and warning system.",
    "RA OFF Flag in IVSI (may be accompanied by master caution light and aural annunciations) \n(a)  Verify TCAS II/transponder function selector is in TA/RA position. (b)  If the crew selects TA/RA and \"RA OFF\" flag is in view, then the pilot with the operable IVSI (flag not in view) should be the pilot flying. \n\n## Amber Flag In Ivsi (May Be Accompanied By Master Caution Light And Aural Annunciations)",
    "## Amber Flag In Ivsi (May Be Accompanied By Master Caution Light And Aural Annunciations)\n\n(a)  Check XPDR FAIL light. \n(b)  If OFF, select other altitude source. (c)  If ON, select alternate ATCRBS transponder.  (TCAS II will no longer be available). \n\n## Xpdr Fail Light Illuminated (May Be Accompanied By Master Caution Light And Aural Annunciations)\n\n(a)  Select alternate ATCRBS transponder.  (TCAS II will no longer be available.) \n\n## Hybrid Surveillance Failure Annunciation",
    "## Hybrid Surveillance Failure Annunciation\n\n(a)  For installations that are capable of annunciating hybrid surveillance failures to the pilot: \n(1)  Make a logbook entry to record the failure.  No other crew action is necessary.  TCAS continues to provide traffic annunciation and collision avoidance protection even when hybrid surveillance has failed. \n\n## Section Iv - Performance.\n\n(a)  No change from basic airplane flight manual.",
    "## Section Iv - Performance.\n\n(a)  No change from basic airplane flight manual. \n\n## Appendix B. Transponder Ground Tests & Evaluations. Tests And Evaluations.",
    "Using a suitable calibrated test set, conduct the following tests: \nCAUTION:  When conducting any ground testing of the transponder or TCAS \nsystem, you must prevent being a source of interference to ATC or other TCAS aircraft operating in the area.  Ground maintenance checks or ramp testing (such as altimetry or bearing accuracy testing) can result in data transmissions which produce false targets for the ground ATC surveillance systems or airborne TCAS aircraft.",
    "These false indications of \"intruder aircraft\" could result in unnecessary ATC",
    "communications and possibly in TCAS induced aircraft maneuvers.  Therefore, conduct such testing in coordination with ATC and use antenna shielding (that is, transmission absorption covers or caps) to prevent transmission of test data that could generate false intruder information.  Using high-powered, hangar-mounted transponders to conduct ramp testing is NOT an acceptable means for conducting either TCAS or transponder ramp testing.  As an alternative to the use of antenna shielding ,",
    "either TCAS or transponder ramp testing.  As an alternative to the use of antenna shielding , radiated testing can be used provided that a) if in Air Mode, the Mode C code, Mode S altitude reporting downlink formats, and ADS-B altitude reports all respond with an altitude that is at least 600 feet below ground level or an altitude above 90,000 feet above ground level, and b) if aircraft is in a normal pre-dispatch configuration (in On Ground Mode and transponder set to \"TRANSPONDER\" mode), the",
    "pre-dispatch configuration (in On Ground Mode and transponder set to \"TRANSPONDER\" mode), the Mode C code, Mode S altitude reporting downlink formats, and ADS-B altitude reports all respond with an altitude at ground level.",
    "## B.1 Reply Delay. Interrogates With Valid Modes And Verifies Reply Delay Minus Range Delay (Average Of Best 8 Out Of 13 Replies) Equals:\n\nB.1.1 \n128.00 µs (±0.25 µs) for Mode S. \nB.1.2 \n3.00 µs (±0.50 µs) for ATCRBS. \n\n## B.2 Reply Jitter. Interrogates With Valid Modes And Verifies, Using Best 8 Out Of 13 Replies. Reply Jitter (Changes In Reply Delay) Is Less Than Or Equal To:\n\nB.2.1 \n0.05 µs for Mode S. \nB.2.2 \n0.06 µs for Intermode (All-Call). \nB.2.3 \n0.10 µs for ATCRBS.",
    "B.2.1 \n0.05 µs for Mode S. \nB.2.2 \n0.06 µs for Intermode (All-Call). \nB.2.3 \n0.10 µs for ATCRBS. \n\n## B.3 Atcrbs Reply. Interrogates With Atcrbs (Modes A And C) Interrogations And Verifies:\n\nB.3.1 \nF1 to F2 spacing is 20.3 µs (±0.10 µs). \nB.3.2 \nF1 and F2 pulse width between the 0.5 amplitude point on the leading and trailing edge is 0.45 µs (±0.10 µs).",
    "## B.4 Sls Level. Interrogates With Valid Atcrbs Interrogations Including P2 Pulse. Interrogations Are Conducted With P2 Level At -9 Db And Then Again At 0 Db. Test Verifies:\n\nB.4.1 \nTransponder does not reply when P2 level is at 0 dB (UUT is suppressed). \nB.4.2 \nTransponder replies when P2 level is at -9 dB (UUT is not suppressed). \n\n## B.5 Atcrbs-Only All-Call. Interrogates With An Atcrbs-Only All-Call And Verifies:",
    "## B.5 Atcrbs-Only All-Call. Interrogates With An Atcrbs-Only All-Call And Verifies:\n\nB.5.1 \nIf Mode S is valid, no reply is received from a Mode S transponder. \nB.5.2 \nIf no Mode S, reply is received from an ATCRBS transponder. \nB.6 \nMode S All-Call.",
    "Interrogates with the ATCRBS (mode A) Mode S All-Call.  Address received in downlink format (DF) 11 is then used in an uplink format (UF) 4 interrogation to solicit a DF4 reply.  The address received is decoded and compared with the address sent.",
    "## B.7 Invalid Icao 24-Bit Aircraft Address. Interrogates With Mode S Interrogations Using Two Addresses Different From The Address Determined By The Mode S All-Call, Uf11.  Test Verifies No Reply Is Received. Addresses Used Are One Greater And 256 Greater Than The Correct Address. B.8 Spr On/Off. Interrogates With A Mode S Interrogation With The Synchronous Phase Reversal (Spr) On, Verifying Correct Reply Is Received.  Then Same Interrogation Is Sent Again With The Spr Off, Verifying No Reply",
    "Reply Is Received.  Then Same Interrogation Is Sent Again With The Spr Off, Verifying No Reply Is Received.",
    "B.9 \nMode S UF0. \nInterrogates with Mode S uplink format 0 (Short air-to-air surveillance, ACAS) verifying reply is received that has correct altitude (compared with Mode C altitude), address (compared with Mode Test address) and format.",
    "B.10 \nMode S UF4. \nInterrogates with Mode S uplink format 4 (Surveillance, altitude request), verifying reply is received that has correct altitude (compared with Mode C altitude), address (compared with Mode Test address) and format. \nB.11 \nMode S UF5. \nInterrogates with Mode S uplink format 5 (Surveillance, identity request) verifying \nreply is received that has correct identity (compared with Mode A identity), address \n(compared with Mode Test address) and format. \nB.12 \nMode S UF11.",
    "(compared with Mode Test address) and format. \nB.12 \nMode S UF11. \nInterrogates with Mode S uplink format 11, verifying reply is received that has correct address (compared with Mode Test address) and format. \nB.13 \nMode S UF16.",
    "Interrogates with Mode S uplink format 16 (Long air-to-air surveillance, ACAS), verifying reply, if received, has correct altitude (compared with the Mode C altitude), address (compared with Mode Test address) and format.  No reply to UF16 does not fail Mode S in Auto Test. \n\nB.14 \nMode S UF20.",
    "B.14 \nMode S UF20. \n\nInterrogates with Mode S uplink format 20 (Comm A, altitude request) verifying reply received has correct altitude (compared with Mode C altitude), address (compared with Mode Test address) and format.  No reply to UF20 does not fail Mode S in Auto Test. \n\nB.15 \nMode S UF21.",
    "B.15 \nMode S UF21. \n\nInterrogates with Mode S uplink format 21 (Comm A, identity request) verifying reply received has correct identity (compared with Mode A identity), address (compared with Mode Test address) and format.  No reply to UF21 does not fail Mode S in Auto Test.",
    "B.16 \nAcquisition Squitter. \nVerifies squitters are being received from the UUT every 0.8 to 1.2 seconds. \nB.17 \nFrequency. \nVerifies frequency of transponder is 1090 MHz (± frequency tolerance as specified by equipment manufacturer).  Frequency is displayed in the Auto Test screen. \nB.18 \nDiversity. \nVerifies diversity isolation (power level difference between UUT \"On\" antenna \nsquitters and \"Off\" antenna squitters) is greater than or equal to 20 dB.  Diversity",
    "squitters and \"Off\" antenna squitters) is greater than or equal to 20 dB.  Diversity \nisolation is displayed in Auto Test screen. \nNote: To ensure >=20 dB dynamic range, test must be run within 50 feet (15.24 \nmeters) of UUT antenna being tested.",
    "B.19 \nMTL Difference. \nVerifies Receiver Sensitivity (MTL) to Mode A interrogations equals MTL to Mode C interrogations (±1.0 dB). \nB.20 \nAltitude Reporting.",
    "Verifies the reported altitude in the AC field of DF0, DF4, D16, and D20 corresponds to the value provided from the on-board altitude source to the transponder and is reported with the quantization indicated by the Q bit in the AC field.  For aircraft with 25 foot or better pressure altitude sources, pressure altitude information should be reported in 25-foot increments.  Pressure altitude data obtained from a source with larger than 25-foot resolution must not be reported using 25-foot",
    "data obtained from a source with larger than 25-foot resolution must not be reported using 25-foot increments.",
    "Note: To ensure the correct reporting of altitude with the proper quantization, the aircraft altitude must be incremented over a 300-foot range in 25 foot increments.",
    "B.21 \nSelected Vertical Intention (BDS register 4016) if implemented. \n\nVerify the system marks the data status invalid when information is either not available or invalid.  Verify all reserved fields are set to zero.  Verify that the system transmits the selected vertical intention data in BDS register 4016 correctly and that this data corresponds to the data from the originating avionics on the aircraft. \n\nB.22 \nTarget State and Status Information (BDS register 6216) if implemented.",
    "B.22 \nTarget State and Status Information (BDS register 6216) if implemented. \n\nVerify the system marks the data status invalid when information is either not available or invalid.  Verify all reserved fields are set to zero.  Verify that the system transmits the target state and status data in BDS register 6216 correctly and that this data corresponds to the data from the originating avionics on the aircraft\n\n## Appendix C. Historical Information On Development Of Tcas. C.1 Early Tcas.",
    "C.1.1",
    "The airline industry has been working with the Air Transport Association of America (ATA), now known as Airlines for America (A4A), since 1955 toward a collision avoidance system.  It was not until the mid-1970s, however, that research centered on using signals from ATCRBS airborne transponders as the cooperative element of a collision avoidance system.  This technical approach allows a collision avoidance capability on the flight deck, which is independent of the ground system.  In 1981, the",
    "avoidance capability on the flight deck, which is independent of the ground system.  In 1981, the FAA announced our decision to implement an aircraft collision avoidance concept called the Traffic Alert and Collision Avoidance System (TCAS).  The concept is",
    "based upon agency and industry development efforts in the areas of beacon based \ncollision avoidance systems and air-to-air discrete address communications techniques utilizing Mode S airborne transponder message formats. \nC.1.2",
    "A short time later, prototypes of TCAS II were installed on two Piedmont Airlines Boeing 727 aircraft, and were flown on regularly scheduled flights.  Although the displays were located outside the view of the flight crew and seen only by trained observers, these tests did provide valuable information on the frequency and circumstances of alerts and their potential for interaction with the ATC system.  In a follow-on phase II program, a later version of TCAS II was installed on a single",
    "ATC system.  In a follow-on phase II program, a later version of TCAS II was installed on a single Piedmont Airlines Boeing 727, and the system was certified in April 1986 then subsequently approved for operational evaluation in early 1987.  Since the equipment was not developed to full standards, the system was only operated in visual meteorological conditions.  Although the flight crew operated the system, the evaluation was primarily for the purpose of data collection and its correlation",
    "the system, the evaluation was primarily for the purpose of data collection and its correlation with flight crew and observer observation and response.",
    "C.1.3",
    "Later versions of TCAS II manufactured by Bendix/King Air Transport Avionics Division were installed and approved on United Airlines airplanes in early 1988. Similar units manufactured by Honeywell were installed and approved on Northwest Airlines airplanes in late 1988.  This limited installation program operated TCAS II units approved for operation as a full-time system in both visual and instrument meteorological conditions on three different aircraft types.  The operational evaluation",
    "instrument meteorological conditions on three different aircraft types.  The operational evaluation programs continued through 1988 to validate the operational suitability of the systems.",
    "## C.2 Recent Tcas Developments.",
    "C.2.1 \nSince the early 1990s, an operational evaluation known as the TCAS Transition Program (TTP) collected and analyzed data on the performance and use of TCAS II in both the U.S. National Airspace System (NAS) and in other airspace worldwide.  As a result of these analyses, changes to TCAS II were developed, tested, and implemented in the early to mid-1990s.  These changes, collectively known as TCAS II V7.0, were implemented by industry in the late 1990s.  TCAS II V7.0 complies with the",
    "International Civil Aviation Organization (ICAO) Standards and Recommended Practices (SARP) for ACAS II.  TCAS II V7.0 or V7.1 is mandated for carriage in Australia, India and certain European countries.  V7.0 was mandated for carriage in",
    "2003 by ICAO with V7.1 becoming mandatory by ICAO on January 2, 2014 for new aircraft and for existing aircraft by January 1, 2017.  In addition, if you operate an aircraft that is equipped with TCAS II in RVSM airspace, it must be a TCAS II that meets TSO-C119b (V7.0) or a later version.",
    "C.2.2 \nInvestigation of operational problems resulted in changes to TCAS II V7.0.  The changes resulting from that investigation resulted in TCAS II V7.1. \nC.2.3 \nWhile developing corrective action for the operational problems, the Federal Aviation Administration (FAA), along with industry representatives, decided to develop \nperformance standards for TCAS II Hybrid Surveillance.  That work resulted in",
    "performance standards for TCAS II Hybrid Surveillance.  That work resulted in \ncreation of RTCA/DO-300, Minimum Operational Performance Standards (MOPS) for Traffic Alert and Collision Avoidance System II (TCAS II) Hybrid Surveillance.",
    "Investigation of operational problems reported after introduction of TCAS II units incorporating hybrid surveillance resulted in changes to TCAS II V7.1.  Those changes are invoked by TSO-C119e.  Change 2 to RTCA/DO-300 and Change 1 to RTCA/DO- 300A also incorporate these changes for TCAS II hybrid surveillance units designed to TSO-C119c and C119d, respectively.",
    "C.2.4 \nAs a result of a 2006 midair collision in Brazil, the FAA has determined that a need exists to strengthen requirements for crew alerting for loss of TCAS functionality. Consistent with 14 CFR sections 25.1302, 25.1309(c), and 25.1322, we have incorporated those changes into this AC. \nTSO-C119e classifies failure of the TCAS II to provide a reliable traffic alert and collision avoidance function as a Hazardous/Severe-Major failure condition.",
    "However, previous revisions of this AC have only provided guidance for \"incorrect RAs\", defined in the AC as an \"*RA occurring* when a threat is present, but, because of a failure of the installed TCAS II, Mode S transponder, or associated sensors, commands a maneuver *that reduces separation* to the threat [emphasis added].\"  In some cases, this has resulted in design approval holders and ACO engineers incorrectly classifying *failure to provide RA when a threat is present*, or late provision",
    "incorrectly classifying *failure to provide RA when a threat is present*, or late provision of an RA, as simple loss of function and therefore minor (loss of TCAS II functionality is only minor if the loss of function is appropriately annunciated). The FAA considers failure to provide an RA (or late provision of an RA) when a threat is present, without annunciation of loss of TCAS II functionality, to also be a Hazardous/Severe-Major failure of the function defined in paragraph 3.a of TSO-",
    "to also be a Hazardous/Severe-Major failure of the function defined in paragraph 3.a of TSO- C119e (i.e., provide a reliable traffic alert and collision avoidance function). Therefore, this AC clarifies TCAS failure classification and system safety assessment considerations by adding reference to a \"Missing RA\", defined as \"An RA that does not occur, or that occurs later than the CAS logic indicates is necessary, when a threat is present\", which is a Hazardous/Severe-Major failure condition.",
    "is necessary, when a threat is present\", which is a Hazardous/Severe-Major failure condition.  The System Safety Assessment section of this AC contains means of compliance for addressing missing RAs.",
    "Since TCAS is a supplemental system to ATC separation services and the flight crew's responsibility to see-and-avoid, the FAA considers that those two factors (ATC separation services and see-and-avoid responsibility) partially mitigate the normally assigned failure classification for TCAS, and allow the probability of incorrect RA and missing RA event(s) to be improbable (10-5) versus the 10-7 usually associated with a Hazardous/Severe-Major failure classification.",
    "## C.3 Accident History Related To The Development And Evolution Of Tcas.",
    "C.3.1 \nThis section provides links to online information on significant historical accidents that",
    "have played a role in the development and evolution of TCAS.  This section does not provide a detailed narrative of those events, but rather enables interested readers to conduct further research into accidents that have influenced the development of TCAS by providing easy access to relevant information.  The intent of providing links to this information is to capture historical lessons learned related to TCAS, in order to preserve key safety objectives for the system and facilitate its",
    "related to TCAS, in order to preserve key safety objectives for the system and facilitate its continued refinement.",
    "C.3.2 \nPSA 727, San Diego and Aeromexico DC-9, Los Angeles, Midair Collisions with General Aviation Aircraft:  Detailed information is available at the FAA's Lessons Learned from Transport Airplane Accidents website at: http://lessonslearned.faa.gov/ll_main.cfm?TabID=3&CategoryID=14&LLID=48 \nC.3.3",
    "Boeing 757/Tupolev Tu-154 midair collison, Überlingen, Germany, July 1, 2002: Further information is available at the Aviation Safety Network website at: https://aviation-safety.net/database/record.php?id=20020701-1 (for the Boeing 757), and https://aviation-safety.net/database/record.php?id=20020701-0 (for the Tu-154). The final report of the German Federal Bureau of Aircraft Accidents Investigation (BFU) is also available, in English, at:",
    "German Federal Bureau of Aircraft Accidents Investigation (BFU) is also available, in English, at:  http://www.bfuweb.de/EN/Publications/Investigation%20Report/2002/Report_02_AX001-1- 2_Ueberlingen_Report.pdf?__blob=publicationFile .  Appendices to the BFU final report are at:  http://www.bfuweb.de/EN/Publications/Investigation%20Report/2002/Report_02_AX001-1- 2_Ueberlingen_Appendix_1-3.pdf?__blob=publicationFile",
    "C.3.4 \nBoeing 737-800/Embraer Legacy 600 midair collision, near Peixoto Azevedo, MT, Brazil, September 29, 2006:  Further information is available at the Aviation Safety Network website at: https://aviation-safety.net/database/record.php?id=20060929-0 (for the Boeing 737-800), and https://aviationsafety.net/database/record.php?id=20060929-1 (for the Embraer Legacy 600).",
    "## Appendix D. Related Documents.\n\nD.1 \n14 CFR Parts.",
    "You can apply current portions of 14 CFR for the design, substantiation, certification and operational approval of TCAS II and Mode S transponders.  Sections prescribing requirements for these types of systems are listed below.  Order copies of 14 CFR Parts 21, 23, 25, 27, 29, 43, 91, 121, and 135 from the Superintendent of Documents, U.S. Government Publishing Office, P.O. Box 979050, St. Louis, MO 63197-9000, telephone (866) 512-1800, fax (202) 512-2104.  You can also get copies from the",
    "MO 63197-9000, telephone (866) 512-1800, fax (202) 512-2104.  You can also get copies from the Government Publishing Office (GPO), electronic CFR Internet website at http://www.ecfr.gov.",
    " 14 CFR § 25.301 Loads.  14 CFR § 25.303 Factor of safety.  14 CFR § 25.305 Strength and deformation.  14 CFR § 25.561 General.  14 CFR § 25.603 Materials.  14 CFR § 25.609 Protection of structure.  14 CFR § 25.629 Aeroelastic stability requirements.  14 CFR § 25.869 Fire protection: systems.  14 CFR § 25.1301 Function and installation.  14 CFR § 25.1302 Installed systems and equipment for use by the flightcrew.  14 CFR § 25.1303 Flight and navigation instruments.  14 CFR § 25.1307",
    "for use by the flightcrew.  14 CFR § 25.1303 Flight and navigation instruments.  14 CFR § 25.1307 Miscellaneous equipment.  14 CFR § 25.1309 Equipment, systems, and installations.",
    " 14 CFR § 25.1316 System Lightning Protection.  14 CFR § 25.1317 High-intensity Radiated Field (HIRF) Protection.  14 CFR § 25.1321 Arrangement and visibility.  14 CFR § 25.1322 Warning, caution, and advisory lights.  14 CFR § 25.1331 Instruments using a power supply.  14 CFR § 25.1333 Instrument systems.  14 CFR § 25.1335 Flight director systems.  14 CFR § 25.1351 Electrical Systems and Equipment: General.  14 CFR § 25.1353 Electrical equipment and installations.  14 CFR § 25.1355",
    "Equipment: General.  14 CFR § 25.1353 Electrical equipment and installations.  14 CFR § 25.1355 Distribution system.",
    " 14 CFR § 25.1357 Circuit protective devices.  14 CFR § 25.1381 Instrument lights.  14 CFR § 25.1431 Electronic equipment. \n 14 CFR § 25.1541 Markings and Placards: General.  14 CFR § 25.1581 Airplane Flight Manual: General.  14 CFR § 25.1585 Operating procedures.",
    "Note: References to 14 CFR part 25 are appropriate when installing TCAS II on transport category airplanes.  When TCAS II is to be certified for non-transport category airplanes, use the equivalents to the above 14 CFR part 25 sections in other parts of the regulations.",
    "D.2 \nFAA ACs. \n\nYou will find a current list of ACs on the FAA Internet website at http://rgl.faa.gov.",
    " AC 20-131A, Airworthiness Approval of Traffic Alert and Collision Avoidance \nSystems (TCAS II) and associated Mode S Transponders \n AC 20-115C, *Airborne Software Assurance*  AC 20-165B, Airworthiness Approval of Automatic Dependent Surveillance - \nBroadcast OUT Systems",
    "Broadcast OUT Systems \n AC 20-172B, *Airworthiness Approval for ADS-B In Systems and Applications*  AC 25.1302-1, *Installed Systems and Equipment for Use by the Flightcrew*  AC 25.1309-1A, *System Design and Analysis*  AC 25.1322-1, *Flightcrew Alerting*  AC 25.1329-1C, *Approval of Flight Guidance Systems*  AC 25-11B, *Electronic Flight Displays* \n AC 120-55C, *Air Carrier Operational Approval and Use of TCAS II* \nD.3 \nFAA TSOs.",
    "You will find a current list of TSOs on the FAA Internet website Regulatory and Guidance Library at http://rgl.faa.gov.  You will also find the TSO Index of Articles at the same site. \n\n TSO-C112e, Air Traffic Control Radar Beacon System/Mode Select \n(ATCRBS/Mode S) Airborne Equipment \n TSO-C119e, Traffic Alert and Collision Avoidance System (TCAS) Airborne \nEquipment, TCAS II With Hybrid Surveillance Functionality \nD.4 \nFAA Other.",
    "You will find this related information on the FAA Internet website Regulatory and Guidance Library at http://rgl.faa.gov.  The document is posted adjacent to the links for AC 20-151 and TSO-C119. \n\n Introduction to TCAS II V7.1, February 28, 2011 \n\n## D.5 Rtca Inc. Publications. Order Rtca Documents From Rtca, Inc., 1150 18Th Street N.W. Suite 910, Washington D.C. 20036 Or Order Online At Www.Rtca.Org.",
    " RTCA/DO-160G, Environmental Conditions and Test Procedures for Airborne \nEquipment, dated December 12, 2010. \n RTCA/DO-178C, Software Considerations in Airborne Systems and Equipment \nCertifications, dated December 13, 2011. \n RTCA/DO-181E, Minimum Operational Performance Standards for Air Traffic \nControl Radar Beacon System/Mode Select (ATCRBS/Mode S) Airborne \nEquipment, dated March 17, 2011. \n RTCA/DO-185A, Minimum Operational Performance Standards for Traffic Alert",
    " RTCA/DO-185A, Minimum Operational Performance Standards for Traffic Alert \nand Collision Avoidance Systems II (TCAS II), dated December 16, 1997. \n RTCA/DO-185B, Minimum Operational Performance Standards for Traffic Alert \nand Collision Avoidance Systems II (TCAS II), dated June 19, 2008; including Change 1 dated July 1, 2009, and Change 2 dated March 20, 2013. \n RTCA/DO-300, Minimum Operational Performance Standards for Traffic Alert",
    " RTCA/DO-300, Minimum Operational Performance Standards for Traffic Alert \nand Collision Avoidance System II (TCAS II) Hybrid Surveillance, dated December 13, 2006; including Change 1 dated July 1, 2009, and Change 2 dated December 15, 2015. \n RTCA/DO-300A, Minimum Operational Performance Standards for Traffic Alert \nand Collision Avoidance System II (TCAS II) Hybrid Surveillance, dated March 20, 2013; including Change 1 dated December 15, 2015.",
    "## D.6 Sae International. Order Sae Documents From Sae International, 400 Commonwealth Drive, Warrendale, Pa  15096, Telephone (724) 776-4841, Fax (724) 776-0790.  Also, You May Order Copies Online At Www.Sae.Org.",
    " ARP 926B, *Fault/Failure Analysis Procedure*, dated June 11, 1997.  ARP 1834A, *Fault/Failure Analysis for Digital Systems and Equipment*, dated \nJune 1, 1997. \n ARP 4102/7, *Electronic Displays*, dated July 1, 1988.  ARP 4102/8A, *Flight Deck Head-Up Displays*, dated November 1, 1998. \n ARP 4754A, *Guidelines for Development of Civil Aircraft and Systems*, dated \nDecember 21, 2010. \n ARP 4761, Guidelines and Methods for Conducting the Safety Assessment Process",
    " ARP 4761, Guidelines and Methods for Conducting the Safety Assessment Process \non Civil Airborne Systems and Equipment, dated December 1, 1996. \nD.7 \nAERONAUTICAL RADIO, INC. (ARINC).",
    "Publications are available from SAE-ITC, ARINC Industry Activities, 16701 Melford Blvd., Suite 120, Bowie, MD 20715, telephone (240) 334-2578 or online at http://store.aviation-ia.com/cf/store/customer_service.cfm. \n\n ARINC 718( ), Mark 3 Air Traffic Control Transponder (ATCRBS/MODE S). \n ARINC 735( ), Mark 2 Traffic Alert and Collision Avoidance System (TCAS). \nD.8 \nInternational Civil Aviation Organization (ICAO).",
    "Publications are available from ICAO, Attention: Customer Service unit, 999 University Street, Montreal, Quebec, Canada H3C5H7; telephone +1 514-954-8022, facsimile:  514-954-6769, sitatex YULCAYA, email: sales@icao.int or on line at http://www.icao.int. \n\n Airborne Collision Avoidance System (ACAS) Manual document 9863, First \nEdition dated 2006. \nD.9 \nJAA.",
    "JAA documents transposed to publications of the European Aviation Safety Agency (EASA) are available on the EASA web site at https://www.easa.europa.eu/.  JAA documents are also available on the EUROCONTROL site at http://www.eurocontrol.int/  . \n\n \nJAA Temporary Guidance Leaflet (TGL) 13 Revision 1. \n\n## D.10 Easa. Publications Are Available On The Easa Web Site At Https://Www.Easa.Europa.Eu/.",
    "## D.10 Easa. Publications Are Available On The Easa Web Site At Https://Www.Easa.Europa.Eu/.\n\n AMC 20-13 Certification of Mode S Transponder Systems for Enhanced \nSurveillance. \n EASA Certification Specification and Acceptable Means of Compliance - Airborne \nCommunication Navigation and Surveillance, Book 1 and Book 2.\n\n## Appendix E. Definitions And Acronyms.",
    "## Appendix E. Definitions And Acronyms.\n\nE.1 \nDefinitions. -  The following definitions are specific to this AC and may differ from \ndefinitions contained in other references. \nActive surveillance. - Using TCAS interrogations and subsequent replies to update or acquire a TCAS track. \n\nAdvisory. - Message given to alert the flight crew of converging aircraft and/or a potential collision.",
    "Air traffic control radar beacon system (ATCRBS). - Secondary surveillance radar system with ground based interrogators and airborne transponders capable of operation on Modes A and C. \n\nAlert. - Indication (aural or visual) that informs the flight crew in a timely manner about converging aircraft or potential collision.",
    "Automatic dependent surveillance broadcast (ADS-B). - A function on an aircraft or vehicle that automatically broadcasts its own aircraft's identity, state vector (horizontal and vertical position and velocity), associated quality and performance parameters (accuracy and integrity) and other information.  Broadcast links include the 1090 MHz extended squitter (ES) and the universal access transceiver (UAT) broadcast on 978MHz.",
    "Coast. - Condition which occurs when TCAS II does not receive a reply to an interrogation from an intruder for which it has established a track, resulting in the logic continuing the track based on previous track characteristics. \n\nComm-B. - A 112-bit Mode S reply containing a 56-bit MB message field containing the extracted transponder register.",
    "Corrective resolution advisory. - Advises the pilot to either deviate from current vertical speed, such as CLIMB when the aircraft is level, or to maintain an existing climb or descent rate. In TCAS II V7.0 and V7.1, a \"Maintain Rate RA\" is classified as a corrective RA solely to provide a green fly-to arc or zone on a vertical speed indicator.",
    "Discrete. - Separate, complete and distinct signal. Failure. - Inability of a system, subsystem, unit, or part to perform within previously specified limits. \n\nFalse advisory (TA or RA). - Advisory caused by a false track or TCAS II \nmalfunction.",
    "False advisory (TA or RA). - Advisory caused by a false track or TCAS II \nmalfunction. \n\nHybrid Surveillance. - Combined use of active and passive surveillance to update a TCAS track. Incorrect resolution advisory. - RA occurring when a threat is present, but, because of a failure of the installed TCAS II, Mode S transponder, or associated sensors, commands a maneuver that reduces separation to the threat.",
    "Intruder. - Aircraft satisfying the TCAS II traffic advisory detection criteria. Missing resolution advisory. - An RA that does not occur, or that occurs later than the CAS logic indicates is necessary, when a threat is present. \n\nMode A. - Type of secondary surveillance radar (SSR) equipment or mode of operation that replies by selected 4096 code (nonaltitude) when interrogated.",
    "Mode C. - Type of secondary surveillance radar (SSR) equipment or mode of operation that replies with aircraft altitude information when interrogated. \n\nMode S. - Type of secondary surveillance radar (SSR) equipment that replies to Mode A and Mode C ground interrogations, a discrete address, and other aircraft information in response to interrogations from the ground or air.",
    "Other traffic. - Aircraft more than ±1200 feet vertical or 6 nautical miles (NM) from own aircraft that are neither RA nor TA. \n\nPassive surveillance. - The use of airborne position messages to update a TCAS track. Preventive resolution advisory. - Requires a pilot to avoid certain deviations from current vertical rate (for example, a Do Not Climb RA when the aircraft is level).",
    "Proximate traffic. - Aircraft within 6 NM in range and within ±1,200 feet vertically from own aircraft, but does not meet the TCAS II thresholds of a TA or RA. \n\nResolution advisory. - Aural voice and display information provided by TCAS II to a flight crew, advising that a particular maneuver should, or should not, be performed to attain or maintain minimum safe vertical separation from an intruder.",
    "Resolution display. - Shows vertical guidance depicting areas to \"fly to\" and/or avoid above or below the TCAS II equipped aircraft. \n\nSense. - A direction that an RA may take (either Climb or Descend) relative to the existing flight path of own aircraft. \n\nThreat. - An intruder that satisfies the threat detection logic and thus requires an RA. Track. - Estimated position and velocity of a single aircraft based on correlated surveillance data reports.",
    "Traffic. - Aircraft with an operating transponder capable of being tracked and displayed by a TCAS-equipped aircraft. \n\nTraffic advisory (TA). - Aural voice and display information from TCAS II to a flight crew, identifying the location of nearby traffic meeting certain minimum separation criteria. \n\nTraffic display. - Horizontal position of transponder-equipped aircraft relative to the TCAS II equipped aircraft.",
    "Transponder register. - Transponder register means a transponder data buffer containing different pieces of information.  It has 56 bits which are divided into different fields.  The definition of the transponder registers can be found in ICAO Doc 9871 edition 2 and in RTCA/DO-181E, Minimum Operational Performance Standards for Air Traffic Control Radar Beacon System/Mode Select (ATCRBS/Mode S) Airborne Equipment.  Transponder registers are numbered in hexadecimal (00 hex to FF hex). The",
    "S) Airborne Equipment.  Transponder registers are numbered in hexadecimal (00 hex to FF hex). The register number is also known as the BDS code (Comm-B data selector).  In this documentation a register is named: register XY16 or register addressed by BDS code X,Y.  Outside this document, it is also often referenced as just BDS X,Y.",
    "## E.2 Acronyms.",
    "| 14 CFR    | Title 14 of the Code of Federal Regulations             |\n|-----------|---------------------------------------------------------|\n| ACARS     | Aircraft communications addressing and reporting system |\n| ADS-B     | Automatic dependent surveillance - broadcast            |\n| AFM       | Airplane flight manual                                  |\n| AFMS      | Airplane flight manual supplement                       |",
    "| AFMS      | Airplane flight manual supplement                       |\n| AGL       | Above ground level                                      |\n| ASR       | Airport surveillance radar                              |\n| AMC       | Acceptable Means of Compliance                          |\n| ATA       | Air Transport Association                               |\n| ATC       | Air traffic control                                     |",
    "| ATC       | Air traffic control                                     |\n| ATCRBS    | Air traffic control radar beacon system                 |\n| CAS       | Collision avoidance algorithm, or CAS logic             |\n| CMC       | Central Maintenance Computer                            |\n| CRS       | CAS requirements specification                          |\n| dB        | Decibel                                                 |",
    "| dB        | Decibel                                                 |\n| EADI      | Electronic attitude display indicator                   |\n| EFIS      | Electronic flight instrument system                     |\n| EHS       | Enhanced Surveillance                                   |\n| EHSI      | Electronic horizontal situation indicators              |\n| ELS       | Elementary Surveillance                                 |",
    "| ELS       | Elementary Surveillance                                 |\n| EMC       | Electromagnetic compatibility                           |\n| FAA       | Federal Aviation Administration                         |\n| FD        | Flight director                                         |\n| FHA       | Functional hazard assessment                            |\n| FL        | Flight level                                            |",
    "| FL        | Flight level                                            |\n| FMEA      | Failure modes and effects analysis                      |\n| FPM       | Feet Per Minute                                         |\n| GPS       | Global positioning system                                        |\n|-----------|------------------------------------------------------------------|\n| GPWS/TAWS | Ground proximity warning system/terrain awareness warning system |",
    "| GPWS/TAWS | Ground proximity warning system/terrain awareness warning system |\n| HUD       | Heads-up device                                                  |\n| ICA       | Instructions for Continued Airworthiness                         |\n| ICAO      | International Civil Aviation Organization                        |\n| IVSI      | Instantaneous vertical speed indicator                           |\n| JAA       | Joint Aviation Authorities                                       |",
    "| JAA       | Joint Aviation Authorities                                       |\n| MHz       | Megahertz                                                        |\n| NAS       | National Airspace System                                         |\n| ND        | Navigation display                                               |\n| NM        | Nautical mile                                                    |\n| PFD       | Primary flight display                                           |",
    "| PFD       | Primary flight display                                           |\n| RVSM      | Reduced Vertical Separation Minimum                              |\n| RA        | Resolution advisory                                              |\n| SARP      | Standards and Recommended Practices                              |\n| STC       | Supplemental type certificate                                    |\n| TA        | Traffic advisory                                                 |",
    "| TA        | Traffic advisory                                                 |\n| TC        | Type certificate                                                 |\n| TCAS II   | Traffic alert and collision avoidance system                     |\n| TSO       | Technical standard order                                         |\n| TTP       | TCAS transition program                                          |\n| Vmo       | Maximum operating limit speed                                    |",
    "## Appendix F. Interfacing The Transponder To Aircraft Systems To Support Transmission Of Short-Term Intent",
    "F.1 \nGeneral. \nF.1.1 \nSelected altitude information is intended for use by ATC to improve the controller tactical view by providing them with a digital indication of altitude clearance intent and for improving performance of conflict probe automation. \nF.1.2",
    "F.1.2 \nWith respect to implementing short-term intent, the term \"target altitude\" is the next altitude at which the aircraft will level-off if in a climb or descent, or the aircraft current intended altitude if it is intending to hold its altitude. \nF.1.3",
    "F.1.3 \nA pilot may operate the aircraft in a manual mode or Flight Director/Autopilot mode where the level off altitude is not known by any aircraft system.  Even when operating the aircraft in Flight Director/Autopilot mode, some legacy flight automation may have knowledge of the level off altitude, but not provide this information via an external interface.  In either of these conditions, the BDS 4016 and BDS 6216 implementation must indicate that the target altitude is unknown. \nF.1.4",
    "F.1.4 \nSome legacy aircraft do not have selected altitude functionality, but do have a function that alerts the flight crew when a desired altitude is reached, commonly called an altitude alerter.  In installations where an altitude alerter is present and the operator of the aircraft has operating guidance to require its use, the altitude alerter setting may be used to encode MCP/FCU selected altitude. \nF.1.5",
    "F.1.5 \nNote:  If the flight crew does not use the altitude alerter, encoding this information \nwill be misleading and the equipment should not be interfaced to the transponder. \nF.1.6",
    "In existing aircraft with federated avionics suites, it is typical to have a pilot interface to the autopilot implemented as separate self-contained unit which is wired to the rest of the systems in the aircraft as needed.  This is commonly referred to as a Mode Control Panel (MCP) or Flight Control Unit (FCU).  Historically, there was no connection between these control units and the transponder.  In the following paragraphs, the guidance is written from the perspective of this type of",
    "In the following paragraphs, the guidance is written from the perspective of this type of federated architecture.  In aircraft with more integrated avionics suites, the display and control of autopilot functions may be integrated with the display and control of several other aircraft functions.  In this type of integrated architecture there is not a literal MCP or FCU.  In these cases, the guidance still applies to the autopilot control function regardless of what hardware it is integrated",
    "still applies to the autopilot control function regardless of what hardware it is integrated into.",
    "F.1.7 \nA similar case exists for the Flight Management System (FMS) function.  Historically, the FMS was a self-contained unit wired to other aircraft systems as needed.  In modern flight decks, the FMS function can be integrated in hardware with other aircraft systems.  The following guidance is written as if the FMS is a federated unit. The guidance still applies to the case where FMS functionality is integrated with other aircraft systems.",
    "## F.2\n\nPopulating Selected Vertical Intention Register BDS 4016. \n\nThis section provides guidance for interfacing the transponder to aircraft systems for complying with the EU Enhanced Surveillance requirement for Selected Vertical Intent Register BDS 4016.",
    "F.2.1\nIf available on the aircraft, interface the MCP/FCU to the transponder and verify that \nthe selected altitude information is reported correctly and marked as valid. If the data is either not available or invalid, verify that it is reported as invalid. \nF.2.2\nFor installations with an FMS system, the installer should ensure the transponder is \nreceiving valid selected altitude information. If the data is either not available or \ninvalid, verify that it is reported as invalid. \nF.2.3",
    "invalid, verify that it is reported as invalid. \nF.2.3\nThe installer should ensure that the transponder receives the barometric pressure \nsetting in use.  In some installations, it is possible to override the barometric pressure \nsetting and fly the aircraft to the uncorrected pressure altitude.  In this case the \nreported correction should be zero.  If the data is either not available or invalid, verify \nthat it is reported as invalid.",
    "that it is reported as invalid. \nThe installer should verify all reserved fields are unused and set to zero.",
    "F.2.4 F.2.5\nFor installations that do not have VNAV, LNAV, Autopilot Engaged, Altitude Hold, \nor Approach Mode information available, the installer should ensure the MCP/FCU \nMode bits are marked invalid.  If the transponder receives one or more of the mode \nparameters, the installer should verify the MCP/FCU Mode bits are set in accordance",
    "parameters, the installer should verify the MCP/FCU Mode bits are set in accordance \nwith the horizontal/vertical mode controlling the aircraft.  The extent of these modes can vary significantly across different aircraft platforms.  A description of each field follows, to clarify the intended use of these parameters by ATC.  Refer to the example scenarios for a detailed description on setting the mode field.  \nF.2.5.1",
    "F.2.5.1\nVNAV indicates when an aircraft is following vertical path guidance using information from the FMS. The pilot may arm this mode manually. \nF.2.5.2\nLNAV indicates when the aircraft is following lateral path guidance using information from the FMS. The pilot may arm this mode manually. \nAutopilot Engaged indicates when the pilot has engaged the Autopilot system.",
    "F.2.5.3 F.2.5.4\nAltitude Hold Mode indicates that the aircraft will remain at its current altitude regardless of the current setting or a change to the MCP/FCU selected altitude or FMS selected altitude data.\nNote: Altitude Hold Mode may be inhibited when the aircraft has captured the approach (e.g. capturing the glideslope). \n\nF.2.5.5 Approach Mode indicates the pilot has armed the desired approach source (e.g.\nVOR/LOC and G/S or LNAV and VNAV).",
    "## F.3 Populating Target State And Status Information Register Bds 6216.\n\nThis section provides guidance for interfacing the ADS-B system to aircraft systems for complying with the EU ADS-B requirement for Target State and Status BDS 6216.",
    "F.3.1\nSILSUPP is based on whether the position source probability of exceeding the reported integrity value is calculated on a per-hour or per-sample basis and should be set based on design data from the position source equipment manufacturer. ADS-B systems interfaced with a GNSS position source compliant with any revision of TSO-C129, TSO-C145, TSO-C146, or TSO-C196 may preset SILSUPP to ZERO, as GNSS position sources use a per hour basis for integrity. \nF.3.2",
    "F.3.2\nFor installations with both an MCP/FCU and an FMS system, the installer should \nensure the selected altitude information transmitted is the MCP/FCU selected altitude.",
    "This should be verified in transponder register BDS 4016 and the Target State and Status ADS-B message. If neither the MCP/FCU nor the FMS is providing selected altitude information or the information is invalid, then the installer should ensure the data status is set to all ZEROs.  In some legacy aircraft, the selected altitude information may be available but the system does not indicate which source, MCP/FCU or FMS, is in control of the aircraft vertical profile.  In this case, the MCP/FCU",
    "source, MCP/FCU or FMS, is in control of the aircraft vertical profile.  In this case, the MCP/FCU selected altitude should be encoded when it is valid.  If MCP/FCU selected altitude is not valid, and the FMS selected altitude is valid, then the FMS selected altitude should be encoded.",
    "F.3.3\nThe installer should ensure that when the aircraft vertical intent is to fly the current altitude (e.g., altitude hold) or the pilot is manually flying the aircraft, the MCP/FCU selected altitude is encoded in the Target State and Status ADS-B message. \nF.3.4",
    "F.3.4\nThe installer should ensure that the transponder receives the barometric pressure setting in use.  In some installations, it is possible to override the barometric pressure setting and fly the aircraft to the uncorrected pressure altitude.  In this case the reported correction should be zero.  If the barometric pressure setting is not available or invalid, the installer should verify that the data status is marked invalid. \nF.3.5",
    "For installations with both an MCP/FCU and an FMS system, the installer should ensure the selected heading information transmitted by the transponder corresponds to the system in control of the aircraft horizontal profile. If the data is either not available or invalid, verify that it is reported as invalid.  In some legacy aircraft, the selected heading information may be available but the system does not indicate which source, MCP/FCU or FMS, is in control of the aircraft horizontal profile.",
    "does not indicate which source, MCP/FCU or FMS, is in control of the aircraft horizontal profile.  In this case, the MCP/FCU selected heading should be encoded when it is valid.  If MCP/FCU selected heading is not valid, and the FMS selected heading is valid, then the FMS selected heading should be encoded.",
    "F.3.6\nThe accuracy limits for the Navigation Accuracy Category for Position (NACP) allow the surveillance applications to determine whether the reported geometric position has an acceptable level of accuracy for its intended use.  The ADS-B equipment must set the NACP based on the real time 95% accuracy metric provided by the position source.  \nWhen interfacing GNSS sources, the NACP should be based on a qualified Horizontal Figure of Merit (HFOM).",
    "F.3.7",
    "You should verify the type of altitude source installed in the aircraft and interface the altitude system per the ADS-B equipment manufacturer's instructions. For aircraft with an approved, non-Gillham altitude source, NICBARO should be preset at installation to ONE. For aircraft with a Gillham altitude source without an automatic cross-check, NICBARO must be preset at installation to ZERO. For aircraft which dynamically cross-check a Gillham altitude source with a second altitude source the",
    "aircraft which dynamically cross-check a Gillham altitude source with a second altitude source the NICBARO must be set based on the result of this cross-check.  We recommend that ADS-B installations use non-Gillham altitude encoders to reduce the potential for altitude errors.",
    "F.3.8\nSIL is typically a static (unchanging) value and may be set at the time of installation if \na single type of position source is integrated with the ADS-B system.  SIL is based \nsolely on the position source's probability of exceeding the reported integrity value",
    "solely on the position source's probability of exceeding the reported integrity value \nand should be set based on design data from the position source equipment manufacturer.  Installations which derive SIL from GNSS position sources compliant with any revision of TSO-C129, TSO-C145, TSO-C146, or TSO-C196 which output Horizontal Protection Level (HPL) or Horizontal Integrity Level (HIL) should set the \nSIL = 3 because HPL and HIL are based on a probability of 1x10-7 per hour.  Do not",
    "SIL = 3 because HPL and HIL are based on a probability of 1x10-7 per hour.  Do not \nbase NIC or SIL on Horizontal Uncertainty Level (HUL) information. If integrating with a non-compliant GPS, SIL must be set to 0. \nF.3.9 For installations that do not have VNAV, LNAV, Autopilot Engaged, Altitude Hold,",
    "or Approach Mode information available, the installer should ensure the MCP/FCU Mode bits are reported as invalid.  If one or more of the mode parameters are provided to the transponder, the installer should verify the MCP/FCU Mode bits are set in accordance with the horizontal/vertical mode controlling the aircraft.  The extent of these modes can vary significantly across different aircraft platforms.  A description of each field follows, to clarify the intended use of these parameters by ATC.",
    "A description of each field follows, to clarify the intended use of these parameters by ATC.  Refer to the example scenarios for a detailed description on setting the mode field.",
    "F.3.9.1 VNAV indicates when an aircraft is following vertical path guidance using\ninformation from the FMS.  The pilot may arm this mode manually. \nF.3.9.2 LNAV indicates when the aircraft is following lateral path guidance using information\nfrom the FMS.  The pilot may arm this mode manually. \nF.3.9.3 Autopilot Engaged indicates when the pilot has engaged the Autopilot system. F.3.9.4 Altitude Hold Mode indicates that the aircraft will remain at its current altitude",
    "regardless of the current setting or a change to the MCP/FCU selected altitude or FMS \nselected altitude data. \nNote: Altitude Hold Mode may be inhibited when the aircraft has captured the approach (e.g. capturing the glideslope).",
    "F.3.9.5 Approach Mode indicates the pilot has armed the desired approach source (e.g.\nVOR/LOC and G/S or LNAV and VNAV). \nF.3.10 The installer should verify all reserved fields are unused and set to zero.\nF.3.11 The TCAS Installed and Operational field must interface with the TCAS II system if",
    "your aircraft has a TCAS II system. This parameter should be preset to ZERO if your aircraft does not have a TCAS II or if your aircraft has a TCAS I. Typically, this parameter will already be provided to the Mode S transponder from the TCAS II. TCAS II systems compliant with TSO-C119( ) indicate they are operational and able to issue an RA when they transmit Reply Information (RI) = 3 or 4 to the transponder. \nF.3.12 MCP/FCU Mode Examples",
    "To further clarify how the vertical mode bits should operate, this section presents a set of scenarios below.  Figure 3 depicts a series of vertical maneuvers.  Table 1 illustrates how the equipment would set the parameters for BDS 4016 during each maneuver. Similarly, Table 2 illustrates how the equipment would set the parameters for BDS 6216 during each maneuver.  The parameters encoded in BDS 4016 and BDS 6216 by the transponder are based on information received from other aircraft equipment",
    "and BDS 6216 by the transponder are based on information received from other aircraft equipment or via aircraft configuration strapping.  Below the table there is a description of each step along with any assumptions made for the given maneuver.  For the purposes of these examples, we assume that the pilot has the ability to manually select the use of MCP/FCU or FMS as the source providing the flight path information to the aircraft's autoflight guidance system.  We also assume that a change by",
    "path information to the aircraft's autoflight guidance system.  We also assume that a change by the pilot on the MCP/FCU will override the information provided by the FMS.",
    "| Step     |   Step  |   Step  |   Step  |   Step  |   Step  |   Step  |   Step  |\n|----------|---------|---------|---------|---------|---------|---------|---------|\n| 0        |      1  |      2  |      3  |      4  |      5  |      6  |      7  |\n| VNAV     |         |         |         |         |         |         |         |\n| 1        |      1  |      0  |      0  |      0  |      0  |      1  |      1  |\n| Alt Hold |         |         |         |         |         |         |         |",
    "| Alt Hold |         |         |         |         |         |         |         |\n| 0        |      0  |      1  |      1  |      0  |      0  |      0  |      0  |\n| Approach |         |         |         |         |         |         |         |\n| 0        |      0  |      0  |      0  |      0  |      0  |      1  |      1  |\n| 11       |     11  |     01  |     01  |     10  |     00  |     11  |     11  |\n| Target   |         |         |         |         |         |         |         |",
    "| Target   |         |         |         |         |         |         |         |\n| Altitude |         |         |         |         |         |         |         |\n| Source   |         |         |         |         |         |         |         |\n| 1        |         |         |         |         |         |         |         |\n|          |         |         |         |         |         |         |         |\n| Step      | Step    | Step    | Step    | Step    | Step    | Step    | Step    |",
    "| Step      | Step    | Step    | Step    | Step    | Step    | Step    | Step    |\n|-----------|---------|---------|---------|---------|---------|---------|---------|\n| 0         | 1       | 2       | 3       | 4       | 5       | 6       | 7       |\n| Autopilot |         |         |         |         |         |         |         |\n| Engage    |         |         |         |         |         |         |         |",
    "| Engage    |         |         |         |         |         |         |         |\n| 1         | 1       | 1       | 1       | 1       | 0       | 1       | 1       |\n| VNAV      |         |         |         |         |         |         |         |\n| 1         | 1       | 0       | 0       | 0       | 0       | 1       | 1       |\n| LNAV      |         |         |         |         |         |         |         |",
    "| LNAV      |         |         |         |         |         |         |         |\n| 1         | 1       | 1       | 0       | 1       | 0       | 1       | 1       |\n| Alt Hold  |         |         |         |         |         |         |         |\n| 0         | 0       | 1       | 1       | 0       | 0       | 0       | 0       |\n| Approach  |         |         |         |         |         |         |         |",
    "| Approach  |         |         |         |         |         |         |         |\n| 0         | 0       | 0       | 0       | 0       | 0       | 1       | 1       |\n| Selected  |         |         |         |         |         |         |         |\n| Altitude  |         |         |         |         |         |         |         |\n| MCP       | MCP     | MCP     | MCP     | MCP     | MCP     | MCP     | MCP     |",
    "F.3.12.1\nStep 0 \nF.3.12.1.1\nAssumptions: \nF.3.12.1.1.1 Aircraft is flying an en-route segment; the pilot engages the use of the\nFMS. \nF.3.12.1.1.2 The pilot has engaged the Autopilot System F.3.12.1.2\nManeuver: Level Flight to Waypoint 1 \nF.3.12.1.3\nThe aircraft autopilot levels off the aircraft at the specified heading and altitude based on the waypoint information provided by the FMS system \n(i.e., HDG: 293o, ALT: FL250).  The transponder sets the parameters as \nfollows:",
    "(i.e., HDG: 293o, ALT: FL250).  The transponder sets the parameters as \nfollows: \nF.3.12.1.3.1 BDS 4016 and BDS 6216 Parameters:",
    "| F.3.12.1.3.1.1                                         | When the pilot engages the FMS system as the vertical    |\n|--------------------------------------------------------|----------------------------------------------------------|\n| driving source for the aircraft, VNAV is set to \"ONE\". |                                                          |\n| F.3.12.1.3.1.2                                         | Altitude hold is set to \"ZERO\".                          |",
    "| F.3.12.1.3.1.3                                         | The pilot has not armed the approach.  Therefore,        |\n| approach mode is set to \"ZERO\".                        |                                                          |",
    "F.3.12.1.3.2 BDS 4016 Specific Parameters:",
    "| F.3.12.1.3.2.1                                       | Target Altitude Source represents the use of FMS (i.e.,    |\n|------------------------------------------------------|------------------------------------------------------------|\n| \"11\") as the source being used for selected altitude |                                                            |\n| information.                                         |                                                            |",
    "| F.3.12.1.3.2.2                                       | Reserved                                                   |",
    "F.3.12.1.3.3 BDS 6216 Specific Parameters:",
    "| F.3.12.1.3.3.1                                             | Once engaged by the pilot, the Autopilot system sets    |\n|------------------------------------------------------------|---------------------------------------------------------|\n| Autopilot Engage to \"ONE\".                                 |                                                         |\n| F.3.12.1.3.3.2                                             | When the pilot engages the FMS system as the lateral    |",
    "| driving source for the aircraft, LNAV is set to \"ONE\".     |                                                         |\n| F.3.12.1.3.3.3                                             | Selected Altitude field is populated with MCP/FCU       |\n| selected altitude and the selected altitude type is set to |                                                         |\n| MCP/FCU.                                                   |                                                         |",
    "F.3.12.2\nStep 1 \nF.3.12.2.1\nAssumptions: \nF.3.12.2.1.1 The pilot has made no changes on the MCP/FCU system.\nNote: \nThe altitude in the MCP/FCU must be higher or lower than the achieve altitude desired by the FMS.  If not, the MCP/FCU will act as an upper or lower altitude restriction. \n\n## F.3.12.2.1.2 Reserved",
    "## F.3.12.2.1.2 Reserved\n\nF.3.12.2.2\nManeuver: Descent from Waypoint 1 to Waypoint 2 \nF.3.12.2.2.1 The FMS determines a descent and heading change as required and\ntransmits the appropriate information to the autopilot system (i.e., HDG: \n280o, ALT: FL220).  The transponder sets the parameters as follows: \nF.3.12.2.2.2 BDS 4016 and BDS 6216 Parameters:",
    "F.3.12.2.2.2.1\nVNAV remains set to \"ONE\" as FMS system is still \nproviding guidance to the aircraft. \nF.3.12.2.2.2.2.\nThe pilot has not engaged altitude hold and altitude hold remains set to \"ZERO\". \nF.3.12.2.2.2.3\nThe pilot has not armed a method of approach. Therefore, approach mode remains set to \"ZERO\". \n\nF.3.12.2.2.3 BDS 4016 Specific Parameters:",
    "| F.3.12.2.2.3.1                                         | Target Altitude Source represents the use of FMS (i.e.,    |\n|--------------------------------------------------------|------------------------------------------------------------|\n| \"11\") as the source for selected altitude information. |                                                            |\n| F.3.12.2.2.3.2                                         | Reserved                                                   |",
    "F.3.12.2.2.4 BDS 6216 Specific Parameters:\n\nF.3.12.2.2.4.1\nAutopilot Engage remains set to \"ONE\". \nF.3.12.2.2.4.2\nLNAV remains set to \"ONE\" as the FMS is still \nproviding guidance to the aircraft. \nF.3.12.2.2.4.3\nSelected Altitude field is populated with MCP/FCU selected altitude and the selected altitude type is set to MCP/FCU. \n\n## F.3.12.3 Step 2",
    "## F.3.12.3 Step 2\n\nF.3.12.3.1\nAssumptions: \nF.3.12.3.1.1 The pilot has made no heading or altitude changes on the MCP/FCU\nsystem. \nF.3.12.3.1.2 Upon leveling off, the pilot engages Altitude Hold. F.3.12.3.2\nManeuver: Level Flight from Waypoint 2 with Altitude Hold engaged \nF.3.12.3.2.1 The aircraft achieves the desired heading and altitude provided by the\nFMS system, and levels off at waypoint 2.  The transponder sets the parameters as follows: \nF.3.12.3.2.2 BDS 4016 and BDS 6216 Parameters:",
    "| F.3.12.3.2.2.1                                  | VNAV is set to \"ZERO.\"                        |\n|-------------------------------------------------|-----------------------------------------------|\n| F.3.12.3.2.2.2                                  | Altitude Hold is set it to \"ONE.\"             |\n| F.3.12.3.2.2.3                                  | The pilot has not armed a method of approach. |",
    "| F.3.12.3.2.2.3                                  | The pilot has not armed a method of approach. |\n| Therefore, approach mode remains set to \"ZERO.\" |                                               |",
    "F.3.12.3.2.3 BDS 4016 Specific Parameters:",
    "| F.3.12.3.2.3.1                                     | Target Altitude Source represents the use of Aircraft    |\n|----------------------------------------------------|----------------------------------------------------------|\n| Altitude (i.e., \"01\") as the source being used for |                                                          |\n| selected altitude information.                     |                                                          |",
    "| F.3.12.3.2.3.2                                     | Reserved                                                 |",
    "F.3.12.3.2.4 BDS 6216 Specific Parameters:",
    "| F.3.12.3.2.4.1                                             | Autopilot Engage remains set to \"ONE.\"            |\n|------------------------------------------------------------|---------------------------------------------------|\n| F.3.12.3.2.4.2                                             |                                                   |\n| LNAV remains set to \"ONE\" as the FMS is still              |                                                   |",
    "| providing guidance to the aircraft.                        |                                                   |\n| F.3.12.3.2.4.3                                             | Selected Altitude field is populated with MCP/FCU |\n| selected altitude and the selected altitude type is set to |                                                   |\n| MCP/FCU.                                                   |                                                   |",
    "F.3.12.4\nStep 3 \nF.3.12.4.1\nAssumptions: \nF.3.12.4.1.1 The pilot has input a cleared heading assigned by ATC into the\nMCP/FCU. \nF.3.12.4.1.2 Reserved F.3.12.4.2\nManeuver: Altitude Hold with Heading change from Waypoint 3 to Waypoint 4 \nF.3.12.4.2.1 As the aircraft approaches waypoint 3, the pilot received a new heading\nfrom ATC deviating from the heading information being provided by the \nFMS system (i.e., HDG: 275o).  The pilot enters the cleared heading into",
    "FMS system (i.e., HDG: 275o).  The pilot enters the cleared heading into \nthe MCP/FCU, and disengages the use of the FMS system as the lateral guidance source.  The autopilot remains engaged, and begins the maneuver to achieve the selected heading received from the MCP/FCU for waypoint 4.  The transponder will set the parameters as follows: \nF.3.12.4.2.2 BDS 4016 and BDS 6216 Parameters:",
    "F.3.12.4.2.2.1\nVNAV remains set to \"ZERO\" since the aircraft is \nstill in Altitude Hold mode. \nF.3.12.4.2.2.2\nAltitude hold remains to \"ONE.\" \nF.3.12.4.2.2.3\nThe pilot has not armed a method of approach. Therefore, approach mode remains set to \"ZERO.\" \n\nF.3.12.4.2.3 BDS 4016 Specific Parameters:",
    "| F.3.12.4.2.3.1                                            | Target Altitude Source represents the use of Aircraft    |\n|-----------------------------------------------------------|----------------------------------------------------------|\n| Altitude (i.e., \"01\") as the source for selected altitude |                                                          |\n| information.                                              |                                                          |",
    "| F.3.12.4.2.3.2                                            | Reserved                                                 |",
    "F.3.12.4.2.4 BDS 6216 Specific Parameters:\n\nF.3.12.4.2.4.1\nAutopilot Engage remains set to \"ONE.\" \nF.3.12.4.2.4.2\nLNAV is set to \"ZERO\" as the aircraft is now using \ninformation from the MCP/FCU. \nF.3.12.4.2.4.3\nSelected Altitude field is populated with MCP/FCU selected altitude and the selected altitude type is set to MCP/FCU.",
    "F.3.12.5\nStep 4 \nF.3.12.5.1\nAssumptions: \nF.3.12.5.1.1 The pilot re-engages the use of FMS as the lateral guidance source for\nthe aircraft. \nF.3.12.5.1.2 The pilot has input a cleared altitude received from ATC. F.3.12.5.2\nManeuver: ATC Directed Climb from Waypoint 5 to Waypoint 6 \nF.3.12.5.2.1 As the aircraft approaches waypoint 5, the pilot received a new altitude",
    "from ATC deviating from the altitude information being provided by the FMS system.  The pilot enters the cleared altitude into the MCP/FCU (i.e., FL240), and disengages the altitude hold functionality.  The autopilot remains engaged, pilot engages a new vertical mode to initiate a climb (e.g. vertical speed mode) and the aircraft begins the maneuver to achieve the selected altitude received from the MCP/FCU for waypoint 6.  The transponder will set the parameters as follows:",
    "F.3.12.5.2.2 BDS 4016 and BDS 6216 Parameters:",
    "| F.3.12.5.2.2.1   | VNAV remains set to \"ZERO.\"     |\n|------------------|---------------------------------|\n| F.3.12.5.2.2.2   | Altitude hold is set to \"ZERO.\" |\n| F.3.12.5.2.2.3                                  |\n|-------------------------------------------------|\n| Therefore, approach mode remains set to \"ZERO.\" |\n\nF.3.12.5.2.3 BDS 4016 Specific Parameters:",
    "| F.3.12.5.2.3.1                                  | Target Altitude Source represents the use of    |\n|-------------------------------------------------|-------------------------------------------------|\n| MCP/FCU (i.e., \"10\") as the source for selected |                                                 |\n| altitude information.                           |                                                 |",
    "| F.3.12.5.2.3.2                                  | Reserved                                        |",
    "F.3.12.5.2.4 BDS 6216 Specific Parameters:\n\nF.3.12.5.2.4.1\nAutopilot Engage remains set to \"ONE.\" \nF.3.12.5.2.4.2\nLNAV is set to \"ONE\" as the FMS is now providing \nlateral guidance to the aircraft. \nF.3.12.5.2.4.3\nSelected Altitude field is populated with MCP/FCU selected altitude and the selected altitude type is set to MCP/FCU.",
    "F.3.12.6\nStep 5 \nF.3.12.6.1\nAssumptions: \nF.3.12.6.1.1 The pilot has not re-engaged the use of FMS as the vertical guidance\nsource for the aircraft. \nF.3.12.6.1.2 ATC has cleared the pilot to fly an assigned heading. F.3.12.6.1.3 ATC has cleared the pilot to fly an assigned altitude. F.3.12.6.1.4 The pilot has disengaged the autopilot. F.3.12.6.2\nManeuver: Manual flown descent \nF.3.12.6.2.1 The aircraft achieves the desired altitude provided by the MCP/FCU, and",
    "F.3.12.6.2.1 The aircraft achieves the desired altitude provided by the MCP/FCU, and\nlevels off at waypoint 6.  The pilot receives a new altitude and heading from ATC.  The pilot disengages the autopilot.  The transponder will set the parameters as follows: \nF.3.12.6.2.2 BDS 4016 and BDS 6216 Parameters:",
    "| F.3.12.6.2.2.1                                  | VNAV remains set to \"ZERO.\"                   |\n|-------------------------------------------------|-----------------------------------------------|\n| F.3.12.6.2.2.2                                  | Altitude Hold remains set to \"ZERO.\"          |\n| F.3.12.6.2.2.3                                  | The pilot has not armed a method of approach. |",
    "| F.3.12.6.2.2.3                                  | The pilot has not armed a method of approach. |\n| Therefore, approach mode remains set to \"ZERO.\" |                                               |",
    "F.3.12.6.2.3 BDS 4016 Specific Parameters:\n\n| F.3.12.6.2.3.1                                         | Target Altitude Source represents Unknown (i.e.,    |\n|--------------------------------------------------------|-----------------------------------------------------|\n| \"00\") as the source for selected altitude information. |                                                     |\n| F.3.12.6.2.3.2                                         | Reserved                                            |",
    "F.3.12.6.2.4 BDS 6216 Specific Parameters:\n\nF.3.12.6.2.4.1\nAutopilot Engage is set to \"ZERO.\" \nF.3.12.6.2.4.2\nLNAV is set to \"ZERO\" as the pilot is not using the autopilot to maintain lateral guidance. \nF.3.12.6.2.4.3\nSelected Altitude field is populated with MCP/FCU selected altitude and the selected altitude type is set to MCP/FCU. \n\n## F.3.12.7 Step 6",
    "F.3.12.7.1\nAssumptions: \nF.3.12.7.1.1 The pilot re-engages LNAV and VNAV. F.3.12.7.1.2 The pilot re-engages the Autopilot System. F.3.12.7.1.3 The pilot engages Approach mode. F.3.12.7.2\nManeuver: Approach Mode from Waypoint 7 \nF.3.12.7.2.1 The aircraft levels off at the cleared altitude and heading.  ATC clears",
    "F.3.12.7.2.1 The aircraft levels off at the cleared altitude and heading.  ATC clears\nthe pilot for approach.  The pilot re-engages the use of the FMS as the lateral and vertical guidance source for the aircraft and arms the Approach mode.  The transponder will set the parameters as follows: \nF.3.12.7.2.2 BDS 4016 and BDS 6216 Parameters:",
    "F.3.12.7.2.2.1\nVNAV is set to \"ONE\" as the aircraft is now using \ninformation from the FMS system. \nF.3.12.7.2.2.2\nAltitude Hold remains set to \"ZERO\" \nF.3.12.7.2.2.3\nApproach Mode is set to \"ONE.\" \n\nF.3.12.7.2.3 BDS 4016 Specific Parameters:",
    "| F.3.12.7.2.3.1                                   | Target Altitude Source represents the use of the FMS    |\n|--------------------------------------------------|---------------------------------------------------------|\n| (i.e., \"11\") as the source for selected altitude |                                                         |\n| information.                                     |                                                         |",
    "| F.3.12.7.2.3.2                                   | Reserved                                                |\n| F.3.12.7.2.4 BDS 62                              |                                                         |\n| 16                                               |                                                         |\n| Specific Parameters:                             |                                                         |",
    "| F.3.12.7.2.4.1                                   |                                                         |\n| Autopilot Engage is set to \"ONE.\"                |                                                         |\nF.3.12.7.2.4.2\nLNAV is set to \"ONE\" as the FMS is now providing \nlateral guidance to the aircraft. \nF.3.12.7.2.4.3\nSelected Altitude field is populated with MCP/FCU \nselected altitude and the selected altitude type is set to MCP/FCU.",
    "F.3.12.8\nStep 7 \nF.3.12.8.1\nAssumptions: \nF.3.12.8.1.1 ATC provides the pilot with a final altitude clearance. F.3.12.8.1.2 The FMS system will fly a step down approach to the cleared altitude. F.3.12.8.2\nManeuver: Step Down Approach to Waypoint 8 \nF.3.12.8.2.1 The pilot enters the final altitude clearance into the MCP/FCU.  The pilot",
    "F.3.12.8.2.1 The pilot enters the final altitude clearance into the MCP/FCU.  The pilot\ncontinues the use of the Autopilot system.  The pilot continues the use of the FMS as the vertical and lateral guidance source for the aircraft.  The approach mode remains engaged.  The transponder will set the parameters as follows: \nF.3.12.8.2.2 BDS 4016 and BDS 6216 Parameters:",
    "F.3.12.8.2.2.1\nVNAV is set to \"ONE\" as the aircraft is now using \ninformation from the FMS system. \nF.3.12.8.2.2.2\nAltitude Hold remains set to \"ZERO\" \nF.3.12.8.2.2.3\nApproach Mode is set to \"ONE.\" \n\nF.3.12.8.2.3 BDS 4016 Specific Parameters:",
    "| F.3.12.8.2.3.1                                   | Target Altitude Source represents the use of the FMS    |\n|--------------------------------------------------|---------------------------------------------------------|\n| (i.e., \"11\") as the source for selected altitude |                                                         |\n| information.                                     |                                                         |",
    "| F.3.12.8.2.3.2                                   | Reserved                                                |",
    "F.3.12.8.2.4 BDS 6216 Specific Parameters:",
    "F.3.12.8.2.4.1\nAutopilot Engage is set to \"ONE.\" \nF.3.12.8.2.4.2\nLNAV is set to \"ONE\" as the FMS is now providing \nlateral guidance to the aircraft. \nF.3.12.8.2.4.3\nSelected Altitude field is populated with MCP/FCU selected altitude and the selected altitude type is set to MCP/FCU.\n| 2                                                                                              | MSB = 32 768 feet                                                                      |",
    "|------------------------------------------------------------------------------------------------|----------------------------------------------------------------------------------------|\n| 1                                                                                              | STATUS                                                                                 |",
    "| PURPOSE:                                                                                       |                                                                                        |\n| To provide ready access to information about the aircraft's current vertical                   |                                                                                        |",
    "| intentions, in order to improve the effectiveness of conflict probes and to provide additional |                                                                                        |\n| tactical information to controllers.                                                           |                                                                                        |",
    "| 3                                                                                              |                                                                                        |\n| 4                                                                                              |                                                                                        |",
    "| 5                                                                                              | MCP/FCU SELECTED ALTITUDE                                                              |\n| 1)                                                                                             | Target altitude shall be the short-term intent value, at which the aircraft will level |",
    "| off (or has leveled off) at the end of the current maneuver. The data source that              |                                                                                        |\n| the aircraft is currently using to determine the target altitude shall be indicated in         |                                                                                        |",
    "| the altitude source bits (54 to 56) as detailed below.                                         |                                                                                        |\n| 6                                                                                              |                                                                                        |",
    "| 7                                                                                              | Range = [0, 65 520] feet                                                               |\n| 8                                                                                              |                                                                                        |",
    "| 9                                                                                              |                                                                                        |\n| Note. This information which represents the real \"aircraft intent,\" when available,            |                                                                                        |",
    "| represented by the altitude control panel selected altitude, the flight management             |                                                                                        |\n| system selected altitude, or the current aircraft altitude according to the aircraft's         |                                                                                        |",
    "| mode of flight (the intent may not be available at all when the pilot is flying the            |                                                                                        |\n| aircraft).                                                                                     |                                                                                        |",
    "| 10                                                                                             |                                                                                        |\n| 11                                                                                             |                                                                                        |",
    "| 12                                                                                             |                                                                                        |\n| 13                                                                                             | LSB = 16 feet                                                                          |",
    "| 14                                                                                             | STATUS                                                                                 |\n| 15                                                                                             | MSB = 32 768 feet                                                                      |",
    "| 2)                                                                                             | The data entered into bits 1 to 13 shall be derived from the mode control              |\n| panel/flight control unit or equivalent equipment. Alerting devices may be used to             |                                                                                        |",
    "| provide data if it is not available from \"control\" equipment. The associated mode              |                                                                                        |\n| bits for this field (48 to 51) shall be as detailed below.                                     |                                                                                        |",
    "| 3)                                                                                             | The data entered into bits 14 to 26 shall be derived from the flight management        |\n| system or equivalent equipment managing the vertical profile of the aircraft.                  |                                                                                        |",
    "| 16                                                                                             |                                                                                        |\n| 17                                                                                             |                                                                                        |",
    "| 18                                                                                             | FMS SELECTED ALTITUDE                                                                  |\n| 19                                                                                             |                                                                                        |",
    "| 20                                                                                             | Range = [0, 65 520] feet                                                               |\n| 4)                                                                                             | The current barometric pressure setting shall be calculated from the value             |",
    "| contained in the field (bits 28 to 39) plus 800 mb.                                            |                                                                                        |\n| When the barometric pressure setting is less than 800 mb or greater than                       |                                                                                        |",
    "| 1 209.5 mb, the status bit for this field (bit 27) shall be set to indicate invalid data.      |                                                                                        |\n| 5)                                                                                             | Reserved bits 40 to 47 shall be set to ZERO (0).                                       |",
    "| 21                                                                                             |                                                                                        |\n| 22                                                                                             |                                                                                        |",
    "| 23                                                                                             |                                                                                        |\n| 24                                                                                             |                                                                                        |",
    "| 25                                                                                             |                                                                                        |\n| 26                                                                                             | LSB = 16 feet                                                                          |",
    "6)\nBits 48 to 56 shall indicate the status of the values provided in bits 1 to 26 as follows:",
    "| 27                                                                                     | STATUS                                            |\n|----------------------------------------------------------------------------------------|---------------------------------------------------|\n| 28                                                                                     | MSB = 204.8 mb                                    |",
    "| Bit 48 shall indicate whether the mode bits (49, 50 and 51) are already being          |                                                   |\n| populated:                                                                             |                                                   |\n| 1.                                                                                     |                                                   |",
    "| 2.                                                                                     | 0 = No mode information provided                  |\n| 3.                                                                                     | 1 = Mode information deliberately provided        |\n| 29                                                                                     |                                                   |",
    "| 30                                                                                     |                                                   |\n| 31                                                                                     |                                                   |\n| 32                                                                                     | BAROMETRIC PRESSURE SETTING                       |",
    "| 4.                                                                                     |                                                   |\n| Bits 49, 50 and 51:                                                                    |                                                   |\n| 33                                                                                     | MINUS 800 mb                                      |",
    "| 5.                                                                                     |                                                   |\n| 6.                                                                                     | 0 = Not active                                    |\n| 34                                                                                     |                                                   |",
    "| 35                                                                                     | Range = [0, 410] mb                               |\n| 7.                                                                                     | 1 = Active                                        |\n| 8.                                                                                     |                                                   |",
    "| 9.                                                                                     | Reserved bits 52 and 53 shall be set to ZERO (0). |\n| 10.                                                                                    |                                                   |\n| 36                                                                                     |                                                   |",
    "| 37                                                                                     |                                                   |\n| 38                                                                                     |                                                   |\n| 39                                                                                     | LSB = 0.1 mb                                      |",
    "| Bit 54 shall indicate whether the target altitude source bits (55 and 56) are actively |                                                   |\n| being populated:                                                                       |                                                   |\n| 11.                                                                                    |                                                   |",
    "| 12.                                                                                    | 0 = No source information provided                |\n| 13.                                                                                    | 1 = Source information deliberately provided      |\n| 14.                                                                                    |                                                   |",
    "| Bits 55 and 56 shall indicate target altitude source:                                  |                                                   |\n| 40                                                                                     |                                                   |\n| 41                                                                                     |                                                   |",
    "| 42                                                                                     |                                                   |\n| 43                                                                                     |                                                   |\n| 44                                                                                     | RESERVED                                          |",
    "| 15.                                                                                    |                                                   |\n| 16.                                                                                    | 00 = Unknown                                      |\n| 17.                                                                                    | 01 = Aircraft altitude                            |",
    "| 18.                                                                                    | 10 = FCU/MCP selected altitude                    |\n| 19.                                                                                    | 11 = FMS selected altitude                        |\n| 45                                                                                     |                                                   |",
    "| 46                                                                                     |                                                   |\n| 47                                                                                     |                                                   |\n| 48                                                                                     | STATUS OF MCP/FCU MODE BITS                       |",
    "| 20.                                                                                    |                                                   |\n| 21.                                                                                    |                                                   |\n| .                                                                                      |                                                   |",
    "|                                                                                        |                                                   |\n| 49                                                                                     | VNAV MODE                                         |\n| 50                                                                                     | ALT HOLD MODE                                     |",
    "| 51                                                                                     | APPROACH MODE                                     |\n| 52                                                                                     | RESERVED                                          |",
    "53 54 \nSTATUS OF TARGET ALT SOURCE BITS \n55 \nMSB \nTARGET ALT SOURCE \n56 \nLSB \nPURPOSE: To provide aircraft state and status  \ninformation.   \nFORMAT TYPE CODE = 29 \n **SUBTYPE CODE = 1** \n7 \nLSB \n8 \nSIL SUPPLEMENT (0=Per Hour, 1=Per Sample) \n9 \nSELECTED ALTITUDE TYPE (0=MCP/FCU, 1=FMS) \n10 \nMSB = 32768 feet",
    "11 \nMCP / FCU SELECTED ALTITUDE \n12 \n(when Selected Altitude Type = 0) \n13 \nFMS SELECTED ALTITUDE \n14 \n(when Selected Altitude Type = 1) \n15 \n  Coding:    111 1111 1111 = 65472 feet \n16 \n  *** **** **** \n17 \n  000 0000 0010 = 32 feet \n18 \n  000 0000 0001 = 0 feet \n19 \n  000 0000 0000 = No data or Invalid \n20 \nLSB = 32 feet \n21 \nMSB = 204.8 millibars \n22 \nBAROMETRIC PRESSURE SETTING (MINUS 800 millibars) \n23 \nRange = [0, 408.0] Resolution = 0.8 millibars \n24",
    "23 \nRange = [0, 408.0] Resolution = 0.8 millibars \n24 \n  Coding:      1 1111 1111 = 408.00 millibars \n25 \n* **** ****\n26 \n0 0000 0010 = 0.800 millibars\n27 \n0 0000 0001 = 0.000 millibars\n28 \n0 0000 0000 = No Data or Invalid\n29 \nLSB = 0.8 millibars \n30 \nSTATUS    (0=Invalid, 1=Valid) \n31 \nSign    (0=Positive, 1=Negative)",
    "32 \nMSB = 90.0 degrees \n33 34 \nSELECTED HEADING \n35 \nRange = [+/- 180] degrees, Resolution = 0.703125 degrees \n36 \n(Typical Selected Heading Label = \"101\") \n37 38 39 \nLSB = 0.703125 degrees (180/256) \n40 \nMSB",
    "41 \nNAVIGATION ACCURACY CATEGORY FOR POSITION (NACP) \n42 43 \nLSB \n44 \nNAVIGATION INTEGRITY CATEGORY FOR BARO (NICBARO) \n45 \nMSB \nSOURCE INTEGRITY LEVEL (SIL) \n46 \nLSB \n47 \nSTATUS OF MCP / FCU MODE BITS (0 = Invalid, 1 = Valid) \n48 \nAUTOPILOT ENGAGED (0 = Not Engaged, 1 = Engaged) \n49 \nVNAV MODE ENGAGED (0 = Not Engaged, 1 = Engaged) \n50 \nALTITUDE HOLD MODE (0 = Not Engaged, 1 = Engaged) \n51 \nReserved for ADS-R Flag  \n52 \nAPPROACH MODE (0 = Not Engaged, 1 = Engaged) \n53",
    "51 \nReserved for ADS-R Flag  \n52 \nAPPROACH MODE (0 = Not Engaged, 1 = Engaged) \n53 \nTCAS/ACAS OPERATIONAL (0 = Not Operational, 1 = Operational) \n54 \nLNAV MODE  (0 = Not Engaged, 1 = Engaged) \n55 \nMSB \nRESERVED \n56 \nLSB",
    "## Appendix G. Advisory Circular Feedback Information",
    "If you find an error in this AC, have recommendations for improving it, or have suggestions for new items/subjects to be added, you may let us know by (1) complete the form online at https://ksn2.faa.gov/avs/dfs/Pages/Home.aspx or (2) emailing this form to 9-AWA-AVS-AIR- DMO@faa.gov Subject: AC 20-151C \nDate: ___________ \nPlease check all appropriate line items: \nAn error (procedural or typographical) has been noted in paragraph _______ on page \n_______.",
    "Recommend paragraph _______ on page _______ be changed as follows: \nIn a future change to this AC, please cover the following subject: \n(Briefly describe what you want added.) \nOther comments: \n \nI would like to discuss the above. Please contact me. \n\nSubmitted by: __________________________________ Date: __________________ Telephone Number: __________________ Routing Symbol: _________________ \nFAA Form 1320-19 (10-98)"
  ]
}