{
  "source": "AC 20-152A.md",
  "chunks": [
    "The applicant should document in the Plan for Hardware Aspects of Certification \n(PHAC), or any other related planning document, the process and activities that the applicant intends to perform to satisfy the objectives of this AC. The PHAC, as well as those related planning documents should be submitted for certification. \n\n## Custom Device Development",
    "This section provides guidance for the development assurance of programmable logic devices (PLDs), field programmable gate arrays (FPGAs), or application specific integrated circuits (ASICs), which are collectively referred to as \"custom devices.\"",
    "These custom devices are addressed in ED-80/DO-254, Section 1.2, Item 3 as \"custom micro-coded components.\" Developing a custom device demands a well-defined development process. However, it is understood that the process to develop complex custom devices requires more comprehensive activities and artifacts than for a simple device.",
    "e \nSection 5.1 identifies custom devices that are within the scope of this AC. \ne \nSection 5.2 provides guidance on simple/complex classification for custom devices. \ne \nSection 5.3 provides guidance on development assurance for complex custom \ndevices. \ne \nSection 5.4 provides guidance on development assurance for simple custom \ndevices. In particular, Section 5.4 defines which Sections from 5.5 to 5.11 are \napplicable to the development assurance of simple electronic devices. \ne",
    "applicable to the development assurance of simple electronic devices. \ne \nSections 5.5 through 5.10 provide clarifications on ED-80/DO-254. \ne \nSection 5.11 provides background information and guidance specific to COTS IP \nused in custom devices.",
    "## Applicability To Custom Devices 5.1\n\nSection 5 is applicable to a digital or mixed-signal custom device that contributes to hardware DAL A, B, or C functions. \n\nAppendix A to ED-80/DO-254 modulates the ED-80/DO-254 life cycle data based on the DAL allocated to the hardware function. This document recognizes Appendix A for the modulation of the life cycle data according to the hardware DAL for the development of custom devices. \n\n## Simple/Complex Classification 5.2",
    "## Simple/Complex Classification 5.2\n\nED-80/DO-254 introduces the notion of simple and complex hardware items. This section clarifies and provides criteria that could be used to classify a device as simple by considering the design content of the custom device, and subsequently, the ability to comprehensively verify the device.",
    "A hardware custom device is classified as simple only if a technical assessment of the design content supports the ability of the device to be verified by a comprehensive combination of deterministic tests and analyses that ensures correct functional performance under all foreseeable operating conditions with no anomalous behavior. \n\nThe following criteria should be used for assessing whether a device should be classified as simple:",
    "e \nSimplicity of the functions and their number, \ne¢ \nNumber and the simplicity of the interfaces, \ne \nSimplicity of the data/signal processing or transfer functions, and \ne \nIndependence of functions/blocks/stages. \nAdditional criteria specific to the digital part of the design include:",
    "e \nWhether the design is synchronous or asynchronous, \ne¢ \nNumber of independent clocks, \ne \nNumber of state machines, number of states and state transitions per state machine, \nand \ne \nIndependence between the state machines. \nThe applicant may propose other or additional criteria for the technical assessment of simplicity. \n\nWhen an item cannot be classified as simple, it should be classified as complex.",
    "When an item cannot be classified as simple, it should be classified as complex. \n\nHowever, note that an item constructed entirely from simple items may itself be complex. \n\nFor each custom device, the applicant should document in the PHAC or any related planning document: \n\n1. \nThe development assurance level, \n2. \nThe simple or complex classification, and \n3. \nIfa device is classified as simple, the justification based on the simple \nclassification criteria.",
    "## 5.3 Development Assurance For Complex Custom Devices\n\nED-80/DO-254 is recognized as the industry standard for the development assurance of complex custom devices. \n\nThe applicant should satisfy ED-80/DO-254 and the additional objectives or clarifications described in this AC from Sections 5.5 through 5.11.\n\n## Development Assurance For Simple Custom Devices 5.4",
    "## Development Assurance For Simple Custom Devices 5.4\n\nFor the development of simple custom devices, it is understood that the life cycle data might be significantly reduced compared with the data required for a complex custom device.",
    "ED-80/DO-254 acknowledges that documentation for the design process of a simple hardware device is less extensive than the one needed for a complex device. In addition, while verification and configuration management are also needed, these supporting processes also require less documentation for a simple device. However, it is important that a simple custom device performs its intended function, and is under configuration management, thus allowing the device to be reproduced, conformed, and",
    "and is under configuration management, thus allowing the device to be reproduced, conformed, and analyzed to ensure continued operational safety.",
    "The applicant should propose a process in the PHAC or any other appropriate planning document to develop simple custom devices that encompasses:",
    "1. \nDefinition of the device functions, \n2. \nComplete verification of the device functions, through tests and analyses, \n3. \nConfiguration management of the device, including problem reporting and the \ninstructions to reproduce the device, \n4. \nAssessment of the build conformance of the device. \nSections 5.5.2.4 and 5.5.2.5 of this document also apply to the verification process for simple custom devices. \n\nThe life cycle data for simple devices can be combined with other hardware data.",
    "The life cycle data for simple devices can be combined with other hardware data. \n\nIf tools are used for the simple custom device development process, the objectives or clarifications of those objectives described in Section 5.8 of this document are also applicable. \n\nWhen the applicant intends to reuse a previously developed simple device, ED-80/DO- \n254, Section 11.1 and the clarifications provided in Section 5.9 of this document should be used.",
    "If the applicant intends to use COTS IP, the objectives or clarifications of those objectives described in Section 5.11 of this document are also applicable. \n\n## Clarifications To Ed-80/Do-254 Validation And Verification Processes 5.5 5.5.1 Validation Process",
    "Establishing a correct and complete set of requirements is the cornerstone of the development assurance process. ED-80/DO-254, Section 6.1 addresses the validation process to ensure the completeness and correctness of derived requirements.",
    "Nevertheless, the validation process is essential for all the requirements. Indeed, the upper-level requirements allocated to the custom device are often refined, decomposed or restated at the custom device level, and in terms that support the hardware design.\n\nThese custom device requirements, which are traceable from/to the upper-level requirements and, therefore, not considered to be \"derived,\" should also be correct and complete.",
    "The applicant should validate all the custom device requirements by following the ED-80/DO-254 validation process (ED-80/DO-254, Section 6). This validation activity covers both derived and non-derived requirements. \n\nFor DAL A and B development, validation activities should be performed with independence. \n\nNote: ED-80/DO-254 Appendix A defines acceptable means for establishing independence. \n\n## 5.5.2 Verification Process",
    "## 5.5.2 Verification Process\n\nED-80/DO-254 broadly describes the verification process, but additional guidance is needed to ensure the verification of the custom device is complete, particularly in the area of: \n\ne \nDesign reviews, \ne \nReviews of test cases and procedures, and \ne \nVerification of the implementation. \n\n## 5.5.2.1 Conceptual Design Review",
    "Conceptual design is the process of generating a high-level design description from the hardware requirements (see ED-80/DO-254, Section 5.2). The conceptual design review is typically used to ensure that the outcome of the conceptual design activities (see ED-80/DO-254, Section \n5.2.2) is consistent with the requirements, and identifies constraints for the interfacing components (hardware or software) and architectural constraints for the detailed design activities of the custom device.",
    "Since this conceptual design review is already addressed in ED-80/DO- \n254, Section 5.2.2 through the note, no separate objective is needed. \n\n## 5.5.2.2 Detailed Design Review\n\nDetailed design is the process of generating, from the conceptual design and the requirements, a hardware description language (HDL) or analog representation of the design, constraints for the implementation (e.g. \n\ntiming constraints, pinout, I/O characteristics), and the hardware-software interface description.",
    "ED-80/DO-254 introduces design reviews in Section 6.3.3.2. \n\nA design review is considered to be an essential step during the detailed design process (ED-80/DO-254, Section 5.3) supporting the implementation process, and complementing requirements-based verification.",
    "For hardware DAL A or DAL B, the applicant should review the detailed design with respect to the design standards and review the traceability between the detailed design and the custom device requirements, in order to demonstrate that the detailed design covers the custom device requirements, is consistent with the conceptual design, and is compliant with the hardware design standards.",
    "For hardware DAL C, the applicant should demonstrate that the detailed design satisfies the hardware design standards. \n\n## Implementation Review\n\n5.5.2.3 \nWithin a custom device development process, tools are used to convert the detailed design data into the physical implementation. While ED-80/DO- \n254 does not explicitly address it, a review of the design tool reports (e.g.",
    "synthesis and place and route reports) is necessary to ensure that the execution of the tool to generate its output was performed correctly. \n\nWhen tools are used to convert the detailed design data into the physical implementation, the applicant should review the design tool reports (e.g. \n\nsynthesis and place and route reports) to ensure that the tool executed properly when generating the output. \n\n## Review Of Verification Cases And Procedures",
    "## Review Of Verification Cases And Procedures\n\n5.5.2.4 \nED-80/DO-254 introduces verification coverage analysis in Section 6.2.2, Item 4, to satisfy the ED-80/DO-254 verification process objectives and determine whether the verification process is correct and complete. A part of the coverage analysis is clarified by the following objective.",
    "Each verification case and procedure should be reviewed to confirm that it is appropriate for the requirements to which it traces and that the requirements are correctly and completely covered by the verification cases and procedures. \n\n## Verification Of The Timing Performance Of The Implementation",
    "## Verification Of The Timing Performance Of The Implementation\n\n5.5.2.5 \nED-80/DO-254, Section 6.2 addresses the verification of the implementation. The implementation results from the process to generate the physical custom device from the detailed design data. The post-layout netlist is the closest virtual representation of the physical custom device, resulting from synthesis (for digital part of the device) and place and route.",
    "While it is recommended to test the implementation in its intended operational environment (i.e. by a physical test), verification using the post-layout netlist may be necessary to complement the verification of the implementation for certain requirements (e.g. features not accessible from the I/O pins of the device, timing, abnormal conditions, or robustness cases). In such cases, the coverage of the requirements by means other than a physical test should be justified.",
    "The requirement to capture activities in ED-80/DO-254, Section 5.1.2, Item 4.g, introduces the need for requirements to address signal timing characteristics under normal and worst-case conditions. Nevertheless, ED- \n80/DO-254 does not explicitly address verification of the performance of the device under all possible (best-case and worst-case) timing conditions that could possibly occur during the operation of the device.",
    "The following objective clarifies the need to take into account the variation of the environmental conditions (temperature, voltage, etc.) \nduring the evaluation of the timing performance of the design, as well as the semiconductor device process variations.",
    "The applicant should verify the timing performance of the design accounting for the temperature and power supply variations applied to the device and the semiconductor device fabrication process variations as characterized by the manufacturer of the semiconductor device. \n\nNote: Static timing analysis (STA) with the necessary timing constraints and conditions is one of the possible means of compliance with this objective for the digital parts of custom devices.",
    "## Clarifications To Ed-80/Do-254, Robustness Aspects 5.6\n\nED-80/DO-254 mentions robustness defects but does not explicitly address robustness.",
    "The robustness of the design is defined as the expected behavior of the design under abnormal and boundary/worst-case operating conditions of the inputs and internal design states. These conditions are often captured as derived requirements when they are not allocated from the upper level process. When subjected to these conditions, it is understood that the design may not continue to perform as it would under normal conditions.",
    "For DAL A or DAL B hardware, the abnormal and boundary conditions and the associated expected behaviour of the design should be defined as requirements. \n\n## Recognition Of Hdl Code Coverage Method 5.7\n\nHDL code coverage analysis is an assessment of whether the HDL code of the design has been exercised through HDL simulations.",
    "The HDL code coverage method provides an assessment of the coverage of the design logic structure, giving an indication of which aspects of the logic structure are exercised and which are not.",
    "When performed during requirements-based verification (per ED-80/DO-254, Section 6.2), HDL code coverage is recognized as a method to perform ED-80/DO-254",
    "elemental analysis per Appendix B, Section 3.3.1, for digital devices. HDL code coverage supports the assessment of whether the HDL code elements are fully covered by requirements-based simulations. As such, it does not represent an assessment of the completeness of requirements-based testing activities or the effectiveness of requirement coverage.",
    "For hardware DAL A or DAL B, where HDL code coverage is used to perform elemental analysis (ED-80/DO-254, Appendix B, Section 3.3.1), the applicant should define in the planning documents the detailed coverage criteria of the HDL code elements used in the design. The criteria should ensure coverage over the various cases of the HDL code elements used in the design (e.g. branches, conditions, etc.). Any noncovered case or element should be analyzed and justified.",
    "Note: Code coverage might need to be complemented by additional analysis for any hardware items that are identified as not covered by the code coverage analysis, in order to complete the elemental analysis of all elements. This situation may occur in the use of some COTS IP instantiations. \n\n## Clarifications To Ed-80/Do-254, Tool Assessment And Qualification",
    "## Clarifications To Ed-80/Do-254, Tool Assessment And Qualification\n\n5.8 \nED-80/DO-254 introduces the notion of tool assessment and qualification. ED-80/DO- 254, Figure 11-1 includes a flow chart indicating the tool assessment considerations and activities, and provides guidance for when tool qualification may be necessary. This AC uses the flow chart and its related text as a basis for providing further clarification, as follows: \n\n## Ed-80/Do-254 - Figure 11-1, Item 1. - Identify The Tool",
    "## Ed-80/Do-254 - Figure 11-1, Item 1. - Identify The Tool\n\nInformation capturing the environment required for tool operation and the tool revision should be included with the tool identification. \n\n## Ed-80/Do-254 - Figure 11-1, Item 2. - Identify The Process The Tool Supports",
    "## Ed-80/Do-254 - Figure 11-1, Item 2. - Identify The Process The Tool Supports\n\nWhen identifying the design or verification process that the tool supports, it is important to also identify what purpose or activity within the hardware development process the tool satisfies. While assessing the tool limitations, evidence of formal assessment of the tool problem reports is not required if the tool output has been completely and independently assessed.",
    "## Ed-80/Do-254 - Figure 11-1, Item 3. - Is The Tool Output Independently Assessed?\n\nThe purpose of assessing the tool output is to completely cover, with an independent means, the potential errors that the tool could introduce into the design or fail to detect during verification.",
    "When the applicant intends to independently assess a tool output, the applicant should propose an independent assessment that verifies the tool output is correct. The independent assessment should justify that there is sufficient coverage of the tool output. The completeness of the tool assessment should be based on the design/implementation and/or verification objectives that the tool is used to satisfv.",
    "## Ed-80/Do-254 - Figure 11-1, Item 4. - Is The Tool A Level A, B Or C Design Tool Or A Level A Or B Verification Tool?",
    "ED-80/DO-254, Figure 11-1, Item 4 of the tool assessment/qualification flow excludes the need for activities for tools \"used to assess the completion of verification testing, such as in an elemental analysis.\"",
    "The last statement is misleading regarding the intent of code coverage tools used for elemental analysis. As stated in Section 5.7 of this document: when a code coverage tool is used for elemental analysis, it does not represent an assessment of the completeness of the requirements-based testing activities or the effectiveness of the requirement coverage.",
    "It is therefore necessary to provide some further clarifications.",
    "e \nThis document recognizes the Figure 11-1, Item 4 exclusion of tool \nassessment/qualification activities for code coverage tools only when they are used to assess whether the code has been exercised by requirements-based \ntesting/simulations (elemental analysis). \ne \nIftest cases or procedures are automatically generated by a tool and this tool uses \ncoverage to determine the completion of the requirements verification, then the tool",
    "coverage to determine the completion of the requirements verification, then the tool \nshould be considered to be a verification tool to answer the question raised in \nFigure 11-1, Item 4.",
    "## Ed-80/Do-254 - Figure 11-1, Item 5. - Does The Tool Have Relevant History?\n\nIn ED-80/DO-254, the supporting text for Figure 11-1, Item 5 can be misinterpreted to suggest that when the tool has been previously used, no further tool assessment is necessary. Item 5 should be understood to mean that the applicant will provide sufficient data and justification to substantiate the relevance and credibility of the tool history.",
    "When the applicant intends to claim credit for the relevant history of a tool, sufficient data should be provided as a part of the tool assessment to demonstrate that there is a relevant and credible tool history to justify that the tool will produce correct results for its proposed use. \n\n## Ed-80/Do-254 - Figure 11-1, Item 9. - Design Tool Qualification",
    "## Ed-80/Do-254 - Figure 11-1, Item 9. - Design Tool Qualification\n\nFor design tools, contrary to the note in the supporting text for Figure 11-1, Item 9, the tool history should not be used as a stand-alone means of tool assessment and qualification.",
    "A relevant tool history may be used to compensate for some particular gaps in the tool assessment and qualification process, for example, to explain the method of independent assessment of the tool output. In this case, a relevant tool history is considered to be complementary data, providing more assurance for a tool. \n\nIn addition to what is already referenced in ED-80/DO-254, Figure 11-1, Item 9, for tool qualification guidance, ED-12C/DO-178C and ED-215/DO-330 may also be used.",
    "## Clarifications To Ed-80/Do-254 Regarding Previously Developed Hardware",
    "5.9 \nPreviously developed hardware (PDH) is defined as a custom-developed hardware \ndevice that has been installed in an airborne system or equipment either approved \nthrough FAA type certification (TC/STC) or authorized through TSOA. The section \nproviding clarification on the use of PDH also covers PDH that was developed and \napproved prior to the use of ED-80/DO-254 in civil certification. \nThis section provides guidance on the use of ED-80/DO-254, Section 11.1, for PDH.",
    "When an applicant proposes to reuse PDH, the applicant should use ED-80/DO-254, Section 11.1 and its subordinate paragraphs. The applicant should perform the assessments and analyses required in ED-80/DO-254, Section 11.1, in order to ensure that using the PDH is valid and that the compliance shown during the previous approval was not compromised by any of the following:",
    "1. \nModification of the PDH for the new application or for obsolescence management; \n2. \nChange to the function, change to its use, or change to a higher failure condition \nclassification of the PDH in the new application; or \n3. \nChange to the design environment of the PDH. \nThe results should be documented in the PHAC or any other appropriate planning document.",
    "In the context of custom device development, any one of these three points potentially invalidates the original development assurance credit for the PDH. In case of change or modification, the applicant should assess these changes using ED-80/DO-254, Section 11.1 and its subordinate paragraphs. When the original design assurance of the PDH is invalidated by one of the above points, the custom device should be upgraded based on the assessment per ED-80/DO-254, Section 11.1. When upgrading the",
    "should be upgraded based on the assessment per ED-80/DO-254, Section 11.1. When upgrading the hardware, the applicant should consider the objectives of this document that are applicable per the assessment.",
    "## Clarifications To Ed-80/Do-254, Appendix A\n\n5.10 \nThis section clarifies the life cycle data referenced in ED-80/DO-254, Appendix A as follows.",
    "e \nThe row corresponding to 10.1.6 \"Hardware Process Assurance Plan\" in Table A-1 \nshould also indicate HC2 for Level C to be consistent with row 10.8. \ne \nThe row corresponding to 10.2.2, \"Hardware Design Standard\" in Table A-1 should \nalso indicate HC2 for Level C. HDL Coding Standards are part of the Hardware \nDesign Standards. \ne \nThe row corresponding to 10.3.2.2 \"Detailed Design Data\" in Table A-1 should \nindicate HC1 for Levels A, B, and C. \ne",
    "indicate HC1 for Levels A, B, and C. \ne \nThe row corresponding to 10.4.2 \"Hardware Review and Analysis Procedures\" in \nTable A-1 should also indicate HC2 for Level C to be consistent with row 10.4.3. \ne \nThe Top-Level drawing referenced in ED-80/DO-254, Appendix A, corresponds to \na Hardware Configuration Index (HCI) document. The HCI document completely \nidentifies the hardware configuration, the embedded logic, and the development life",
    "identifies the hardware configuration, the embedded logic, and the development life \ncycle data. To support consistent and accurate replication of the custom device \n(ED-80/DO-254, Section 7.1), the Top-Level Drawing includes the hardware life \ncycle environment or refers to \na Hardware Environment Configuration Index \n(HECI) document.",
    "## Use Of Cots Ip In Custom Device Development S.11\n\nSection 5.11 addresses COTS IP that is instantiated within FPGAs/PLDs/ASICs during the development of the custom device. \n\nThis section addresses COTS IP and its integration within custom devices and describes objectives to support the demonstration of compliance with the applicable airworthiness regulations for the hardware aspects of airborne systems and equipment certification.",
    "Section 5.11.2, on \"Applicability to COTS IP,\" identifies COTS IP that are within the scope of Section 5.11. \n\n## S11 Background",
    "TP refers to design functions (design modules or functional blocks, including IP",
    "libraries) used to design and implement a part of or a complete custom device such as a PLD, FPGA, or ASIC. IP is considered to be commercial-off-the-shelf intellectual property, i.e., \"COTS IP,\" when it is a commercially available function, used by a number of different users, in a variety of applications and installations. Custom IP, developed for a few specific aircraft equipment, is not considered to be COTS IP.",
    "COTS IP are available in various source formats. COTS IP are categorized as Soft IP, Firm IP, or Hard IP based on the stage in the custom device design flow where the IP is instantiated. A function can be a combination of source formats and each part needs to be addressed. Definitions for Soft IP, Firm IP, and Hard IP can be found in the Appendix A Glossary.",
    "wt \n| Requirements/    | RTL    | +    | Place    | &              |\n|------------------|--------|------|----------|----------------|\n| Concept          | Design | CSS  | Route    | Implementation |",
    "The availability of a COTS IP does not guarantee that it is suitable to be used in a custom device for aircraft systems. Some COTS IP may have been developed using ED-80/DO-254 and will therefore have the necessary life cycle data to demonstrate satisfaction of ED-80/DO-254. However, most COTS IP are not developed to meet aviation development assurance standards and, therefore, there are risks associated with their use in a custom device for aircraft systems or equipment.",
    "The risks of using COTS IP may include: \n\ne \nIncomplete or missing documentation/data regarding: \no \nThe behavioral operation of the COTS IP, \no \nHow to integrate it into the design; \ne \nInsufficient verification performed by the COTS IP provider; \n¢ \nDeficient quality of the COTS IP. \nThe potential for design errors may be increased by the lack of development assurance, and/or by insufficient service experience.",
    "Possible design errors within COTS IP or in the use of COTS IP may lead to a failure mode. Risk factors for these types of errors include:",
    "¢ \nUnknown level of rigor of the COTS IP design and verification process; \ne \nMisalignment between the intended usage of the COTS IP by the IP provider and \nthe usage in the custom device by the IP user; \ne \nIncomplete or missing details regarding the detailed operation of the COTS IP; \ne \nIncorrect integration of the COTS IP with the rest of the custom device design; \ne \nIntegrator lacking expertise with the function of the IP.",
    "e \nIntegrator lacking expertise with the function of the IP. \nAdditionally, the COTS IP user completes the development of the integrated COTS IP \nup to the physical implementation of the device. The COTS IP user may introduce a design error while completing the physical implementation of the COTS IP because of the user's incomplete knowledge of the internal design of the COTS IP.",
    "## 5.11.2 Applicability To Cots Ip\n\nSection 5.11 is applicable to COTS IP used in a custom device that meets the definition of \"commercial-off-the-shelf intellectual property\" in the Appendix A Glossary. This scope encompasses digital, analog, and mixed-signal COTS IP. \n\nNote: Analog COTS IP is within the above-mentioned scope, as it could be instantiated within a custom mixed-signal device. \n\nSection 5.11 is applicable to COTS IP contributing to hardware DAL A, B, or C \nfunctions.",
    "Section 5.11 is applicable to COTS IP contributing to hardware DAL A, B, or C \nfunctions. \n\nSection 5.11 is applicable to Soft IP, Firm IP, and Hard IP that are inserted within a custom device by the applicant. However, Section 5.11 does not apply to Hard IP that is embedded in the silicon of an FPGA or a PLD by the FPGA/PLD device manufacturer. \n\nThis type of IP is considered to be part of the COTS device, and is covered in Section \n6, Use of Commercial Off-the-Shelf Devices.",
    "## Development Assurance For Cots Ip 5.11.3\n\nA COTS IP development assurance approach should be based on the category of the COTS IP (soft, firm, hard) and on the identified risks of failure due to a design error in the COTS IP itself or an error in the way it is used in the custom device.",
    "This section provides objectives addressing development assurance when using COTS \nIP. These objectives are intended to cover the particular aspects of development when using COTS IP, and are expressed in connection with the custom device development process that follows ED-80/DO-254 and the custom device objectives of this document.",
    "The development aspects related to COTS IP start from the custom device process that captures the allocated requirements for the function that will be performed by the COTS IP. From this entry point, the following aspects provide a basis to define the development assurance objectives for the use of COTS IP:",
    "e \nSelection of the COTS IP, \ne \nAssessment of the IP provider and the IP data, \ne \nPlanning activities, including the verification strategy, \n¢ \nDefinition of the requirements/derived requirements, \ne \nDesign integration, implementation, and verification of the COTS IP in the custom \ndevice. \n\n## 5.11.3.1 Selection Of The Cots Ip To Implement The Function",
    "## 5.11.3.1 Selection Of The Cots Ip To Implement The Function\n\nCOTS IP can be available in different forms/source formats and various levels of quality. Some COTS IP may not be acceptable for use in airborne systems. The selection criteria below are intended to address the essential characteristics that are considered a minimum for the use of IP in custom AEH devices.",
    "The applicant should select a COTS \nIP that is considered to be an acceptable solution, based on at least the following criteria:",
    "1. \nThe IP is technically suitable for implementing the intended function; \n2. \nThe description of the COTS IP architecture or IP design concept provides an \nunderstanding of the functionality, modes, and configuration of the IP. The \ndescription should also include an understanding of the source format or \ncombination of source formats of the COTS IP;",
    "combination of source formats of the COTS IP; \nThe availability and quality of data and documentation allow the understanding of all aspects of the COTS IP functions, modes, and behavior, and enable the integration and verification of the COTS IP (e.g., datasheets, application notes, user guide, knowledge of errata, etc.); \nInformation exists for the IP user to be able to create the physical implementation of the COTS",
    "Information exists for the IP user to be able to create the physical implementation of the COTS \nIP (e.g., synthesis constraints, usage and performance limits, physical implementation, and routing instructions);",
    "5. \nIt can be demonstrated that the COTS IP fulfills its intended function. \n\n## 5.11.3.2 Assessment Of The Cots Ip Provider & Cots Ip Data Objective Ip-2\n\nThe applicant should assess the COTS IP provider and the associated data of the COTS \nIP based on at least the following criteria:",
    "1. \nThe IP provider provides all the information necessary for the integration of the \nCOTS \nIP within the custom device and to support the implementation of the \nCOTS \nIP within the device (e.g., synthesis constraints, usage domain, \nperformance limits, physical implementation, and routing instructions); \nThe configurations, selectable options, and scalable modules of the COTS IP \ndesign are documented so that the implementation of the COTS IP can be properly managed;",
    "design are documented so that the implementation of the COTS IP can be properly managed; \nThe COTS IP has been verified by following a trustworthy and reliable process, and the verification covers the applicant's specific use case for the COTS IP \n(including the used scale for scalable IP and the IP functions selected for selectable functions); \nThe known errors and limitations are available to the IP user, and there is a process to provide updated information to the IP user;",
    "The COTS IP has service experience data that shows reliable operation for the applicants specific use case for the COTS \nIP.",
    "The assessment should be documented. The results of the assessment should be submitted for certification. \n\n## Planning Of The Hardware Development Assurance Approach Related 5.11.3.3 To Cots Ip Complementary Development Assurance",
    "5.11.3.3.1 \nWhen the IP-2 objective criteria items 1, 2, 4, or 5 cannot be completely met using the IP provider's data, the applicant should define an appropriate development assurance activity to mitigate the criteria that were not met and address the associated risk of development errors. The development assurance activity should be based on the ED-80/DO-254 \nobjectives. \n\nNote: The results of the assessment of objective IP-2, item 3 are considered in Section 5.11.3.3.2.",
    "## Verification Strategy For Cots Ip Functions\n\n5.11.3.3.2 \nIn addition to the verification of the custom device functions supported by the COTS IP, there is a need to ensure that the aspects related to the COTS \nIP and its usage are addressed. This section focuses on defining a verification strategy to cover those aspects.",
    "The verification performed by the COTS IP provider typically does not follow the ED-80/DO-254 verification process but may provide some credit to be used for the verification strategy. However, the verification process for COTS IP generally differs from one IP vendor to another, and the level of assurance varies depending on the IP provider's development practices. \n\nThe verification strategy may combine different means to complement the traditional requirements-based testing approach.",
    "Based on the applicant's assessment of the IP provider and the IP data through objective IP-2, the applicant is expected to establish a verification strategy. The aim of this verification strategy is to cover all three of the following aspects:",
    "e \nThe COTS IP - the purpose is to ensure that the COTS IP is verified, addressing the risk identified from the IP-2, Item 3 objective; \ne \nIts implementation - the purpose is to ensure that the COTS IP still \nperforms its allocated function, and that no design errors have been \nintroduced by the design steps performed by the applicant (e.g., \nsynthesis/place and route); \ne \nIts integration within the custom device - the purpose is to ensure that",
    "e \nIts integration within the custom device - the purpose is to ensure that \nthe COTS IP has been properly connected, configured, and constrained within the custom device. \nThe strategy may accomplish more than one aspect within a common verification step.",
    "This section identifies a general objective for the verification of COTS IP \nused in a custom device, enabling various verification approaches. \n\nThe applicant should describe in the hardware verification plan, PHAC, or any related planning document, a verification strategy that should encompass all three of the following aspects:",
    "1. \nThe verification of the COTS \nIP itself, addressing the risk identified \nfrom the IP-2, Item 3 objective, \n2. \nThe verification of the COTS \nIP after the design steps performed by \nthe applicant (e.g., synthesis/place and route), \n3. \nThe verification of the integrated COTS \nIP functions within the custom \ndevice. \nNote 1: Reliable and trustworthy test data, test cases or procedures from the COTS IP provider may be used as part of the verification strategy to satisfy this objective.",
    "Note 2: If the COTS \nIP implements functions based on an industry standard, proven standardized test vectors verifying compliance with the standard may be used in the verification strategy of the COTS \nIP. \n\nNote 3: The verification strategy covers at a minimum the used functions of the COTS IP and ensures that the unused functions are correctly disabled or deactivated and do not interfere with the used functions. \n\n## 5.11.3.3.3 Cots Ip And Planning Aspects",
    "## 5.11.3.3.3 Cots Ip And Planning Aspects\n\nThe applicant has to define the activities that are needed for the hardware development assurance approach related to COTS IP. \n\nThe applicant should describe in the PHAC, or any related planning document, a hardware development assurance approach for using the COTS \nIP that at least includes:",
    "1. \nIdentification of the selected COTS \nIP (version) and its source \nformat(s) associated with the point(s) in the design flow where the \nCOTS \nIP is integrated into the custom device, \n2. \nA summary of the COTS IP functions, \n3. \nThe development assurance process that the applicant defines to \nsatisfy the objectives of Section 5.11.3, \n4. \nThe process related to the design integration and to the usage of the \nCOTS \nIP in the development process of the custom device, \n5.",
    "COTS \nIP in the development process of the custom device, \n5. \nTool assessment and qualification aspects when the applicant uses a \ntool to perform design and/or verification steps for the COTS \nIP.",
    "## Requirements For Cots Ip Function And Validation\n\n5.11.3.4 \nCustom device requirements typically contain requirements that relate to the function supported by the COTS IP. The granularity of these requirements may be very different depending on the COTS IP function and the visibility of the functions supported by the IP at the custom device level.",
    "Depending on the extent of requirements-based testing as a part of the chosen verification strategy of the COTS IP, the level of detail and the granularity of the AEH custom device requirements may need to be refined to specifically address the COTS IP functions and the implementation of the COTS IP.",
    "In addition, requirements should be captured to encompass all the necessary design details used to connect, configure, and constrain the COTS IP and properly integrate it into the AEH custom device. \n\nThe requirements related to the allocated COTS IP functions should be captured to an extent commensurate with the verification strategy.",
    "In addition, derived requirements should be captured to cover the following aspects associated with the integration of the COTS \nIP into the custom device design:",
    "1. \nCOTS \nIP used functions (including parameters, configuration, \nselectable aspects), \n2. \nDeactivation or disabling of unused functions, \n3. \nCorrect control and use of the COTS \nIP, in accordance with the data \nfrom the COTS IP provider. \nWhen the applicant chooses a verification strategy (see Section 5.11.3.3.2)",
    "When the applicant chooses a verification strategy (see Section 5.11.3.3.2) \nthat solely relies on requirements-based testing, the \"extent commensurate with the verification strategy\" corresponds to a complete requirement capture of the COTS IP following ED-80/DO-254.",
    "Regarding the validation aspects, the COTS IP requirements should be validated as a part of the validation process of the AEH custom device. \n\n## Verification\n\n5.11.3.5 \nThe applicant should ensure that the COTS IP is verified as a part of the overall custom device verification process per ED-80/DO-254 and based on the verification strategy for the COTS IP that has been described in the PHAC or a related planning document.",
    "For the requirements-based verification part, the applicant should satisfy ED-80/DO-254, Section 6.2 for the verification of the requirements related to the COTS IP (see Section 5.11.3.4 above). This can be performed as a part of the overall custom device process, therefore there is no separate objective. \n\n## Do-254 Appendix B Considerations\n\n5.11.3.6 \nWhen developing a hardware DAL A \nor B custom device, ED-80/DO-254, Appendix B is applicable.",
    "Code coverage analysis that is recognized as part of elemental analysis \n(refer to Section 5.7 of this document) might not be possible for the COTS \nIP part of the design. However, ED-80/DO-254, Appendix B \noffers other acceptable methods, including safety-specific analysis. The following objective further clarifies the expectations when using safety-specific analysis. \n\nFor COTS IP used in DAL A or DAL B hardware, the applicant should satisfy ED-80/DO-254, Appendix B.",
    "The applicant may choose safety-specific analysis methods to satisfy Appendix B on the COTS \nIP function and its integration within the custom device functions. This safety-specific analysis should identify the safetysensitive portions of the COTS \nIP and the potential for design errors in the COTS \nIP that could affect the hardware DAL A and DAL B functions in the custom device or system.",
    "For unmitigated aspects of the safety-sensitive portions of the IP, the safety-specific analysis should determine which additional requirements, design features, and verification activities are required for the safe operation of the COTS \nIP in the custom device. \n\nAny additional requirements, design features, and/or verification activities that result from the analysis should be fed back to the appropriate process. \n\n## Use Of Commercial Off-The-Shelf Devices",
    "## Use Of Commercial Off-The-Shelf Devices\n\nApplicants are increasingly using COTS electronic devices in aircraft/engines/ \npropellers/airborne systems, which may have safety implications for the aircraft, engines/propellers, or systems.",
    "Section 6 addresses the use of COTS devices through objectives that support the demonstration of compliance with the applicable airworthiness regulations for hardware aspects of airborne systems and equipment certification when using complex COTS \ndevices. Section 6.2, \"Applicability to COTS devices,\" enables applicants to identify the COTS devices that are within the scope of Section 6.",
    "Note: The term \"COTS device\" used in this document applies to a semiconductor product that is fully encapsulated in a package. This term does not apply to circuit board assemblies. \n\n## Background 6.1",
    "## Background 6.1\n\nCOTS devices continue to increase in complexity and are highly configurable. COTS \ndevices provide \"off-the-shelf\" already developed functions, some of which are highly complex. Their development and production processes undergo a semiconductor industry qualification based on their intended market (consumer, automotive, telecom, etc.). Their usage by the aerospace industry provides additional integration and higher performance capabilities than were possible in the past.",
    "The design data for these COTS devices are usually not available to the COTS user. \n\nSince these devices are generally not developed for airborne system purposes, assurance has not been demonstrated that the rigor of a COTS manufacturer's development process is commensurate with the aviation safety risks.",
    "ED-80/DO-254 introduces a basis for the development assurance for the use of COTS \ndevices in Section 11.2, \"COTS components usage.\" This section states that \"the use of COTS components will be verified through the overall design process, including the supporting processes.\"",
    "Since ED-80/DO-254 was released in the year 2000, the number of functions embedded and integrated in a single COTS device has significantly increased. Functions which were previously split into various components, making the interface between those components accessible for verification, are now embedded within a single chip. While there are clearly some benefits of integrating more functions within a device, the increased level of integration makes it difficult for the user to verify the",
    "within a device, the increased level of integration makes it difficult for the user to verify the different hardware functions in the device due to lack of access to the interfaces between functions. Since these devices are more complex and highly configurable than the older separate devices, the risk is greater that the COTS device will not achieve the intended function in particular use cases over the required operating conditions.",
    "Furthermore, some additional assurance is needed because design errors may still be discovered after the COTS device is released to the market, or when an applicant extends the use of the device beyond the manufacturer's specifications. \n\n## Applicability To Cots Devices 6.2",
    "## Applicability To Cots Devices 6.2\n\nSection 6 is applicable to digital, hybrid, and mixed-signal COTS devices that contribute to hardware DAL A, B, or C functions. For COTS devices contributing to hardware DAL C \nfunctions, a limited set of the objectives of this section will apply. \n\nSection 6 is also applicable to FPGA and PLD devices that embed Hard IP (see definition) in their produced/manufactured silicon, but only for the COTS part of the FPGAs/PLDs.",
    "Section 6.4 only applies to COTS devices that are complex, as determined by the following COTS complexity assessment. \n\n## Cots Complexity Assessment 6.3\n\nIn order to define which COTS devices are complex, the following high-level criteria should be used, considering all functions of the device, including any functions intended to be unused: \nA COTS device is complex when the device:",
    "1. \nHas multiple functional elements that can interact with each other; and \n2. \nOffers a significant number of functional modes; and \n3. \nOffers configurability of the functions, allowing different data/signal flows and \ndifferent resource sharing within the device. \nOr when the device:",
    "4. \nContains advanced data processing, advanced switching, or multiple processing \nelements (e.g. multicore processors, graphics processing, networking, complex bus switching, interconnect fabrics with multiple masters, etc.) \nFor complex COTS devices, it is impractical to completely verify all possible configurations of the device, and it is difficult to identify all potential failures.",
    "The applicant should assess the complexity of the COTS devices used in the design according to the high-level criteria of Section 6.3, and document the list of relevant devices (see note 1), including the classification rationale, in the PHAC or any related hardware planning document.",
    "Note 1: The applicant is not expected to assess the complete bill of material to satisfy the above objective, but only those devices that are relevant for the classification, including devices that are at the boundary between simple and complex. The resulting classification (simple or complex) for those devices that are at the boundary and those that are definitely complex should be documented.",
    "Note 2: A classification rationale is required for those devices that are at the boundary \n(meeting a part of the high-level criteria) and are classified as simple. \n\nSome examples of classification are provided in AC 00-72 for illustration. \n\n## Development Assurance For Use Of Complex Cots 6.4",
    "## Development Assurance For Use Of Complex Cots 6.4\n\nED-80/DO-254, Section 11.2.1, identifies some electronic component management process items when using a COTS device. ED-80/DO-254, Section 11.2.2, and Section \n6.1 of this document, identify some concerns with using a COTS device. The following objectives acknowledge and supplement ED-80/DO-254, Section 11.2 in clarifying how to gain certification credit when using complex COTS devices. \n\n## Electronic Component Management Process 6.4.1",
    "## Electronic Component Management Process 6.4.1\n\nAs stated in ED-80/DO-254, Section 11.2, \"the use of an electronic component management process, in conjunction with the design process, provides the basis for COTS components usage.\" \n\nThe applicant should ensure that an electronic component management process exists to address the selection, qualification, and configuration management of COTS devices.",
    "The electronic component management process should also address the access to component data such as the user manual, the datasheet, errata, installation manual, and access to information on changes made by the component manufacturer.",
    "As part of the electronic component management process, for devices contributing to hardware DAL A or B functions, the process for selecting a complex COTS device should consider the maturity of the COTS \ndevice and, where risks are identified, they should be appropriately mitigated. \n\nNote: Recognized industry standards describing the principles of electronic component management may be used to support the development of the electronic component management process. See AC 00-72.",
    "## 64.1.1 Using A Device Outside Ranges Of Values Specified In Its Datasheet\n\nThe device reliability is established by the device manufacturer through the device qualification process. (See definition of \"qualification of a device\" in the glossary.) ED-80/DO-254, Section 11.2.1, Item 6 mentions that a device is selected based on the technical suitability of the device for the intended application.",
    "In some cases, the applicant may need to use the device outside the specified operating conditions guaranteed by the device manufacturer. \n\nED-80/DO-254, Section 11.2.1, Item 4 and Item 6 should be addressed when the device is used outside its guaranteed specification. The following objective describes what to achieve when using a device outside the ranges of values specified in its datasheet.",
    "When the complex COTS device is used outside the limits of the device manufacturers specification (such as the recommended operating limits), the applicant should establish the reliability and the technical suitability of the device in the intended application. \n\n## 6.4.1.2 Considerations When The Cots Device Has Embedded Microcode\n\nCOTS devices may need microcode to execute some hardware functions.",
    "COTS devices may need microcode to execute some hardware functions. \n\nWhen those functions are used by the applicant, there is a risk if the microcode has not been verified by the device manufacturer during the COTS device qualification, or if the microcode is proposed to be modified by the applicant.",
    "If the microcode is delivered by the device manufacturer, is controlled by the device manufacturer's configuration management system, and is qualified together with the device by the device manufacturer, it is accepted that the microcode is part of the qualified COTS device. If the microcode is not qualified by the device manufacturer or if it is modified by the applicant, the microcode will not be considered to be part of the qualified COTS device.",
    "If the microcode is not qualified by the device manufacturer or if it is modified by the applicant, the applicant should ensure that a means of compliance for this microcode integrated within the COTS device is proposed by the appropriate process and is commensurate with the usage of the COTS \ndevice. \n\nNote: the PHAC (or any other related planning document) should document the existence of the microcode and refer to the process \n(hardware, software, system) where it is addressed.",
    "## 6.4.2 Cots Device Malfunctions\n\nSome COTS devices may contain errors that may or may not have been detected by the device manufacturer. \n\nThe applicant should assess the errata of the COTS \ndevice that are relevant to the use of the device in the intended application and identify and verify the means of mitigation for those errata. If the mitigation means is not implemented in hardware, the mitigation means should be fed back to and verified by the appropriate process.",
    "Note: The above objective refers to any mitigation means (such as hardware, software, system, or other means.) \n\nThe applicant should identify the failure modes of the used functions of the device and the possible associated common modes, and feed both of these back to the system safety assessment process. \n\n## 6.4.3 Usage Of Cots Devices",
    "## 6.4.3 Usage Of Cots Devices\n\nThis section focuses on the usage of complex COTS devices, while Section 7 covers the overall circuit board assembly development process. This Section refers to the term \n\"intended function of the hardware,\" which is considered to be defined through the CBA development process.",
    "Complex COTS devices can have multiple functions and many configurations of those functions. The configuration of a device should be managed in order to provide the ability to consistently apply the required configuration settings, to replicate the configuration on another item, and to modify the configuration in a controlled manner, when modification is necessary. \n\nThe configuration of the device addresses at least the following topics:",
    "e \nUsed functions (e.g., identification of each function, configuration characteristics, \nmodes of operation), \ne \nUnused functions and the means (internal/external) used to deactivate them, \ne¢ \nMeans to control any inadvertent activation of the unused functions, or inadvertent \ndeactivation of the used functions, \ne \nMeans to manage device resets, \ne \nPower-on configuration, \ne \nClocking configuration (e.g., identification of the different clock domains), and \n¢",
    "e \nClocking configuration (e.g., identification of the different clock domains), and \n¢ \nOperating conditions (e.g., clock frequency, power supply level, temperature, etc.). \nThe applicant should ensure that the usage of the COTS \ndevice has been defined and verified according to the intended function of the hardware. This also includes the hardware-sofiware interface and the hardware to (other) hardware interface.",
    "When a COTS device is used in a hardware DAL A or B function, the applicant should show that unused functions of the COTS \ndevice do not compromise the integrity and availability of the COTS device's used functions. \n\nNote 1: For unused functions of the COTS \ndevice, it is recommended that an effective deactivation means is used and verified, when available. \n\nNote 2: Verification should be performed at an appropriate level (hardware, software, equipment).",
    "Note 2: Verification should be performed at an appropriate level (hardware, software, equipment). \n\nED-80/DO-254, Section 10.3.2.2.4 introduces hardware/software (HW/SW) interface data, which can be used as a reference to define the software interface data of the COTS \ndevice. \n\nSome additional consideration should be given to the critical configuration settings.",
    "Some additional consideration should be given to the critical configuration settings. \n\nThose are defined as the settings that are deemed necessary by the applicant for the proper usage of the hardware, which, if inadvertently altered, could change the behavior of the COTS device, causing it to no longer fulfill the hardware intended function.",
    "If the complex COTS device contributes to DAL A or B functions, the applicant should develop and verify a means that ensures an appropriate mitigation is specified in the event of any inadvertent alteration of the \"critical configuration settings\" of the COTS \ndevice. \n\nNote: The mitigation means might be defined at the hardware, software, or system level, or a combination of these. The mitigation means may also be defined by the safety assessment process.",
    "## Development Assurance Of Circuit Board Assemblies (Cba)\n\nThis section provides guidance for the development assurance of CBA (a board or a collection of boards). \n\n## Applicability 7A\n\nSection 7 is applicable to CBA that contribute to hardware DAL A, B, or C functions. \n\n## Development Assurance Of Circuit Board Assemblies 7.2",
    "While it is already a common practice for applicants to have an internal process to address the development of CBA, it is necessary to clarify the expectations for development assurance, including the flow down of the equipment/system requirements to the hardware. For consolidation of the development and/or the use of complex devices, it is essential to ensure consistency in the overall development assurance approach for the hardware domain. Moreover, definition of the CBA function is also",
    "assurance approach for the hardware domain. Moreover, definition of the CBA function is also necessary to enable the allocation of requirements and their flow-down to the complex devices.",
    "## Objective Cba-1\n\nThe applicant should have a process to address the development of circuit board assemblies that contain complex custom devices or complex COTS devices, in order to ensure that the CBA performs its intended function. The process should include requirements capture, validation, verification, and configuration management activities, and ensure an appropriate flow down of requirements. See AC 00-72 for additional information.",
    "Note: The applicant's process to address the development of the circuit board assembly may be defined together with the equipment process, when relevant. \n\n## Related Regulatory, Advisory, And Industry Material Title 14 Of The Code Of Federal Regulations (14 Cfr) Applicable Sections 8.1",
    "This AC provides guidance on development of an acceptable means of compliance to the following regulations, with respect to AEH development assurance: 14 CFR parts \n21, 23, 25, 27, 29, 33 and 35 (principally, §§ 21 subpart O, 23.2500, 23.2505, 23.2510, \n25/27/29.1301, 25/27/29.1309, 33.28, and 35.23). \n\n## Faa Advisory Circulars 8.2",
    "e \nAC 00-72, Best Practices for Airborne Electronic Hardware Design Assurance \nUsing EUROCAE ED-80() and RTCA DO-254(). \ne \nAC 20-174, Development of Civil Aircraft and Systems. \ne \nAC 21-50, Installation of TSOA Articles and LODA Appliances. \ne¢ \nAC 23.1309-1, System Safety Analysis and Assessment for Part 23 Airplanes. \ne \nAC 23.2010-1, FAA Accepted Means of Compliance Process for 14 CFR Part 23. \ne¢ \nAC 25.1309-1, System Design and Analysis. \ne",
    "e¢ \nAC 25.1309-1, System Design and Analysis. \ne \nAC 27-1, Certification of Normal Category Rotorcraft (Changes 1-8 \nincorporated). \ne \nAC 29-2, Certification of Transport Category Rotorcraft (Changes 1-8 \nincorporated). \ne \nAC 33.28-1, Compliance Criteria \nfor 14 CFR § 33.28, Aircraft Engines, Electrical \nand Electronic Engine Control Systems. \nAC 33.28-2, Guidance Material for 14 CFR 33.28, Reciprocating Engines, \nElectrical and Electronic Engine Control Systems. \ne",
    "Electrical and Electronic Engine Control Systems. \ne \nAC 33.28-3, Guidance Material for 14 CFR § 33.28, Engine Control Systems. \ne \nAC 35.23-1, Guidance Material \nfor 14 CFR 35.23, Propeller Control Systems.",
    "## 8.3 Easa Acceptable Means Of Compliance (Amc)\n\nAMC 20-152(), Development Assurance for Airborne Electronic Hardware. \n\n## 8.4 Industry Documents",
    "e \nSAE International Aerospace Recommended Practice (ARP) 4754A, Guidelines for \nDevelopment of Civil Aircraft and Systems, dated December 21, 2010. \ne \nSAE International Aerospace Recommended Practice (ARP) 4761, Guidelines and \nMethods for Conducting the Safety Assessment Process on Civil Airborne Systems \nand Equipment, dated December 1, 1996. \ne \nEUROCAE ED-79A, Guidelines for Development of Civil Aircraft and Systems, \ndated December 1, 2010. \ne",
    "dated December 1, 2010. \ne \nRTCA DO-254, Design Assurance Guidance for Airborne Electronic Hardware, \ndated April 19, 2000. \ne \nEUROCAE ED-80, Design Assurance Guidance for Airborne Electronic \nHardware, dated April 2000.",
    "## 9 Where To Find This Ac.\n\nYou may find this AC at http://www.faa.gov/regulations_policies/advisory_circulars/ If you have suggestions for improving this AC, you may use the Advisory Circular Feedback form at the end of this AC. \n\nDigitally signed by VICTOR W WICKLUND \nDate: 2022.10.07 \nS \n14:15:51 -07 00\" \nVictor Wicklund Acting Director, Policy and Innovation Division Aircraft Certification Service \n\n## Appendix A. Glossary",
    "## Appendix A. Glossary\n\nAbnormal conditions - Conditions that are inconsistent with specified normal operating conditions. \n\nAirborne electronic hardware - An electronic \"hardware item\" (see ED-80/DO-254 for definition of \"hardware item') intended to be installed in airborne equipment/systems. \n\nBatch - A manufacturing lot of a semiconductor device that is reproduced using the same semiconductor fabrication process.",
    "Commercial off-the-shelf (COTS) device - A device, integrated circuit or multi-chip module developed by a supplier for a wide range of customers (not restricted to airborne systems), whose design and configuration is controlled by the supplier or an industry specification.",
    "A COTS \ndevice can encompass digital, analog, or mixed-signal technology. COTS electronic components are generally developed by the semiconductor industry for the commercial market, not particular to the airborne domain. These devices have widespread commercial use and are developed according to the semiconductor manufacturer's proprietary development processes.",
    "COTS device usage - Definition of the used and unused functions that are implemented in the device. This is further defined as an exhaustive list of conditions/constraints (such as configuration settings, usage rules, protocol, timing constraints, input output (IO) interface, and addressing schemes) associated with the performance characteristics of the used COTS",
    "functions. Respecting the defined usage of the COTS will ensure the expected performance of the device for a given set of constraints.",
    "Commercial-off-the-shelf intellectual property (COTS IP) - Intellectual property (IP) refers to design functions (design modules or functional blocks, including IP libraries) used to design and implement a part of or a complete custom device such as a PLD, FPGA, or an ASIC.",
    "Intellectual property is considered to be \"COTS IP\" when it is a commercially available function, used by a number of different users in a variety of applications and installations. In this document, the terminology \"a/the COTS IP\" refers to a piece of hardware that is COTS IP per this definition. COTS IP is available in various source formats: \na.",
    "Soft IP \nSoft IP is COTS IP defined as register transfer level (RTL) code, captured in an HDL \nsuch as Verilog or VHDL, that may be readable or encrypted. It is instantiated by the IP \nuser within the custom device HDL code or by selecting the COTS IP function in a library. Soft IP will be synthesized, placed and routed in the AEH custom device. \n\nIn this document, the terminology \"a/the Soft IP\" refers to a piece of hardware that is Soft IP per this definition. \n\nb.",
    "b. \n\nFirm IP \nFirm IP is COTS IP defined as a technology-dependent netlist. It is instantiated within the custom device netlist (inserted by the user, called from a library, or selected by the user as a library function). Firm IP will be placed and routed in the AEH custom device In this document, the terminology \"a/the Firm IP\" refers to a piece of hardware that is Firm IP per this definition.",
    "c. \nHard IP \nHard IP is COTS IP defined as a physical layout (stream, polygon, GDSII format, etc.). \nHard IP is instantiated by the IP user during the physical design layout stage; \nalternatively, Hard IP is embedded into the silicon of the FPGA/PLD by the FPGA \nprovider/device manufacturer. \n\nIn this document, the terminology \"a/the Hard IP\" refers to a piece of hardware that is Hard IP per this definition.",
    "Complex COTS device maturity - A complex device is mature when the risk of an unintended function or misbehavior is low. The risk of anomalous behavior decreases as a device is widely used and device errata are documented and communicated to the users of the device.",
    "Critical configuration settings - Those configuration settings that the applicant has determined to be necessary for the proper usage of the hardware, which, if inadvertently altered, could change the behavior of the COTS device, causing it to no longer fulfil its intended function.",
    "Development assurance for use of COTS device - All the planned and systematic activities conducted to provide adequate confidence and evidence that the complex COTS device safely performs its intended function under its operating conditions. \n\nHardware design assurance level of a function - Refer to ED-80/DO-254, Table 2-1 for the definition of DAL A, B, C, and D functions. \n\nHybrid device - An integrated circuit combining different semiconductor dies and passive components on a substrate.",
    "TP libraries - \"IP libraries\" used in the COTS IP definition refers to all sub-modules, subblocks, or other design sub-functions that are formally/commercially made available by a COTS \nIP provider and intended for integration within a COTS IP by the COTS IP user. However, Macro Cells for FPGAs or Standard Cells for ASICs are not considered to be IP libraries, hence they are not related to the COTS IP topic referred to in this document.",
    "Microcode - This term often refers to a hardware-level set of instructions. It is typically stored in the COTS device's high-speed memory, and microcode instructions are generally translated into sequences of detailed circuit-level operations. Microcode may be used in general-purpose microprocessors, microcontrollers, digital signal processors, channel controllers, disk controllers, network interface controllers, network processors, graphics processing units, and other hardware.",
    "A Basic Input/Output System (BIOS) is an example of microcode, which is used to initialize microprocessor input and output process operations.\n\nMixed-signal device - A device that combines digital and analog technologies. \n\nNote - A note in this document is supporting information used to provide explanatory material, emphasize a point, or draw attention to related items which are not entirely within context.",
    "Objective - An objective in this document is a requirement for development assurance that should be met to demonstrate compliance with the applicable airworthiness requirements. \n\nPreviously developed hardware (PDH) - A custom-developed hardware device that has been installed in an airborne system or equipment either approved through FAA type certification \n(TC/STC) or authorized through FAA TSOA.",
    "Qualification of a device \n- SAE EIA-STD-4899 defines component qualification as \"The process used to demonstrate that the component is capable of meeting its application specification for all the required conditions and environments.\" Component qualification results in a \"qualified device.\" Note that the use of \"qualification\" is not intended to refer to ED-14/DO-160 environmental qualification testing.",
    "(OMB Control Number: 2120-0748 \nExpiration Date: 11/20/2028",
    "APPENDIX B. Advisory Circular Feedback Form Paperwork Reduction Act Burden Statement: A federal agency may not conduct or sponsor, and a person is not required to respond to, nor shall a person be subject to a penalty for failure to comply with a collection of information subject to the requirements of the Paperwork Reduction Act unless that collection of information displays a currently valid OMB Control Number. The OMB Control Number for this information collection is 2120-0746. Public",
    "OMB Control Number. The OMB Control Number for this information collection is 2120-0746. Public reporting for this collection of information is estimated to be approximately 20 minutes per response, including the time for reviewing instructions, searching existing data sources, gathering and maintaining the data needed, completing and reviewing the collection of information.",
    "All responses to this collection of information are voluntary FAA Order 1320.46D Send comments regarding this burden estimate or any other aspect of this collection of information, including suggestions for reducing this burden to: \nInformation Collection Clearance Officer, Barbara Hall, 800 Independence Ave, Washington, D.C. 20590.",
    "If you find an error in this AC, have recommendations for improving it, or have suggestions for new items/subjects to be added, you may let us know by (1) emailing this form to ( \n) or \n(2) faxing it to the attention of the LOB/SO ( \n). \n\nSubject: \nPlease mark all appropriate line items:",
    "Subject: \nPlease mark all appropriate line items: \n\nO An error (procedural or typographical) has been noted in paragraph. \non \npage. \n. \nO Recommend paragraph. \non page \nbe changed as follows: \nO Ina future change to this AC, please cover the following subject: \n(Briefly describe what you want added.) \nO Other comments: \nO Iwould like to discuss the above. Please contact me. Submitted by: \nDate:"
  ]
}