{
  "source": "AIA NAS NAS806-1950 R1991.md",
  "chunks": [
    "## Specification - Aircraft Seats And Bef˓Ths\n\nThis specification defines the mini­\nmum performance and safety standards \nfor seats and berths to be installed \nin certificated aircra..rt. \n\n## Applicable Specifications Q) Cancelled After 9 Oc'Idber 1991 No Superseding Standard L,",
    "## Applicable Specifications Q) Cancelled After 9 Oc'Idber 1991 No Superseding Standard L,\n\nl,l The latest issue and amendment of the following documents a.re ma.de a \npart of this specification by reference to the applicable sections \nhereinafter noted. \nl.l.l CAA Safety; Regulation Release No, 259. \"Compliance of Equip­\nment aoo Materials Used in Air Carrier Aircraft with Fire Prevention Requirementsn. \n\n## Types 2.",
    "## Types 2.\n\n2.1 This specification covers all types of crew and passenger seats and \nberths for civil aircraft use in the following categories: \n\n## 3. Ma.Te..'Iua.L And Workmanship",
    "3,1 Materials shall be of a quality 'Which experience aniJ./or tests have \nconclusively demonstrated to be suitable for use in aircraft seats \nand berths. Worlona.nship shall be consistent with high-grade air­\ncraft manufacturing practice. \n3,l.l Protection: All members of the structure shall be suitably \nprotected against deterioration or loss of strength in ser­\nvice due to weathering, corrosion, abrasion or other causes \nwhere the type of material requires such protection,",
    "where the type of material requires such protection, \n3.1.2 Fire Precaution: The covering and upholstery and all other \nexposed material used in the seat or berth shall have name­\nresistant properties as specified by CAA Safety Regulation \nRelease No. 259. If ashtrays are installed in, or attached \nto, the seat or berth, they shall be of a self-contained, \ncompletely removable type.",
    "DEI'AIL REQUIREMENTS \nINACTIVE FOR NEW DESIGN \n\nCUSTODIAN NATIONAL AEROSPACE STANDARDS COMMITTEE \n\n## Specification - Aircraft Seats Alld Berths\n\nUSE OF OR RELIANCE UPON THIS DOCUMENT OR ANY NATIONAL AEROSPACE STANDARD IS ENTIRELY VOLUNTARY. AIA DOES NOT QUALIFY SUPPLIERS OR \nCERTIFY CONFORMANCE OF ITEMS PRODUCED UNDER NATIONAL AEROSPACE STANDARDS. AIA MAKES NO REPRESENTATION OR CLAIM RESPECTING (1) \n\n# (D Cancelled After 9 October 1991 No Superseding Standard",
    "4.1.1 Generals The seat shall be designed so that in anr or its \nadjustable positions **and** when installed facing in a specified \ndirection or directions, it will pro7ide protection tor the \noccupant in a manner compatible with the .function tor which \nthe seat is designed, i.e., pilot, cabin attendant, check \npilot, passenger, and the like. \n4.1.2 ̺trength: All seats o.nd be1·ths intenaed for single occupancy \nshall be designed for the ultimate loads specified in Table",
    "shall be designed for the ultimate loads specified in Table \nI to which occupants are subjected. The loads shall be con­\nsidered as acting separately and shall be based on a passen­\nger weight of 170 pounds for Type I and 190 pounds (includes \nparachute) tor Types II and III. The sideward, upward and \ndownward loads, as specified in Table I, are the minimums \ncorresponding to fiight and groum load conditions prescrib­\ned in the applicable Civil Air Regulations. The forward",
    "ed in the applicable Civil Air Regulations. The forward \nloads correspond to the emergency conditions **prescribed** in \nthe applicable Civil Air Regulations. For seats intended \ntor multiple occupancy the loads must be increased accord­\ningly. Ultimate loads are 1.5 times the limit loads \n-",
    "Type I \nType II* \nType III \nForce \nDire:ction \n1710 lbs. (9.0 g) \n285 lbs. (1.5 g) \n855 lbs. (4.5 g) \n1710 lbs. (9.0 g) \nForwe.rd \nSideward \nUpward \nDownward \n1710 lbs. (9.0 g) \n285 lbs. (1.5 g) \n570 lbs. (3.0 g) \n1254 lbs. (6.6 g) \n1020 lbs. (6.o g) \n255 lbs. (1.5 g) \n340 lbs. (2.0g) \n765 lbs. (4.5 g) \n\n*Civil Air Regulations require use of parachute 1n utility­\ncategory aircraft operated 1n acrobatic fiight **when** carry­\ning passengers.",
    "4.1.2.l Ult.1mrrt.e Load Strength: The seat or berth 1n arq \nof its adjustable positions while installed..tacina \nin a specified direction or directions, when occu­\npied by ma.xi.mum number of occupants, shall be cap­\nable of withstanding ultimate loads without failure \nfor at lee.st three (3) seconds. \n4.1.2.2 J,1rn1t Load Strengths The seat or berth 1n ar:,y ot",
    "for at lee.st three (3) seconds. \n4.1.2.2 J,1rn1t Load Strengths The seat or berth 1n ar:,y ot \nits adjustable positions shall be capable ot withstanding the limit loads without suffering detrimental permanent deformation. At all. loads up to \n# (D Cancelled After 9 Oc'Idber 1991 No Superseding Standard",
    "these limit loads the deformation shall be such as \nnot to interfere њTith safe operation of the air­\nplane. \n         {Note: \n                 this limit load requirement is not \napplicable to the forward loading since it is an \nemergency condition).",
    "4.1.3 Safetv Belt Ancho_rages: vihen anchorages for safety \nbelts are provided thqy shall be of a type which \nwill pero1it self-nli&,rning of the belt and fitting. \n4.1.4 Should.!'r Harness Anchorages: When anchorages for \nshoulder harnesses are provided, they shall be so \nlocated ns to ensure they will be ahove the shoul­\nder level of the occupant. \n4.1.5 Projectionћ: The surfaces of the seat shall be \nfree from sharp e<lges or ќny projections which may",
    "free from sharp e<lges or ќny projections which may \nchafe the safety belt or harness webbing. Projec­\ntions, sharp corners, and other hazardous features, \nagainst which occupants :n..'1y be tr..rmm during a \ncrash, shall be avoided insofar as possible. Any \nunavoidable features of this nature shall be ade­\nquately padded. \n4.2 Mc'lr'king: \nEach seat or berth shall be legibly and permanently marked with the following information: \nManufacturer's Name Model Number or Model Name \nSeat Type",
    "Manufacturer's Name Model Number or Model Name \nSeat Type \nSerial Number or Date of Manufacture \nNational Aircraft Standard Humber (NAS_) \n4 - \n.3 Qu.a.lifioa.tion Tests: \nTests :;:hall be conducted as necessary \nto demonstrate the following: \n(a) that seats or berths \nmanufactured in accordance with this specification are cap­\nable of supporting the limit loads without detrimental \npermanent deformation; (b) that, at all loads up to limit",
    "permanent deformation; (b) that, at all loads up to limit \nloads, the deformation shall be such as not to interfere \nwith the safe operation of the aircraft; and (c) that the \nstructure is capable of supporting the ultimate loads speci­\nfied herein without failure for at least 3 seconds. \n4.3.1 Detail Qualification Test Reauirements: \nThe seat \nor berth shall be loaded in tests such that the \nloads imposed on the sea.t or berth by the occupant(s)",
    "loads imposed on the sea.t or berth by the occupant(s) \nin conjunction with the safety belt or belts and \ntheir attachments are accurately simulated by means \nof a block or frame or duruny, said block or frame or \nCERTIFY CONFORMANCE OF ITEMS PRODUCED UNDER NATIONAL AEROSPACE STANDARDS. AIA MAKES NO REPRESENTATION OR CLAIM RESPECTING (11",
    "## (D Cancelled After 9 Oc'Iober 1991 No Superseding Standard\n\ndU111D1 being restrained in the seat or berth bf the \nbelt or belts attached to their fittings. The \nteats may be conducted in a jig simulating installa­\ntion conditions.",
    "4.3.1.l When a seat or berth is to be installed or \nadjuats to face in other than the forward \ndirection, su:f\"tioient tests shall be made \nto substantiate the seat strength tor \"11 \nintended positions. \n4.3.1.-2 When testing for a particular load condi­\ntion ot a vertically or horizontally ad­\njustable seat, the most critical seat posi­\ntion associated with that load shall be \nused tor the test• \n4.3.,l •. \n3 Where the safety belt or belts or harnesa \nare not attached to the seat oi: berth",
    "4.3.,l •. \n3 Where the safety belt or belts or harnesa \nare not attached to the seat oi: berth \nstructure, the seat or berth shall be \ntested tor the loads which would be im­\nposed on such installation. \n4.3.2 Flame-Resistance Test or Seat Coverst Specimens of \nthe seat covering and upholstery- shall meet the tests outlined in CAA Safety Regulation Release Mo. 259. \nCERTIFY CONFORMANCE OF ITEMS PRODUCED UNDER NATIONAL AEROSPACE STANDARDS. AIA MAKES NO REPRESENTATION OR CLAIM RESPECTING 11)"
  ]
}