{
  "source": "AIA NAS NAS 808-1951 R1991.md",
  "chunks": [
    "## Sp'Exjificat!On - Aircraft Skis\n\nThis specification defines the \nmin:imum requirements for air­\ncraf't skis suitable for use on \ncivil aircraf't. \n\n## Applicable Sp'Exjifications\n\n1.1 The applicable sections of the latest issue and amemment of ANC-5 \nStrength of Metal Aircraf't Elements am ANC-18 Design of Wood Air­\ncraf't Structures - are made a part of this specification as herein­\nart \ner noted. \n2.1 This specification provides design criteria for skis tor use on \ncivil aircraf't.",
    "## 3. Ma.Tmlial And Workmanship\n\nAll materials used in the ski assembly shall be of a quality which ex­\nperience or tests have demonstrated to be suitable am dependable for use in aircraf't skis am shall conform to specifications which will insure their having the strength and other properties assumed in the design. All workmanship shall be consistent vith high-grade aircraf't ski manufacturing practice.",
    "3.1 Fabrication Methods: The methods of fabrication employed in \nthe construction of the ski assembly shall be such as to pro­\nduce consistently sound structures. When a fabrication process \nrequires close control to attain this objective, the process \nshall ·be performed in a manner for which suitability am depend­\nability have been established on the basis of experience or tests. \n3.2 stamard Fastenings: All bolts, pins, screws, and rivets used in",
    "3.2 stamard Fastenings: All bolts, pins, screws, and rivets used in \nthe ski assembly shall be of a type the suitability and depend­\nability of which have been demonstrated by experience or tests. \nThe use of a suitable and dependable locking device or method is \nrequired for all such bolts, pins, screws. Self-locking nuts \nshall not be used on bolts subject to rotation. \nJ.3 Castings: All castings shall be of high quality, clean, soum, \nand f'ree from blow holes, porosity, or surface defects.",
    "and f'ree from blow holes, porosity, or surface defects. \n3.4 Protection: All members of the ski assembly shall be suitably \nprotected against deterioration or loss of strength in service \ndue to weathering, corrosion, abrasion, or other causes.",
    "## Sp'Exjification - Aircraft Skis",
    "ysE OF j:)R \n                                       _RE¹IA.,NCE UºON :rH.tS DQCUMENT \n                                                                           »R ANY.. NATIONAL AERQSPAC.1' STANDARD IS ENTIRELY VOLUNTARY. AIA DOES NOT QUALIFY SUPPLIERS OR \nCOPYRIGHT Aerospag.§lT,l.in.d_µ_5,t;\n                                          s",
    "COPYRIGHT Aerospag.§lT,l.in.d_µ_5,t;\n                                          s\n                                          i;:,i;¼½\"'1¾¿À(;)G;J.!'9,(;Á.1[0.J;1.>c:Ât;Elln!Ã.ÄÅqaJATltl;l;ÆÇ A((iJ:,hÈÉÊ-%JiANDARDS AIA MAKES NO REPRESENTATION OR CLAIM RESPECTING (1) \nLicensed by InfomËftlJililin\\E'Harrd;rfllJ.i§''.1/slwv<Ilci:e\\sb.RTICULAR APPLICATION, OR (2) THE EXISTENCE OF OR",
    "0 \n                                                                                                                            APPLICABILITY THERETO OF PATENT OR TRADEMARK RIGHTS.",
    "()",
    "3.5 Inspection Provisions: Adequate means shallÞbe provided to permit \nthe close examination of such parts of the ski assembly as require \nperiodic inspection, adjustments for-proper alignment and function­\ning, and lubrication of moving parts. \n3.6 Identification: F.ach·aircrai't ski shall be suitably placarded with \nthe following information:",
    "Manufacturer's Name \nSki Model \nMaximum Limit Load in Powxls \nSerial No. and Date of Manufacture \nNAS Spec \n•. No. \n\"For Installation Geometry, see \nSki Installation Drawing No. _ \n- \n\nThese markings shall be displayed in a conspicuous place on the ski and shall be of such character that they·will not be obliterated or effaced as a result of service usage. \n\n## 4. Detail Requirements 4.1 Design",
    "## 4. Detail Requirements 4.1 Design\n\n4.l.1 . If safety cables are used, separate **means.** of attaching the \ncables shall be provided at the forward and af't ends of \nthe ski. In designs on which a tension cord is used, the \ncord shall be attached to a point on the ski different \nfrom that to which the safety cable is attached. \n\n## 4.2 Strength",
    "4.2.1 Material Strength Properties: The sßàength properties of \nthe materials used shall be based on a ·suffiqient number \nof tests of material to establish design **values** on a statistical basis. The values contained in Aá5 and \nANC-18 shall be used unless shown to be inapplicable ·1n \na particular case. The design values shall be so chosen \nthat the probability of any ski assembly being wxler­\nstrength because of material variations is extr-.ely",
    "strength because of material variations is extr-.ely \nremote. When.- consideration of the design for fatigue \n·conditions may be important, the ski assembly shall be \ndesigned, insofar as practicable, to avoid points of \nstress concentration. \n4.2.2 The strength of the ski, including the pedestal• shall be \nsubstantiated by a stress analysis or by static tests to \nultimate load.",
    "o 1-----------------------------,-----\n-=-r:-:,.,, \n                                                                             ... \n                                                                              :;::.,o:::: \n                                                                                .. \n                                                                                -.  ____ \n                                                                                          ...,",
    "TITLE \n                                             Specification \n\nD: \nCL \n< \nSPIDIFICATION - AâCRAF'l' SKIS \n\n# . . Aircraft Industries Association Of America, Inc .. E10 Shoreham Building, Washington !5, D. C.",
    "4.2.2.1 Structural or stress analysis may be used for sub­\nstantiation only when the structure conforms with \ntypes for which experience has shown such methods \nto be reliable. \n4.2.3 Loads: \nStrength requirements are specified in terms of \nlimit and ultimat_e loads. Limit loads are .the maximum loads \nanticipated in service. Ultimate loads are equal to the \nlimit loads multiplied by the factor of safety and in certain \ncases by an additional special factor as noted below. Unless",
    "cases by an additional special factor as noted below. Unless \notherwise noted, loads specified are limit loads. \n4.2.4 Factor of Safety: \nThe factor of safety shall be 1.5. \n4.2.4.1 Special Factors: \nWhen the¾e may be uncertainty con­\ncerning the actual strength of particular parts of \nthe ski assembly or when the strength is likely ·to \ndeteriorate in service prior to norool replacement, \nadditional factors of safety shall be provided to insure that the strength and reliability of such",
    "additional factors of safety shall be provided to insure that the strength and reliability of such \nparts are not less than the rest of the ski assembly. \nThe following special factors shall be c·onsidered for \nboth stress ·analysis and static tests, When several \nfactors are involved, only the largest factor need be \nused. (See following note)",
    "| Note: ¿ial Factor Exanples:                     | The ultilllate load    |\n|-------------------------------------------------|------------------------|\n| for a casting equals the limit load times 1.5   |                        |\n| times the apnropriate casting factor specified  |                        |\n| in 4.2.4.l(a), (1) or (2).                      |                        |\n| z                                               |                        |",
    "| z                                               |                        |\n| 0                                               |                        |\n| iii                                             |                        |\n| 0::                                             |                        |\n|                                                 |                        |\n| The ultimate load fo':' a casting when consider­ |                        |",
    "| The ultimate load fo':' a casting when consider­ |                        |\n| ing casting, bearing and/or fitting factors     |                        |\n| equals the limit load times 1.5 times the       |                        |\n| largest special factor involved. This special   |                        |\n| factor will be 2.0 if section 4,2.4.l(a)(l) is  |                        |\n| pertinent or 1.25 if section 4,2.4,l(a)         | (2) is                 |",
    "| pertinent or 1.25 if section 4,2.4,l(a)         | (2) is                 |\n| pertinent, unless the bearing factor is larger. |                        |\n| Since the fitting factor of 1.15 is less than   |                        |\n| either of                                       | ·                      |\n| the above two casting factors, it               |                        |\n| ceases tÀ be critical and may be ignored.       |                        |",
    "## Casting Factors\n\n(a) \n;Q \nI \nC\\I \n.-l \n(1)- If visual inspection only is to be employed, the \nspecial factor shall be 2.0. \nTITLE \nLI.I \n \nQ \n-I \n< \n> \n0 \nD: \nQ. Q. \n< \nSPECIFICATI0Á- AIRCRAFI' SKIS \n\n# Aircraft Industries Association Of America, Inc.. 610 Shoreham Building, Washington 15, 0, C.\n\n(2) \nThe special factor may be reduced to 1.25 for",
    "(2) \nThe special factor may be reduced to 1.25 for \n\n| u1                                               |\n|--------------------------------------------------|\n| least three sample castings are tested to shc,w  |\n| compliance with these factors, ani if all sample |\n| am production castings are determined to be ac­   |\n| ceptable upon ccmpletion of a visual and radio­   |\n| graphical inspection.                            |",
    "(b) Bearing Factors \nThe factor of safety in bearing at bolted or pinned joints shall be in accordance with those bearing factors specified in ANC-5. \n\n(c) Fitting Factor \nFittings are defined as parts such as end term.ina:Ls used to join one structural member to another.",
    "A \nmultiplying factor of safety of at least 1.15 shall be used in the analysis of all fittings the strength of which is not proved by limit and ultimate load tests in which the actual stress conditions are simu­\nlated in the fitting and the surrounding structure. \n\nThis factor shall be applied to all portions of the fitting, the means of attachment, and bearing on the members joined. \n\nThe fitting factor need not be applied if a type of joint design based on compre­\nhensive test data is used.",
    "4. \n2.5 Strength and Defonnation: \nThe ski assembly shall be capable of \nsupporting limit loads without suffering detrimental permanent \ndeformations. \nAt all loads up to the limit loads, the deforma­\ntion shall be such.as not to interfere with safe operation of the aircraft on which the sld. is to be used. \nThe ski assembly \nshall be capable of supporting ultimate loads without failure \nfor at least three secon:is, unless proof or strength is demon­",
    "for at least three secon:is, unless proof or strength is demon­\nstrated by dynamic tests simulating actual conditions of load \napplication.",
    "## Rating Qualifications\n\n5.1 Ratings: \nThe ski manufacturer. shall select the maximwn limit load \nfor which the ski asser.ibly will be rated. \n\n## Specification - Aibcraft Skis\n\nNAS 80_8 \nTHII DRAWING 9Ul'ER■EDH ALL ANTEC:Elll!NT ■TAHDARD DllAWING■ P-OR THII ■A \n.. \n\nE l'RODUC:T, AND ■HALL ■_ECOMll &P\"l'ECTIVll",
    "E l'RODUC:T, AND ■HALL ■_ECOMll &P\"l'ECTIVll \n\n                                ,011 VENDOR .. \n                                               ANUP\"AClURCIIS NOT LATER THAN - M:)NTH■ APTER THIE LATE■T DATE OP\" j'l'l'IIOYAL ■HOWH, \nCOPYRIGHT Aerospace Industries Association of America, Inc. \n                                                                               (AIA/NAS) \nLicensed by Information Handling Services",
    "AIRCRAFT INDUSTRIES ASSOCIATION OF AMERICA, INC \n.. 610 SHOREHAM BUILDING, WASHINGTOl',I 5. D. C. \n\n(a) \nEach design of ski assembly shall be substanȮiatea as \ndescribed herein to establish the following selected \nrating: \n$$\\mathbf{L}=\\mathbf{\\Lambda}\\mathbf{\\Lambda}\\mathbf{\\Lambda}\\mathbf{\\Lambda}\\mathbf{\\Lambda}\\mathbf{\\Lambda}\\mathbf{\\Lambda}\\mathbf{\\Lambda}\\mathbf{\\Lambda}\\mathbf{\\Lambda}\\mathbf{\\Lambda}\\mathbf{\\Lambda}$$",
    "Note: \n        In order for the ski t0 be eligible for installation on \nanȯ• Ȱiven model aircraft, the maxinrum limit load (L) shall be \nat least equal to S x fl where 11s11 is the maximum static load \nand/'/ is the limit land:ing load factor previously determined \nfrom static drop tests of the airplane by the aircraft manu­\nfacturer. \n             In lieu of a value of fl determ:ined from such drop \ntests, a value of 11 determ:ined from the follovt:ing formula may \nbe used:",
    "tests, a value of 11 determ:ined from the follovt:ing formula may \nbe used: \n             9000 \nfl = 2.80 + -.-,--,.-= \n                       where W is the weight of the aircraft. \n           w + Looo",
    "5.2 Loading Requirements: The ratings for ski assemblies shall be sub­\nstantiated for the following conditions: \n(a) \nDistributed Up Load \n(b) \nConcentrated Up Load \n(c) \nDistributed Side Load \n(d) \nConcentrated Side Load \n5.3 Test Requirements and Methods: \nThe ski assembly shall be ȱestigated \nfor limit and ultimate loads as set forth below. \nThe pedestal type ski, including the pedestal, shall be designed to withstand the loads when supported at the pedestaj_ bearing· sleeve.",
    "In the case of the c_lamp-on ski:",
    "(a) \nThe ski assembly shall be supported at those p) aces on the \ncradle which will trans::tl.t the test loads as they would be \nimposed dur:ing ground operation. \n(b) \nIf a Tiheel and tire combination is used as a means of support, \nsinrJlat:ing an actual installation of the ski assembly, steps \nshall be taken to prevent the tire from being pushed off the \nwheel (e.g., water under pressure within the tire) during the \napplication of the loads for the conditions specified in",
    "application of the loads for the conditions specified in \nsections 5.2(c) and (d). \n(c) \nThe condition specified in section 5.2 (b) need not be considered \nwhen, upon installation, the tire rests on the ski runner and the",
    "## Title Specification Specificatioh - Aircraft Skis\n\n7 \nN \nrl \nUl \n \na \nJ \nc( \n> \n0 \n0: \nQ. \nQ. \nc( \n\n  ,. \n. . \n\n# Aircraft Industries Association Of America, Inc,. 610 Shoreham Building, Washington !5, D, C,\n\ntest load would be transmitted directly from the ski to the tire.",
    "S.3.1 Distributed L1Jnit Up Load: \nAn upward load equal to the rated \nload (L) shall be distributed uniformly along the ski bottom \nand symmetrically with respect to the pedestal bearing sleeve \nin the fore-and-aft direction. \nThat portion of the front of \nthe ski which is at a greater distance from the bearing sleeve \nthan the aft end need not carry aey of the load. \n5.3.2 Concentrated Limit Up Load: \nA concentrated up load equal to the",
    "5.3.2 Concentrated Limit Up Load: \nA concentrated up load equal to the \nload specified in 5.3.1 shall be applied to the ski bottom \ndirectly under the pedestal bearing sleeve. \n,5.3.3 Distributed Limit Side Load: \nA sideward load equal to 35% of \nthe load specified in S.3.1 shall be distributed uniformly along \nthe outside edge of the ski bottom arrl symmetrically with respect to the pedestal. bearing sleeve in the fore-and-aft direction.",
    "That portion of the front of the ski which is at a greater \ndistance from the bearing sleeve than the aft end need not car:cy \nany of the load. \nNote: \nRoouction for Pedestal Height: \nWhen the height of the aircraft axle .from the ground.with the ski installed is greater than the moment arm R given by the fonnula",
    "$$\\mathrm{\\boldmath~R~}=\\mathrm{\\boldmath~9~}+\\mathrm{\\boldmath~\\frac{S}{\\frac{1000}{S}},}$$\nwhere S is defined in 5.1, the side load may be reduced to the value which is obtained by multiplying the Side load specified in 5.3 \n.J by a factor equal to the ratio of the moment arm to the height of the axle from the ground.",
    "5.3.4 Concentrated Limit Side Load: \nA horizontal load equal to \n.1341· shal..l be applied to the edge of the ski bottom at a \ndistance forward of the axle equal to three tines the height \nof the skiplane axle frOJ!l the ground, exce,t that, if this \npedestal hei- gh\nt is less than the moment arm given by the \nformula in S.J .3. then the distance shall be three times the \nmoment arm given by the above formula. \n5.4 \nȲ \nCut-Away Skis i \nln the case of a ski where the center section of the",
    "5.4 \nȲ \nCut-Away Skis i \nln the case of a ski where the center section of the \naft end of the runner is cut away, the applicable load for that \nsection of the ski shaJ.l be divided between the two parts of the \nrunner in proportion to the relative widths of these parts. \nLLI \nȳ \nC \ncu11i,1c•\"o\" \nTITLE \nSpecification \nSPECIFICATION - AffiCRAFT SKIS \n0:: \nll. ll. \nt("
  ]
}