{
  "source": "AIA-NAS NAS807  2017.md",
  "chunks": [
    "## Twin Seaplane Floats Specification\n\n \n--`,`,,``,,,,,``,```,``,,`````,,-`-`,,`,,`,`,,`---\nTHIS DRAWING SUPERSEDES ALL ANTECEDENT STANDARD DRAWINGS FOR THE SAME \nPRODUCT AND SHALL BECOME EFFECTIVE NO LATER THAN SIX MONTHS FROM THE LAST \nREVISION DATE. \n\nTWIN SEAPLANE FLOATS \nNAS807 \nUSE OF OR RELIANCE UPON THIS DOCUMENT OR ANY NATIONAL AEROSPACE STANDARD IS ENTIRELY VOLUNTARY.  AIA DOES NOT QUALIFY SUPPLIERS OR CERTIFY \n\n## Table Of Contents",
    "1. \nINTRODUCTION .......................................................................................................................3 \n2. \nTYPES \n......................................................................................................................................3 \n2.1 \nLanding gear for amphibious floats \n.............................................................................................3 \n3. \nMATERIAL AND WORKMANSHIP",
    "3. \nMATERIAL AND WORKMANSHIP \n.................................................................................................3 \n3.1 \nFabrication methods \n..................................................................................................................3 \n3.2 \nComposite materials \n..................................................................................................................3 \n3.2.1 \nComposite structural considerations",
    "3.2.1 \nComposite structural considerations \n............................................................................................4 \n3.3 \nStandard fastenings ..................................................................................................................4 \n3.4 \nProtection ................................................................................................................................4 \n3.5 \nInspection provisions",
    "3.5 \nInspection provisions \n.................................................................................................................5 \n3.6 \nIdentification \n............................................................................................................................5 \n4. \nDETAIL REQUIREMENTS............................................................................................................5 \n4.1",
    "4.1 \nBuoyancy .................................................................................................................................5",
    "--`,`,,``,,,,,``,```,``,,`````,,-`-`,,`,,`,`,,`---",
    "4.1.1 \nFlooded compartment buoyancy \n.................................................................................................5 \n4.2 \nStrength...................................................................................................................................5 \n4.2.1 \nMaterial Strength Properties \n.......................................................................................................5 \n4.2.2",
    "4.2.2 \nLoads.......................................................................................................................................5 \n4.2.3 \nFactor of safety ........................................................................................................................5 \n4.2.4 \nStrength and deformation \n..........................................................................................................6 \n4.3 \nWater loads",
    "4.3 \nWater loads \n..............................................................................................................................6 \n4.3.1 \nDesign weights \n.........................................................................................................................6 \n4.3.2 \nDesign landing conditions ..........................................................................................................7 \n4.3.3",
    "4.3.3 \nLimit load factors for general structure design .............................................................................7 \n4.3.4 \nFloat detail design \n.....................................................................................................................8",
    "## Appendix\n\n \nAppendix A - References \n........................................................................................................................ \n13 \n\n## Figures",
    "## Figures\n\n Figure 1 - Pictorial definition of angles, dimensions, and directions on seaplane .......................................... \n10 \nFigure 2 - Float station weighing factor ................................................................................................... \n11 \nFigure 3 - Transverse pressure distributions \n............................................................................................. \n12 \n\n \n\n## 1. Introduction",
    "## 1. Introduction\n\nThis specification defines the minimum airworthiness requirements for twin seaplane floats suitable for use on airplanes. \n\n## 2. Types\n\nThis specification provides design criteria for twin seaplane floats for use on airplanes. \n\n## 2.1 Landing Gear For Amphibious Floats\n\nFor amphibious floats, landing gear must meet the applicable landing gear requirements, at an aircraft installation level, of 14 CFR part 23 or 25. \n\n## 3. Material And Workmanship",
    "## 3. Material And Workmanship\n\nAll materials used in the structure shall be of a quality which experience or tests have demonstrated to be suitable and dependable for use in aircraft floats and shall conform to specifications which will ensure their having the strength and other properties assumed in the design. All workmanship shall be consistent with high-grade aircraft float manufacturing practice. \n\n## 3.1 Fabrication Methods",
    "## 3.1 Fabrication Methods\n\nThe methods of fabrication employed in the construction of the float structure shall be such as to produce consistently sound structures. When a fabrication process requires close control to attain this objective, the process shall be one for which the suitability and dependability have been established on the basis of experience or tests.",
    "Composite process specifications shall be developed anew by the float manufacturer or could be an existing industry or government created specification. The specifications should meet the following requirements, including but not limited to:",
    "- \nDeveloped to control the manufacture of the part(s), and address in-process inspection or test \nrequirements for quality assurance purposes. \n- \nProvide a means by which process parameters and methods can be documented and communicated to the various organizations involved in the fabrication of the composite parts. \n- \nBe clear and complete to ensure that the resulting parts are consistent in quality. \n--`,`,,``,,,,,``,```,``,,`````,,-`-`,,`,,`,`,,`---",
    "--`,`,,``,,,,,``,```,``,,`````,,-`-`,,`,,`,`,,`---\nGuidance for developing a process specification and some examples of content can be found in Appendix A.",
    "## 3.2 Composite Materials",
    "Each structural composite material used shall conform to a specification. The purpose of that specification is to ensure the composite materials used in production maintain consistency with the materials used in, or reflected by, the design data, the test articles used for material qualification and/or the proof-of-structure certification test article(s).  These material specifications may be developed by the manufacturer, or may be existing specifications created and maintained by another",
    "developed by the manufacturer, or may be existing specifications created and maintained by another party provided the specifications control the requisite material properties.",
    "The specifications shall meet the following non-exclusive list of requirements, intended to ensure the specifications' \ngoal of composite raw material consistency:",
    "- \nInspection procedures and supplier controls shall be established \n- \nMaterial acceptance limits shall be established  \nThe float manufacturer will provide evidence that each production batch of material in each shipment meets the material specification requirements. This evidence will include test data, certificate of conformity, affidavits, etc., depending upon the float manufacturer's quality assurance plan and purchase contract requirements for a particular material.",
    "A material specification for a composite material may require some unique content compared to specifications for other commonly used aerospace materials.  See Appendix A for references and guidance regarding the content of a composite material specification.   \n\n## 3.2.1 Composite Structural Considerations",
    "Experimental evidence should be provided to demonstrate that the material design values or allowables are attained with a high degree of confidence in the appropriate critical environmental exposures to be expected in service.  The structural static strength substantiation of a composite design should include effects of environment, material and process variability, non-detectable defects or any defects that are allowed by the quality control, manufacturing acceptance criteria, and service",
    "any defects that are allowed by the quality control, manufacturing acceptance criteria, and service damage allowed in maintenance documents of the end product.  The static strength of the composite design should be demonstrated in the appropriate environment using one of the three approaches below:",
    "1) In the first approach, the full scale static test should be conducted on structure conditioned to simulate the \ncritical environmental exposure and then tested in that environment. \n2) The second approach relies upon coupon, element, and subcomponent test data to determine the effect of",
    "environmental exposure on static strength. This characterization should be performed for all structural materials.  The critical degradation characterized by these tests should then be accounted for in the full scale static strength demonstration test (e.g., overload factors), or in analysis of these results (e.g., showing a positive margin of safety with design values that include the degrading effects of environment). The necessary",
    "experience to validate an analysis may include previous ultimate load tests with similar designs, material systems, and load cases. \n3) In practice, aspects of the first two approaches may be combined to get the desired result (e.g., a full scale \nstatic test may be performed at critical operating temperature with a load factor to account for moisture \nabsorbed over the aircraft structure's life).",
    "## 3.3 Standard Fastenings\n\nAll bolts, pins, screws, and rivets used in the structure shall be of a type the suitability and dependability of which have been demonstrated by experience or tests. The use of a suitable and dependable locking device or method is required for all such bolts, pins, and screws. Self-locking nuts shall not be used on bolts subject to rotation. \n\n## 3.4 Protection",
    "## 3.4 Protection\n\nAll members of the structure shall be suitably protected against deterioration or loss of strength in service due to weathering, corrosion, abrasion, or other causes. Special precautions should be taken against corrosion from salt water, particularly where parts made from materials with different electronegativity potentials are in close proximity. Adequate provisions for ventilation and drainage of all compartments of the structure shall be made.",
    "--`,`,,``,,,,,``,```,``,,`````,,-`-`,,`,,`,`,,`---\n\n## 3.5 Inspection Provisions\n\nAdequate means shall be provided to permit the close examination of such parts of the float as require periodic inspection, adjustments for proper alignment and functioning, and lubrication of moving parts. \n\n## 3.6 Identification\n\nSeaplane floats shall be suitably placarded with the following information: \n\n- \nManufacturer's Name \n- \nFloat Model \n\n## 4. Detail Requirements 4.1 Buoyancy",
    "- \nManufacturer's Name \n- \nFloat Model \n\n## 4. Detail Requirements 4.1 Buoyancy\n\nTwin seaplane floats shall have a buoyancy of 80% in excess of that required to support the maximum weight of the airplane in fresh water. \n\n## 4.1.1 Flooded Compartment Buoyancy",
    "Each float must have enough watertight compartments to provide reasonable assurance that the aircraft will stay afloat, without capsizing, in case of a likely float flooding.  Likely flooding should take into consideration the potential for striking objects in the water, including, but not limited to: contact with an object at a bulkhead in a multi-compartment float which results in the flooding of adjacent compartments, and; contact with an object that results in the flooding of a",
    "flooding of adjacent compartments, and; contact with an object that results in the flooding of a longitudinally proximate compartment of each float.",
    "## 4.2 Strength 4.2.1 Material Strength Properties",
    "The strength properties of the materials used shall be based on a sufficient number of tests of material to establish design values on a statistical basis. The design values shall be so chosen that the probability of any structure being under-strength because of material variations is extremely remote. The structure shall be designed, in so far as practicable, to avoid points of stress concentration where variable stresses above the fatigue limit are likely to occur in normal service.",
    "## 4.2.2 Loads",
    "Strength requirements are specified in terms of limit and ultimate loads. Limit loads are the maximum loads anticipated in service. Ultimate loads are equal to the limit loads multiplied by the factor of safety. Unless otherwise described, loads specified are limit loads. All such loads shall be distributed in a manner conservatively approximating or closely representing actual conditions. If deflections under load would change significantly the distribution of external or internal loads, such",
    "under load would change significantly the distribution of external or internal loads, such redistribution shall be taken into account.",
    "## 4.2.3 Factor Of Safety\n\nThe factor of safety shall be 1.5 unless any of the conditions of sections 4.2.3.1 through 4.2.3.4 apply. In those cases, the factor of safety of 1.5 shall be multiplied by the highest pertinent safety factors prescribed in sections 4.2.3.1 (special factors) through 4.2.3.4 (fitting factor).  \n\n## 4.2.3.1 Special Factors",
    "## 4.2.3.1 Special Factors\n\nWhere there may be uncertainty concerning the actual strength of particular parts of the structure, or where the strength is likely to deteriorate in service prior to normal replacement, increased factors of safety shall be provided to ensure that the strength and reliability of such parts is not less than the rest of the structure.",
    "4.2.3.2 \nCasting Factors \na) \nIf visual inspection only is to be employed, the variability factor shall be 2.0. \nb) The variability factor may be reduced to 1.25 for ultimate loads and 1.15 for limit loads if at least three \nsample castings are tested to show compliance with these factors, and if all sample and production castings have been determined to be acceptable upon completion of a visual and radiographical inspection. \n\n## 4.2.3.3 Bearing Factors",
    "## 4.2.3.3 Bearing Factors\n\nThe factor of safety in bearing at bolted or pinned joints shall be 2.0 for joints subject to rotation, or shock or vibration, or 2.5 for joints subject to rotation and shock or vibration.  For joints subject to neither, the factor of safety shall be 1.15. \n\n## 4.2.3.4 Fitting Factor",
    "Fittings are defined as parts such as end terminals used to join one structural member to another. A factor of safety of at least 1.15 shall be used in the analysis of all fittings the strength of which is not proved by limit and ultimate load tests in which the actual stress conditions are simulated in the fitting and the surrounding structure. This factor applies to all portions of the fitting, the means of attachment, and bearing on the members joined. The fitting factor need not be applied",
    "the means of attachment, and bearing on the members joined. The fitting factor need not be applied if a type of joint design based on comprehensive test data is used.",
    "## 4.2.3.5 Structural Bonds\n\nWhere load carrying components of the float are structurally bonded together, the effects of disbonds and voids located within the bonded joint shall be considered. \n\n## 4.2.4 Strength And Deformation",
    "The structure shall be capable of supporting limit loads without suffering detrimental permanent deformations. At all loads up to limit loads, the deformation shall be such as not to interfere with safe operation of the aircraft on which the float is used. The structure shall be capable of supporting ultimate loads without failure for at least 3 seconds, unless proof of strength is demonstrated by dynamic tests simulating actual conditions of load application.",
    "The effects of material and manufacturing variability, environmental conditions, and in-service wear and abuse should be considered.  The ultimate load capability of the structure shall be demonstrated with manufacturing defects (such as disbonds and voids) up to the threshold of detectability, and may include service damage. \n\n## 4.3 Water Loads",
    "## 4.3 Water Loads\n\nThe floats and float supporting structure shall be investigated for all critical distributions of water pressures occurring during the design conditions defined herein. \n\n## 4.3.1 Design Weights\n\nThe design weight used in the water landing conditions shall be the design landing weight of the airplane on which the float is to be used. \n\n--`,`,,``,,,,,``,```,``,,`````,,-`-`,,`,,`,`,,`---\n\n## 4.3.2 Design Landing Conditions",
    "--`,`,,``,,,,,``,```,``,,`````,,-`-`,,`,,`,`,,`---\n\n## 4.3.2 Design Landing Conditions\n\nThe requirement of paragraphs 4.3.3 and 4.3.4 shall be minimum design conditions. \n\n## 4.3.3 Limit Load Factors For General Structure Design",
    "The following limit load factors shall be used in the design of the structure as a whole. In applying the loads resulting from the load factors prescribed in 4.3.3, it is acceptable to distribute them over the float bottom so as to avoid excessive local shear loads and bending moments at the point where the resultant water load is located. In this distribution of the loads, pressures not less than those prescribed in 4.3.4.2 at the float station of load application defined by 4.3.3.1 through",
    "those prescribed in 4.3.4.2 at the float station of load application defined by 4.3.3.1 through 4.3.3.4 shall be used.",
    "a) \nStep landing: \n$$n_{w}={\\frac{C_{1}{V_{s o}}^{2}}{\\tan^{2/3}(\\beta)W^{1/3}}}$$\nb) Bow or stern landing: \n$$n_{w}=\\frac{C_{1}{V_{s o}}^{2}}{\\tan^{2/3}(\\beta)W^{1/3}}\\times\\frac{K_{1}}{(1+{r_{x}}^{2})^{2/3}}$$\nin which,",
    "洧녵洧녵洧녻洧녻 = \nlimit water reaction load factor, equal to water reaction divided by weight of seaplane \n洧녤洧녤\n洧멇롐멇롐멇롐 = \nairplane stalling speed at design landing weight with zero thrust and landing flaps or other high lift devices in position for landing (knots, CAS) \n洧띻洧띻 = \nangle of deadrise at station at which load factor is being computed (see Figure 1) (degrees) \n洧녥洧녥 = \none half the airplane design landing weight (pounds) \n洧냤洧냤1 =",
    "洧녥洧녥 = \none half the airplane design landing weight (pounds) \n洧냤洧냤1 = \nempirical airplane operations factor having a value 0.012, except that this value shall be increased if \nnecessary to yield the minimum step load factor prescribed in 4.3.3.1 \n洧쮫롏쬪n1 = \nempirical float station weighing factor. Recognition of the effect of flexibility of the attachment of the floats on the seaplane may be made by reducing the weighing factor 洧쮫롏쬪n1 at the bow and at the stern to 0.8 of the",
    "1 at the bow and at the stern to 0.8 of the \nvalues shown in Figure 2. (NOTE: THIS REDUCTION DOES NOT APPLY TO THE FLOAT DESIGN BUT ONLY TO THE CARRY-THROUGH STRUCTURE) \n洧洧륲n洧논洧논 =",
    "洧洧륲n洧논洧논 = \nratio of distance, parallel to float reference axis, from center of gravity to float longitudinal station at which load factor is being computed to the radius of gyration of the seaplane in pitch. Since the float may be used on seaplanes of varying radius of gyration, the float designer shall conservatively select an 洧洧륲n洧논洧논 value so \nas to account for the maximum value of the radius of gyration of any seaplanes on which the float may be installed.",
    "## 4.3.3.1 Step Landing\n\nThe resultant water load shall be applied perpendicular to the keel at the longitudinal station corresponding to the center of gravity location. The magnitude of load shall be that corresponding to the limit load factor given by 4.3.3 (a) but shall not be less than that corresponding to a load factor of 2.33.",
    "REVISION \n2 \n--`,`,,``,,,,,``,```,``,,`````,,-`-`,,`,,`,`,,`---\n \nUSE OF OR RELIANCE UPON THIS DOCUMENT OR ANY NATIONAL AEROSPACE STANDARD IS ENTIRELY VOLUNTARY.  AIA DOES NOT QUALIFY SUPPLIERS OR CERTIFY",
    "4.3.3.2 \nBow landing \nThe resultant water load shall be applied at the keel one-fifth of the distance from the bow to the step measured parallel to the reference axis, and shall be directed upward perpendicular to the tangent to the keel line at that point. The magnitude of the water load shall be that corresponding to the limit load factor given by 4.3.3(b).",
    "4.3.3.3 \nStern landing \nThe resultant water load shall be applied at the keel at a point .85 times the distance from step to the end of the afterbody and shall be directed perpendicular to the tangent to the keel line at that point. The magnitude of the resultant load shall be that corresponding to the limit load factor given by 4.3.3(b).",
    "4.3.3.4 \nUnsymmetrical landing - two-float landing with drift \nThe unsymmetrical landing condition shall consist of a two-float landing on the step of each float with side load on one float. The upward load shall be .75 times the step landing load of 4.3.3.1. The side load shall be tan洧띻洧띻",
    "4  times the step landing load of 4.3.3.1. It shall be directed inboard perpendicular to the plane of symmetry midway between the keel and chine lines of one float at the same longitudinal station as the upward load.",
    "## 4.3.4 Float Detail Design\n\nThe following float detail design criteria are prescribed to design the hull detail including frames and bulkheads, stringers, and bottom plating. \n\n## 4.3.4.1 Local Pressure Distribution",
    "## 4.3.4.1 Local Pressure Distribution\n\nThe following local pressure distribution shall be used for the design of the bottom plating and stringers and their attachment to the supporting structure. These pressures simulate pressures occurring during highly localized impacting of water on the float and need not be applied over an area large enough to result in the development of frame or general structure loads greater than those specified in 4.3.4.2.",
    "a) \nUnflared bottom \nPressure at keel, psi \n \n洧녞洧녞洧녲洧녲= 洧냤洧냤2洧쮫롏2洧녤洧녤\n洧멇롐멇롐멇롐\n2\ntan洧띻洧띻洧녲洧녲\nvarying linearly to .75 洧녞洧녞洧녲洧녲 at chine. \n\n \n\nb) Flared bottom \nThe pressure distribution transversely shall be, (1) the envelope of pressures from (a) and, (2) the distribution to account for flare, (see Figure 3) \nPressure at chine, psi",
    "$$P_{c h}={\\frac{C_{3}K_{2}{V_{s o}}^{2}}{\\tan\\!\\beta}}$$\nvarying linearly to a pressure corresponding to a value given by (a) at start of flare, where \n洧냤洧냤2 =  0.00213 \n洧냤洧냤3 =  0.0016 \n洧쮫롏2 = Float station weighing factor (See Figure 2) \n洧띻洧띻洧녲洧녲 = Angle of deadrise at keel (See Figure 1) \n\n## 4.3.4.2 Distributed Bottom Pressures For General Design",
    "The following pressure distributions shall be used for the design of the frames, keel, and chine structure. These pressures shall be applied simultaneously over the entire float bottom and their distributions shall be uniform (See Figure 3). The loads obtained from the summation of these pressures shall be carried into the side wall structure of the float proper, but need not be transmitted in a fore and aft direction as shear and bending loads.",
    "a) \nSymmetrical: The magnitudes of the symmetrically distributed pressures in psi shall be given by: \n\n$$P=\\,\\frac{{{C}_{4}}{{K}_{2}}{{V}_{So}}^{2}}{\\mathrm{tan}\\beta}$$\n\nWhere,\n\n$$C_4=\\,.078{{C}_{1}}$$\n \n\nb) Unsymmetrical: The magnitudes of the unsymmetrically distributed pressures shall be the same as the \nsymmetrical pressures on one side of the float plane of symmetry and one-half of the symmetrical \npressures on the other side of the float plane of symmetry.",
    "--`,`,,``,,,,,``,```,``,,`````,,-`-`,,`,,`,`,,`---\n \nUSE OF OR RELIANCE UPON THIS DOCUMENT OR ANY NATIONAL AEROSPACE STANDARD IS ENTIRELY VOLUNTARY.  AIA DOES NOT QUALIFY SUPPLIERS OR CERTIFY USE OF OR RELIANCE UPON THIS DOCUMENT OR ANY NATIONAL AEROSPACE STANDARD IS ENTIRELY VOLUNTARY.  AIA DOES NOT QUALIFY SUPPLIERS OR CERTIFY \nARLINGTON, VA  22209 \nTHIS DRAWING SUPERSEDES ALL ANTECEDENT STANDARD DRAWINGS FOR THE SAME",
    "ARLINGTON, VA  22209 \nTHIS DRAWING SUPERSEDES ALL ANTECEDENT STANDARD DRAWINGS FOR THE SAME \nPRODUCT AND SHALL BECOME EFFECTIVE NO LATER THAN SIX MONTHS FROM THE LAST \nREVISION DATE.",
    "REVISION \n2 \nNAS807 \nUSE OF OR RELIANCE UPON THIS DOCUMENT OR ANY NATIONAL AEROSPACE STANDARD IS ENTIRELY VOLUNTARY.  AIA DOES NOT QUALIFY SUPPLIERS OR CERTIFY \n\n## Appendix A - References\n\nThe following documents are provided as guidance material for composite materials:",
    "- \nAC 23-20, \"Acceptance Guidance on Material Procurement and Process Specification for Polymer Matrix Composite Systems\"  \n- \nAC 21-26, \"A Quality System for the Manufacture of Composite Structures\" \n- \nDOT/FAA/AR-03/19, \"Material Qualification and Equivalency for Polymer Matrix Composite Material Systems: Updated Procedure\" \n- \nDOT/FAA/AR-06/10, \"Guidelines and Recommended Criteria for the Development of a Material Specification for \nCarbon Fiber/Epoxy Fabric Prepregs\" \n-",
    "Carbon Fiber/Epoxy Fabric Prepregs\" \n- \nDOT/FAA/AR-07/3, \"Guidelines and Recommended Criteria for the Development of a Material Specification For \nCarbon Fiber/Epoxy Unidirectional Prepregs Update\" \n- \nDOT/FAA/AR-06/25, \"Preliminary Guidelines and Recommendations for the Development of Material and \nProcess Specifications for Carbon Fiber-Reinforced Liquid Resin Molded Materials\"",
    "Process Specifications for Carbon Fiber-Reinforced Liquid Resin Molded Materials\" \n Guidance for developing a process specification and some examples of content can be found in the following references:",
    "- \nAC 23-20, \"Acceptance Guidance on Material Procurement and Process Specification for Polymer Matrix Composite Systems\" \n- \nAC 21-26A, \"Quality System for the Manufacture of Composite Structures\" \n- \nDOT/FAA/AR-02/110, \"Guidelines for the Development of Process Specifications, Instructions, and Controls for the Fabrication of Fiber-Reinforced Polymer Composites\" \n-",
    "- \nDOT/FAA/AR-06/25, \"Preliminary Guidelines and Recommendations for the Development of Material and Process Specifications for Carbon Fiber-Reinforced Liquid Resin Molded Materials\""
  ]
}