{
  "source": "ASTM D412 2016(2021).md",
  "chunks": [
    "# Designation: D412 −16 (Reapproved 2021) Standard Test Methods For Vulcanized Rubber And Thermoplastic Elastomers— Tension1\n\nThis standard is issued under the fixed designation D412; the number immediately following the designation indicates the year of original adoption or, in the case of revision, the year of last revision. A number in parentheses indicates the year of last reapproval. A\nsuperscript epsilon (´) indicates an editorial change since the last revision or reapproval.",
    "This standard has been approved for use by agencies of the U.S. Department of Defense.\n\n## 1. Scope",
    "## 1. Scope\n\n1.1 These test methods cover procedures used to evaluate the tensile (tension) properties of vulcanized thermoset rubbers and thermoplastic elastomers. These methods are not applicable to ebonite and similar hard, low elongation materials. The methods appear as follows:\nTest Method A—Dumbbell and Straight Section Specimens Test Method B—Cut Ring Specimens NOTE 1—These two different methods do not produce identical results.",
    "1.2 The values stated in either SI or non-SI units shall be regarded separately as normative for this standard. The values in each system may not be exact equivalents; therefore each system must be used independently, without combining values.",
    "1.3 This standard does not purport to address all of the safety concerns, if any, associated with its use. It is the responsibility of the user of this standard to establish appropriate safety, health, and environmental practices and determine the applicability of regulatory limitations prior to use.",
    "1.4 This international standard was developed in accordance with internationally recognized principles on standardization established in the Decision on Principles for the Development of International Standards, Guides and Recommendations issued by the World Trade Organization Technical Barriers to Trade (TBT) Committee.\n\n## 2. Referenced Documents\n\n2.1 *ASTM Standards:*2\nD1349 Practice for Rubber—Standard Conditions for Testing D1566 Terminology Relating to Rubber\n10.1520/D0412-16R21.",
    "| D3182                                                  |  Practice for Rubber—Materials, Equipment, and Pro-   |\n|--------------------------------------------------------|-------------------------------------------------------|\n| cedures for Mixing Standard Compounds and Preparing    |                                                       |\n| Standard Vulcanized Sheets                             |                                                       |",
    "| D3183                                                  | Practice for Rubber—Preparation of Pieces for Test    |\n| Purposes from Products                                 |                                                       |\n| D3767                                                  | Practice for Rubber—Measurement of Dimensions         |\n| D4483                                                  | Practice for Evaluating Precision for Test Method     |",
    "| Standards in the Rubber and Carbon Black Manufacturing |                                                       |\n| Industries                                             |                                                       |\n| E4                                                     | Practices for Force Verification of Testing Machines  |\n| 2.2                                                    |                                                       |",
    "| ASTM Adjunct:                                          |                                                       |\n| Cut Ring Specimens,                                    | Method B (                                            |\n| 3                                                      |                                                       |",
    "2.3 ISO Standards: ISO 37 Rubber, Vulcanized and Thermoplastic Determination of Tensile Stress-Strain Properties4\n\n## 3. Terminology\n\n3.1 Definitions: 3.1.1 *tensile set—*the extension remaining after a specimen has been stretched and allowed to retract in a specified manner, expressed as a percentage of the original length. (D1566)\n3.1.2 *tensile set-after-break—*the tensile set measured by fitting the two broken dumbbell pieces together at the point of rupture.",
    "3.1.3 *tensile strength—*the maximum tensile stress applied in stretching a specimen to rupture. (D1566)\n3.1.4 *tensile stress—*a stress applied to stretch a test piece\n(specimen). (D1566)\n3.1.5 *tensile stress at-given-elongation—*the stress required to stretch the uniform cross section of a test specimen to a given elongation. (D1566)",
    "3.1.6 *thermoplastic elastomers—*a diverse family of rubberlike materials that unlike conventional vulcanized rubbers can be processed and recycled like thermoplastic materials.",
    "3.1.7 *ultimate elongation—*the elongation at which rupture occurs in the application of continued tensile stress.\n\n3.1.8 *yield point—*that point on the stress-strain curve, short of ultimate failure, where the rate of stress with respect to strain, goes through a zero value and may become negative.\n\n(D1566)\n3.1.9 *yield strain—*the level of strain at the yield point.\n\n(D1566)\n3.1.10 *yield stress—*the level of stress at the yield point.\n\n(D1566)\n\n## 4. Summary Of Test Method",
    "(D1566)\n\n## 4. Summary Of Test Method\n\n4.1 The determination of tensile properties starts with test pieces taken from the sample material and includes the preparation of the specimens and the testing of the specimens. Specimens may be in the shape of dumbbells, rings or straight pieces of uniform cross-sectional area.",
    "4.2 Measurements for tensile stress, tensile stress at a given elongation, tensile strength, yield point, and ultimate elongation are made on specimens that have not been prestressed. Tensile stress, yield point, and tensile strength are based on the original cross-sectional area of a uniform cross-section of the specimen.",
    "4.3 Measurement of tensile set is made after a previously unstressed specimen has been extended and allowed to retract by a prescribed procedure. Measurement of \"set after break\" is also described.\n\n## 5. Significance And Use",
    "## 5. Significance And Use\n\n5.1 All materials and products covered by these test methods must withstand tensile forces for adequate performance in certain applications. These test methods allow for the measurement of such tensile properties. However, tensile properties alone may not directly relate to the total end use performance of the product because of the wide range of potential performance requirements in actual use.",
    "5.2 Tensile properties depend both on the material and the conditions of test (extension rate, temperature, humidity, specimen geometry, pretest conditioning, etc.); therefore materials should be compared only when tested under the same conditions.\n\n5.3 Temperature and rate of extension may have substantial effects on tensile properties and therefore should be controlled. These effects will vary depending on the type of material being tested.",
    "5.4 Tensile set represents residual deformation which is partly permanent and partly recoverable after stretching and retraction. For this reason, the periods of extension and recovery (and other conditions of test) must be controlled to obtain comparable results.\n\n## 6. Apparatus",
    "6.1 *Testing Machine—*Tension tests shall be made on a power driven machine equipped to produce a uniform rate of grip separation of 500 6 50 mm/min (20 6 2 in./min) for a distance of at least 750 mm (30 in.) (see Note 2). The testing machine shall have both a suitable dynamometer and an indicating or recording system for measuring the applied force within 62 %. If the capacity range cannot be changed for a test",
    "(as in the case of pendulum dynamometers) the applied force at break shall be measured within 62 % of the full scale value, and the smallest tensile force measured shall be accurate to within 10 %. If the dynamometer is of the compensating type for measuring tensile stress directly, means shall be provided to adjust for the cross-sectional area of the specimen. The response of the recorder shall be sufficiently rapid that the applied force is measured with the requisite accuracy during the",
    "be sufficiently rapid that the applied force is measured with the requisite accuracy during the extension of the specimen to rupture. If the testing machine is not equipped with a recorder, a device shall be provided that indicates, after rupture, the maximum force applied during extension. Testing machine systems shall be capable of measuring elongation of the test specimen in minimum increments of 10 %.",
    "NOTE 2—A rate of elongation of 1000 6 100 mm/min (40 6 4 in./min)\nmay be used and notation of the speed made in the report. In case of dispute, the test shall be repeated and the rate of elongation shall be at 500\n6 50 mm/min (20 6 2 in./min).",
    "6.2 *Test Chamber for Elevated and Low Temperatures—*The test chamber shall conform with the following requirements:\n6.2.1 Air shall be circulated through the chamber at a velocity of 1 to 2 m/s (3.3 to 6.6 ft/s) at the location of the grips or spindles and specimens maintained within 2°C (3.6°F) of the specified temperature.\n\n6.2.2 A calibrated sensing device shall be located near the grips or spindles for measuring the actual temperature.",
    "6.2.3 The chamber shall be vented to an exhaust system or to the outside atmosphere to remove fumes liberated at high temperatures.\n\n6.2.4 Provisions shall be made for suspending specimens vertically near the grips or spindles for conditioning prior to test. The specimens shall not touch each other or the sides of the chamber except for momentary contact when agitated by the circulating air.",
    "6.2.5 Fast acting grips suitable for manipulation at high or low temperatures may be provided to permit placing dumbbells or straight specimens in the grips in the shortest time possible to minimize any change in temperature of the chamber.\n\n6.2.6 The dynamometer shall be suitable for use at the temperature of test or it shall be thermally insulated from the chamber.",
    "6.2.7 Provision shall be made for measuring the elongation of specimens in the chamber. If a scale is used to measure the extension between the bench-marks, the scale shall be located parallel and close to the grip path during specimen extension and shall be controlled from outside the chamber.\n\n6.3 *Micrometer—*A digital or analogue dial micrometer conforming to the requirements of Practice D3767 (Procedure A). Ring specimens are addressed in 14.10.",
    "6.4 *Apparatus for Tensile Set Test—*The testing machine described in 6.1 or an apparatus similar to that shown in Fig. 1\nmay be used. A stop watch or other suitable timing device measuring in minute intervals for at least 30 min, shall be provided. A scale or other device shall be provided for measuring tensile set to within 1 %.\n\n## 7. Selection Of Test Specimens",
    "## 7. Selection Of Test Specimens\n\n7.1 Consider the following information in making selections:\n7.1.1 Since anisotropy or grain directionality due to flow introduced during processing and preparation may have an influence on tensile properties, dumbbell or straight specimens should be cut so the lengthwise direction of the specimen is parallel to the grain direction when this direction is known. Ring specimens normally give an average of with and across the grain properties.",
    "7.1.2 Unless otherwise noted, thermoplastic rubber or thermoplastic elastomer specimens, or both, are to be cut from injection molded sheets or plaques with a thickness of 3.0 6\n0.3 mm. Specimens of other thickness will not necessarily give comparable results. Specimens are to be tested in directions both parallel and perpendicular to the direction of flow in the mold. Sheet or plaque dimensions must be sufficient to do this.",
    "7.1.3 Ring specimens enable elongations to be measured by grip separation, but the elongation across the radial width of the ring specimens is not uniform. To minimize this effect the width of the ring specimens must be small compared to the diameter.",
    "7.1.4 Straight specimens tend to break in the grips if normal extension-to-break testing is conducted and should be used only when it is not feasible to prepare another type of specimen. For obtaining non-rupture stress-strain or material modulus properties, straight specimens are quite useful.",
    "7.1.5 The size of specimen type used will be determined by the material, test equipment and the sample or piece available for test. A longer specimen may be used for rubbers having low ultimate elongation to improve precision of elongation measurement.\n\n## 8. Calibration Of The Testing Machine",
    "## 8. Calibration Of The Testing Machine\n\n8.1 Calibrate the testing machine in accordance with Procedure A of Practices E4. If the dynamometer is of the straingauge type, calibrate the tester at one or more forces in addition to the requirements in Sections 7 and 18 of Practices E4.\n\nTesters having pendulum dynamometers may be calibrated as follows:\n8.1.1 Place one end of a dumbbell specimen in the upper grip of the testing machine.",
    "8.1.2 Remove the lower grip from the machine and attach it, by means of the gripping mechanism to the dumbbell specimen in the upper grip.\n\n8.1.3 Attach a hook to the lower end of the lower specimen grip mechanism.\n\n8.1.4 Suspend a known mass from the hook of the lower specimen grip mechanism in such a way as to permit the mass assembly to temporarily rest on the lower testing machine grip framework or holder (see Note 3).",
    "8.1.5 Start the grip separation motor or mechanism, as in normal testing, and allow it to run until the mass is freely suspended by the specimen in the upper grip.",
    "8.1.6 If the dial or scale does not indicate the force applied\n(or its equivalent in stress for a compensating type tester) within specified tolerance, thoroughly inspect the testing machine for malfunction (for example, excess friction in bearings and other moving parts). Ensure that the mass of the lower grip mechanism and the hook are included as part of the known mass.",
    "8.1.7 After machine friction or other malfunction has been removed, recalibrate the testing machine at a minimum of three points using known masses to produce forces of approximately\n10, 20 and 50 % of capacity. If pawls or rachets are used during routine testing, use them for calibration. Check for friction in the head by calibrating with the pawls up.\n\nNOTE 3—It is advisable to provide a means for preventing the known mass from falling to the floor in case the dumbbell should break.",
    "8.2 A rapid approximate calibration of the testing machine may be obtained by using a spring calibration device.\n\n## 9. Test Temperature",
    "## 9. Test Temperature\n\n9.1 Unless otherwise specified, the standard temperature for testing shall be 23 6 2°C (73.4 6 3.6°F). Specimens shall be conditioned for at least 3 h when the test temperature is 23°C (73.4°F). If the material is affected by moisture, maintain the relative humidity at 50 6 5 % and condition the specimens for at least 24 h prior to testing. When testing at any other temperature is required use one of the temperatures listed in Practice D1349.",
    "9.2 For testing at temperatures above 23°C (73.4°F) preheat specimens for 10 6 2 min for Method A and for 6 6 2 min for Method B. Place each specimen in the test chamber at intervals ahead of testing so that all specimens of a series will be in the chamber the same length of time. The preheat time at elevated temperatures must be limited to avoid additional vulcanization or thermal aging.",
    "9.3 For testing at temperatures below 23°C (73.4°F) condition the specimens at least 10 min prior to testing.\n\n## Test Method A—Dumbbell And Straight Specimens 10. Apparatus",
    "## Test Method A—Dumbbell And Straight Specimens 10. Apparatus\n\n10.1 *Die—*The shape and dimensions of the die for preparing dumbbell specimens shall conform with those shown in Fig. 2. The inside faces in the reduced section shall be perpendicular to the plane formed by the cutting edges and polished for a distance of at least 5 mm (0.2 in.) from the cutting edge. The die shall at all times be sharp and free of nicks (see 9.2).",
    "NOTE 4—The condition of the die may be determined by investigating the rupture point on any series of broken (ruptured) specimens. Remove such specimens from the grips of the testing machine, stack the joinedtogether specimens on top of each other, and note if there is any tendency for tensile breaks to occur at the same position on each of the specimens. Rupture consistently at the same place indicates that the die may be dull, nicked, or bent at that location.",
    "10.2 *Bench Marker—*The two marks placed on the specimen and used to measure elongation or strain are called \"bench marks\" (see Note 5). The bench marker shall consist of a base plate containing two raised parallel projections. The surfaces of the raised projections (parallel to the plane of the base plate) are ground smooth in the same plane. The raised projection marking surfaces shall be between 0.05 and 0.08 mm (0.002 and 0.003 in.) wide and at least 15 mm (0.6 in.) long. The angles between",
    "0.05 and 0.08 mm (0.002 and 0.003 in.) wide and at least 15 mm (0.6 in.) long. The angles between the parallel marking surfaces and the sides of the projections shall be at least 75°. The distance between the centers of the two parallel projections or marking surfaces shall be within 1 % of the required or target bench mark distance. A handle attached to the back or top of the bench marker base plate is normally a part of the bench marker.",
    "NOTE 5—If a contact extensometer is used to measure elongation, bench marks are not necessary.\n\n10.3 *Ink Applicator—*A flat unyielding surface (hardwood, metal, or plastic) shall be used to apply either ink or powder to the bench marker. The ink or powder shall adhere to the specimen, have no deteriorating effect on the specimen and be of contrasting color to that of the specimen.\n\n10.4 *Grips—*The testing machine shall have two grips, one of which shall be connected to the dynamometer.",
    "10.4.1 Grips for testing dumbbell specimens shall tighten automatically and exert a uniform pressure across the gripping surfaces, increasing as the tension increases in order to prevent slippage and to favor failure of the specimen in the straight reduced section. Constant pressure pneumatic type grips also are satisfactory. At the end of each grip a positioning device is recommended for inserting specimens to the same depth in the grip and for alignment with the direction of pull.",
    "Dimensions of Standard Dumbbell DiesA (Metric Units)\nDimension\nUnits\nTolerance\nDie A\nDie B\nDie C\nDie D\nDie E\nDie F\nA\nmm\n±1\n25\n25\n25\n16\n16\n16\nB\nmm\nmax\n40\n40\n40\n30\n30\n30\nC\nmm\nmin\n140\n140\n115\n100\n125\n125\nD\nmm\n±6B\n32\n32\n32\n32\n32\n32\nD-E\nmm\n±1\n13\n13\n13\n13\n13\n13\nF\nmm\n±2\n38\n38\n19\n19\n38\n38\nG\nmm\n±1\n14\n14\n14\n14\n14\n14\nH\nmm\n±2\n25\n25\n25\n16\n16\n16\nL\nmm\n±2\n59\n59\n33\n33\n59\n59\nW\nmm\n+0.05, –0.00\n12\n6\n6\n3\n3\n6\nZ\nmm\n±1\n13\n13\n13\n13\n13\n13",
    "A Dies whose dimensions are expressed in metric units are not exactly the same as dies whose dimensions are expressed in U.S. customary units. Dies dimensioned in metric units are intended for use with apparatus calibrated in metric units.\n\nB For dies used in clicking machines it is preferable that this tolerance be ±0.5 mm.",
    "Dimensions of Standard Dumbbell DiesA (U.S. Customary Units)\nDimension\nUnits\nTolerance\nDie A\nDie B\nDie C\nDie D\nDie E\nDie F\nA\nin.\n±0.04\n1\n1\n1\n0.62\n0.62\n0.62\nB\nin.\nmax\n1.6\n1.6\n1.6\n1.2\n1.2\n1.2\nC\nin.\nmin\n5.5\n5.5\n4.5\n4\n5\n5\nD\nin.\n±0.25B\n1.25\n1.25\n1.25\n1.25\n1.25\n1.25\nD-E\nin.\n±0.04\n0.5\n0.5\n0.5\n0.5\n0.5\n0.5\nF\nin.\n±0.08\n1.5\n1.5\n0.75\n0.75\n1.5\n1.5\nG\nin.\n±0.04\n0.56\n0.56\n0.56\n0.56\n0.56\n0.56\nH\nin.\n±0.08\n1\n1\n1\n0.63\n0.63\n0.63\nL\nin.\n±0.08\n2.32\n2.32\n1.31\n1.31\n2.32\n2.32\nW\nin.\n+0.002, –0.000\n0.500\n0.250\n0.250\n0.125",
    "0.63\n0.63\nL\nin.\n±0.08\n2.32\n2.32\n1.31\n1.31\n2.32\n2.32\nW\nin.\n+0.002, –0.000\n0.500\n0.250\n0.250\n0.125\n0.125\n0.250\nZ\nin.\n±0.04\n0.5\n0.5\n0.5\n0.5\n0.5\n0.5",
    "A Dies whose dimensions are expressed in metric units are not exactly the same as dies whose dimensions are expressed in U.S. customary units.\n\nB For dies used in clicking machines it is preferable that this tolerance by ±0.02 in.\n\n10.4.2 Grips for testing straight specimens shall be constant pressure pneumatic, wedged, or toggle type designed to transmit the applied gripping force over the entire width of the gripped specimen.\n\n## 11. Specimens",
    "## 11. Specimens\n\n11.1 *Dumbbell Specimens—*Prepare five specimens for testing.\n\n11.1.1 The test specimens may be injection molded or cut from a flat sheet not less than 1.3 mm (0.05 in.) nor more than 3.3 mm (0.13 in.) thick and of a size which will permit cutting a specimen by one of the standard methods (refer to Fig. 2 for the standard methods). Refer to 7.1 regarding thermoplastic rubber or thermoplastic elastomer specimens.",
    "11.1.1.1 Sheets may be prepared directly by processing or from finished articles by cutting and buffing. If obtained from a manufactured article, the specimen shall be free of surface roughness, fabric layers, etc. in accordance with the procedure described in Practice D3183.\n\n11.1.2 The preferred method of preparing specimens is by compression molding. The mold shall have cavities in depth and of a configuration described in subsection 8.2.2 of Practice D3182.",
    "11.1.2.1 The specimens may be die-cut from the molded piece using Die C (refer to Fig. 2) unless otherwise specified.\n\nCut the specimens from the sheet with a single impact stroke (hand or machine) to ensure smooth cut surfaces.\n\n11.1.3 All specimens shall be cut so that the lengthwise portion of the specimens is parallel to the grain unless otherwise specified. Refer to 7.1.1 regarding anisotropy or grain directionality.",
    "11.1.4 An alternative method of preparing dumbbell specimens is to mold them directly in the form of the dies described in Fig. 2 to the depth and of a configuration described in subsection 8.2.2 of Practice D3182.",
    "11.1.5 *Marking Dumbbell Specimens—*Dumbbell specimens shall be marked with the bench marker described in 10.2, with no tension on the specimens at the time of marking. Marks shall be placed on the reduced section, equidistant from its center and perpendicular to the longitudinal axis. The between bench mark distance shall be as follows: for Die C or Die D of Fig. 2, 25.00 6 0.25 mm (1.00 6 0.01 in.); for any other Die of Fig. 2, 50.00 6 0.5 mm (2.00 6 0.02 in.).",
    "11.1.6 Measuring Thickness of Dumbbell Specimens—",
    "Three measurements shall be made for the thickness, one at the center and one at each end of the reduced section. The median of the three measurements shall be used as the thickness in calculating the cross sectional area. Specimens with a difference between the maximum and the minimum thickness exceeding 0.08 mm (0.003 in.), shall be discarded. The width of the specimen shall be taken as the distance between the cutting edges of the die in the restricted section.",
    "11.2 *Straight Specimens—*Straight specimens may be prepared if it is not practical to cut either a dumbbell or a ring specimen as in the case of a narrow strip, small tubing or narrow electrical insulation material. These specimens shall be of sufficient length to permit their insertion in the grips used for the test. Bench marks shall be placed on the specimens as described for dumbbell specimens in 11.1.5. To determine the cross sectional area of straight specimens in the form of tubes, the",
    "in 11.1.5. To determine the cross sectional area of straight specimens in the form of tubes, the mass, length, and density of the specimen may be required. The cross sectional area shall be calculated from these measurements as follows:",
    "$$A=M/DL\\tag{1}$$\n\nwhere:\n\n$A$ = cross-sectional area, cm${}^{2}$,\n\n$M$ = mass, g,\n\n$D$ = density, g/cm${}^{3}$, and\n\n$L$ = length, cm.\n\nNote 6--$A$ in square inches = $A$ (cm${}^{2}$) $\\times$ 0.155.\n\n## 12. Procedure",
    "12.1 Determination of Tensile Stress, Tensile Strength and Yield Point—Place the dumbbell or straight specimen in the grips of the testing machine, using care to adjust the specimen symmetrically to distribute tension uniformly over the cross section. This avoids complications that prevent the maximum strength of the material from being evaluated. Unless otherwise specified, the rate of grip separation shall be 500 6 50 mm/min",
    "(20 6 2 in./min) (see Note 7). Start the machine and note the distance between the bench marks, taking care to avoid parallax. Record the force at the elongation(s) specified for the test and at the time of rupture. The elongation measurement is made preferably through the use of an extensometer, an autographic mechanism or a spark mechanism. At rupture, measure and record the elongation to the nearest 10 %. See Section 13 for calculations.",
    "NOTE 7—For materials having a yield point (yield strain) under 20 %\nelongation when tested at 500 6 50 mm/min (20 6 2 in./min), the rate of elongation shall be reduced to 50 6 5 mm/min (2.0 6 0.2 in./min). If the material still has a yield point (strain) under 20 % elongation, the rate shall be reduced to 5 6 0.5 mm/min (0.2 6 0.002 in./min). The actual rate of separation shall be reported.",
    "12.2 *Determination of Tensile Set—*Place the specimen in the grips of the testing machine described in 6.1 or the apparatus shown in Fig. 1, and adjust symmetrically so as to distribute the tension uniformly over the cross section. Separate the grips at a rate of speed as uniformly as possible, that requires 15 s to reach the specified elongation. Hold the specimen at the specified elongation for 10 min, release quickly without allowing it to snap back and allow the specimen to rest for 10",
    "for 10 min, release quickly without allowing it to snap back and allow the specimen to rest for 10 min. At the end of the 10 min rest period, measure the distance between the bench marks to the nearest 1 % of the original between bench mark distance. Use a stop watch for the timing operations. See Section 13 for calculations.",
    "12.3 *Determination of Set-After-Break—*Ten minutes after a specimen is broken in a normal tensile strength test, carefully fit the two pieces together so that they are in good contact over the full area of the break. Measure the distance between the bench marks. See Section 13 for calculations.\n\n## 13. Calculation\n\n13.1 Calculate the tensile stress at any specified elongation as follows:",
    "## 13. Calculation\n\n13.1 Calculate the tensile stress at any specified elongation as follows:\n\n$$T_{(\\rm xxx)}=F_{(\\rm xxx)}/A\\tag{2}$$\nwhere:\nT(xxx)\n= tensile stress at (xxx) % elongation, MPa (lbf/in.2), F(xxx)\n= force at specified elongation, MN or (lbf), and A\n= cross-sectional area of unstrained specimen, m2\n(in.2).\n\n13.2 Calculate the yield stress as follows:",
    "13.2 Calculate the yield stress as follows:\n\n$$Y_{\\rm{(stress)}}=F_{\\rm{(y)}}/A\\tag{3}$$\nwhere:\nY(stress)\n= yield stress, that stress level where the yield point occurs, MPa (lbf/in.2), F(y)\n= magnitude of force at the yield point, MN (lbf), and A\n= cross-sectional area of unstrained specimen, m2\n\n(in.2).\n13.3 Evaluate the yield strain as that strain or elongation magnitude, where the rate of change of stress with respect to strain, goes through a zero value.",
    "13.4 Calculate the tensile strength as follows:\n\n$$\\rm TS=F_{\\rm(BE)}/A\\tag{4}$$\nwhere:\nTS\n= tensile strength, the stress at rupture, MPa (lbf/in.2), F(BE)\n= the force magnitude at rupture, MN (lbf), and A\n= cross-sectional area of unstrained specimen, m2\n\n(in.2).\n13.5 Calculate the elongation (at any degree of extension) as follows:",
    "(in.2).\n13.5 Calculate the elongation (at any degree of extension) as follows:\n\n$$E=100[L-L_{(0)}]/L_{(0)}\\tag{5}$$\nwhere:\nE\n= the elongation in percent (of original bench mark distance), L\n= observed distance between bench marks on the extended specimen, and L(o)\n= original distance between bench marks (use same units for L and L(o)).\n\n13.6 The breaking or ultimate elongation is evaluated when L is equal to the distance between bench marks at the point of specimen rupture.",
    "13.7 Calculate the tensile set, by using Eq 5, where L is equal to the distance between bench marks after the 10 min retraction period.\n\n13.8 *Test Result—*A test result is the median of three individual test measurement values for any of the measured properties as described above, for routine testing. There are two exceptions to this and for these exceptions a total of five specimens (measurements) shall be tested and the test result reported as the median of five.",
    "13.8.1 *Exception 1—*If one or two of the three measured values do not meet specified requirement values when testing for compliance with specifications.\n\n13.8.2 *Exception 2—*If referee tests are being conducted.\n\n## Test Method B—Cut Ring Specimens 14. Apparatus",
    "## Test Method B—Cut Ring Specimens 14. Apparatus\n\n14.1 *Cutter—*A typical ring cutter assembly is illustrated in Fig. 3. This is used for cutting rings from flat sheets by mounting the upper shaft portion of the cutter in a rotating housing that can be lowered onto a sheet held by the rubber holding plate as shown in Fig. 4.",
    "14.1.1 *Blade Depth Gauge—*This gauge consists of a cylindrical disk having a thickness of at least 0.5 mm (0.02 in.)\ngreater than the thickness of the rubber to be cut and a diameter less than the inside diameter of the specimen used for adjusting the protrusion of the blades from the body of the cutter. See Fig. 3.",
    "14.2 *Rubber Holding Plate—*The apparatus for holding the sheet during cutting shall have plane parallel upper and lower surfaces and shall be a rigid polymeric material (hard rubber, polyurethane, polymethylmethacrylate) with holes approximately 1.5 mm (0.06 in.) in diameter spaced 6 or 7 mm (0.24 or 0.32 in.) apart across the central region of the plate. All the holes shall connect to a central internal cavity which can be maintained at a reduced pressure for holding the sheet in place due to",
    "internal cavity which can be maintained at a reduced pressure for holding the sheet in place due to atmospheric pressure. Fig. 4 illustrates the design of an apparatus for holding standard sheets (approximately 150 × 150 × 2 mm) during cutting.",
    "14.3 *Source of Reduced Pressure—*Any device such as a vacuum pump that can maintain an absolute pressure below 10 kPa (0.1 atm) in the holding plate central cavity.\n\n14.4 *Soap Solution—*A mild soap solution shall be used on the specimen sheet to lubricate the cutting blades.",
    "14.5 *Cutter Rotator—*A precision drill press or other suitable machine capable of rotating the cutter at an angular speed of at least 30 rad/s (approximately 300 r/min) during cutting shall be used. The cutter rotator device shall be mounted on a horizontal base and have a vertical support orientation for the shaft that rotates the spindle and cutter. The run-out of the rotating spindle shall not exceed 0.01 mm (0.004 in.).",
    "14.6 *Indexing Table—*A milling table or other device with typical *x-y* motions shall be provided for positioning the sheet and holder with respect to the spindle of the cutter rotating device.\n\n14.7 *Tensile Testing Machine—*A machine as specified in\n6.1 shall be provided.\n\n14.8 *Test Fixture—*A test fixture as shown in Fig. 5 shall be provided for testing the ring specimens. The testing machine shall be calibrated as outlined in Section 8.",
    "14.9 *Test Chamber—*A chamber for testing at high and low temperatures shall be provided as specified in 6.2.\n\n14.9.1 The fixtures specified in 14.8 are satisfactory for testing at other than room temperature. However at extreme temperatures, a suitable lubricant shall be used to lubricate the spindle bearings.\n\n14.9.2 The dynamometer shall be suitable for use at the temperature of test or thermally insulated from the chamber.",
    "14.10 *Micrometer—*A digital or analogue dial micrometer conforming to the requirements of Practice D3767. Procedure A2 is the preferred method for measuring the dimensions of the cut-rings. Either the dome-dome contact arrangement described in 9.2.2.1 or the dome-flat contact arrangement described in 9.2.2.3 of Practice D3767 are acceptable.",
    "14.11 The radial width of the cut-ring is measured using a micrometer with a base that shall consist of an upper cylindrical surface (with its axis oriented in a horizontal direction) at least 12 mm (0.5 in.) long and 15.5 6 0.5 mm (0.61 6 0.02 in.)",
    "| Dimension   |   mm |   in. | Dimension   |   mm |   in. |\n|-------------|------|-------|-------------|------|-------|\n| A           |  178 |  7    | F           | 19   | 0.75  |\n| B           |  152 |  6    | G           | 23   | 0.9   |\n| C           |   89 |  3.5  | H           |  1.5 | 0.062 |\n| D           |  229 |  9    |             |      |       |\n| E           |    6 |  0.25 |             |      |       |\n\n## 15. Ring Specimen",
    "## 15. Ring Specimen\n\n15.1 *ASTM Cut Rings—*Two types of cut ring specimens may be used. Unless otherwise specified, the Type 1 ring specimen shall be used.\n\n15.1.1 Ring Dimensions:\nmm in.",
    "Type 1",
    "in diameter. To accommodate small diameter rings that approach the 15.5 mm (0.61 in.) diameter of the base and to avoid any ring extension in placing the ring on the base, the bottom half of the cylindrical surface may be truncated at the cylinder centerline, that is, a half cylinder shape. This permits placing small rings on the upper cylindrical surface without interference fit problems. Curved feet on the end of the dial micrometer shaft to fit the curvature of the ring(s), may be used.",
    "| Circumference (inside)                                       | 50.0 ± 0.01   | 2.0 ± 0.004    |\n|--------------------------------------------------------------|---------------|----------------|\n| Diameter (inside)                                            | 15.92 ± 0.003 | 0.637 ± 0.001  |\n| Radial width                                                 | 1.0 ± 0.01    | 0.040 ± 0.0004 |\n| Thickness, minimum                                           | 1.0           | 0.040          |",
    "| Thickness, minimum                                           | 1.0           | 0.040          |\n| maximum                                                      | 3.3           | 0.13           |\n| Type 2                                                       |               |                |\n| Circumference mean                                           | 100.0 ± 0.2   | 4.0 ± 0.0004   |\n| Diameter (inside)                                            | 29.8 ± 0.06   | 1.19 ± 0.0001  |",
    "| Diameter (inside)                                            | 29.8 ± 0.06   | 1.19 ± 0.0001  |\n| Radial width                                                 | 2.0 ± 0.02    | 0.08 ± 0.0008  |\n| Thickness, minimum                                           | 1.0           | 0.04           |\n| maximum                                                      | 3.3           | 0.13           |\n| 15.2                                                         |               |                |",
    "| 15.2                                                         |               |                |\n| ISO Cut Rings—                                               |               |                |\n| The normal size and the small size                           |               |                |\n| ring specimens in ISO 37 have the following dimensions given |               |                |\n| in mm. See ISO 37 for specific testing procedures for these  |               |                |",
    "| in mm. See ISO 37 for specific testing procedures for these  |               |                |\n| rings.                                                       |               |                |\n| Normal                                                       | Small         |                |\n| Diameter, inside                                             | 44.6 ± 0.2 mm | 8.0 ± 0.1 mm   |\n| Diameter, outside                                            | 52.6 ± 0.2 mm | 10.0 ± 0.1 mm  |",
    "| Diameter, outside                                            | 52.6 ± 0.2 mm | 10.0 ± 0.1 mm  |\n| Thickness                                                    | 4.0 ± 0.2 mm  | 1.0 ± 0.1 mm   |\n| 15.3                                                         |               |                |\n| Rings Cut from Tubing—                                       |               |                |\n| The dimensions of the ring                                   |               |                |",
    "| The dimensions of the ring                                   |               |                |\n| specimen(s) depend on the diameter and wall thickness of the |               |                |\n| tubing and should be specified in the product specification. |               |                |",
    "15.4 *Preparation of Cut Ring Specimens—*Place the blades in the slots of the cutter and adjust the blade depth using the blade depth gauge. Place the cutter in the drill press and adjust the spindle or table so that the bottom of the blade holder is about 13 mm (0.5 in.) above the surface of the holding plate. Set the stop on the vertical travel of the spindle so that the tips of the cutting blades just penetrate the surface of the plate. Place the sheet on the holding plate and reduce the",
    "blades just penetrate the surface of the plate. Place the sheet on the holding plate and reduce the pressure in the cavity to 10 kPa (0.1 atm) or less. Lubricate the sheet with mild soap solution. Lower the cutter at a steady rate until it reaches the stop. Be sure that the blade holder does not contact the sheet. If necessary, readjust the blade depth. Return the spindle to its original position and repeat the operation on another sheet.",
    "15.5 *Preparation of Ring Specimens from Tubing—*Place the tubing on a mandrel preferably slightly larger than the inner diameter of the tubing. Rotate the mandrel and tubing in a lathe. Cut ring specimens to the desired axial length by means of a knife or razor blade held in the tool post of the lathe. Lay thin wall tubing flat and cut ring specimens with a die or cutting mechanism having two parallel blades.",
    "15.6 Ring Dimension Measurements:\n15.6.1 *Circumference—*The inside circumference can be determined by a stepped cone or by \"go-no go\" gauges. Do not use any stress in excess of that needed to overcome any ellipticity of the ring specimen. The mean circumference is obtained by adding to the value for the inside circumference, the product of the radial width and π (3.14).",
    "15.6.2 *Radial Width—*The radial width is measured at three locations distributed around the circumference using the micrometer described in 14.11.\n\n15.6.3 *Thickness—*For cut rings, the thickness of the disk cut from the inside of the ring is measured with a micrometer described in Practice D3767, Procedure A2, refer to 14.10.",
    "15.6.4 *Cross-Sectional Area—*The cross-sectional area is calculated from the median of three measurements of radial width and thickness. For thin wall tubing, the area is calculated from the axial length of the cut section and wall thickness.\n\n## 16. Procedure",
    "## 16. Procedure\n\n16.1 Determination of Tensile Stress, Tensile Strength, Breaking (Ultimate) Elongation and Yield Point—In testing ring specimens, lubricate the surface of the spindle with a suitable lubricant, such a mineral oil or silicone oil. Select one with documented assurance that it does not interact or affect the material being tested. The initial setting of the distance between the spindle centers may be calculated and adjusted according to the following equation:",
    "$$\\begin{array}{l}\\mbox{$\\rm IS=[C_{\\rm TS}]-C_{\\rm[SF]}/2$}\\end{array}\\tag{6}$$\nwhere:\nIS\n= initial separation of spindle centers, mm (in.), C(TS)\n= circumference of test specimen, inside circumference for Type 1 rings, mean circumference for Type 2 rings, mm (in.), and C (SP)\n= circumference of either (one) spindle, mm (in.).",
    "Unless otherwise specified the rate of spindle separation shall be 500 6 50 mm/min (20 6 2 in./min) (see Note 8). Start the test machine and record the force and corresponding distance between the spindles. At rupture, measure and record the ultimate (breaking) elongation and the tensile (force)\nstrength. See Section 17 for calculations.\n\nNOTE 8—When using the small ISO ring, the rate of spindle separation shall be 100 6 10 mm/min (4 6 0.4 in./min).",
    "16.2 *Tests at Temperatures Other than Standard—*Use the test chamber described in 6.2. For tests at temperatures above\n23°C (73.4°F), preheat the specimens 6 6 2 min at the test temperature. For below room temperature tests cool the specimens at the test temperature for at least 10 min prior to test.\n\nUse test temperatures prescribed in Practice D1349. Place each specimen in the test chamber at intervals such that the recommendations of 9.2 are followed.\n\n## 17. Calculation",
    "17.1 Stress-strain properties for ring specimens are in general calculated in the same manner as for dumbbell and straight specimens with one important exception. Extending a ring specimen generates a nonuniform stress (or strain) field across the width (as viewed from left to right) of each leg of the ring. The initial inside dimension (circumference) is less than the outside dimension (circumference), therefore for any extension of the grips, the inside strain (or stress) is greater than the",
    "therefore for any extension of the grips, the inside strain (or stress) is greater than the outside strain (or stress) because of the differences in the initial (unstrained) dimensions.",
    "17.2 The following options are used to calculate stress at a specified elongation (strain) and breaking or ultimate elongation.\n\n17.2.1 *Stress at a Specified Elongation—*The mean circumference of the ring is used for determining the elongation. The rationale for this choice is that the mean circumference best represents the average strain in each leg of the ring.",
    "17.2.2 *Ultimate (Breaking) Elongation—*This is calculated on the basis of the inside circumference since this represents the maximum strain (stress) in each leg of the ring. This location is the most probable site for the initiation of the rupture process that occurs at break.\n\n17.3 Calculate the tensile stress at any specified elongation by using Eq 2 in 13.1.\n\n17.3.1 The elongation to be used to evaluate the force as specified in Eq 2 (13.1), is calculated as follows:",
    "$E=200$[LIMC${}_{\\rm[TS]}$]\nwhere:\nE\n= elongation (specified), percent, L\n= increase in grip separation at specified elongation, mm (in.), and MC(TS)\n= mean circumference of test specimen, mm (in.).\n\n17.3.2 The grip separation for any specified elongation can be found by rearranging Eq 7, as given below:\n\n$L=E\\times MC_{\\rm TS}/200$ (8)\n17.4 Calculate the yield stress by using Eq 3 in 13.2.",
    "$L=E\\times MC_{\\rm TS}/200$ (8)\n17.4 Calculate the yield stress by using Eq 3 in 13.2.\n\n17.5 Evaluate the yield strain as given in 13.3. Since yield strain may be considered to be an average bulk property of any material, use the mean circumference for this evaluation.\n\n17.6 Calculate the tensile strength by using Eq 4 in 13.4.\n\n17.7 Calculate the breaking or ultimate elongation as follows (see Notes 8 and 9):",
    "17.7 Calculate the breaking or ultimate elongation as follows (see Notes 8 and 9):\n\n$E=200\\times[LIC_{(\\rm TS)}]$ (9)\nwhere:\nE\n= breaking or ultimate elongation, percent, L\n= increase in grip separation at break, mm (in.), and IC(TS)\n= inside circumference of ring test specimen, mm\n(in.).\n\n17.8 The inside circumference is used for both types of rings, see 15.1.1 for dimensions. Use the inside diameter to calculate the inside circumference for Type 2 rings.",
    "of the different dimensions used in calculating (1) stress at a specified elongation (less than the ultimate elongation) and (2) the ultimate\n(breaking) elongation (see 17.1 and 17.2), it is possible that a stress at a specified elongation, slightly less (4 to 5 %) than the ultimate elongation cannot be measured (calculated).\n\n## 18. Report",
    "## 18. Report\n\n18.1 Report the following information:\n18.1.1 Results calculated in accordance with Section 13 or\n17, whichever is applicable,\n18.1.2 Type or description of test specimen and with Section\n13 which type of die, either U.S. Customary Units or Metric Units, was used.",
    "18.1.3 Date of test, 18.1.4 Rate of extension if not as specified, 18.1.5 Temperature and humidity of test room if not as specified,\n18.1.6 Temperature of test if at other than 23 6 2°C (73.4 6\n3.6°F) and\n18.1.7 Date of vulcanization, preparation of the rubber, or both, if known.\n\n## 19. Precision And Bias5\n\n19.1 This precision and bias section has been prepared in accordance with Practice D4483. Refer to Practice D4483 for terminology and other statistical details.",
    "19.2 The precision results in this precision and bias section give an estimate of the precision of these test methods with the materials used in the particular interlaboratory program as described below. The precision parameters should not be used for acceptance/rejection testing of any group of materials without documentation that the parameters are applicable to those particular materials and the specific testing protocols that include these test methods.",
    "19.3 Test Method A (Dumbbells): 19.3.1 For the main interlaboratory program a Type 1\nprecision was evaluated in 1986. Both repeatability and reproducibility are short term, a period of a few days separates replicate test results. A test result is the median value, as specified by this test method, obtained on three determination(s) or measurement(s) of the property or parameter in question.",
    "19.3.2 Three different materials were used in this interlaboratory program, these were tested in ten laboratories on two different days.",
    "19.3.3 For the main interlaboratory program cured sheets of each of the three compounds were circulated to each laboratory and stress-strain (dumbbell) specimens were cut, gauged, and tested. A secondary interlaboratory test was conducted for one of the compounds (R19160). For this testing, uncured compound was circulated and sheets were cured at a specified time and temperature (10 min at 157°C) in each laboratory. From these individually cured sheets, test specimens were cut and tested on",
    "in each laboratory. From these individually cured sheets, test specimens were cut and tested on each of two days one week apart as in the main program. The main program results are referred to as \"Test Only\" and the secondary program results are referred to as \"Cure and Test.\"",
    "19.3.4 The results of the precision calculations for repeatability and reproducibility are given in Tables 1 and 2, in ascending order of material average or level, for each of the materials evaluated and for each of the three properties evaluated.",
    "19.3.5 The precision of this test method may be expressed in the format of the following statements that use what is called an \"appropriate value\" of *r, R,* (r), or (R), that is, that value to be used in decisions about test results (obtained with the test method). The appropriate value is that value of r or R\nassociated with a mean level in Tables 1-4 closest to the mean level under consideration at any given time, for any given material in routine testing operations.",
    "19.3.6 *Repeatability—*The repeatability, r, of this test method has been established as the appropriate value tabulated in Tables 1 and 2. Two single test results, obtained under normal test method procedures, that differ by more than this tabulated r (for any given level) must be considered as derived from different or nonidentical sample populations.",
    "NOTE 1—\nSr = repeatability standard deviation. r = repeatability = 2.83 times the square root of the repeatability variance. (r) = repeatability (as percentage of material average). SR = reproducibility standard deviation. R = reproducibility = 2.83 times the square root of the reproducibility variance. (R) = reproducibility (as percentage of material average).",
    "Part 1 Tensile Strength, MPa:\nMaterial\nAverage\nWithin Laboratories\nBetween Laboratories\nSr\nr\n(r)\nSR\nR\n(R)\n1. N18081\n9.88\n0.200\n0.568\n5.75\n0.293\n0.829\n8.40\n3. E17074\n15.38\n0.467\n1.323\n8.60\n0.482\n1.366\n8.88\n2. R19160\n25.70\n0.436\n1.235\n4.80\n1.890\n5.351\n20.82\nPooled ValuesA\n16.99\n0.385\n1.090\n6.42\n1.102\n3.120\n18.37\nPart 2 Percent Elongation:\nMaterial\nAverage\nWithin Laboratories\nBetween Laboratories\nSr\nr\n(r)\nSR\nR\n(R)\n3. E17074\n156.3\n6.304\n17.842\n11.41\n11.481\n32.492\n20.78\n2. R19160\n510.4\n11.471",
    "Sr\nr\n(r)\nSR\nR\n(R)\n3. E17074\n156.3\n6.304\n17.842\n11.41\n11.481\n32.492\n20.78\n2. R19160\n510.4\n11.471\n32.464\n6.36\n21.243\n60.120\n11.77\n1. N18081\n591.6\n17.810\n50.402\n8.52\n27.198\n76.972\n13.01\nPooled ValuesA\n419.4\n12.761\n36.114\n8.61\n20.999\n59.427\n14.16\nPart 3 Stress at 100 % Elongation, MPa:\nMaterial\nAverage\nWithin Laboratories\nBetween Laboratories\nSr\nr\n(r)\nSR\nR\n(R)\n1. N18081\n1.17\n0.053\n0.151\n12.96\n0.061\n0.1744\n14.92\n2. R19160\n2.01\n0.050\n0.142\n7.10\n0.274\n0.7755\n38.62\n3. E17074\n9.08\n0.489\n1.385\n15.25",
    "0.1744\n14.92\n2. R19160\n2.01\n0.050\n0.142\n7.10\n0.274\n0.7755\n38.62\n3. E17074\n9.08\n0.489\n1.385\n15.25\n0.738\n2.0910\n23.02\nPooled ValuesA\n4.09\n0.285\n0.808\n19.79\n0.456\n1.2915\n31.60",
    "A No values omitted.\n\nNOTE 1—\nSr = repeatability standard deviation. r = repeatability = 2.83 times the square root of the repeatability variance. (r) = repeatability (as percentage of material average). SR = reproducibility standard deviation. R = reproducibility = 2.83 times the square root of the reproducibility variance. (R) = reproducibility (as percentage of material average).",
    "NOTE 2—\nN18081—highly extended, low durometer CR (Neoprene). R19160—high tensile NR. E17047—moderately filled EPDM.",
    "Part 1 Tensile Strength, MPa:\nMaterial\nAverage\nWithin Laboratories\nBetween Laboratories\nSr\nr\n(r)\nSR\nR\n(R)\n1. R19160\n26.0\n0.613\n1.73\n6.66\n1.74\n4.95\n19.0\nPart 2 Percent Elongation:\nMaterial\nAverage\nWithin Laboratories\nBetween Laboratories\nSr\nr\n(r)\nSR\nR\n(R)\n1. R19160\n526.9\n13.32\n37.7\n7.15\n19.6\n55.70\n10.5\nPart 3 Stress at 100 % Elongation, MPa:\nMaterial\nAverage\nWithin Laboratories\nBetween Laboratories\nSr\nr\n(r)\nSR\nR\n(R)\n1. R19160\n1.83\n0.072\n0.205\n11.21\n0.226\n0.641\n34.5",
    "A Seven laboratories participated in this cure and test program.\n\nthat differ by more than the tabulated R (for any given level) must be considered to have come from different or nonidentical sample populations.",
    "19.3.7 *Reproducibility—*The reproducibility, R, of this test method has been established as the appropriate value tabulated in Tables 1 and 2. Two single test results obtained in two different laboratories, under normal test method procedures, NOTE 1—",
    "Sr = repeatability standard deviation. r = repeatability = 2.83 times the square root of the repeatability variance. (r) = repeatability (as percentage of material average). SR = reproducibility standard deviation. R = reproducibility = 2.83 times the square root of the reproducibility variance. (R) = reproducibility (as percentage of material average).",
    "Tensile Strength (MPa)\nMaterial\nAverage\nWithin Laboratories\nBetween Laboratories\nSr\nr\n(r)\nSR\nR\n(R)\n5. MATL 5\n11.5\n0.666\n1.885\n16.3\n1.43\n4.06\n35.3\n6. MATL 6\n12.7\n0.274\n0.775\n6.0\n0.83\n2.35\n18.5\n1. MATL 1\n14.6\n0.367\n1.040\n7.1\n0.40\n1.15\n7.9\n4. MATL 4\n15.0\n0.553\n1.565\n10.4\n3.03\n8.59\n57.2\n2. MATL 2\n20.3\n1.293\n3.660\n18.0\n2.47\n6.99\n34.4\n3. MATL 3\n22.3\n1.556\n4.405\n19.6\n1.55\n4.40\n19.6\nPooled ValuesA\n15.9\n0.942\n2.666\n16.7\n1.87\n5.31\n33.3\n\nA No values omitted.",
    "A No values omitted.\n\nNOTE 1—\nSr = repeatability standard deviation. r = repeatability = 2.83 times the square root of the repeatability variance. (r) = repeatability (as percentage of material average). SR = reproducibility standard deviation. R = reproducibility = 2.83 times the square root of the reproducibility variance. (R) = reproducibility (as percentage of material average).",
    "Ultimate Elongation, %\nMaterial\nAverage\nWithin Laboratories\nBetween Laboratories\nSr\nr\n(r)\nSR\nR\n(R)\n1. MATL 1\n322.1\n15.25\n43.18\n13.40\n33.4\n94.7\n29.4\n2. MATL 2\n445.4\n11.35\n32.12\n7.21\n34.1\n96.6\n21.7\n4. MATL 4\n509.4\n27.44\n77.65\n15.24\n51.1\n144.8\n28.4\n5. MATL 5\n545.0\n2.91\n8.25\n1.51\n56.3\n159.5\n29.2\n6. MATL 6\n599.7\n12.91\n36.55\n6.09\n14.0\n39.6\n6.60\n3. MATL 3\n815.8\n16.25\n45.99\n5.63\n90.6\n256.5\n31.4\nPooled ValuesA\n539.6\n16.54\n46.82\n8.67\n48.2\n136.4\n25.2\nA No values omitted.",
    "19.3.8 Repeatability and reproducibility expressed as a percentage of the mean level, (r) and (R), have equivalent application statements as above for r and R. For the (r) and (R)\nstatements, the difference in the two single test results is expressed as a percentage of the arithmetic mean of the two test results.",
    "19.3.9 *Bias—*In test method terminology, bias is the difference between an average test value and the reference (or true) test property value. Reference values do not exist for this test method since the value (of the test property) is exclusively defined by the test method. Bias, therefore, cannot be determined.",
    "19.4 Test Method B (Rings):\n19.4.1 A Type 1 precision was evaluated in 1985. Both repeatability and reproducibility are short term, a period of a few days separates replicate test results. A test result is the mean value, as specified by this test method, obtained on three determinations or measurements of the property or parameter in question.\n\n19.4.2 Six different materials were used in the interlaboratory program, these were tested in four laboratories on two different days.",
    "19.4.3 The results of the precision calculations for repeatability and reproducibility are given in Tables 3 and 4, in ascending order of material average or level, for each of the materials evaluated.\n\n19.4.4 Repeatability, r, varies over the range of material levels as evaluated. Reproducibility, R, varies over the range of material levels as evaluated.",
    "19.4.5 The precision of this test method may be expressed in the format of the following statements that use what is called an \"appropriate value\" of *r, R,* (r), or (R), that is, that value to be used in decisions about test results (obtained with the test method). The appropriate value is that value of r or R\nassociated with a mean level in Tables 1-4 closest to the mean level under consideration at any given time, for any given material in routine testing operations.",
    "19.4.6 *Repeatability—*The repeatability, r, of this test method has been established as the appropriate value tabulated in Tables 3 and 4. Two single test results, obtained under normal test method procedures, that differ by more than this tabulated r (for any given level) must be considered as derived from different or nonidentical sample populations.",
    "19.4.9 *Bias—*In test method terminology, bias is the difference between an average test value and the reference (or true) test property value. Reference values do not exist for this test method since the value (of the test property) is exclusively defined by the test method. Bias, therefore, cannot be determined.\n\n## 20. Keywords",
    "20.1 elongation; set after break; tensile properties; tensile set; tensile strength; tensile stress; yield point\n19.4.7 *Reproducibility—*The reproducibility, R, of this test method has been established as the appropriate value tabulated in Tables 3 and 4. Two single test results obtained in two different laboratories, under normal test method procedures, that differ by more than the tabulated R (for any given level)",
    "must be considered to have come from different or nonidentical sample populations.",
    "19.4.8 Repeatability and reproducibility expressed as a percentage of the mean level, (r) and (R), have equivalent application statements as 19.3.6 and 19.3.7 for r and R. For the\n(r) and (R) statements, the difference in the two single test results is expressed as a percentage of the arithmetic mean of the two test results.",
    "ASTM International takes no position respecting the validity of any patent rights asserted in connection with any item mentioned in this standard. Users of this standard are expressly advised that determination of the validity of any such patent rights, and the risk of infringement of such rights, are entirely their own responsibility.",
    "This standard is subject to revision at any time by the responsible technical committee and must be reviewed every five years and if not revised, either reapproved or withdrawn. Your comments are invited either for revision of this standard or for additional standards and should be addressed to ASTM International Headquarters. Your comments will receive careful consideration at a meeting of the responsible technical committee, which you may attend. If you feel that your comments have not",
    "the responsible technical committee, which you may attend. If you feel that your comments have not received a fair hearing you should make your views known to the ASTM Committee on Standards, at the address shown below.",
    "This standard is copyrighted by ASTM International, 100 Barr Harbor Drive, PO Box C700, West Conshohocken, PA 19428-2959, United States. Individual reprints (single or multiple copies) of this standard may be obtained by contacting ASTM at the above address or at 610-832-9585 (phone), 610-832-9555 (fax), or service@astm.org (e-mail); or through the ASTM website (www.astm.org). Permission rights to photocopy the standard may also be secured from the Copyright Clearance Center, 222 Rosewood",
    "to photocopy the standard may also be secured from the Copyright Clearance Center, 222 Rosewood Drive, Danvers, MA 01923, Tel: (978) 646-2600; http://www.copyright.com/"
  ]
}