{
  "source": "ASTm D792 2020.md",
  "chunks": [
    "# Designation: D792 −20 Standard Test Methods For Density And Specific Gravity (Relative Density) Of Plastics By Displacement1\n\nThis standard is issued under the fixed designation D792; the number immediately following the designation indicates the year of original adoption or, in the case of revision, the year of last revision. A number in parentheses indicates the year of last reapproval. A\nsuperscript epsilon (´) indicates an editorial change since the last revision or reapproval.",
    "This standard has been approved for use by agencies of the U.S. Department of Defense.\n\n## 1. Scope*\n\n1.1 These test methods describe the determination of the specific gravity (relative density) and density of solid plastics in forms such as sheets, rods, tubes, or molded items.",
    "1.2 Two test methods are described: 1.2.1 *Test Method A—*For testing solid plastics in water, and\n1.2.2 *Test Method B—*For testing solid plastics in liquids\nother than water.\n1.3 The values stated in SI units are to be regarded as the standard.",
    "1.4 Warning—Mercury has been designated by many regu-\nlatory agencies as a hazardous substance that can cause\nserious medical issues. Mercury, or its vapor, has been\ndemonstrated to be hazardous to health and corrosive to\nmaterials. Use caution when handling mercury and mercury-\ncontaining products. See the applicable product Safety Data\nSheet (SDS) for additional information. The potential exists\nthat selling mercury or mercury-containing products, or both,",
    "that selling mercury or mercury-containing products, or both,\nis prohibited by local or national law. Users must determine\nlegality of sales in their location.",
    "1.5 This standard does not purport to address all of the\nsafety concerns, if any, associated with its use. It is the\nresponsibility of the user of this standard to establish appro-\npriate safety, health, and environmental practices and deter-\nmine the applicability of regulatory limitations prior to use.\n\nNOTE 1—This standard is not equivalent to ISO 1183–1 Method A. This test method provides more guidelines on sample weight and dimension.",
    "ISO 1183-1 allows testing at an additional temperature of 27 6 2°C.\n\n1.6 This international standard was developed in accordance with internationally recognized principles on standardization established in the Decision on Principles for the Development of International Standards, Guides and Recommendations issued by the World Trade Organization Technical Barriers to Trade (TBT) Committee.\n\n## 2. Referenced Documents",
    "## 2. Referenced Documents\n\n2.1 *ASTM Standards:*2\nD618 Practice for Conditioning Plastics for Testing D891 Test Methods for Specific Gravity, Apparent, of Liquid\nIndustrial Chemicals\nD4968 Practice for Annual Review of Test Methods and\nSpecifications for Plastics\nD6436 Guide for Reporting Properties for Plastics and\nThermoplastic Elastomers\n\nE12 Terminology Relating to Density and Specific Gravity\nof Solids, Liquids, and Gases (Withdrawn 1996)3",
    "| E456                                     |  Terminology Relating to Quality and Statistics     |\n|------------------------------------------|-----------------------------------------------------|\n| E691                                     | Practice for Conducting an Interlaboratory Study to |\n| Determine the Precision of a Test Method |                                                     |\n| E2251                                    | Specification for Liquid-in-Glass ASTM Thermom-     |",
    "| E2251                                    | Specification for Liquid-in-Glass ASTM Thermom-     |\n| eters with Low-Hazard Precision Liquids  |                                                     |\n| E2935                                    | Practice for Conducting Equivalence Testing in      |\n| Laboratory Applications                  |                                                     |",
    "IEEE/ASTM SI-10 Practice for Use of the International\nSystem of Units (SI) (the Modernized Metric System)\n\n## 3. Terminology\n\n3.1 *General—*The units, symbols, and abbreviations used in these test methods are in accordance with IEEE/ASTM SI-10.\n\n3.1.1 For terms relating to precision and bias and associated issues, the terms used in this test method are in accordance with the definitions in Terminology E456.",
    "3.2 Definitions: 3.2.1 *specific gravity (relative density)—*the ratio of the mass of a given volume of the impermeable portion of the material at 23°C to the mass of an equal volume of gas-free distilled or de-mineralized water at the same temperature; the form of expression shall be:\n\nSpecific gravity (relative density) 23/23${}^{\\circ}$C\n\n(or sp gr 23/23${}^{\\circ}$C)",
    "Specific gravity (relative density) 23/23${}^{\\circ}$C\n\n(or sp gr 23/23${}^{\\circ}$C)\n\nNote 2--This definition is essentially equivalent to the definition for apparent specific gravity and apparent density in Terminology E12, because the small percentage difference introduced by not correcting for the buoyancy of air is insignificant for most purposes.\n\n3.2.2 _density_--cubic metre of impermeable portion of the material at 23${}^{\\circ}$C. The form of expression shall be:",
    "$$\\mbox{D}^{23},\\,\\mbox{kg/m}^{3}$$\nNOTE 3—The SI unit of density, as defined in IEEE/ASTM SI-10, is kg/m3. To convert density in g/cm3 to density in kg/m3, multiply by 1000.\n\nNOTE 4—To convert specific gravity 23/23°C to density 23°C, kg/m3, use the following equation:\nD23 C, kg/m3 5 sp gr23/23°C 3997.5\nWhere 997.5 kg/m3 is the density of water at 23°C.\n\n## 4. Summary Of Test Method",
    "## 4. Summary Of Test Method\n\n4.1 Determine the mass of a specimen of the solid plastic in air. It is then immersed in a liquid, its apparent mass upon immersion is determined, and its specific gravity (relative density) calculated.\n\n## 5. Significance And Use",
    "## 5. Significance And Use\n\n5.1 The specific gravity or density of a solid is a property that is conveniently measured to identify a material, to follow physical changes in a sample, to indicate degree of uniformity among different sampling units or specimens, or to indicate the average density of a large item.",
    "5.2 Changes in density of a single material are due to localized differences in crystallinity, loss of plasticizer, absorption of solvent, or to other causes. It is possible that portions of a sample differ in density because of their differences in crystallinity, thermal history, porosity, and composition (types or proportions of resin, plasticizer, pigment, or filler).\n\n5.3 Density is useful for calculating strength-weight and cost-weight ratios.\n\n## 6. Sampling",
    "5.3 Density is useful for calculating strength-weight and cost-weight ratios.\n\n## 6. Sampling\n\n6.1 The sampling units used for the determination of specific gravity (relative density) shall be representative of the quantity of product for which the data are required.",
    "6.1.1 If it is known or suspected that the sample consists of two or more layers or sections having different specific gravities, either complete finished parts or complete cross sections of the parts or shapes shall be used as the specimens, or separate specimens shall be taken and tested from each layer. The specific gravity (relative density) of the total part shall not be obtained by adding the specific gravity of the layers, unless relative percentages of the layers are taken into account.",
    "## 7. Conditioning\n\n7.1 *Conditioning—*Condition the test specimens at\n23 6 2°C and 50 6 10 % relative humidity for not less than 40\nh prior to test in accordance with Procedure A of Practice D618, unless otherwise specified by the contract or relevant material specifications. In cases of disagreement, the tolerances shall be 61°C and 65 % relative humidity.",
    "7.2 *Test Conditions—*Conduct tests in the standard laboratory atmosphere of 23 6 2°C and 50 6 10 % relative humidity, unless otherwise specified in this specification or by the contract or relevant material specification. In cases of disagreement, the tolerances shall be 61°C and 65 % relative humidity.\n\n## Test Method A For Testing Solid Plastics In Water (Specimens 1 To 50 G) 8. Scope",
    "## Test Method A For Testing Solid Plastics In Water (Specimens 1 To 50 G) 8. Scope\n\n8.1 This test method involves weighing a one-piece specimen of 1 to 50 g in water, using a sinker with plastics that are lighter than water. This test method is suitable for plastics that are wet by, but otherwise not affected by water.\n\n## 9. Apparatus",
    "## 9. Apparatus\n\n9.1 *Analytical Balance—*A balance with a precision of 0.1\nmg or better is required for materials having densities less than\n1.00 g/cm3 and sample weights less than 10 grams. For all other materials and sample weights, a balance with precision of 1 mg or better is acceptable. The balance shall be equipped with a stationary support for the immersion vessel above the balance pan (\"pan straddle\").",
    "9.1.1 The balance shall provide the precision that all materials tested have three significant figures on density. In case that materials with different densities are tested on one single balance, use the balance that provides at least three significant figures for all materials concerned.\n\nNOTE 5—To ensure that the balance meets the performance requirements, check on zero point and sensitivity frequently and perform periodic calibration.",
    "9.2 *Sample Holder,* corrosion-resistant (for example, wire, gemholder, etc.).\n\n9.3 *Sinker—*A sinker for use with specimens of plastics that have specific gravities less than 1.00. The sinker shall: (1) be corrosion-resistant; (2) have a specific gravity of not less than\n7.0; (3) have smooth surfaces and a regular shape; and (4) be slightly heavier than necessary to sink the specimen. The sinker shall have an opening to facilitate attachment to the specimen and sample holder.",
    "9.4 *Immersion Vessel—*A beaker or other wide-mouthed vessel for holding the water and immersed specimen.\n\n9.5 *Thermometer—*A thermometer readable to 0.1°C or better.\n\n## 10. Materials\n\n10.1 *Water—*The water shall be substantially air-free and distilled or de-mineralized water. If this solution does not wet the specimen, Method B shall be used.\n\nNOTE 6—Air in water can be removed by boiling and cooling the water, or by shaking the water under vacuum in a heavy-walled vacuum flask.",
    "(**Warning—**Use gloves and shielding.) If the water does not wet the specimen, add a few drops of a wetting agent into the water.\n\n## 11. Test Specimen",
    "11.1 The test specimen shall be a single piece of material with a size and shape suitable for the testing apparatus, provided that its volume shall be not less than 1 cm3 and its surface and edges shall be made smooth. The thickness of the specimen shall be at least 1 mm for each 1 g of weight. A specimen weighing 1 to 5 g was found to be convenient, but specimens up to approximately 50 g are also acceptable (see Note 7). Care shall be taken in cutting specimens to avoid changes in density",
    "also acceptable (see Note 7). Care shall be taken in cutting specimens to avoid changes in density resulting from compressive stresses or frictional heating.",
    "NOTE 7—Specifications for certain plastics require a particular method of specimen preparation and should be consulted if applicable.\n\n11.2 The specimen shall be free from oil, grease, and other foreign matter.\n\n## 12. Procedure\n\n12.1 For density calculation, measure and record the water temperature. This is not needed for specific gravity calculation.",
    "12.2 Weigh the specimen in air. Weigh to the nearest 0.1 mg for specimens of mass 1 to 10 g and density less than 1.00\ng/cm3. Weigh to the nearest 1 mg for other specimens.\n\n12.3 If necessary, attach to the balance a piece of fine wire sufficiently long to reach from the hook above the pan to the support for the immersion vessel. In this case attach the specimen to the wire such that it is suspended about 25 mm above the vessel support.",
    "12.3.1 If a wire is used, weigh the specimen in air after hanging from the wire. In this case, record the mass of the specimen, a = (mass of specimen + wire, in air) −(mass of wire in air).",
    "12.4 Mount the immersion vessel on the support, and completely immerse the suspended specimen (and sinkers, if used) in water (see 10.1) at a temperature of 23 6 2°C. The vessel must not touch sample holder or specimen. Remove any bubbles adhering to the specimen, sample holder, or sinker, by rubbing them with a wire. Pay particular attention to holes in the specimen and sinker. If the bubbles are not removed by this method or if bubbles are continuously formed (as from dissolved gases), the",
    "are not removed by this method or if bubbles are continuously formed (as from dissolved gases), the use of vacuum is recommended (see Note",
    "8). Determine the mass of the suspended specimen to the required precision (see 12.2) (see Note 9). Record this apparent",
    "|                            | TABLE 1 Test Method A   | Specific Gravity Tested in Water   |\n|----------------------------|-------------------------|------------------------------------|\n| Material                   | Mean                    | S                                  |\n| r                          |                         |                                    |\n| A                          |                         |                                    |",
    "| A                          |                         |                                    |\n| S                          |                         |                                    |\n| R                          |                         |                                    |\n| B                          |                         |                                    |\n| r                          |                         |                                    |",
    "| r                          |                         |                                    |\n| C                          |                         |                                    |\n| R                          |                         |                                    |\n| D                          |                         |                                    |\n| Polypropylene              | 0.9007                  | 0.00196                            |",
    "| Polypropylene              | 0.9007                  | 0.00196                            |\n| Cellulose Acetate Butyrate | 1.1973                  | 0.00232                            |\n| Polyphenylene Sulfide      | 1.1708                  | 0.00540                            |\n| Thermoset                  | 1.3136                  | 0.00271                            |\n| Polyvinyl Chloride         | 1.3396                  | 0.00243                            |",
    "A Sr = within laboratory standard deviation for the individual material. It is obtained by pooling the within-laboratory standard deviations of the test results from all of the participating laboratories: Sr = [[(s1)2 + (s 2)2 . . .+(sn )2]/n]1/2\nB SR = between-laboratories reproducibility, expressed as standard deviation: SR = [Sr\n2 + SL\n2]1/2 where S L is the standard deviation of laboratory means.",
    "C r = within-laboratory critical interval between two test results = 2.8 × Sr. D R = between-laboratories critical interval between two test results = 2.8 × SR.\n\nmass as b (the mass of the specimen, sinker, if used, and the partially immersed wire in liquid). Unless otherwise specified, weigh rapidly in order to minimize absorption of water by the specimen.",
    "NOTE 8—Some specimens may contain absorbed or dissolved gases, or irregularities which tend to trap air bubbles; any of these may affect the density values obtained. In such cases, the immersed specimen may be subjected to vacuum in a separate vessel until evolution of bubbles has substantially ceased before weighing (see Test Method B). It must also be demonstrated that the use of this technique leads to results of the required degree of precision.",
    "NOTE 9—It may be necessary to change the sensitivity adjustment of the balance to overcome the damping effect of the immersed specimen.\n\n12.5 Weigh the sample holder (and sinker, if used) in water with immersion to the same depth as used in the previous step\n(Notes 10 and 11). Record this weight as w (mass of the sample holder in liquid).",
    "NOTE 10—If a wire is used, it is convenient to mark the level of immersion by means of a shallow notch filed in the wire. The finer the wire, the greater the tolerance is permitted in adjusting the level of immersion between weighings. With wire Awg No. 36 or finer, disregard its degrees of immersion and, if no sinker is used, use the mass of the wire in air as w.",
    "NOTE 11—If the wire is used and is left attached to the balance arm during a series of determinations, determine the mass a with the aid of a tare on the other arm of the balance or as in 12.3.1. In such cases, care must be taken that the change of mass of the wire (for example, from visible water) between readings does not exceed the desired precision.",
    "12.6 Repeat the procedure for the required number of specimens. Two specimens per sample are recommended. Determine acceptability of number of replicate test specimens by comparing results with precision data given in Tables 1 and\n2. Use additional specimens if desired.\n\n## 13. Calculation\n\n13.1 Calculate the specific gravity of the plastic as follows:\nsp gr23/23°C 5 a/~a1w 2 b!",
    "13.1 Calculate the specific gravity of the plastic as follows:\nsp gr23/23°C 5 a/~a1w 2 b!\n\nwhere: a\n= apparent mass of specimen, without wire or sinker, in\nair,\nb\n= apparent mass of specimen (and of sinker, if used)\ncompletely immersed and of the wire partially immersed in liquid, and\nw\n= apparent mass of totally immersed sinker (if used) and\nof partially immersed wire.\n13.2 Calculate the density of the plastic as follows:",
    "|               | TABLE 2 Test Method B   | Specific Gravity Tested in Liquids Other Than Water   |\n|---------------|-------------------------|-------------------------------------------------------|\n| Material      | Mean                    | S                                                     |\n| r             |                         |                                                       |",
    "| r             |                         |                                                       |\n| A             |                         |                                                       |\n| S             |                         |                                                       |\n| R             |                         |                                                       |\n| B             |                         |                                                       |",
    "| B             |                         |                                                       |\n| r             |                         |                                                       |\n| C             |                         |                                                       |\n| R             |                         |                                                       |\n| D             |                         |                                                       |",
    "| D             |                         |                                                       |\n| Polypropylene | 0.9023                  | 0.00139                                               |\n| LDPE          | 0.9215                  | 0.00109                                               |\n| HDPE          | 0.9678                  | 0.00126                                               |\n| Thermoset     | 1.3130                  | 0.00160                                               |",
    "A Sr = within laboratory standard deviation for the individual material. It is obtained by pooling the within-laboratory standard deviations of the test results from all of the participating laboratories:\nSr = [[(s1)2 + (s 2)2 . . .+ ( sn)2]/n] 1/2\nB SR = between-laboratories reproducibility, expressed as standard deviation: SR = [Sr\n2 + SL\n2]1/2 where S L is the standard deviation of laboratory means.",
    "C r = within-laboratory critical interval between two test results = 2.8 × Sr. D R = between-laboratories critical interval between two test results = 2.8 × SR.\n\nD23C, kg/m3 5 sp gr23/23°C 3997.5\n13.3 If the temperature of the water is different than 23°C, use the density of water listed in Table 3 directly, or use the following equations to calculate the density of water at testing temperature:\n\n$$M=\\Delta D/\\Delta t\\tag{1}$$",
    "$$M=\\Delta D/\\Delta t\\tag{1}$$\n\n$D$(conversion to 23${}^{\\circ}$C), kg/m${}^{3}$ (2)\n5 sp gr ta/tw 3@997.51~tw 2 23! 3M#\nand sp gr 23/23 5 D ~conversion to 23°C!/997.5\n(3)\n\nwhere:\nM\n= slope,\n∆D\n= difference between the lowest and highest temperature\ntolerance for the standard density of water (D @ 21°C\n- D @ 25°C),\n∆t\n= difference between the highest and lowest temperature\ntolerance recommended, (21°C–25°C),\nta\n= temperature of air, and\ntw\n= temperature of water.\n\n## 14. Report",
    "## 14. Report\n\n14.1 Report the following information: 14.1.1 Complete identification of the material or product tested, including method of specimen preparation and conditioning,\n14.1.2 Average specific gravity (relative density) for all specimens from a sampling unit corrected to 23.0°C (Table 3)\nare reported as sp gr 23/23°C = ___, or average density reported as D23C = ___ kg/m3, NOTE 12—Reporting density in g/cm3 is also acceptable provided that it is agreed upon by the users.",
    "14.1.3 A measure of the degree of variation of specific gravity or density within the sampling unit such as the standard deviation and number of determinations on a homogeneous",
    "°C\nρ=/kg m–3\n0.0\n0.1\n0.2\n0.3\n0.4\n0.5\n0.6\n0.7\n0.8\n0.9\n21\n997.9948\n9731\n9513\n9294\n9073\n8852\n8630\n8406\n8182\n7957\n22\n997.7730\n7503\n7275\n7045\n6815\n6584\n6351\n6118\n5883\n5648\n23\n997.5412\n5174\n4936\n4697\n4456\n4215\n3973\n3730\n3485\n3240\n24\n997.2994\n2747\n2499\n2250\n2000\n1749\n1497\n1244\n0990\n0735\n25\n997.0480\n0223\n9965B\n9707B\n9447B\n9186B\n8925B\n8663B\n8399B\n8135B\n\nAObtained from *CRC Handbook of Chemistry and Physics*, 78th edition, 1997-1998.\n\nBThe leading figure decreases by 1.",
    "BThe leading figure decreases by 1.\n\nmaterial or the averages plus these measures of dispersion on different layers or areas of a nonhomogeneous product,\n14.1.4 Report the temperature of the water. 14.1.5 Report the density and specific gravity with three significant figures.\n\n14.1.6 Any evidence of porosity of the material or specimen,\n14.1.7 The method of test (that is, Method A of Test Method D792), and\n14.1.8 Date of test.\n\n## 15. Precision And Bias\n\n15.1 See Section 23.",
    "## 15. Precision And Bias\n\n15.1 See Section 23.\n\n## Test Method B For Testing Solid Plastics In Liquids Other Than Water (Specimens 1 To 50 G) 16. Scope\n\n16.1 Test Method B uses a liquid other than water for testing one-piece specimens, 1 to 50 g, of plastics that are affected by water or are lighter than water.\n\n## 17. Apparatus",
    "## 17. Apparatus\n\n17.1 The apparatus shall include the balance, wire, and immersion vessel of Section 8, and, optionally, the following:\n17.2 *Pycnometer with Thermometer—*A 25-mL specific gravity bottle with thermometer, or\n17.3 *Pycnometer—*A pycnometer of the Weld type, preferably with a capacity of about 25 mL and an external cap over the stopper.",
    "17.4 *Thermometer—*A thermometer having ten divisions per degree Celsius over a temperature range of not less than 5°C or 10°F above and below the standard temperature, and having an ice point for calibration. A thermometer short enough to be handled inside the balance case will be found convenient.\n\nASTM Thermometer S63C (see Specification E2251) and Anschütz-type thermometers have been found satisfactory for this purpose.",
    "17.5 *Constant-Temperature Bath—*An appropriate constanttemperature bath adjusted to maintain a temperature of\n23 6 0.1°C.\n\n## 18. Materials",
    "18.1 *Immersion Liquid—*The liquid used shall not dissolve, swell, or otherwise affect the specimen, but shall wet it and shall have a specific gravity less than that of the specimen. In addition, the immersion liquid shall be non-hygroscopic, has a low vapor pressure, a low viscosity, and a high flash point, and shall leave little or no waxy or tarry residue on evaporation. A narrow cut distilled from kerosine meets these requirements for many plastics. The specific gravity 23/23°C of the",
    "from kerosine meets these requirements for many plastics. The specific gravity 23/23°C of the immersion liquid shall be determined shortly before and after each use in this method to a precision of at least 0.1 % relative, unless it has been established experimentally in the particular application that a lesser frequency of determination also provides the desired precision.",
    "NOTE 13—For the determination of the specific gravity of the liquid, the use of a standard plummet of known volume or of Method A, C, or D of Test Methods D891, using the modifications required to give specific gravity 23/23°C instead of specific gravity 60/60°F, is recommended. One suggested procedure is the following:",
    "If a constant-temperature water bath is not available, determine the mass of the clean, dry pycnometer with thermometer to the nearest 0.1 mg on an analytical balance. Fill the pycnometer with water (10.1) cooler than 23°C. Insert the thermometer-stopper, causing excess water to be expelled through the side arm. Permit the filled bottle to warm in air until the thermometer reads 23.0°C. Remove the drop of water at the tip of the side arm with a bit of filter paper, taking care not to draw any",
    "drop of water at the tip of the side arm with a bit of filter paper, taking care not to draw any liquid from within the capillary, place the cap over the side arm, wipe the outside carefully, and determine the mass of the filled bottle again to the nearest 0.2 mg. Empty the pycnometer, dry, and fill with immersion liquid. Determine the mass with the liquid in the same manner as was done with the water. Calculate the specific gravity 23/23°C of the liquid, d, as follows:",
    "$$d=(b-e)/(w-e)$$\nwhere: e\n= apparent mass of empty pycnometer,\nw\n= apparent mass of pycnometer filled with water at\n23.0°C, and\nb\n= apparent mass of pycnometer filled with liquid at\n23.0°C.\nIf a constant-temperature water bath is available, a pycnometer without a thermometer is optional to used (compare 30.2).",
    "NOTE 14—One standard object which has been found satisfactory for this purpose is the Reimann Thermometer Plummet. These are normally supplied calibrated for measurements at temperatures other than 23/23°C, so that recalibration is not necessary for the purposes of these methods.\n\n## 19. Test Specimen\n\n19.1 See Section 11.\n\n## 20. Procedure",
    "## 19. Test Specimen\n\n19.1 See Section 11.\n\n## 20. Procedure\n\n20.1 The procedure shall be similar to Section 12, except for the choice of immersion liquid, and the temperature during the immersed weighing (12.3) shall be 23 6 0.5°C.\n\n## 21. Calculation\n\n21.1 The calculations shall be similar to Section 13, except that d, the specific gravity 23/23°C of the liquid, shall be placed in the numerator: (see 13.1)\n\n$\\mbox{\\it Sp}\\,\\mbox{\\it gr}\\,\\mbox{\\it23/23}\\,\\mbox{\\it C}=(a\\times d)/(a+w-b)$",
    "$\\mbox{\\it Sp}\\,\\mbox{\\it gr}\\,\\mbox{\\it23/23}\\,\\mbox{\\it C}=(a\\times d)/(a+w-b)$\n\n## 22. Report\n\n22.1 See Section 14.\n\n## 23. Precision And Bias",
    "## 22. Report\n\n22.1 See Section 14.\n\n## 23. Precision And Bias\n\n23.1 Tables 1 and 2 are based on an interlaboratory study4\nconducted in 1985 in accordance with Practice E691, involving\n5 materials tested with Test Method A by six laboratories or four materials tested with Test Method B by six laboratories. Each test result was based on two individual determinations and each laboratory obtained four test results for each material.",
    "(**Warning—**Do not apply the data of Table 1 and Table 2 to acceptance or rejection of materials, as these data apply only to the materials tested in the round robin and are unlikely to be rigorously representative of other lots, formulations, conditions, materials, or laboratories. Users of this test method need to apply the principles outlined in Practice E691 to generate data specific to the materials and laboratory (or between specific laboratories).)",
    "23.2 For information on equivalence, see Practice E2935.",
    "23.3 There are no recognized standards by which to estimate bias of this test method.\n\n## 24. Keywords\n\n24.1 density; relative density; specific gravity\n\n## Summary Of Changes\n\nCommittee D20 has identified the location of selected changes to this standard since the last issue (D792 - 13)\nthat may impact the use of this standard. (July 1, 2020)\n(8) Note 9—Made Note 9 into 12.3.1.",
    "(9) 17.4—Updated thermometer information for Liquid-in- Glass Thermometers. (10) Note 15—Removed permissive language. (11) 23.1—Updated precision and bias terminology. (12) 23.2—Removed old precision and bias terminology. (13) 23.3—Added equivalence information.",
    "(1) 1.5—Added Mercury warning.\n(2) 2.1—Removed standard E1; Added E456, E2251, E2935. (3) 3.1.1—Added Precision and Bias terminology. (4) Note 5—Made Note 5 into 9.1.1. (5) 10.1.1—Added wetting information. (6) Note 7—Removed wetting information. (7) 12.1—Added temperature is for Density calculation.",
    "ASTM International takes no position respecting the validity of any patent rights asserted in connection with any item mentioned in this standard. Users of this standard are expressly advised that determination of the validity of any such patent rights, and the risk of infringement of such rights, are entirely their own responsibility.",
    "This standard is subject to revision at any time by the responsible technical committee and must be reviewed every five years and if not revised, either reapproved or withdrawn. Your comments are invited either for revision of this standard or for additional standards and should be addressed to ASTM International Headquarters. Your comments will receive careful consideration at a meeting of the responsible technical committee, which you may attend. If you feel that your comments have not",
    "the responsible technical committee, which you may attend. If you feel that your comments have not received a fair hearing you should make your views known to the ASTM Committee on Standards, at the address shown below.",
    "This standard is copyrighted by ASTM International, 100 Barr Harbor Drive, PO Box C700, West Conshohocken, PA 19428-2959, United States. Individual reprints (single or multiple copies) of this standard may be obtained by contacting ASTM at the above address or at 610-832-9585 (phone), 610-832-9555 (fax), or service@astm.org (e-mail); or through the ASTM website (www.astm.org). Permission rights to photocopy the standard may also be secured from the Copyright Clearance Center, 222 Rosewood",
    "to photocopy the standard may also be secured from the Copyright Clearance Center, 222 Rosewood Drive, Danvers, MA 01923, Tel: (978) 646-2600; http://www.copyright.com/"
  ]
}