{
  "source": "ASTM D395 2018.md",
  "chunks": [
    "# Designation: D395 −18 Standard Test Methods For Rubber Property—Compression Set1\n\nThis standard is issued under the fixed designation D395; the number immediately following the designation indicates the year of original adoption or, in the case of revision, the year of last revision. A number in parentheses indicates the year of last reapproval. A\nsuperscript epsilon (´) indicates an editorial change since the last revision or reapproval.",
    "This standard has been approved for use by agencies of the U.S. Department of Defense.\n\n## 1. Scope\n\n1.1 These test methods cover the testing of rubber intended for use in applications in which the rubber will be subjected to compressive stresses in air or liquid media. They are applicable particularly to the rubber used in machinery mountings, vibration dampers, and seals. Three test methods are covered as follows:",
    "| Test Method                                        | Section   |\n|----------------------------------------------------|-----------|\n| A—Compression Set Under Constant Force in Air      | 8 - 11    |\n| B—Compression Set Under Constant Deflection in Air | 12 - 15   |\n| 16 - 21                                            |           |\n| C—Compression Set Under Constant Deflection in Air |           |\n| Considering Material Hardness                      |           |",
    "1.2 The choice of test method is optional, but consideration should be given to the nature of the service for which correlation of test results may be sought. Unless otherwise stated in a detailed specification, Test Method B shall be used.\n\n1.3 Test Method B is not suitable for vulcanizates harder than 90 IRHD.\n\n1.4 The values stated in SI units are to be regarded as the standard.",
    "1.4 The values stated in SI units are to be regarded as the standard.\n\n1.5 This standard does not purport to address all of the safety concerns, if any, associated with its use. It is the responsibility of the user of this standard to establish appropriate safety, health, and environmental practices and determine the applicability of regulatory limitations prior to use.",
    "1.6 This international standard was developed in accordance with internationally recognized principles on standardization established in the Decision on Principles for the Development of International Standards, Guides and Recommendations issued by the World Trade Organization Technical Barriers to Trade (TBT) Committee.\n\n--``,``,``,,,`,,,````,`,``,`,,,`-`-`,,`,,`,`,,`---\n\n## 2. Referenced Documents",
    "2.1 *ASTM Standards:*2\nD1349 Practice for Rubber—Standard Conditions for Testing\nD3182 Practice for Rubber—Materials, Equipment, and Procedures for Mixing Standard Compounds and Preparing Standard Vulcanized Sheets\nD3183 Practice for Rubber—Preparation of Pieces for Test\nPurposes from Products\nD3767 Practice for Rubber—Measurement of Dimensions D4483 Practice for Evaluating Precision for Test Method\nStandards in the Rubber and Carbon Black Manufacturing Industries",
    "Standards in the Rubber and Carbon Black Manufacturing Industries\nE145 Specification for Gravity-Convection and Forced-\nVentilation Ovens",
    "## 3. Summary Of Test Methods\n\n3.1 A test specimen is compressed to either a deflection or by a specified force and maintained under this condition for a specified time and at a specified temperature.\n\n3.2 The residual deformation of a test specimen is measured\n30 min after removal from a suitable compression device in which the specimen had been subjected for a definite time to compressive deformation under specified conditions.",
    "3.3 After the measurement of the residual deformation, the compression set, as specified in the appropriate test method, is calculated according to Eq 1 and Eq 2.\n\n## 4. Significance And Use",
    "4.1 Compression set tests are intended to measure the ability of rubber compounds to retain elastic properties after prolonged action of compressive stresses. The actual stressing service may involve the maintenance of a definite deflection, the constant application of a known force, or the rapidly repeated deformation and recovery resulting from intermittent compressive forces. Though the latter dynamic stressing, like the others, produces compression set, its effects as a whole are simulated",
    "dynamic stressing, like the others, produces compression set, its effects as a whole are simulated more closely by compression flexing or hysteresis tests. Therefore, compression set tests are considered to be mainly applicable to service conditions involving static stresses. Tests are frequently conducted at elevated temperatures.",
    "## 5. Test Specimens\n\n5.1 Specimens from each sample may be tested in duplicate\n(Option 1) or triplicate (Option 2). The compression set of the sample in Option 1 shall be the average of the two specimens expressed as a percentage. The compression set of the sample in Option 2 shall be the median (middle most value) of the three specimens expressed as a percentage.\n\n5.2 The standard test specimen shall be a cylindrical disk cut from a laboratory prepared slab.",
    "5.2 The standard test specimen shall be a cylindrical disk cut from a laboratory prepared slab.\n\n5.2.1 The dimensions of the standard specimens shall be:",
    "| Type                | 1          |\n|---------------------|------------|\n| A                   |            |\n| 2                   |            |\n| B                   |            |\n| Thickness, mm (in.) | 12.5 ± 0.5 |\n| (0.49 ± 0.02)       |            |\n| 6.0 ± 0.2           |            |\n| (0.24 ± 0.01)       |            |\n| Diameter, mm (in.)  | 29.0 ± 0.5 |\n| (1.14 ± 0.02)       |            |\n| 13.0 ± 0.2          |            |\n| (0.51 ± 0.01)       |            |",
    "A Type 1 specimen is used in Test Methods A, B, and C. B Type 2 specimen is used in Test Method B and C.",
    "5.2.2 When cutting the standard specimen, the circular die having the required inside dimensions specified in 5.2.1 shall be rotated in a drill press or similar device and lubricated by means of a soap solution. A minimum distance of 13 mm (0.51 in.) shall be maintained between the cutting edge of the die and the edge of the slab. The cutting pressure shall be as light as possible to minimize cupping of the cut edges. The dies shall be maintained carefully so that the cutting edges are sharp",
    "of the cut edges. The dies shall be maintained carefully so that the cutting edges are sharp and free of nicks.",
    "5.3 An optional method of preparing the standard specimen may be the direct molding of a circular disk having the dimensions required for the test method used and specified in\n5.2.1.",
    "NOTE 1—It should be recognized that an equal time and temperature, if used for both the slab and molded specimen, will not produce an equivalent state of cure in the two types of specimen. A higher degree of cure will be obtained in the molded specimen. Adjustments, preferably in the time of cure, must be taken into consideration if comparisons between the specimens prepared by different methods are to be considered valid.",
    "NOTE 2—It is suggested, for the purpose of uniformity and closer tolerances in the molded specimen, that the dimensions of the mold be specified and shrinkage compensated for therein. A two-plate mold with a cavity 13.0 6 0.1 mm (0.510 6 0.004 in.) in thickness and 29.20 6 0.05\nmm (1.148 6 0.002 in.) in diameter, with overflow grooves, will provide Type 1 specimens for Test Method A and Test Method B. A similar mold but having a cavity of 6.3 6 0.3 mm (0.25 6 0.012 in.) in thickness and",
    "13.3 6 0.1 mm (0.52 6 0.004 in.) in diameter will provide Type 2\nspecimens for Test Method B.",
    "5.4 When the standard test specimen is to be replaced by a specimen taken from a vulcanized rubber part of greater thickness than the one indicated in 5.2.1, the sample thickness shall be reduced first by cutting transversely with a sharp knife\n--``,``,``,,,`,,,````,`,``,`,,,`-`-`,,`,,`,`,,`---\nand then followed by buffing to the required thickness in accordance with Practice D3183.",
    "5.5 An alternative method of preparing specimens is by plying up cylindrical disks cut from a standard sheet prepared in accordance with Practice D3182 using the specimen sizes specified in 5.2.1 and cutting as described in 5.2.2, or where a drill press is not available cutting the specimens with a single stroke from a cutting die.",
    "5.5.1 The disks shall be plied, without cementing, to the thickness required. Such plies shall be smooth, flat, of uniform thickness, and shall not exceed seven in number for Type 1 specimens and four in number for Type 2 specimens.\n\n5.5.2 Care shall be taken during handling and placing of the plied test specimen in the test fixture by keeping the circular faces parallel and at right angles to the axis of the cylinder.",
    "5.5.3 The results obtained on plied specimens may be different from those obtained using solid specimens and the results may be variable, particularly if air is trapped between disks.\n\n5.5.4 The results obtained on the specimens prepared by one of the methods may be compared only to those prepared by the same method.",
    "5.6 For routine or product specification testing, it is sometimes more convenient to prepare specimens of a different size or shape, or both. When such specimens are used, the results should be compared only with those obtained from specimens of similar size and shape and not with those obtained with standard specimen. For such cases, the product specification should define the specimen as to the size and shape. If suitable specimens cannot be prepared from the product, the test method and",
    "the size and shape. If suitable specimens cannot be prepared from the product, the test method and allowable limits must be agreed upon between the producer and the purchaser.",
    "## 6. Conditioning\n\n6.1 Store all vulcanized test specimens or product samples to be tested at least 24 h but not more than 60 days. When the date of vulcanization is not known, make tests within 60 days after delivery by the producer of the article represented by the specimen.\n\n6.2 Allow buffed specimens to rest at least 30 min before specimens are cut for testing.",
    "6.2 Allow buffed specimens to rest at least 30 min before specimens are cut for testing.\n\n6.3 Condition all specimens before testing for a minimum of\n3 h at 23 6 2°C (73.4 6 3.6°F). Specimens whose compression set properties are affected by atmospheric moisture shall be conditioned for a minimum of 24 h in an atmosphere controlled to a relative humidity of 50 6 10 %RH (40 to 60 %RH).\n\n## 7. Precision And Bias3",
    "## 7. Precision And Bias3\n\n7.1 These precision statements have been prepared in accordance with Practice D4483. Please refer to Practice D4483\nfor terminology and other testing and statistical concepts.\n\n7.2 Prepared test specimens of two rubbers for Test Methods A and B were supplied to five laboratories. These were tested in duplicate each day on two separate testing days. A test result, therefore, is the average of two test specimens, for both Test Methods A and B.",
    "7.3 One laboratory did not run the Test Method A testing;\ntherefore, the precision for Test Method A is derived from four laboratories.\n\n7.4 The Type 1 precision results are given in Table 1 and Table 2.",
    "7.4 The Type 1 precision results are given in Table 1 and Table 2.\n\n7.5 *Bias—*In test method statistical terminology, bias is the difference between an average test value and the reference or true test property value. Reference values do not exist for these test methods since the value or level of the test property is exclusively defined by the test method. Bias, therefore, cannot be determined.\n\n## Test Method A—Compression Set Under Constant Force In Air 8. Apparatus",
    "## Test Method A—Compression Set Under Constant Force In Air 8. Apparatus\n\n8.1 *Micrometer—*A micrometer, analog or digital, for measuring specimen thickness, in accordance with Practice D3767, Method A1.",
    "8.2 *Compression Device,* consisting of a force application spring and two parallel compression plates assembled by means of a frame or threaded bolt in such a manner that the device shall be portable and self-contained after the force has been applied and that the parallelism of the plates shall be maintained. The force may be applied in accordance with either\n8.2.1 or 8.2.2.",
    "8.2.1 *Calibrated Spring Force Application—*The required force shall be applied by a screw mechanism for compressing a calibrated spring the proper amount. The spring shall be of properly heat-treated spring steel with ends ground and perpendicular to the longitudinal axis of the spring. A suitable compression device is shown in Fig. 1. The spring shall conform to the following requirements:\n8.2.1.1 The spring shall be calibrated at room temperature",
    "8.2.1.1 The spring shall be calibrated at room temperature\n23 6 5°C (73.4 6 9°F) by applying successive increments of force not exceeding 250 N (50 lbf) and measuring the corresponding deflection to the nearest 0.2 mm (0.01 in.). The curve obtained by plotting the forces against the corresponding deflections shall have a slope of 70 6 3.5 kN/m (400 6 20\nlbf/in.) at 1.8 kN (400 lbf). The slope is obtained by dividing",
    "Method A\nMaterial\nMean\nLevel\nWithin LaboratoryA\nBetween LaboratoryA\nSr\nr\n(r)\nSR\nR\n(R)\n1\n1.73 (%)\n0.050\n0.142\n8.2\n0.190\n0.54\n31.1\n2\n26.1\n0.898\n2.54\n9.7\n2.37\n6.71\n25.7\nA Sr = within laboratory standard deviation.\nr = repeatability (in measurement units). (r) = repeatability (in percent).\nSR = between laboratory standard deviation.\nR = reproducibility (in measurement units). (R) = reproducibility (in percent).\n\n--``,``,``,,,`,,,````,`,``,`,,,`-`-`,,`,,`,`,,`---",
    "--``,``,``,,,`,,,````,`,``,`,,,`-`-`,,`,,`,`,,`---\n\nMaterial\nMean\nLevel\nWithin LaboratoryA\nBetween LaboratoryA\nSr\nr\n(r)\nSR\nR\n(R)\n1\n13.7 (%)\n0.591\n1.67\n12.2\n1.54\n4.36\n31.8\n2\n52.8\n0.567\n1.60\n3.0\n5.92\n16.8\n31.7\nA Sr = within laboratory standard deviation.\nr = repeatability (in measurement units).\n(r) = repeatability (in percent).\nSR = between laboratory standard deviation.\nR = reproducibility (in measurement units). (R) = reproducibility (in percent).",
    "the two forces above and below 1.8 kN by the difference between the corresponding deflections.\n\n8.2.1.2 The original dimensions of the spring shall not change due to fatigue by more than 0.3 mm (0.01 in.) after it has been mounted in the compression device, compressed under a force of 1.8 kN (400 lbf), and heated in the oven for one week at 70 6 2°C (158 6 3.6°F). In ordinary use, a weekly check of the dimensions shall show no greater change than this over a period of 1 year.",
    "8.2.1.3 The minimum force required to close the spring\n(solid) shall be 2.4 kN (530 lbf).",
    "8.2.2 *External Force Application—*The required force shall be applied to the compression plates and spring by external means after the test specimen is mounted in the apparatus. Either a calibrated compression machine or known masses may be used for force application. Provision shall be made by the use of bolts and nuts or other devices to prevent the specimen and spring from losing their initial deflections when the external force is removed. The spring shall have essentially the same",
    "initial deflections when the external force is removed. The spring shall have essentially the same characteristics as described in 8.2.1, but calibration is not required. A suitable compression device is shown in Fig. 2.",
    "8.3 *Plates—*The plates between which the test specimen is compressed shall be made of steel of sufficient thickness to withstand the compressive stresses without bending.\n\n8.3.1 The surfaces against which the specimen is held shall have an industrial chrome (hard chrome) plated finish and shall be cleaned thoroughly and wiped dry before each test.",
    "8.3.2 The steel surfaces contacting the rubber specimens shall be ground to a maximum roughness of 0.250 µm (10 µin.), polished, and industrial chrome (hard chrome) plated.\n\n8.3.3 The polishing and subsequent industrial chrome (hard chrome) plating shall not affect the final finish beyond the tolerance stated in 8.3.2.",
    "NOTE 3—The specifications regarding the surface roughness (smoothness) of the contact surfaces of the plates is to be considered only at the time of manufacture or refurbishing as it is not a property that is easily determined in the course of routine use. The suitability for the use of the device is to be determined by the user.\n\n8.4 *Oven,* conforming to the specification for a Type IIB\nlaboratory oven given in Specification E145.",
    "8.4.1 Type IIB ovens specified in Specification E145 are satisfactory for use through 70°C. For higher Temperatures Type II A ovens are necessary.\n\n8.4.2 The interior size shall be as follows or of an equivalent volume:\n\nInterior size of air oven:\nmin.\n300 by 300 by 300 mm (12 by 12 by 12 in.)\nmax.\n900 by 900 by 1200 mm (36 by 36 by 48 in.)\n\n8.4.3 Provision shall be made for placing test specimens in the oven without touching each other or the sides of the aging chamber.",
    "8.4.4 The heating medium for the aging chamber shall be air circulated within it at atmospheric pressure.\n\n8.4.5 The source of heat is optional but shall be located in the air supply outside of the aging chamber.\n\n8.4.6 A suitable temperature measurement device located in the upper central portion of the chamber near the test specimens shall be provided to record the actual aging temperature.\n\n8.4.7 Automatic temperature control by means of thermostatic regulation shall be used.",
    "8.4.7 Automatic temperature control by means of thermostatic regulation shall be used.\n\n8.4.8 The following special precautions shall be taken in order that accurate, uniform heating is obtained in all parts of the aging chamber.\n\n8.4.8.1 The heated air shall be thoroughly circulated in the oven by means of mechanical agitation. When a motor driven fan is used, the air must not come in contact with the fan motor brush discharge because of danger of ozone formation.",
    "8.4.8.2 Baffles shall be used as required to prevent local overheating and dead spots.\n\n8.4.8.3 The thermostatic control device shall be so located as to give accurate temperature control of the heating medium. The preferred location is adjacent to the temperature measuring device listed in section 8.4.6.\n\n8.4.8.4 An actual check shall be made by means of maximum reading thermometers placed in various parts of the oven to verify the uniformity of the heating.\n\n## 9. Procedure",
    "## 9. Procedure\n\n9.1 *Original Thickness Measurement—*Measure the original thickness of the specimen to the nearest 0.02 mm (0.001 in.), in accordance with Practice D3767, Method A1. Place the specimen on the anvil of the micrometer so that the presser foot will indicate the thickness at the central portion of the top and bottom faces.",
    "9.2 *Application of Compressive Force—*Assemble the specimens in the compression device, using extreme care to place them exactly in the center between the plates to avoid tilting. If the calibrated spring device (see Fig. 1) is used, apply the compressive force by tightening the screw until the deflection as read from the scale is equivalent to that shown on the calibration curve for the spring corresponding to a force of 1.8",
    "kN (400 lbf). With the external loading device (see Fig. 2), apply this force to the assembly in the compression machine or by adding required masses, but in the latter case, take care to add the mass gradually without shock. Tighten the nuts and bolts just sufficiently to hold the initial deflections of the specimen and spring. It is imperative that no additional force be applied in tightening the bolts.",
    "9.3 *Test Time and Test Temperature—*Choose a suitable temperature and time for the compression set, depending upon the conditions of the expected service. In comparative tests, use identical temperature and heating periods. It is suggested that the test temperature be chosen from those listed in Practice D1349. Suggested test periods are 22 h and 70 h. The specimen shall be at room temperature when inserted in the compression device. Place the assembled compression device in the oven within 2",
    "inserted in the compression device. Place the assembled compression device in the oven within 2 h after completion of the assembly and allow it to remain there for the required test period in dry air at the test temperature selected. At the end of the test period, take the device from the oven and remove the specimens immediately and allow it to cool.",
    "9.4 *Cooling Period—*While cooling, allow the specimens to rest on a poor thermally conducting surface, such as wood, for 30 min before making the measurement of the final thickness. Conduct the cooling period at a standard laboratory temperature of 23 6 2°C (73.4 6 3.6°F). Specimens whose compression set property is affected by atmospheric moisture shall be cooled in an atmosphere controlled to a relative humidity of 50\n6 10 %RH (40 to 60 %RH).",
    "9.5 *Final Thickness Measurement—*After the rest period, measure the final thickness at the center of the specimen in accordance with 9.1.\n\n## 10. Calculation\n\n10.1 Calculate the compression set as a percentage of the original thickness as follows:\n\n$$C_{A}=[(t_{a}-t_{i})/t_{a}]\\times100\\tag{1}$$\nwhere:\nCA\n= Compression set (Test Method A) as a percentage of the original thickness, to\n= original thickness (see 9.1), and ti\n= final thickness (see 9.5).",
    "--``,``,``,,,`,,,````,`,``,`,,,`-`-`,,`,,`,`,,`---\n\n## 11. Report",
    "11.1 Report the following information: 11.1.1 Original dimensions of the test specimen, including the original thickness, to,\n11.1.2 Actual compressive force on the specimen as determined from the calibration curve of the spring and spring deflection reading (see 8.2.1) or as applied by an external force\n(see 8.2.2),\n11.1.3 Thickness of the test specimen 30 min after removal from the clamp, ti,\n11.1.4 Type of test specimen used, together with the time and temperature of test,",
    "11.1.4 Type of test specimen used, together with the time and temperature of test,\n11.1.5 Compression set, expressed as a percentage of the original thickness,\n11.1.6 Test method used (Test Method A), and 11.1.7 Number of specimens tested.",
    "## Test Method B—Compression Set Under Constant Deflection In Air 12. Apparatus\n\n12.1 *Micrometer—*A micrometer, analog or digital, for measuring the specimen thickness, in accordance with Practice D3767, Procedure A.\n\nNOTE 4—For vulcanizates having a hardness below 35 IRHD, the force on the presser foot should be reduced to 0.2 6 0.05 N (0.04 6 0.01 lbf).\n\n12.2 *Spacers,* to maintain the constant deflection required under Test Method B.",
    "12.2 *Spacers,* to maintain the constant deflection required under Test Method B.\n\n12.2.1 Spacers for Type 1 samples shall have a thickness of\n9.5 6 0.02 mm (0.375 6 0.001 in.).\n\n12.2.2 Spacers for Type 2 samples shall have a thickness of\n4.50 6 0.01 mm (0.1770 6 0.0005 in.).\n\n12.2.3 The spacers in 12.2.1 and 12.2.2 are to be used with the standard specimens described in 5.2.1.\n\n12.2.3.1 Considering the Type 1 tolerances for specimens and spacers, the % compression ranges from 20 to 26 %.",
    "12.2.3.2 The Type 2 tolerances yield a range of compression from 23 to 29 %.\n\n12.2.3.3 It is important to consider the dimensions of the spacers (Equation 2) and report their dimensions (refer to\n15.1.4).\n\n12.3 *Compression Device,* consisting of two or more flat steel plates between the parallel faces of which the specimens may be compressed as shown in Fig. 3.",
    "12.3.1 When using the standard specimens described in\n5.2.1, steel spacers refer to (12.2) for the required percentage of compression (approximately 25 %) shall be placed on each side of the rubber specimens to control their thickness while compressed.",
    "12.3.2 When using specimens other than the standard specimens, steel spacers of a dimension that will achieve the required percentage of compression (approximately 25 %)\nshall be placed on each side of the rubber specimens to control their thickness while compressed.\n\n12.3.3 The steel surfaces contacting the rubber specimens shall be ground to a maximum roughness of 0.250 µm (10 µin.), polished and then industrial chrome (hard chrome) plated\n(see Note 3).\n\n12.4 *Oven,* see 8.4.",
    "12.4 *Oven,* see 8.4.\n\n12.5 *Plates—*The plates between which the test specimen is compressed shall be made of steel of sufficient thickness to withstand the compressive stresses without bending.\n\n12.5.1 The surfaces against which the specimen is held shall have an industrial chrome (hard chrome) finish and shall be cleaned thoroughly and wiped dry before each test.",
    "12.5.2 The steel surfaces contacting the rubber specimens shall be ground to a maximum roughness of 0.250 µm (10 µin.), polished and then industrial chrome (hard chrome) plated.\n\n12.5.3 The polishing and subsequent industrial chrome\n(hard chrome) plating shall not affect the final finish beyond the tolerance stated in 12.5.2.\n\n## 13. Procedure",
    "## 13. Procedure\n\n13.1 *Original Specimen Thickness Measurement—*Measure the original thickness of the specimen to the nearest 0.02 mm\n(0.001 in.), in accordance with Practice D3767, Procedure A.\n\n13.1.1 Place the specimen on the anvil of the micrometer so that the presser foot will indicate the thickness at the central portion of the top and bottom faces.",
    "13.2 *Spacer Thickness Measurement—*Measure the thickness of the spacer to the nearest 0.01 mm (0.0005 in.), the gauge used to measure the specimen thickness may be used.",
    "13.3 *Application of Compressive Force—*Place the test specimens between the plates of the compression device with the spacers on each side, or placed on the outboard corners when using washer-style spacers. Allow sufficient clearance for the bulging of the rubber when compressed (see Fig. 3) to assure that the specimens do not contact the spacers or other specimens.",
    "13.3.1 Where a lubricant is applied, it shall consist of a thin coating of a lubricant having substantially no action on the rubber.\n\n13.3.1.1 A silicon or fluorosilicon fluid has been found to be suitable.\n\n13.3.2 Tighten the bolts so that the plates are drawn together uniformly until they are in contact with the spacers.\n\n13.3.2.1 The amount of compression employed shall be approximately 25 % (refer to 12.3).",
    "13.3.2.1 The amount of compression employed shall be approximately 25 % (refer to 12.3).\n\n13.3.2.2 A suitable mechanical, pneumatic, or hydraulic device may be used to facilitate assembling and disassembling the test fixture.\n\n13.3.2.3 Avoid overtightening the bolts. Overtightening may cause the plates to deflect and not provide the desired compressive effect.",
    "13.4 *Test Time and Temperature—*Choose a suitable temperature and time for the compression set, depending upon the conditions of the expected service.\n\n13.4.1 In comparative tests, use identical temperature and test periods.\n\n13.4.1.1 It is suggested that the test temperature be chosen from those listed in Practice D1349.\n\n13.4.1.2 Suggested test periods are 22 h and 70 h. 13.4.1.3 The test specimen shall be at room temperature when inserted in the compression device.",
    "13.4.1.4 Place the assembled compression device in the oven within 2 h after completion of assembly and allow it to remain there for the required test period in dry air (refer to Practice D1349 for recommended RH% based upon the test temperature tolerance) at the test temperature selected.\n\n13.4.1.5 At the end of the test period, take the device from the oven, remove the test specimens immediately, and allow them to cool.",
    "13.5 *Cooling Period—*While cooling, allow the test specimen to rest on a poor thermally conducting surface, such as wood, for 30 min before making the measurement of the final thickness. Maintain the conditions during the cooling period in accordance with 9.4.\n\n13.6 *Final Thickness Measurement—*After the rest period, measure the final thickness at the center of the test specimen in accordance with 13.1.\n\n## 14. Calculation",
    "## 14. Calculation\n\n14.1 Calculate the compression set expressed as a percentage of the original deflection as follows:\n--``,``,``,,,`,,,````,`,``,`,,,`-`-`,,`,,`,`,,`---\n\n$$C_{B}=\\left[(t_{o}-t_{i})/(t_{o}-t_{n})\\right]\\times100\\tag{2}$$\nwhere:\nCB = compression set (Test Method B) expressed as percentage of the original deflection, t0 = original thickness of specimen (13.1), ti = final thickness of specimen (13.6), and tn = thickness of the spacer bar used.",
    "NOTE 5—Lubrication of the operating surfaces of the compression device is optional while giving more reproducible results; lubrication may somewhat alter the compression set values.\n\n## 15. Report",
    "15.1 Report the following information: 15.1.1 Original dimensions of the test specimen including the original thickness, to,\n15.1.2 Percentage compression of the specimen actually employed,\n15.1.3 Thickness of the test specimen 30 min after removal from the clamp, ti,\n15.1.4 Dimensions of the spacers, tn,\n15.1.5 Type of test specimen used, together with the time and temperature of test,",
    "15.1.5 Type of test specimen used, together with the time and temperature of test,\n15.1.6 Whether or not the surfaces of the compression device are lubricated. If they are, what type lubrication was used,\n15.1.7 Compression set, expressed as a percentage of the original deflection,\n15.1.8 Test method used (Test Method B), and 15.1.9 Number of specimens tested.",
    "## Test Method C—Compression Set Under Constant Deflection In Air Considering Material Hardness 16. Summary Of Method C\n\n16.1 Method C is nearly equivalent to Method B except that percentage of compression varies with the material's IRHD\nhardness and the compression device is of a different configuration, in one form not requiring spacers as it has an integral measurement gauge allowing the percentage of compression to be calculated. There are other specification and procedural differences.",
    "## 17. Apparatus\n\n17.1 *Micrometer—*A digital micrometer for measuring the specimen thickness, in accordance with Practice D3767, Procedure A and having a contact foot of 4.0 6 0.5 mm.\n\n17.2 *Timing Device,* having the capability of measuring\n61 s.",
    "17.3 *Oven—*Refer to 8.4.\n17.4 *Plates—*Refer to 12.5.\n--``,``,``,,,`,,,````,`,``,`,,,`-`-`,,`,,`,`,,`---\n17.5 *Compression Device,* consisting of two flat steel plates between the parallel faces of which the specimens may be compressed as shown in Fig. 4. Steel spacers for the required percentage of compression given in 17.5 shall be placed on each side of the rubber specimens to control their thickness while compressed, except when using a device as described in",
    "17.5.1. The steel surfaces contacting the rubber specimens shall be ground to a maximum roughness of 0.250 µm (10 µin.), polished and then industrial chrome (hard chrome) plated (see Note 3).",
    "17.5.1 The compression device shall be equipped with an integral, yet removable, micrometer to gauge the percentage of compression by calculation: using the original thickness measurement (refer to 13.1), multiply by 0.75, 0.85, or 0.90 (refer to 17.5) the desired compression based upon the IRHD S2\nhardness of the material, and apply the compressive force by tightening the nut until the micrometer displays the desired value.",
    "17.6 *Spacers—*The height of the spacer(s) shall be chosen so that the compression applied to the test specimen is:\n25 6 2 % for hardness 80 IRHD S2 or below (refer to\n12.2.1 and 12.2.2);\n15 6 2 % for hardness between 81 and 89 IRHD S2;\n10 6 1 % for hardness 90 IRHD S2 and above.\n\n## 18. Test Specimens\n\n18.1 The standard Method C test specimens shall be the same as those described in 5.2.",
    "18.1 The standard Method C test specimens shall be the same as those described in 5.2.\n\n18.2 Nonstandard test specimens may be tested using the device described in 17.5.1. These specimens may be acquired from finished goods or other sources and prepared as described in 5.4, 5.5, and 5.6.",
    "18.3 Type 1 and Type 2 specimens do not characteristically provide the same results. Type 1 specimens are generally used for materials having a lower compression set, while Type 2 specimens are typically used for materials with higher compression set.\n\n## 19. Procedure\n\n19.1 The procedure for Method C is as described in Section\n13 for Method B with the exception of the employment of the device described in 17.5.1 in which spacers are not used and as otherwise specified in this section.",
    "19.2 When using the device described in 17.5.1:\n19.2.1 Place the micrometer in the device and adjust the zero (tare).\n\n19.2.2 Take the original thickness measurement as described in 13.1.",
    "19.2.2 Take the original thickness measurement as described in 13.1.\n\n19.2.3\nSituate the specimens in the device, allowing sufficient clearance for the bulging of the rubber when compressed to assure that the specimens do not contact the spacers or other specimens. Carefully apply the compressive force until the dimensional measurement displayed is equivalent to the percentage compression desired using the calculation described in\n17.5.1.",
    "19.2.4 Remove the micrometer from the compression device prior to placing it in an elevated temperature environment.\n\n19.3 The time between production of the specimen and testing shall be no less than 16 h.\n\n19.4 Test specimens shall be protected from light and heat before testing.\n\n19.5 Test exposure times shall be 22 to 24 h; 70 to 72 h; 166\nto 168 h or in multiples of 166 to 168 h as measured from the time the specimen is placed in the testing environment.",
    "19.6 The test temperatures shall be in accordance with Practice D1349.\n\n19.6.1 The preferred test temperatures in degrees Celsius\n(°C) are: 23; 27; 40; 55; 70; 85; 100; 125; 150; 175; 200; 225; 250, or as agreed upon between customer and supplier.\n\n19.7 Certain materials, such as thermoplastic rubber (TPR), may require annealing to relieve stress/strain introduced by the molding process. After the annealing process, the specimens shall be conditioned as in Sections 13 and 19.",
    "## 20. Calculation",
    "21.1.2 Original dimensions of the test specimen including the original thickness, to,\n21.1.3 Percentage compression of the specimen actually employed,\n21.1.4 Thickness of the test specimen 30 min after removal from the clamp, ti,\n21.1.5 Type of test specimen used, together with the time and temperature of test,\n21.1.6 Whether or not the surfaces of the compression device are lubricated. If they are, what type lubrication was used,",
    "21.1.7 Compression set, expressed as a percentage of the original deflection,\n21.1.8 Test method used (Test Method C), and 21.1.9 Number of specimens tested.",
    "20.1 Calculate the compression set expressed as a percentage as described in Section 14.\n\n## 22. Keywords 21. Report",
    "22.1 compression set; compression set under constant deflection; compression set under constant force; deflection; deformation; elastic property; hysteresis; recovery",
    "21.1 Report the following information: 21.1.1 The IRHD S2 hardness of the material, ASTM International takes no position respecting the validity of any patent rights asserted in connection with any item mentioned in this standard. Users of this standard are expressly advised that determination of the validity of any such patent rights, and the risk of infringement of such rights, are entirely their own responsibility.",
    "This standard is subject to revision at any time by the responsible technical committee and must be reviewed every five years and if not revised, either reapproved or withdrawn. Your comments are invited either for revision of this standard or for additional standards and should be addressed to ASTM International Headquarters. Your comments will receive careful consideration at a meeting of the responsible technical committee, which you may attend. If you feel that your comments have not",
    "the responsible technical committee, which you may attend. If you feel that your comments have not received a fair hearing you should make your views known to the ASTM Committee on Standards, at the address shown below.",
    "This standard is copyrighted by ASTM International, 100 Barr Harbor Drive, PO Box C700, West Conshohocken, PA 19428-2959, United States. Individual reprints (single or multiple copies) of this standard may be obtained by contacting ASTM at the above address or at 610-832-9585 (phone), 610-832-9555 (fax), or service@astm.org (e-mail); or through the ASTM website (www.astm.org). Permission rights to photocopy the standard may also be secured from the Copyright Clearance Center, 222 Rosewood",
    "to photocopy the standard may also be secured from the Copyright Clearance Center, 222 Rosewood Drive, Danvers, MA 01923, Tel: (978) 646-2600; http://www.copyright.com/",
    "--``,``,``,,,`,,,````,`,``,`,,,`-`-`,,`,,`,`,,`---"
  ]
}