{
  "source": "ASTM D297-21.md",
  "chunks": [
    "# Designation: D297 −21 Standard Test Methods For Rubber Products—Chemical Analysis1\n\nThis standard is issued under the fixed designation D297; the number immediately following the designation indicates the year of original adoption or, in the case of revision, the year of last revision. A number in parentheses indicates the year of last reapproval. A\nsuperscript epsilon (´) indicates an editorial change since the last revision or reapproval.",
    "This standard has been approved for use by agencies of the U.S. Department of Defense.\n\n## 1. Scope\n\n1.1 These test methods cover the qualitative and quantitative analysis of the composition of rubber products of the \"R\" family (see 3.1). Many of these test methods may be applied to the analysis of natural and synthetic crude rubbers.\n\n1.1.1 *Part A* consists of general test methods for use in the determination of some or all of the major constituents of a rubber product.",
    "1.1.2 *Part B* covers the determination of specific polymers present in a rubber product.\n\n1.1.3 The test methods appear in the following order:",
    "| Part A. General Test Methods:                    | Sections   |\n|--------------------------------------------------|------------|\n| Rubber Polymer Content by the Indirect Method    | 11 - 13    |\n| Determinations and Report for the General Method | 14         |\n| Density                                          | 16         |\n| Extract Analysis                                 | 17 - 26    |\n| Sulfur Analysis                                  | 27.1 - 33  |",
    "| Sulfur Analysis                                  | 27.1 - 33  |\n| Fillers Analysis                                 | 34 - 40    |\n| Ash Analysis                                     | 41 - 51    |\n| Part B. Determination of Rubber Polymers         | 52 - 58    |",
    "1.2 The values stated in SI units are to be regarded as standard. The values given in parentheses are for information only.\n\n1.3 This standard does not purport to address all of the safety concerns, if any, associated with its use. It is the responsibility of the user of this standard to establish appropriate safety, health, and environmental practices and determine the applicability of regulatory limitations prior to use.",
    "Specific precautionary or warning statements are given in 31.4.5, 31.6, 37.4.2, 38.4.2, 45.1.3, 53.2.3.5, 54.4.2, 54.6,\n56.5.3, and 57.7.3; and X1.3.3 and X2.4.1.6.\n\n1.4 This international standard was developed in accordance with internationally recognized principles on standardization established in the Decision on Principles for the Development of International Standards, Guides and Recommendations issued by the World Trade Organization Technical Barriers to Trade (TBT) Committee.",
    "## 2. Referenced Documents 2.1 *Astm Standards:*2",
    "D792 Test Methods for Density and Specific Gravity (Relative Density) of Plastics by Displacement\nD982 Test Method for Organic Nitrogen in Paper and\nPaperboard\nD1416 Test Methods for Rubber from Synthetic Sources—\nChemical Analysis (Withdrawn 1996)3\nD1418 Practice\nfor\nRubber\nand\nRubber\nLatices—\nNomenclature\nD1646 Test\nMethods\nfor\nRubber—Viscosity,\nStress\nRelaxation,\nand\nPre-Vulcanization\nCharacteristics\n(Mooney Viscometer)",
    "for\nRubber—Viscosity,\nStress\nRelaxation,\nand\nPre-Vulcanization\nCharacteristics\n(Mooney Viscometer)\nD3040 Practice for Preparing Precision Statements for Standards Related to Rubber and Rubber Testing (Withdrawn\n1987)3\nD3156 Practice for Rubber—Chromatographic Analysis of\nAntidegradants (Antioxidants, Antiozonants and Stabilizers)",
    "| D3452                                                   |  Practice for Rubber—Identification by Pyrolysis-Gas   |\n|---------------------------------------------------------|--------------------------------------------------------|\n| Chromatography                                          |                                                        |\n| D3677                                                   | Test Methods for Rubber—Identification by Infrared     |",
    "| Spectrophotometry                                       |                                                        |\n| D4483                                                   | Practice for Evaluating Precision for Test Method      |\n| Standards in the Rubber and Carbon Black Manufacturing  |                                                        |\n| Industries                                              |                                                        |",
    "| E11                                                     | Specification for Woven Wire Test Sieve Cloth and Test |\n| Sieves                                                  |                                                        |\n| E131                                                    | Terminology Relating to Molecular Spectroscopy         |\n| E200                                                    | Practice for Preparation, Standardization, and Storage |",
    "| of Standard and Reagent Solutions for Chemical Analysis |                                                        |\n| E442                                                    | Test Method for Chlorine, Bromine, or Iodine in        |\n| Organic Compounds by Oxygen Flask Combustion            | (With-                                                 |\n| drawn 1996)                                             |                                                        |",
    "| 3                                                       |                                                        |",
    "E443 Test Method for Sulfur in Organic Compounds by\nOxygen Flask Combustion (Withdrawn 1996)3\nStandards volume information, refer to the standard's Document Summary page on the ASTM website.\n\n3 The last approved version of this historical standard is referenced on www.astm.org.\n\n3. Terminology\n3.1 *Definitions—*The nomenclature and abbreviations used for natural and synthetic rubbers are in accordance with Practice D1418.",
    "4. Reagents\n4.1 *Purity of Reagents—*Reagent grade chemicals shall be used in all tests. Unless otherwise indicated, it is intended that all reagents shall conform to the specifications of the Committee on Analytical Reagents of the American Chemical Society, where such specifications are available.4 Other grades may be used, provided it is first ascertained that the reagent is of sufficiently high purity to permit its use without lessening the accuracy of the determination.",
    "4.2 *Purity of Water—*Unless otherwise indicated, references to water shall be understood to mean distilled water or water of equal purity.\n\n5. Concentration of Reagents\n5.1 *Concentrated Acids and Ammonium Hydroxide—*When acids and ammonium hydroxide are specified by name or chemical formula only, it is understood that concentrated reagents of the following densities or concentrations are intended:",
    "Acetic acid, HC2H3O2 (99.7 %)\n1.05\nFormic acid, HCOOH\n1.22\nHydrochloric acid, HCl\n1.19\nHydrofluoric acid, HF (49 %)\n1.16\nNitric acid, HNO3\n1.42\nPhosphoric acid, H3PO4 (85 %)\n1.70\nSulfuric acid, H2SO4\n1.84\nAmmonium hydroxide, NH4OH\n0.90\n\n## Part A. General Test Methods 6. Scope And Application",
    "## Part A. General Test Methods 6. Scope And Application\n\n6.1 The general test methods described cover the analysis of many types of rubber products to determine the amount and type of nonrubber constituents and to calculate indirectly from these data the amount of rubber constituent.",
    "6.2 The applications and limitations of the test methods to analysis of specific types of rubber products are given in the scopes of the various test methods. Application to types of rubber products not specified in the scope of a particular test method shall be verified by application to a control of known and similar composition.",
    "6.3 Special test methods for analysis are given for rubber products containing glue, free carbon, antimony, lead, mineral oil, waxy hydrocarbons, and barium carbonate.\n\nThe desired densities or concentrations of all other concentrated acids are stated whenever they are specified.",
    "5.2 Diluted Acids and Ammonium Hydroxide—\nConcentrations of diluted acids and ammonium hydroxide, except when standardized, are specified as a ratio stating the number of volumes of the concentrated reagent to be added to a given number of volumes of water, as in the following example: HCl (1 + 9) means 1 volume of concentrated HCl (density 1.19) mixed with 9 volumes of water. Acids shall be added to water slowly, with stirring.",
    "5.3 *Standard Solutions—*Concentrations of standard solutions are expressed as normalities or as volume of solution that reacts with or contains a given mass of material being used or determined, for example: 0.1 N Na2S2O3 solution, or CuSO4\nsolution (1 cm3 = 0.001 g Cu).",
    "5.4 *Nonstandardized Solutions—*Concentrations of nonstandardized solutions prepared by dissolving a given mass in a solvent are specified in grams of the reagent (as weighted out)/dm3 of solution, and it is understood that water is the solvent unless otherwise specified, for example: NaOH (10",
    "g/dm3) means 10 g of NaOH dissolved in water and diluted with water to 1 dm3 (Note 1). In the case of certain reagents the concentration may be specified as a percentage by mass, for example: ethanol (50 %) means a solution containing 50 g of ethanol per 100 g of solution. Other nonstandardized solutions may be specified by name only, and the concentration of such solutions will be governed by the instructions for their preparation.",
    "NOTE 1—Whenever a hydrated salt is used in the preparation of a reagent (for example, BaCl2·2H2O) the preparation of the reagent is described in detail. When an anhydrous salt is used in preparing a simple aqueous solution the reagent is listed by title only and details of the preparation are not given.",
    "6.4 For the determination of the amount of a rubber polymer present in a rubber product, an indirect test method is given by which the nonrubber constituents are determined individually or in groups, and the rubber polymer content is determined by difference (Sections 11 - 13). If, in using this test method, fillers are determined by the ashing test method (Section 35 or",
    "36), satisfactory results will be obtained, except where there are found to be present decomposable compounding ingredients such as carbonates that decompose at 550°C, clay, asbestine, talc, hydrated silica, antimony sulfide, halogencontaining components, and silicone polymers. No test method of filler determination herein described will give accurate results in the presence of clay, silica, talc, or any other hydrated filler unless a correction can be made for losses of water of hydration on",
    "or any other hydrated filler unless a correction can be made for losses of water of hydration on ashing. This correction can be made only if the nature and quantity of these fillers are known. The indirect test method will not give accurate results in the presence of halogen-containing components or silicone rubber. In the presence of antimony sulfide or carbonates decomposing at 550°C, but in the absence of the above interfering constituents, approximate correction can be made by means of",
    "the absence of the above interfering constituents, approximate correction can be made by means of determination of total antimony (Section 50) or of the metal associated with the decomposable carbonate (usually calcium, Section 45)",
    "or (Section 49) and calculation of the original composition of the compounding ingredient from these data.",
    "6.5 If factice or high percentages of mineral rubber are present, no accurate test method is known for determination of rubber content or for complete analysis of the rubber product.\n\n6.6 For the determination of the rubber content of hard rubber products, no accurate test method is described herein if fillers decomposable at 550°C are present.\n\n## 7. Blank Determinations",
    "## 7. Blank Determinations\n\n7.1 Blanks shall be run on all determinations to check the purity of the materials used and deductions shall be made accordingly.\n\n## 8. Check Analyses\n\n8.1 Duplicate determinations shall be made and shall check within the limits specified in the test method, when these are stated.\n\n## 9. Preparation Of Samples",
    "9.1 Before preparing a sample for analysis, the analyst shall, by inspection, assure himself that it has not been contaminated. The sample to be analyzed shall be selected by taking pieces from various parts of the original sample and separating them from foreign matter. Because of the variety of rubber products to which this test method can be applied, no single procedure for reducing the sample to the required fineness is applicable to all samples. Therefore, several alternative procedures",
    "to the required fineness is applicable to all samples. Therefore, several alternative procedures for this purpose are described in 9.2 to 9.7. The analyst is expected to select the one most suitable to the sample that he is analyzing and the equipment available.",
    "9.2 For vulcanized soft rubber, unvulcanized rubber, crude rubber, and many samples of reclaimed rubber, it is preferable to mix the sample and grind it by passing it two or three times through a clean, cold, laboratory rubber mill. The rubber will come from the mill in the form of a coarse powder or a rough sheet. If the product is in the form of a sheet, the adjustment of the mill shall be such that the thickness of the final sheet is no greater than 0.5 mm. If the sample is sticky, it shall",
    "that the thickness of the final sheet is no greater than 0.5 mm. If the sample is sticky, it shall be rolled in a liner material that will not adhere to or contaminate the sample. If the milled sample is a powder, it shall be transferred to a No. 14 (1.40-mm) sieve5 and rubbed through the sieve.",
    "Grinding shall be continued until the entire sample passes through the sieve.",
    "9.3 In the absence of milling machinery, the sample may be prepared by cutting it with scissors so that it will pass a No. 14",
    "(1.40-mm) sieve.6,7 The sample may be cut into long strips that are fine enough to pass freely through the sieve and the strips fed through by hand, or the sample may be cut into small fragments and shaken through the sieve. The cutting shall be continued until the entire sample passes through the sieve. If necessary, to prevent sticking, different fragments of the sieved sample may be segregated by wrapping in a liner material that will not adhere to or contaminate the sample.",
    "9.4 Certain very glutinous samples may be prepared for extraction analysis as follows: Place a weighed 2-g sample of the material between two pieces of ashless filter paper that has been extracted in accordance with Section 21. The papers should be approximately 500 by 100 mm (20 by 4 in.) and the sample should be placed near one end. Flatten the sample and spread it throughout the length of the filter paper by passing the",
    "\"sandwich\" lengthwise, through a cold, closely set, even-speed rubber calender. The gross thickness of the resulting sheet should not be greater than 1.0 mm. If a rubber calender is not available, a similar sheet may be obtained by placing the sample in a hydraulic press or a vise. In the latter case, the sample may be roughly spread by hand throughout the length of the filter paper and pressure applied to small areas at a time until the whole sample has been flattened.",
    "9.5 Samples of rubberized cloth, whose overall thickness is no greater than 1.0 mm, may be prepared for analysis by cutting them into pieces 1.5 mm square and then mixing well. If the fabric is easily removed, it should be separated, unless an analysis of the whole cloth is desired.",
    "9.6 Samples of rubber cements shall be evaporated to dryness in a vacuum oven at a temperature not higher than 30°C. The residue may then be analyzed as an unvulcanized sample. A separate sample of the cement shall be distilled under reduced pressure if examination of the solvent is desired.",
    "9.7 Samples of hard rubber shall be reduced to powder form by filing, cleaned with a magnet, and sieved through a No. 30\n(600-µm) sieve.6 Residue retained on this sieve shall be reduced until the entire sample passes through the sieve.",
    "9.8 Certain raw rubber samples may need to be re-shaped, especially when take from a solid bale or rubber crumbs, to approximately 2 mm sheet form for density measurement. In such cases, the raw rubber sample may be pressed between two heat resistant barrier films in a hydraulic press at 100°C for 5 min at a minimum pressure of 50 psi. Condition the molded rubber sheets at 23 6 2°C for at least 1 h and remove the heat resistant film and subsequently conduct the density measurement.",
    "## 10. Preliminary Examination Of Samples\n\n10.1 The procedures given in 10.1.1 - 10.1.9 are for use in determining the number and kind of tests that should be conducted to obtain the desired information concerning the rubber product.\n\n10.1.1 *Carbonates—*Drop a small piece of sample into a test tube containing HCl saturated with bromine. If a stream of bubbles is given off, carbonates are present. The test is not applicable to IIR products.",
    "10.1.2 *Antimony and Lead—*Ash a 0.2 to 0.3-g specimen in accordance with 35.4 or 36.4. Dissolve the ash in 10 cm3 of HCl by heating. Dilute to about 40 cm3 and decant or filter the solution from the residue. Pass H2S into the solution. If a red-orange precipitate forms, antimony is present and may be determined on a rubber specimen in accordance with Section\n50. Organic sulfur shall be determined in accordance with 27.3.",
    "Dilute with water to about 400 cm3 and again pass in H2S. If a black precipitate appears, lead is present and organic and inorganic sulfur shall be determined in accordance with 28.3 and 28.4.\n\n10.1.3 *Carbon Black—*Heat a portion of the sample with HNO3 until there is no more frothing. If the liquid is black, it indicates the presence of carbon black. The test is not applicable to IIR products.",
    "10.1.4 *Barium Salts—*If the sample contains carbonate, ash a small specimen, digest the ash in dilute HCl, cool, and filter.\n\nAdd a few drops of dilute H2SO4 to the filtrate. A white precipitate, insoluble in excess HCl, indicates the presence of acid-soluble barium salts. The presence of acid-soluble barium salts requires that organic sulfur shall be determined by the fusion method (Section 32).",
    "10.1.5 *Waxy Hydrocarbons—*If waxy hydrocarbons are present, they will solidify at −5°C in the acetone extract as a white flocculent precipitate clinging to the sides of the flask.",
    "10.1.6 *Glue—*Extract a portion of the sample with a mixture of 32 % acetone and 68 % chloroform by volume for 8 h in accordance with Section 21. Dry the specimen and digest for 1\nh with hot water. Filter, cool, and add a few drops of a freshly prepared solution of tannic acid (20 g/dm3) to the filtrate and allow to stand for a few minutes. If the solution becomes turbid, glue is present and should be determined as described in Section 40.",
    "10.1.7 *Factice—*Digest the rubber remaining from the test for glue with NaOH solution (175 g/dm3). Decant the liquid, dilute, and acidify with HCl. Any cloudiness or precipitate indicates the presence of factice and the alcoholic potash extract (Section 22) shall be determined.",
    "10.1.8 *Other Fillers—*An HCl-soluble ash indicates the absence of clay, silica, silicates, titanium dioxide, barium sulfate, and lithopone. An HCl-insoluble ash indicates the need for a complete ash analysis if composition of the ash is required.\n\n10.1.9 *Rubber Polymer Identification—*If an identification of the type of rubber polymer present in the sample is desired, proceed in accordance with Sections 52 - 58.",
    "TABLE 1 Factors for Calculations\nRubber\nA\nD\nDensity Mg/m3\nNR\n94/97\n0.94\n0.91A\nIR\n1.00\n1.00\n0.95B\nSBRC\n1.00\n0.92\n0.94B\nBR\n1.00\n1.00\n0.90B\nIIR\n1.00\n1.00\n0.92B\n\nA Wood, L. A., \"Values of Physical Constants of Rubber,\" Rubber Chemistry and\nTechnology, Vol. 12, 1939, p. 130.\nB Wake, W. C., \"The Analysis of Rubber and Rubber-Like Polymers,\" MacLaren\nand Sons, Ltd., London, England, 1958, pp. 42 to 45.\nC Containing 23.5 % bound styrene and not oil-extended.",
    "## Rubber Polymer Content By The Indirect Test Method 11. Scope\n\n11.1 The rubber content of a product is calculated by subtracting the sum of the nonrubber constituents from 100 %.\n\nThis test method is applicable to NR, IR, SBR, and BR products. It can also be applied to IIR products if they are extracted with methyl ethyl ketone rather than with acetone.\n\n## 12. Terminology",
    "12.1 Definitions: 12.1.1 *rubber as compounded—*approximately equivalent to the nonextended rubber used in the manufacture of a rubber product. It differs from the rubber polymer by the amount of nonrubber material present in the crude rubber. For synthetic rubbers the quantity varies with the type of rubber and the manufacturer and no definite percentage can be given. Therefore, for synthetic rubber, rubber as compounded shall be considered to be equal to rubber polymer except for SBR (see",
    "rubber, rubber as compounded shall be considered to be equal to rubber polymer except for SBR (see Table 1).",
    "12.1.2 *rubber by volume—*is the percentage by volume of a rubber product occupied by the rubber as compounded.\n\n12.1.3 *rubber polymer—*the characteristic and major component of a natural or synthetic crude rubber.\n\n12.1.4 *rubber polymer by volume—*the percentage by volume of a rubber product occupied by the rubber polymer.\n\n## 13. Calculation\n\n13.1 Calculate the percentages of rubber as follows:",
    "## 13. Calculation\n\n13.1 Calculate the percentages of rubber as follows:\n\nRubber polymer, % 5 A~100 2 B!\n(1)\nRubber as compounded, % 5 C/D\n(2)\nRubber polymer by volume, % 5 CE/F\n(3)\nRubber by volume, % 5 GE/F\n(4)",
    "where:\nA\n= factor listed in Table 1,\nB\n= sum of percentages of total extract, alcoholic potash\nextract, combined sulfur, inorganic fillers, carbon black and glue as determined in accordance with\nSections 21 (or 19 and 20), 22, 28.2.1, 34.1, 38 (Test\nMethod A) or 39 (Test Method B), and 40.\nC\n= rubber polymer, %\nD\n= factor listed in Table 1,\nE\n= density of product as determined in 16.1,\nF\n= density of rubber listed in Table 1, and\nG\n= rubber as compounded, %",
    "## Determinations And Report For General Test Method 14. Determinations Required\n\n14.1 A complete analysis of a rubber product for the purpose of determining its quality and its specific composition requires, in addition to rubber polymer content, the determination of other values listed in 14.1.1 - 14.1.5.",
    "14.1.1 Acetone Extract, Based on Rubber as Compounded—\nCalculate the percentage of acetone extract, based on rubber as compounded, as follows:\nacetone extract, based on rubber as compounded, %\n(5)\n\n$$=(A/B)\\times100$$\nwhere:\nA\n= percentage of acetone extract, and B\n= percentage of rubber as compounded.",
    "14.1.2 *Sulfur Based on Rubber as Compounded—*Calculate the percentage of sulfur, based on rubber as compounded, as follows:\nSulfur, based on rubber as compounded, % 5 ~A/B! 3100\n(6)\nwhere:\nA\n= percentage of total sulfur, and B\n= percentage of rubber as compounded.\n\n14.1.3 *Inorganic Fillers—*The inorganic fillers may be determined as a unit or may be determined individually and reported as in Items (18) to (28) of 15.1.",
    "14.1.4 *Combustible Fillers—*Carbon black and glue are the combustible fillers which may be determined individually.\n\n14.1.5 *Additives—*Additives such as factice, other rubber substitutes, and softeners are not accurately determined. Their presence and an estimate of the quantities present may be found by determination of acetone, chloroform and alcoholic potash extracts, unsaponifiable matter, waxy hydrocarbons, and mineral oil, and these values shall be reported in a complete analysis.",
    "## 15. Report\n\n15.1 The report may include any or all of the following Items (1) to (17) if a detailed filler analysis is not desired; the purpose of the analysis shall determine the nature of the report. The report may also include any or all of the following Items (18) to (28) if a detailed analysis of inorganic filler is desired.",
    "Determined\nPercentage of\nby Section\n(1)\nAcetone extract, corrected\n18.1 and 19\n(2)\nWaxy hydrocarbons\n24\n(3)\nMineral oil\n25\n(4)\nChloroform extract\n18\n(5)\nFree sulfur\n29\n(6)\nCombined sulfur\n28.2.1\n(7)\nTotal sulfur\n28.2.4\n(8)\nFillers, inorganic\n34.1\n(9)\nCarbon black\n38 or 39\n(10)\nGlue\n40\nDetermined\nPercentage of\nby Section\n(11)\nRubber polymer\n11 - 13 or 52 –\n58\n(12)\nRubber polymer by volume\n11 - 13 11 - 13\n(13)\nRubber as compounded, natural or synthetic\n(14)\nRubber by volume, natural or synthetic",
    "(13)\nRubber as compounded, natural or synthetic\n(14)\nRubber by volume, natural or synthetic\n11 - 13\n(15)\nPercentage of acetone extract on rubber as compounded\n14.1.1 14.1.2\n(16)\nPercentage of sulfur on rubber as compounded\n(17)\nDensity\n16\n(18)\nSilicon dioxide and insoluble matter\n42\n(19)\nSilicon dioxide\n42\n(20)\nLead oxide\n43\n(21)\nIron and aluminum oxides\n44\n(22)\nCalcium oxide\n45\n(23)\nMagnesium oxide\n46\n(24)\nZinc oxide\n47\n(25)\nBarium carbonate\n49\n(26)\nBarium sulfate\n48\n(27)\nAntimony sulfide\n50",
    "46\n(24)\nZinc oxide\n47\n(25)\nBarium carbonate\n49\n(26)\nBarium sulfate\n48\n(27)\nAntimony sulfide\n50\n(28)\nTitanium dioxide\n51",
    "## Density 16. Density\n\n16.1 Determine the density by use of a pycnometer, by hydrostatic weighings, or by compressed volume densimeter. All determinations must be made with solutions at room temperature. Make appropriate corrections to the calculation if the room is at a temperature other than 25°C. Report the temperature of the room when the determinations were made.",
    "16.2 Pycnometer Method: 16.2.1 *Procedure—*Determine the density using the pycnometer with alcohol in place of water to eliminate errors due to air bubbles.\n\n16.2.2 *Calculation—*Calculate the density as follows:",
    "Density at $25^{\\circ}$C in Mg/m${}^{3}=\\frac{0.9971\\times A}{A-(B-C)}\\times D$ (7)\nwhere:\nA\n= mass of specimen, g,\nB\n= mass of pycnometer filled with specimen and alcohol,\ng,\nC\n= mass of pycnometer filled with alcohol, g, and\nD\n= density of alcohol (25°C), Mg/m3 (gm/cc).",
    "g,\nC\n= mass of pycnometer filled with alcohol, g, and\nD\n= density of alcohol (25°C), Mg/m3 (gm/cc).\n16.3 Hydrostatic Method: 16.3.1 *Procedure—*Weigh the specimen first in air. Weigh to the nearest 0.1 mg for specimens of mass 1 to 10 g or density less than 1.00 g/cm. Weigh to the nearest 1 mg for larger specimens or those with density greater than 1.00.",
    "16.3.2 Suspend in water and weigh again. Dipping of the specimen in alcohol followed by blotting before suspending in water for weighing will aid in the elimination of bubbles that cause errors in the determination. A very fine wire is recommended as a supporting medium.\n\n16.3.3 *Calculation—*Calculate the density as follows:\n\n$$\\begin{array}{l}\\mbox{Density at$23^{\\circ}$C in Mg/m${}^{3}$}=\\frac{0.9975\\times A}{A-(B-C)}\\end{array}\\tag{8}$$\n\nwhere:",
    "where:\n\n$A$ = mass of specimen, g,\nB\n= mass of specimen and supporting wire in water, g, and\nC\n= mass of supporting wire in water, g.\n\nNOTE 2—For a relationship between density and specific gravity refer to Test Methods D792, Note 4.",
    "NOTE 2—For a relationship between density and specific gravity refer to Test Methods D792, Note 4.\n\n16.4 Compressed Volume Densimeter:\n16.4.1 *Scope—*This test method describes the use of a volume compressing densimeter which operates on a \"Sample Mass versus Compressed Sample Volume\" ratio as a means of determining the density of rubbery materials such as raw rubbers, carbon black masterbatches, or vulcanizable finished compounds in the uncured state.",
    "16.4.2 Terminology: 16.4.2.1 *compressed volume—*The final equilibrium volume attained by an unvulcanized rubber sample when it is subjected to a compressive force sufficient to cause it to flow until it fully conforms to the surrounding shape of the piston-cylinder test chamber enclosure.\n\n16.4.2.2 *density—*The ratio of sample mass to the final compressed volume.",
    "16.4.3 *Summary of Test Method—*The mass of a test specimen of unvulcanized rubber or rubber compound is determined to 0.01 g. The lid of the test chamber is removed, the sample inserted, and the lid replaced and securely fastened. Sufficient compressive force is applied to the test chamber (by means of air pressure exerted on the inlet side of the drive piston), to cause the sample to flow until it reaches its final compressed volume. From the sample mass and its final compressed volume the",
    "it reaches its final compressed volume. From the sample mass and its final compressed volume the density may be calculated.",
    "16.4.4 *Significance and Use—*This test method may be used for quality control in rubber product manufacturing operations, for research and development testing of raw rubbers, and for evaluating the effects of additives to a rubber compound— particularly the carbon black level in rubber masterbatches.",
    "16.4.5 Apparatus:",
    "16.4.5.1 *Compressed Volume Densimeter,*6(see Fig. 1), consists of an air operated piston-cylinder test chamber whose dimensions (cross sectional area and cylinder length) are accurately known. In the empty state, the top surface of the test piston forms the bottom of the test chamber. As air pressure is applied to the inlet side of the drive cylinder, the test piston will move upwards decreasing the available volume in the test chamber. Measurement of the test piston travel via a linear",
    "the available volume in the test chamber. Measurement of the test piston travel via a linear displacement transducer allows an evaluation of both the calibrated empty volume of the test chamber and the volume remaining when a rubber sample is enclosed and compressed to its final volume. The top of the test chamber is removable for sample insertion but upon replacing it into position it must be securely fastened as per the manufacturer's instructions prior to starting the test.",
    "16.4.5.2 For measuring sample mass, a balance whose output is electronically transferable to the computer memory of the compressed volume densimeter is preferred. In the absence of this feature, a suitable balance may be used with a capacity of at least 310 6 0.01 g.\n\n16.4.5.3 A means of storing and displaying the sample mass\n(g 60.01) and the test piston displacement in cm3 (60.001) is",
    "| 1 = Keyboard, Printerfy          | 6 = Drive Piston ⁄Cylinder   |\n|----------------------------------|------------------------------|\n| 2 = Removable Lid to Test Cylin- |                              |\n| der                              |                              |\n| 7 = Computer (input from balance |                              |\n| & displacement transducer)       |                              |\n| 3 = Test Cylinder                | 8 = Electronic Balance       |",
    "| 3 = Test Cylinder                | 8 = Electronic Balance       |\n| 4 = Displacement Transducer      |                              |\n| 5 = Test Piston                  |                              |",
    "convenient for rapid calculation of density, but in the absence of these features these values can be independently measured and calculated.\n\n16.4.6 Sample Preparation: 16.4.6.1 A sample is cut from either a bale of raw rubber or from a milled sheet of masterbatch or from an unvulcanized rubber compound. A sample volume of 40 to 120 cc may be used, with a sample size of approximately 100 cc recommended for best repeatability.",
    "16.4.6.2 Unless otherwise specified, the standard temperature for testing shall be in accordance with 16.1 (that is, 25 6\n0.5°C).\n\n16.4.7 Procedure: 16.4.7.1 Turn on the electric power supply, and adjust the compressed air supply to the drive piston to 600 kPa (87 psi)\n(see Fig. 1 and Note 3 and Note 4).",
    "NOTE 3—600 kPa (87 psi) on the drive piston of the compressed volume densimeter in Fig. 1 results in a compressive force of 18.9 kN being applied to a sample in the test chamber or 7389 kPa (1072 psi). If the dimensions of the compressed volume densimeter used differ from those shown in Fig. 1 the air supply shall be adjusted to exert the same levels of force and pressure to the sample area.",
    "NOTE 4—No minimum pressure on the sample is specified. For low viscosity samples which have a measured ML-4 at 100 6 0.5°C of <40.0\n(see Test Methods D1646), the use of 600 kPa pressure on the drive piston may cause some sample loss due to leakage through the clearance between the test chamber cap and the cylinder wall. If this happens, it is NOTE 1—Measured Property = Density, Mg/m3.",
    "| Material            | Average              |\n|---------------------|----------------------|\n| Within Laboratories | Between Laboratories |\n| Sr                  | r                    |\n| A (SBR1500)         | 0.944                |\n| B (SBR1712)         | 0.954                |\n| C (SBR1848)         | 1.134                |\n| Pooled (average)    | 1.011                |\n\nA The time period for precision is days.",
    "A The time period for precision is days.\n\nrecommended that the drive piston air supply be reduced to that level which will achieve adequate compression to fill the test chamber without leakage.\n\n16.4.7.2 Zero the electronic balance and check its accuracy with the standard mass supplied by the manufacturer.\n\n16.4.7.3 Check the accuracy of the displacement transducer with the standard metal cylinder of known mass, height, and diameter as per the manufacturer's instructions.",
    "16.4.7.4 Measure the mass of the sample to 60.01 g.\n\n16.4.7.5 Remove the lid to the test chamber, insert the sample, replace the lid, and lock it securely before pressurizing.",
    "16.4.7.6 Activate the air supply to the drive cylinder and adjust to 600 kPa (87 psi) (with a corresponding pressure on the sample of 7389 kPa (1072 psi)). Allow the sample to remain under compression until equilibrium volume is reached as indicated by two or more identical readings in succession of the output from the linear displacement transducer. Note the total piston displacement value in centimeter 60.001.\n\n16.4.8 Calculation:\n16.4.8.1 Calculate the sample's compressed volume as follows:",
    "16.4.8 Calculation:\n16.4.8.1 Calculate the sample's compressed volume as follows:\n\n$$Vs=k\\times D^{2}\\times L\\tag{9}$$\nwhere:\nVs\n= compressed volume, cm3, D\n= test cylinder diameter, cm, L\n= thickness of compressed sample, cm, and k\n= 0.0784.\n\n16.4.8.2 Calculate the sample density as follows:\n\n$D$, Mg/m${}^{3}$ = $\\frac{\\mbox{\\it W}a}{\\mbox{\\it Vs}}$ (10)\nwhere:\nD\n= compressed density (see Note 5), Wo\n= sample mass, g, and Vs\n= sample volume, cm3.\n\nNOTE 5—Mg/m3 is numerically equal to gm/cm3.",
    "NOTE 5—Mg/m3 is numerically equal to gm/cm3.\n\n16.4.9 Report the following information: 16.4.9.1 Date of test, 16.4.9.2 Sample identification, 16.4.9.3 Test temperature, 16.4.9.4 Type of compressed volume densimeter, include critical dimensions if different from those of Fig. 1, and\n16.4.9.5 Results calculated in accordance with Eq 9 and Eq\n10.\n\n## 16.4.10 *Precision And Bias:*8",
    "## 16.4.10 *Precision And Bias:*8\n\n16.4.10.1 These precision statements have been prepared in accordance with Practice D4483. Refer to Practice D4483 for terminology and other statistical calculation details.",
    "16.4.10.2 The results presented in Table 2 give an estimate of the precision of this test method with the SBR rubbers used in the interlaboratory program described below. These precision parameters should not be used for acceptance or rejection testing of materials without documentation that they are applicable to those particular materials and the specific testing protocols that include this test method.",
    "(1) Type 1 interlaboratory precision program was conducted. A period of 24 h separates replicate test results. Five laboratories participated and three SBR rubbers were used. A test result is the value obtained from the average of three determinations. Each material was analyzed in triplicate on two separate days.\n\n16.4.10.3 Precision parameters are given in Table 2.",
    "16.4.10.3 Precision parameters are given in Table 2.\n\n16.4.10.4 The difference between two single test results (or determinations) found on identical test material under the repeatability conditions prescribed for a particular test will exceed the repeatability on an average of not more than once in 20 cases in the normal and correct operation of the test method.",
    "16.4.10.5 The difference between two single independent test results found by two operators working under the prescribed reproducibility conditions in different laboratories on identical test material will exceed the reproducibility on an average of not more than once in 20 cases in the normal and correct operation of the test method.\n\n16.4.11 Keywords: 16.4.11.1 compressed volume; densimeter; density; mass;\nmass/volume ratio\n\n## Extract Analysis 17. Scope",
    "## Extract Analysis 17. Scope\n\n17.1 The test methods described in Sections 18 - 26 cover the removal from a rubber product of all nonrubber constituents soluble in specified organic solvents.\n\n## 18. Terminology",
    "18.1 Definitions of Terms Specific to This Standard: 18.1.1 *acetone extract—*If the acetone extract is made on vulcanized rubber products the acetone removes rubber resins, free sulfur, acetone-soluble plasticizers, processing aids, mineral oils or waxes, acetone-soluble antioxidants and organic accelerators or their decomposition products, and fatty acids. It also removes part of bituminous substances, vulcanized oils, high molecular mass hydrocarbons, and soaps. This is generally called",
    "substances, vulcanized oils, high molecular mass hydrocarbons, and soaps. This is generally called acetone extract. The percentages of free sulfur, waxy hydrocarbons, and mineral oil are determined and their sum deducted from the acetone extract. The value obtained is known as acetone extract, corrected. The corrected figure thus obtained will at times give valuable information regarding the quality of the rubber present. This is not true, however, when the product contains substantial",
    "the quality of the rubber present. This is not true, however, when the product contains substantial quantities of mineral oils or waxes, bituminous substances, organic accelerators, or antioxidants. With products containing rubber that consists of only the best grades of Hevea rubber, the acetone extract should not exceed 5 % of the rubber present. A higher extract may indicate the presence of inferior or reclaimed rubbers, added oils, waxes, or bituminous materials, or substantial quantities",
    "or reclaimed rubbers, added oils, waxes, or bituminous materials, or substantial quantities of organic accelerators or antioxidants. No correction is possible for small quantities of antioxidants and organic accelerators, since no general method is now known for the separation and identification of all classes of these materials. Practice D3156",
    "may be used for the qualitative detection of antidegradants in the acetone extract of vulcanized rubber products. Acetone extract shall be taken as the percentage of acetone extract minus the percentage of sulfur as determined on the acetone extract by Section 30. Acetone extract shall be determined in accordance with Section 19.",
    "18.1.2 *alcohol potash extract—*The purpose of the alcoholic potash extraction is to detect the presence of rubber substitutes. The alcoholic potash extract shall be determined in accordance with Section 22.",
    "18.1.3 *chloroform extract—*The chloroform extraction removes a portion of the bituminous substances and serves as an indication of their presence. The chloroform extract may also include other materials, including small portions of rubber for which no correction is made. The chloroform extract shall be determined in accordance with Section 20.",
    "18.1.4 *mineral oil—*Mineral oil in the rubber product is the portion of the unsaponifiable acetone extract that is soluble in absolute ethanol at −5°C and that is soluble in carbon tetrachloride and is not attacked by concentrated H2SO4. Mineral oil shall be determined in accordance with Section 25.",
    "18.1.5 rapid reflux extracts:—\n18.1.5.1 *bound extract—*Bound extract consists of materials removed from vulcanized rubber products by methyl ethyl ketone in rapid reflux extraction but not removed by acetone in rapid reflux extraction. It includes part of any bituminous substances, vulcanized oils, high-molecular weight hydrocarbons, and soaps not chemically combined with the rubber. It shall be determined in accordance with Section 26.",
    "18.1.5.2 *complete extract—*Rapid reflux extraction of vulcanized rubber products with methyl ethyl ketone removes all of the solvent-soluble organic materials not chemically combined with the rubber. It includes rubber resins, free sulfur, plasticizers, processing aids, antioxidants and organic accelerators or their decomposition products, bituminous substances, fatty acids, soaps, and part of any vulcanized oils.",
    "It shall be determined in accordance with Section 26",
    "18.1.5.3 *free extract—*Rapid reflux extraction of vulcanized rubber products with acetone removes most of the solventsoluble organic materials not chemically combined with the rubber. It includes rubber resins, free sulfur, plasticizers, processing aids, antioxidants and organic accelerators or their decomposition products, and fatty acids, but only part of bituminous substances, vulcanized oils, high-molecular-weight hydrocarbons, and soaps. It shall be determined in accordance with Section",
    "high-molecular-weight hydrocarbons, and soaps. It shall be determined in accordance with Section 26.",
    "18.1.6 *total extract—*The total extract is the material removed from the rubber product, by extraction with a mixture consisting of 32 % acetone and 68 % chloroform by volume, for a period of at least 8 h. It is also approximately equal to the sum of the acetone and chloroform extracts. The total extract shall be determined in accordance with Section 21.",
    "18.1.7 *unsaponifiable acetone extract—*The unsaponifiable acetone extract is the portion of the acetone extract that is not saponified by a 1 N alcoholic KOH solution. It shall be determined in accordance with Section 23.",
    "18.1.8 *waxy hydrocarbons—*The waxy hydrocarbons are the portion of the unsaponifiable acetone extract that is removed by extraction with absolute ethanol and that separates from the alcoholic solution on cooling to −5°C with a mixture of salt and ice. Waxy hydrocarbons shall be determined in accordance with Section 24.\n\n## 19. Acetone Extract",
    "19.1 *Scope—*This test method covers the determination of the percentage of acetone extract (see 18.1). This test method is also applicable when any of the following quantities are to be determined: unsaponifiable acetone extract (Section 23), waxy hydrocarbons (Section 24), mineral oil (Section 25), sulfur in acetone extract (Section 30), and in any procedure where an acetone-extracted specimen is required. It is applicable to crude, unvulcanized, reclaimed, or vulcanized NR, SBR, BR, and IR",
    "is required. It is applicable to crude, unvulcanized, reclaimed, or vulcanized NR, SBR, BR, and IR types of rubber products.",
    "19.2 Extraction Apparatus: 19.2.1 The extraction apparatus used shall be of the general type and dimensions shown in Fig. 2 or Fig. 3.\n\n19.2.2 The apparatus in Fig. 2 shall consist of a glass conical flask, glass extraction cup, and block tin condenser.\n\nThe apparatus in Fig. 3 shall be all glass.\n\n19.3 *Solvent: Acetone—*USP grade acetone may be used if distilled over anhydrous potassium carbonate (K2CO3) not more than 10 days before use. Use the fraction boiling between 56 and 57°C.",
    "19.4 Procedure: 19.4.1 Place a weighed specimen of approximately 2 g in a filter paper. If the specimen is in the form of a sheet (see 9.2), cut it with scissors into strips 3 to 5 mm in width. If the specimen becomes tacky during the extraction, take care that adjacent portions are separated by paper. Fold the paper so that it will fit in the extraction cup and suspend the cup in a weighed extraction flask containing 50 to 75 cm3 of acetone. (Prior to the weighing of the extraction flask, it",
    "flask containing 50 to 75 cm3 of acetone. (Prior to the weighing of the extraction flask, it shall have been dried for",
    "2 h at 70 6 5°C and cooled in a desiccator to the temperature of the balance.)\n19.4.2 Extract the specimen continuously for 16 h heating at a rate such that the time required to fill and empty the siphon cup will be between 2.5 and 3.5 min. (Rubber products having a ratio of total sulfur to rubber polymer in excess of 10 %, shall be extracted for 72 h.) Carefully note all characteristics of the extract, when hot and cold.",
    "19.4.3 Evaporate off the acetone over a steam bath, using a gentle current of filtered air to prevent boiling. Remove the flask from the steam bath just prior to the disappearance of the last traces of solvent to prevent loss of extract. Continue the passage of air through the flask for 10 min to remove the remaining solvent and dry the flask for 2 h at 70 6 5°C in an air bath.\n\n19.4.4 Cool in a desiccator to the temperature of the balance and weigh.",
    "19.4.4 Cool in a desiccator to the temperature of the balance and weigh.\n\n19.5 *Calculation—*Calculate the percentage of acetone extract as follows:\n\nAcotone extract, % = ($A/B$) $\\times$ 100 (11)\nwhere:\nA\n= grams of extract, and B\n= grams of specimen used.\n\n## 20. Chloroform Extract",
    "## 20. Chloroform Extract\n\n20.1 *Scope—*This test method covers the determination of the amount of material removed from a vulcanized rubber product by extraction with chloroform after the specimen has been extracted with acetone (see 18.2). Its application is restricted to vulcanized NR, SBR, BR and IR types of rubber products.\n\n20.2 *Apparatus—*The extraction apparatus shall be that described in 19.2.\n\n20.3 *Solvent: Chloroform—*Chloroform of USP grade may be used in extraction.",
    "20.4 Procedure:\n20.4.1 Suspend the extraction cup containing the specimen that has been extracted with acetone (19.4) in a second weighed extraction flask containing 50 to 75 cm3 of chloroform and extract it for 4 h with the chloroform, using the extraction rate prescribed in 19.4. (Rubber products having a ratio of total sulfur to rubber polymer in excess of 10 % shall be extracted for 24 h.) Record the color of the chloroform solution.",
    "20.4.2 Evaporate the chloroform over a steam bath, using a gentle current of filtered air to prevent boiling. Remove the flask from the steam bath just prior to the disappearance of the last traces of solvent to prevent loss of extract. Continue the passage of air for 10 min to remove the remaining solvent and dry the flask for 2 h in an air bath at 70 6 5°C.",
    "20.4.3 Cool in a desiccator to the temperature of the balance and weigh. Reserve the extracted sample for extraction with alcoholic potash (Section 22).\n\n20.5 *Calculation—*Calculate the percentage of chloroform extract as follows:\nChloroform extract, % 5 ~A/B! 3100\n(12)\nwhere:\nA\n= grams of extract, and B\n= grams of specimen used.",
    "21. Total Extract\n21.1 *Scope—*The total extract (see 18.3) may be used to replace the sum of the acetone and chloroform extracts when analysis is to be performed on an extracted specimen or when rubber polymer is being determined in accordance with 13.1.\n\nIts application is restricted to vulcanized NR, SBR, BR, and IR types of rubber products.\n\n21.2 *Apparatus—*The extraction apparatus shall be that described in 19.2.\n\n21.3 Reagents:\n21.3.1 *Acetone—*See 19.3.\n\n21.3.2 *Chloroform—*See 20.3.",
    "21.4 Procedure: 21.4.1 Place a weighed specimen of approximately 2 g in a filter paper. If the specimen is in the form of a sheet, cut it with scissors into strips 3 to 5 mm in width. If the specimen becomes tacky during the extraction, take care that adjacent portions are separated by paper. Fold the paper so that it will fit in the extraction cup, and suspend the cup in a weighed extraction flask containing 50 to 75 cm3 of a mixture consisting of 32 parts of acetone and 68 parts of chloroform",
    "containing 50 to 75 cm3 of a mixture consisting of 32 parts of acetone and 68 parts of chloroform by volume. Use care in disposing of excess solvent mixture. Acetone plus chloroform can react with bases to form explosive mixtures. (Prior to the weighing of the extraction flask, dry it for 2 h at",
    "70 6 5°C and cool in a desiccator to the temperature of the balance.)",
    "21.4.2 Extract the specimen continuously for 16 h heating at a rate such that the time required to fill and empty the siphon cup will be between 2.5 and 3.5 min. (Rubber products having a ratio of total sulfur to rubber polymer in excess of 10 % shall be extracted for 72 h.) Carefully note all characteristics of the extract, when hot and cold. If the color is black, make a chloroform extraction as described in Section 20 and add the value for the chloroform extract to the result obtained for",
    "as described in Section 20 and add the value for the chloroform extract to the result obtained for total extract.",
    "21.4.3 Evaporate off the solvent over a steam bath, using a gentle current of filtered air to prevent boiling. Remove the flask from the steam bath just prior to the disappearance of the last traces of solvent to prevent loss of extract. Continue the passage of air through the flask for 10 min to remove the remaining solvent and dry the flask for 2 h in a 70 6 5°C air bath.",
    "21.4.4 Cool in a desiccator to the temperature of the balance and weigh. Save the extracted rubber for further tests that require the use of an extracted specimen (see Sections 31, 32,\n33, 38 and 52).\n\n21.5 *Calculation—*Calculate the percentage of total extract as follows:\n\nTotal extract, % = ($A/B$) $\\times$ 100 (13)\nwhere:\nA\n= grams of extract, and B\n= grams of specimen used.\n\n## 22. Alcoholic Potash Extract",
    "## 22. Alcoholic Potash Extract\n\n22.1 *Scope—*This test method covers the determination of the amount of material that can be removed by alcoholic KOH from a rubber product that previously has been extracted with acetone and chloroform (see 18.4). Its application is restricted to vulcanized NR, SBR, BR, and IR types of rubber products.",
    "22.2 Reagents: 22.2.1 *Alcoholic Potash Solution—*Prepare a 1 M alcoholic potassium hydroxide (KOH) solution by dissolving the required amount of KOH in absolute ethanol that has been purified as follows: Dissolve 1.3 g of silver nitrate (AgNO3) in\n3 cm3 of water and add it to 1 dm3 of alcohol. Dissolve 3 g of KOH in the smallest amount of hot water possible, cool, add it to the AgNO3 solution, and shake thoroughly. Allow the solution to stand for at least 24 h, filter, and distill.",
    "NOTE 6—Absolute ethanol denatured with 10 % by volume of methanol, or anhydrous ethanol conforming to Formula No. 2B of the U. S. Bureau of Internal Revenue may be used in place of absolute ethanol.\n\n22.2.2 Congo Red Paper. 22.2.3 *Ethanol* (95 %). 22.2.4 Ether. 22.3 Procedure: 22.3.1 Remove the specimen remaining after the chloroform extract (Section 20) or total extract (Section 21) from its wrapping material, while wet with solvent and dry the rubber at 70 6 5°C to remove the solvent.",
    "22.3.2 Transfer to a 200-cm3 Erlenmeyer flask, add 50 cm3\nof alcoholic potash solution, and heat under a reflux condenser for 4 h. In the case of hard rubber, continue the heating for 16 h or more.",
    "22.3.3 Filter into a 250-cm3 beaker, wash with two 25-cm3\nportions of boiling alcohol and then with three 25-cm3 portions of boiling water, and evaporate the filtrate just to dryness. Use about 75 cm3 of water to transfer the dried filtrate residue to a separatory funnel. Acidify the solution with HCl (1 + 3), testing with Congo red paper.",
    "22.3.4 Extract with four 25-cm3 portions of ether, unless the fourth portion should be colored. In this case, continue the extraction until the ether extract is colorless. Unite the ether fractions and wash thoroughly with water until free of acid (two washings are generally sufficient).",
    "22.3.5 Filter the ether solution through a plug of previously washed absorbent cotton into a weighed flask and wash the separatory funnel and the cotton plug with ether. Evaporate the ether on a steam bath, using a gentle current of filtered air to prevent boiling. Remove the flask from the steam bath just prior to the disappearance of the last traces of solvent and continue the passage of air for 10 min. Dry the flask at 100 6\n5°C to constant mass, cool, and weigh.",
    "22.4 *Calculation—*Calculate the percentage of alcoholic potash extract as follows:\n\nAlcoholic potassium extract, % = ($A/B$) $\\times$ 100 (14)\nwhere:\nA\n= grams of extract, and B\n= grams of specimen used.\n\n## 23. Unsaponifiable Acetone Extract\n\n23.1 *Scope—*This test method covers the determination of the amount of unsaponifiable material contained in the acetonesoluble portion of a rubber product (see 18.5).\n\n23.2 Reagents:\n23.2.1 *Alcoholic Potash Solution—*See 22.2.1.\n\n23.2.2 Ether.",
    "23.2 Reagents:\n23.2.1 *Alcoholic Potash Solution—*See 22.2.1.\n\n23.2.2 Ether.\n\n23.2.3 *Phenolphthalein Indicator Solution—*Dissolve 0.5 g of phenolphthalein in 100 cm3 of ethanol.\n\n23.3 Procedure: 23.3.1 Add to the acetone extract obtained from a 2-g specimen (see 19.4), 50 cm3 of a 1 N alcoholic KOH solution, condenser for 2 h, remove the condenser, and evaporate to dryness.",
    "23.3.2 Transfer to a separatory funnel, using about 100 cm3",
    "of water. Extract with 25 cm3 of ether. Allow the layers to separate thoroughly; then draw off the water layer. Continue extraction of the water layer with fresh portions of ether, including washing out the original flask with a portion, until no more unsaponifiable matter is removed. This usually requires about four washings. Unite the ether layers and wash with water until a negative test for alkali using phenolphthalein indicator is obtained on the wash water.",
    "23.3.3 Transfer the ether to a weighed flask and distill off the ether on a steam bath using a gentle stream of filtered air to prevent boiling. Continue the air stream for 5 min after the ether is distilled off. Dry the extract to constant mass at 100 6\n5°C and weigh. Save the residue for determination of waxy hydrocarbons (Section 24) and mineral oil (Section 25).",
    "23.4 *Calculation—*Calculate the percentage of unsaponifiable acetone extract as follows:\nUnsaponifiable acetone extract, % 5 ~A/B! 3100\n(15)\nwhere:\nA\n= grams of extract, and B\n= grams of specimen used.\n\n## 24. Waxy Hydrocarbons\n\n24.1 *Scope—*This test method covers the determination of the amount of waxy hydrocarbons contained in the unsaponifiable acetone extract that are soluble in ethanol and that separate from an ethanol solution on cooling to −5°C.",
    "24.2 Reagents:\n24.2.1 *Chloroform—*See 20.3.\n\n24.2.2 Ethanol, Absolute.\n\n24.2.3 *Ethanol* (95 to 100%).",
    "24.3 Procedure:\n24.3.1 To the unsaponifiable matter, obtained from 23.3.3, add 50 cm3 of absolute ethanol and heat on the steam bath for",
    "30 min. Let the flask stand in a mixture of ice and salt kept at −5°C for at least 1 h. Filter off the separated waxy hydrocarbons on filter paper by applying gentle suction while keeping the filter funnel surrounded by a salt-ice mixture at −5°C or lower. Wash the precipitate with ethanol (95 to 100 %) that has been cooled to −5°C or lower in an ice-salt mixture. Save the filtrate and washings for determination of mineral oil (Section\n25).",
    "24.3.2 Dissolve the precipitate from the filter paper with hot chloroform, and catch the solution in a weighed 100 to",
    "150-cm3 beaker. Wash the flask with hot chloroform and add the washings to the solution in the beaker in order to include any insoluble matter adhering to the walls of the flask. Evaporate the solvent on a steam bath, passing a gentle current of filtered air over the residue for 5 min after the solvent is essentially evaporated. Dry to constant mass at 100 6 5°C, cool, and weigh.",
    "24.4 *Calculation—*Calculate the percentage of waxy hydrocarbons as follows:\n\nWaxy hydrocarbons, $\\%=(A/B)\\times100$ (16)\nwhere:\nA\n= mass of waxy hydrocarbons, and\nB\n= grams of specimen used.\n\n## 25. Mineral Oil",
    "## 25. Mineral Oil\n\n25.1 *Scope—*This test method covers the determination of the amount of mineral oil that is extracted from a rubber product with acetone. The mineral oils found are saturated hydrocarbons that are soluble in ethanol at −5°C, are soluble in CCl4, and are not attacked by concentrated H2SO4.\n\n25.2 Reagents:\n25.2.1 *Carbon Tetrachloride* (CCl4).\n\n25.2.2 Ether.\n\n25.2.3 *Sulfuric Acid* (H2SO4).",
    "25.3 *Procedure—*Evaporate the alcohol filtrate from the waxy hydrocarbon determination (24.2.1), using a gentle current of filtered air to prevent boiling, add 25 cm3 of CCl4, and transfer to a separatory funnel. Shake with H2SO4, drain off the colored acid, and repeat with fresh portions of H2SO4",
    "until there is no longer any discoloration of the acid. After drawing off all of the H2SO4, add a portion of water and sufficient ether to form the ether-CCl4 layer above the water and wash repeatedly with water until all traces of acid are removed as shown by a methyl red indicator test on the water layer. Transfer the ether-CCl4 layer to a weighed flask and evaporate the solvent on a steam bath, using a current of filtered air to prevent boiling. Remove from the steam bath just prior to the",
    "using a current of filtered air to prevent boiling. Remove from the steam bath just prior to the disappearance of the last traces of solvent and continue the flow of air for 10 min. Dry to constant mass in an air bath at 100 6 5°C, cool, and weigh.",
    "25.4 *Calculation—*Calculate the percentage of mineral oil as follows:\n\n$$\\mbox{Mineral oil,}\\%=(A/B)\\times100\\tag{17}$$\n\nwhere:\n\n$A$ = grams of residue, and\n\n$B$ = grams of specimen used.\n\n## 26. Rapid Reflux Extracts",
    "26.1 *Scope—*This test method covers the determination of the amount of material removed from a vulcanized product by rapid reflux extraction with a specified solvent or the removal of extractable material from a rubber product that is to be analyzed further (see 18.8). It is applicable only to vulcanized NR, SBR, BR, IR, and IIR products and is used when the extracts themselves are not to be analyzed further. The values obtained are not necessarily equivalent to those obtained by continuous",
    "further. The values obtained are not necessarily equivalent to those obtained by continuous extraction procedures (Sections 19, 20, and 21).",
    "26.2 Reagents: 26.2.1 Acetone.",
    "26.2.2 Methyl Ethyl Ketone. 26.3 *Procedure—*Mill the sample until a homogeneous sheet not more than 0.75 mm (0.030 in.) thick is formed. Cut specimens weighing between 90 and 110 mg into different identifying shapes and weigh to the nearest 0.1 mg. Place",
    "25 cm3 of methyl ethyl ketone per specimen for complete extract or of acetone for free extract in a 250-cm Erlenmeyer flask for as many as six specimens. Drop the specimens into the flask, connect it to a condenser, and reflux for 60 min. Disconnect the flask and remove it from the hot plate. Pour the contents onto a clean No. 100 (150-µm) sieve to recover the extracted pieces. (The appearance of small particles on the screen indicates loss of part of the specimen.) Gently blot the extracted",
    "of small particles on the screen indicates loss of part of the specimen.) Gently blot the extracted pieces between paper towels to remove excess solvent. Dry the pieces at 105°C for 15 min. Cool the pieces for 10 min and weigh them to the nearest 0.1 mg.",
    "26.4 *Calculation—*Calculate the percentages of material extracted from a vulcanized material as follows:\nComplete extract, % 5 ~A/B! 3100\n(18)\nwhere:\nA\n= mass loss during extraction with methyl ethyl ketone, and B\n= mass of specimen used.\n\nFree extract, % 5 ~A/B! 3100\n(19)\n\nwhere:\nA\n= mass loss during extraction with acetone, and\nB\n= mass of specimen used.\nBound extract, % 5 A 2 B\n(20)\nwhere:\nA\n= percentage of complete extract, and B\n= percentage of free extract.\n\n## Sulfur Analysis 27. Scope",
    "## Sulfur Analysis 27. Scope\n\n27.1 The test methods for determination of sulfur are for use in determining the quantity of different forms of sulfur found in rubber products. The application to different types of rubber products is covered in the scopes of the specific test methods.\n\n## 28. Terminology",
    "28.1 Definitions:",
    "28.1.1 *Historical Evolution of Definitions—*In the past, the types of sulfur present in a rubber vulcanizate have been defined in various ways, often as a compromise between an absolute definition and a definition of what can be determined by chemical analysis. At the beginning of the development of these analytical test methods, three types of sulfur were defined in a manner in which they could be determined. Free sulfur was the sulfur extractable by acetone. Total sulfur was all of the",
    "could be determined. Free sulfur was the sulfur extractable by acetone. Total sulfur was all of the sulfur, in any form, present in the sample. Sulfur in ash was that sulfur present in inorganic sulfur-bearing fillers plus any sulfur that combined with the fillers during the ashing process. In more recent years, two types of free sulfur were defined; the sulfur extractable with acetone or acetone-chloroform, and that sulfur extractable with sodium sulfite. Total sulfur was redefined to exclude",
    "and that sulfur extractable with sodium sulfite. Total sulfur was redefined to exclude all sulfur in inorganic sulfides and sulfates. This change necessitated the addition of definitions and methods for determination of organic sulfur (organically combined, nonextractable sulfur) and inorganic sulfur; essentially the same, in most cases, as sulfur in ash. In the current revision",
    "(28.2) only three terms are officially defined; total sulfur, free sulfur, and combined sulfur. Of these, the first two can be determined accurately, but free sulfur is subject to interpretation of the meaning of the results. Combined sulfur cannot be accurately determined in some cases in its true meaning. Some secondary terms have been retained to aid in describing the steps and methods necessary for the determination of combined sulfur. Sulfur, acetone extract (Section 30) has been retained",
    "for the determination of combined sulfur. Sulfur, acetone extract (Section 30) has been retained as a means of determining all extractable sulfur, but free elemental sulfur is not determined by this test method or by the free sulfur test method (Section 29).",
    "28.2 Definitions, Current: 28.2.1 combined sulfur (nonextractable organically combined sulfur)—the sulfur from any source in a rubber compound which, through the process of vulcanization, has become chemically bound to the rubber or other organic constituents, and which is not removed by extracting solvents. This sulfur, when determined as prescribed in this section and in the absence of nonextractable sulfur-bearing fillers, may, in the ideal case, be an approximation of the sulfur of",
    "nonextractable sulfur-bearing fillers, may, in the ideal case, be an approximation of the sulfur of vulcanization. However, any interpretation of the results must be made with the knowledge that the results may include any of the following: (1) sulfur combined with rubber; (2) sulfur present in sulfur-bearing rubber chemicals that is not extracted by acetone or acetone-chloroform mixture; (3) part of the sulfur present in factice and mineral rubber; (4) the sulfur contained in carbon black; (5)",
    "of the sulfur present in factice and mineral rubber; (4) the sulfur contained in carbon black; (5) sulfur in reclaimed rubber that is not extracted by acetone or acetone-chloroform mixture ; (6) sulfur in extender oils that may not be extracted; (7) a possible error if any of the combined sulfur combines with inorganic fillers during the determination of inorganic sulfur (Section 33). The specimen shall be extracted with acetone (19.4) or with acetonechloroform mixture (21.4). The latter",
    "shall be extracted with acetone (19.4) or with acetonechloroform mixture (21.4). The latter extracting solvent is preferred, especially if sulfur-bearing additives are known or suspected to be present. Combined sulfur, plus the sulfur present in inorganic compounds, shall be determined on the extracted sample in accordance with Section 31 in the absence of acid-soluble barium salts, antimony and inorganic lead compounds, and in accordance with Section 32 if any of these compounds are present.",
    "inorganic lead compounds, and in accordance with Section 32 if any of these compounds are present. The combined sulfur shall be calculated by subtracting the inorganic sulfur (Section 33) from the above determined combined sulfur plus inorganic sulfur. Application to NBR and IIR compounds must be verified by use of known control samples.",
    "28.2.2 *free sulfur—*the sulfur in a rubber compound available for further vulcanization that is extractable by sodium sulfite. This sulfur is determined by titrating the thiosulfate resulting from extraction with sodium sulfite solution",
    "(50 g ⁄dm3). It represents essentially elemental sulfur, but will include small amounts of coordinately bound sulfur (such as some of the polysulfide sulfur) and organically bound sulfur in some cases, particularly in the presence of thiuram disulfide compounds. Free sulfur shall be determined in accordance with Section 29.",
    "28.2.3 *sulfur, acetone extract—*the sulfur removed from a rubber by extraction with acetone (Section 19) or acetonechloroform mixture (Section 21). This method determines elemental sulfur, sulfur in solvent-soluble accelerators and part of the sulfur present in factice, mineral rubber, reclaimed rubber, and extender oils. It does not determine free sulfur, and the inclusion of the method is largely for the purpose of detecting the presence of sulfur-bearing rubber substitutes such as factice",
    "for the purpose of detecting the presence of sulfur-bearing rubber substitutes such as factice and mineral rubber, or for detecting the presence of an unusually large amount of elemental sulfur or accelerators.",
    "It shall be determined in accordance with Section 30.\n\n28.2.4 *total sulfur—*all the sulfur present in a rubber compound. The total sulfur shall be determined in accordance with Section 31 in the absence of barium sulfate, acid-soluble barium salts, inorganic lead compounds, and antimony compounds. Section 32 must be used on compounds containing any of the above inorganic compounds.\n\n## 29. Free Sulfur",
    "## 29. Free Sulfur\n\n29.1 *Scope—*This test method covers the determination of the amount of free sulfur (see 28.2.2) in rubber products. It is applicable to NR, SBR, BR, NBR, CR, and IR products.\n\n29.2 Apparatus:\n29.2.1 *Filter Crucibles,* filter crucibles that will withstand the firing temperature required in the specific application.",
    "29.3 Reagents and Materials:\n29.3.1 *Cadmium Acetate Solution* (30 g/dm3).\n29.3.2 *Cadmium Acetate Wash Solution* (1.2 g/dm3).\n29.3.3 *Formaldehyde Solution* (40 %). 29.3.4 Glacial Acetic Acid.\n29.3.5 *Iodine, Standard Solution (0.05 N)—*Add 6.35 g of\niodine and 20 g of potassium iodide (KI) to a beaker and just cover with water. Let stand with occasional stirring until dissolved, adding a small additional amount of water if\nnecessary. When dissolved, dilute to 1 dm3, filter through a",
    "necessary. When dissolved, dilute to 1 dm3, filter through a\nfilter crucible, and store the solution in a stoppered, brown glass bottle. Standardize, preferably on the day it is to be used, against the National Institute of Standards and Technology standard sample No. 83 of arsenic trioxide in accordance with the instructions furnished with the standard sample.\n29.3.6 Paraffın.\n29.3.7 *Sodium Stearate Suspension in Water* (1 g/dm3).\n29.3.8 *Sodium Sulfite Solution* (50 g Na2SO3/dm3).",
    "29.3.8 *Sodium Sulfite Solution* (50 g Na2SO3/dm3).\n29.3.9 *Starch Solution* (10 g/dm3).\n29.3.10 *Strontium Chloride Solution* (5 g SrCl2/dm3).",
    "29.4 Procedure: 29.4.1 Place 2 g of a sample thinly sheeted (0.5 to 0.75 mm\n(0.02 to 0.03 in.)) in a 400-cm3, thin-walled, chemically resistant glass9 flask. Add 100 cm3 of Na2SO3 solution, 5 cm3\nof a sodium stearate suspension in water, and approximately\n1 g of paraffin. Cover the flask with a small watch glass and gently boil for 4 h, or digest just below the boiling point for\n16 h. Remove the flask and add 100 cm3 of SrCl2 solution and",
    "16 h. Remove the flask and add 100 cm3 of SrCl2 solution and\n10 cm3 of cadmium acetate solution. Separate the rubber and precipitate by filtration, using a Büchner funnel with suction\n(see 29.2.1). Wash with two 75 to 100-cm3 portions of cadmium acetate wash solution.",
    "29.4.2 To the filtrate add, while stirring, 10 cm3 of formaldehyde solution, 10 cm3 of glacial acetic acid, and 5 cm3 of starch solution. Add enough crushed ice to bring the temperature of the solution below 15°C, and titrate with 0.05 N iodine solution to a blue end point.\n\n29.5 *Blank—*The blank determination on the reagents should not exceed 0.2 to 0.3 cm3.\n\n29.6 *Calculation—*Calculate the percentage of free sulfur as follows:",
    "29.6 *Calculation—*Calculate the percentage of free sulfur as follows:\n\nFree sulfur, $\\%=(A-B)\\ N\\times0.032/C\\times100$ (21)\nwhere:\nA\n= volume of iodine solution required for titration of the\nsample, cm3,\nB\n= volume of iodine solution required for titration of the\nblank, cm3,\nN\n= normality of the iodine solution, and\nC\n= grams of sample used.\n\n## 30. Sulfur, Acetone Extract",
    "## 30. Sulfur, Acetone Extract\n\n30.1 *Scope—*This test method covers the determination of the amount of sulfur in the acetone extract. It is applicable to NR, SBR, BR, IR, and CR products and to IIR products if the extraction is made with methyl ethyl ketone instead of acetone.\n\nThe analysis shall be performed on an acetone extract prepared as described in Section 19.",
    "The analysis shall be performed on an acetone extract prepared as described in Section 19.\n\n30.2 Reagents: 30.2.1 Bromine. 30.2.2 Nitric Acid, Fuming. 30.2.3 *Zinc-Nitric Acid Solution—*Add 200 g of zinc oxide\n(ZnO) to 1 dm3 of HNO3 slowly and with caution. Use protection for the face and hands.",
    "30.3 *Procedure—*Add to the flask containing the acetone extract, 10 cm3 of Zn-HNO3 solution and 2 to 3 cm3 of bromine and cover with a watch glass. Allow to stand near a steam plate for 30 min; then heat on the steam plate to a foamy syrup. Add\n10 cm3 of fuming HNO3 and heat on the hot plate, with the cover removed, until all bromine is expelled. Continue the determination as described in X1.3.3 - X1.3.5.\n\n## 31. Sulfur In Rubber Products By Oxygen Flask Combustion",
    "## 31. Sulfur In Rubber Products By Oxygen Flask Combustion\n\n31.1 Scope: 31.1.1 This test method covers the determination of all the sulfur except that contained in barium sulfate, in a sample of a rubber product. The test method is applicable to NR, CR, SBR, BR, IR, IIR, EPDM, and NBR products.\n\n31.1.2 This test method gives unreliable (usually low)\nresults in the presence of lead compounds. Antimony and barium salts interfere.",
    "31.2 *Summary of Test Method—*The sample, wrapped in filter paper, is burned in an oxygen combustion flask; the carbon and hydrogen of the organic matter are oxidized, and the sulfur is converted to sulfate ions by combustion and adsorption in hydrogen peroxide. The sulfate is titrated with barium perchlorate using a Thorin indicator solution after the removal of interfering cations, if any, with an ion exchange resin.",
    "31.3 Apparatus:\n31.3.1 *Oxygen Combustion Flask (Schöniger Flask)—*A\nchemical-resistant,9 thick-walled oxygen combustion flask,7,10\n1000 cm3 with 35/35 ball joint stopper, platinum sample carrier, and pinch clamp.\n\n31.3.2 *Infrared Safety Igniter,*7,11with cabinet and infrared light (an electrical igniter is also satisfactory).\n\n31.3.3 *Microburet,* 5 or 10-cm3 capacity, with graduations of 0.01 cm3.",
    "31.3.3 *Microburet,* 5 or 10-cm3 capacity, with graduations of 0.01 cm3.\n\n31.3.4 *Magnetic Stirring Bar,* covered with chemicalresistant coating,12 approximately 25 mm (1 in.) long, without spinning ring around the center.\n\n31.3.5 Magnetic Stirrer.\n\n31.3.6 *High-Intensity Lamp,*7,13adjustable. (Helpful but not absolutely necessary.)\n31.3.7 *Filter Paper,* 30 by 30-mm, with 35-mm extension, black7,14 for infrared, or white7,15 for electrical ignition.",
    "31.3.8 *Chromatographic Column,* small, drying tube, or other device that will serve as an ion exchange column for 5 g of resin.\n\n31.3.9 *Beaker,* 250-cm3 capacity.\n\n31.4 Reagents: 31.4.1 *Barium Perchlorate (0.01 M)—*Dissolve 3.363 g of barium perchlorate (Ba(ClO4)2) in water, dilute to 1 dm3.",
    "Standardize the barium perchlorate by weighing about\n0.1000 g of anhydrous sodium sulfate (Na2SO4) to 60.0001 g, dissolving in 10 cm3 of water, making to exactly 100 cm3 in a volumetric flask and mixing thoroughly, transferring exactly 10 cm",
    "3 of this to a small beaker and proceeding according to committee at this time is Tensor Corp., 333 Stanley Ave., Brooklyn, NY. the committee at this time is A. H. Thomas Co., Philadelphia, PA. the committee at this time is A. H. Thomas Co., Philadelphia, PA.",
    "31.7.11 to 31.7.14. Molarity = (0.1 × A × 1000) ⁄(142.06 × B), where A = grams of Na2SO4 weighed, and B = cubic centimetres of Ba(ClO4)2 required for the titration. Restandardize often enough to detect changes of 0.0005 M.",
    "31.4.2 *Cation Exchange Resin,* strongly acidic, in the acid form.7,16\nNOTE 7—The resin is regenerated to the acid form by passing 10 cm3of",
    "NOTE 7—The resin is regenerated to the acid form by passing 10 cm3of\n2 M HCl through the 5-g resin bed at a rate of about 2 to 3 drops per second, then rinsing the bed with 20 cm3 of water at a faster rate. (Because of the resin's large capacity, it can be used 5 to 10 times between regenerations.) Test the last washings with Thorin solution for absence of sulfate. The dry resin, before use, should be swelled in water, in a beaker, to allow for expansion.",
    "31.4.3 *Chlorophosphonazo III—*Indicator solution (3,6-\nbis(p-chloro-o-phosphonophenylazo)-4,5-dihydroxy-2,7 naphthalene disulfonic acid), 0.5 mg/cm3 of distilled water.\n\n31.4.4 *Hydrochloric Acid (2 M)—*Prepare a 2 M solution of hydrochloric acid (HCl).\n\n31.4.5 *Hydrogen Peroxide (1 %)—*Dilute 1 volume of hydrogen peroxide (H2O2), 30 % to 30 volumes with water.",
    "(**Warning—**Thirty percent hydrogen peroxide is very corrosive; wear rubber or plastic gloves and goggles when handling it.)\n31.4.6 *Isopropanol.* 7,17\n31.4.7 *Oxygen,* in compressed gas cylinder.\n\n31.4.8 *Thorin Indicator Solution* (O-2-hydroxy-3,6-disulfo-\n1-naphthylazobenzenearsonic acid, 0.2 %).7,18\n31.5 Sample Preparation and Handling: 31.5.1 The rubber sample must be milled finely on a laboratory roll mill before weighing.",
    "31.5.2 Due to the small sample size, the rubber and filter paper should be protected from contamination, and all operations prior to combustion should be carried out with plastic gloves.",
    "31.6 Safety Precautions: 31.6.1 The following safety precautions must be observed in the combustion of rubber samples:\n31.6.1.1 The flask must contain no residues of organic solvents or vapors, that could cause an explosion; any such solvents used for cleaning the flask should be repeatedly rinsed out with water.",
    "31.6.1.2 The pressure generated by the rapid combustion could cause the flask to explode. Hence, combustion must take place in the safety chamber with the door locked or behind a safety shield or hood shield (preferably in a safety chamber which is itself behind a shield); in any case, the hands and face must be withdrawn behind a screen before the flame reaches the sample itself. Goggles, or a face shield, must be worn during this process.",
    "16 The sole source of supply of the resin (Dowex 50WX8) known to the committee at this time is Dow Chemical Co., Midland, MI.\n\n17 The sole source of supply of isopropanol (catalog No. 27640) known to the committee at this time is ICN K & K Labs, 121 Express St., Plainview, NY 11803.\n\n18 The sole source of supply of the solution known to the committee at this time is Hach Chemical Co., Ames, IA.",
    "31.6.1.3 The flask should be left in the safety chamber until the last spark is extinguished. At this point it is removed; but since a slight vacuum is formed, continue wearing goggles or face shield.\n\n31.7 Procedure:\n31.7.1 Place 10 cm3 of hydrogen peroxide absorbing solution (1 %) and the stirring bar in the empty oxygen combustion flask.",
    "31.7.2 Allow the filter paper to equilibrate to the humidity level at the balance area for 5 min, then fold the filter paper twice to form a U-shaped sample boat according to Fig. 1, A\nand B of Test Method E443.\n\n31.7.3 *Sample—*The sample mass should be 40 to 80 mg for a sulfur range of 1.2 to 1.9 %, but in any case should not exceed 0.1 mmol of sulfur:\n31.7.3.1 Place the rubber sample in the boat and weigh both to the nearest 0.1 mg.",
    "31.7.4 Fold the paper in accordance with 8.2.4 and 8.2.5 of Test Method E443, place the folded paper firmly in the platinum sample carrier hung on the hook of the stopper with the pointed end of the paper projecting outward.\n\n31.7.5 Insert a tube from the oxygen cylinder to nearly the bottom of the flask as in Fig. 2, A, of Test Method E443 and blow in oxygen strongly for at least 0.5 min.",
    "31.7.6 Smoothly remove the oxygen tube and close the stopper without letting the platinum carrier drop into the liquid.\n\n31.7.7 With the stopper upright, clamp the stopper tightly with the pinch clamp.\n\n31.7.8 Place the flask in the infrared igniter chamber with the pointed end of the paper in line with the infrared beam and approximately perpendicular to it. Close the door and turn on the infrared light (or electric igniter) until the paper ignites.",
    "31.7.9 After ignition, stir the sealed flask vigorously on a magnetic stirrer for 1 h. Alternatively, it may be allowed to stand undisturbed for 2 h.\n\n31.7.10 Remove the pinch clamp, tilt the stopper to release the vacuum, and open the flask.\n\n31.7.11 If substantial amounts of compounds of zinc or other cations are thought or known to be present in the compound, prepare an ion exchange column and pass the solution through it.",
    "31.7.11.1 Place a wad of glass wool about 13 mm (0.5 in.)\nin diameter in the bottom of the ion exchange column, which is suspended upright by a clamp, and pour 5 g of ion exchange resin in the acid form into the tube. Place a 250-cm3 beaker under the outlet of the tube.",
    "31.7.11.2 Pour the contents of the flask into the ion exchange column, allowing it to trickle through at the rate of 2 to 3 drops per second into the beaker (mild pressure or vacuum being applied if necessary to achieve this rate).\n\n31.7.11.3 If cations are not present, pour the contents of the flask into a 250-cm3 beaker, wash the flask, stopper hook and platinum carrier three times with 5 cm3 of water, pouring the washings into the beaker, and proceed to 31.7.13.",
    "31.7.12 Wash the sides of the flask, stopper hook and platinum carrier three times with 5 cm3 of water from a wash bottle, pouring the washings through the ion exchange column",
    "| Sample                   | Mean            |\n|--------------------------|-----------------|\n| Within                   |                 |\n| Laboratories             |                 |\n| Among                    |                 |\n| Laboratories             |                 |\n| S                        | CV              |\n| 1                        | 0.93            |\n| 2                        | 23.39           |\n| 3                        | 45.22           |",
    "| 2                        | 23.39           |\n| 3                        | 45.22           |\n| Repeatability            | Reproducibility |\n| Standard deviation (S)   | 0.5568          |\n| A                        |                 |\n| 1.8834                   |                 |\n| A                        |                 |\n| Coefficient of variation |                 |\n| (CV)                     |                 |\n| 0.0359                   | 0.1091          |",
    "| (CV)                     |                 |\n| 0.0359                   | 0.1091          |\n| Least significant        |                 |\n| difference (LSD)         |                 |\n| 10.2                     | 30.8            |\n| B                        |                 |",
    "A LSD is based on 95 % confidence limits.\n\nB An average value, the Standard deviation varies with the test level. See table of values.\n\nto be collected in the beaker. Then force out the last of the liquid from the column by the application of mild vacuum or pressure.",
    "31.7.13 Add 100 cm3 of isopropanol (or sufficient to make the solution 80 % in isopropanol by volume), two drops of Thorin solution and the stirring bar to the beaker, place a high-intensity lamp (if desired) against the beaker and titrate with Ba(ClO4)2 dropwise from the buret until the yellow color changes to a pink color, which remains for at least 30 s.",
    "Alternatively, Chlorophosphonazo III (31.4.3) may be used as the indicator. Use 1 cm3 per analysis. Titrate from a lavenderpink to a green-blue end point. Use a high-intensity lamp if desired. Read the buret value to 0.01 cm3.\n\n31.7.14 Obtain a blank determination by carrying out the entire procedure without using a rubber sample.\n\n31.8 Calculations: 31.8.1 Calculate the total sulfur as follows:",
    "31.8 Calculations: 31.8.1 Calculate the total sulfur as follows:\n\nTotal sulfur, $\\%=[(A-B)M\\times3.21]/W$ (22)\nwhere:\nA\n= Ba(ClO4)2 solution required for titration of the\nsample, cm3,\nB\n= Ba(ClO4)2 solution required for titration of the blank,\ncm3,\nM\n= molarity of the Ba(ClO4)2 solution, and\nW\n= mass of sample used, g.\n\n## 31.9 *Precision:*19",
    "## 31.9 *Precision:*19\n\n31.9.1 These precision statements have been prepared in accordance with Practice D3040. Please refer to this practice for terminology and other testing and statistical concept explanations.\n\n31.9.2 The basic test precision is estimated from an interlaboratory study by four laboratories testing three materials on four days.\n\n31.9.3 A test result is a single determination. See Table 3.\n\n## 32. Sulfur, Fusion Test Method",
    "32.1 *Scope—*This test method covers the determination of total, combined plus inorganic, or inorganic sulfur in rubber compounds when acid-soluble barium salts, antimony sulfide, or inorganic lead compounds are present. All of the sulfur in the specimen, including that present in BaSO4, is determined by this test method. It must be used for determinations of total sulfur when BaSO4 is present. When this test method is used for determination of combined plus inorganic sulfur, it must also be",
    "When this test method is used for determination of combined plus inorganic sulfur, it must also be used for determination of inorganic sulfur (Section 33).",
    "Total sulfur shall be determined on an unextracted specimen;\ncombined plus inorganic sulfur on an extracted specimen. This test method is applicable to NR, SBR, BR, IR, and CR products, and to the determination of total sulfur on NBR products.\n\n32.2 Reagents:\n32.2.1 *Nitric Acid-Bromine Solution—*Add a considerable excess of bromine to HNO3 so that a layer of bromine is present in the reagent bottle. Shake thoroughly and allow to stand 24 h before using.\n\n32.2.2 *Sodium Carbonate* (Na2CO3).",
    "32.2.2 *Sodium Carbonate* (Na2CO3).\n\n32.2.3 *Sodium Carbonate Solution* (50 g/dm3).",
    "32.3 Procedure: 32.3.1 Place 0.5 g of soft rubber or 0.2 g of hard rubber in a low-form porcelain crucible of about 100-cm3 capacity. The specimen shall have been extracted with acetone (Section 19)",
    "or acetone-chloroform mixture (Section 21) if organic plus inorganic sulfur is to be determined. Add 15 cm3 of the HNO3–Br2 mixture, cover the crucible with a watch glass, and let it stand for 1 h in the cold. Heat for 1 h on the steam bath, remove the cover, rinse it with a little water, and evaporate to dryness.",
    "32.3.2 Add 3 cm3 of HNO3, cover, warm a short time on the steam bath, then allow to cool. Carefully add in small portions, by means of a glass spatula, 5 g of Na2CO3 (weighed to 0.5 g).",
    "Raise the watch glass only high enough to permit the introduction of the spatula. Allow the Na2CO3 to slide down the side of the crucible, as it must not be dropped directly into the acid. Rinse the watch glass with 2 or 3 cm3 of hot water and stir the mixture thoroughly with a glass rod. Digest for a few minutes. Spread the mixture halfway up the side of the crucible to facilitate drying, and dry on a steam bath. Fuse the mixture by heating over a sulfur-free flame.",
    "32.3.3 Place the crucible in an inclined position on a wire triangle and start the ignition over a low flame. The tendency for the organic matter to burn too briskly may be controlled by judicious use of the stirring rod with which the burning portion is scraped away from the rest. When part of the mass is burned white, work a fresh portion into it until all of the organic matter is destroyed. It is necessary to hold the edge of the crucible with tongs. Toward the last half of the operation the",
    "is necessary to hold the edge of the crucible with tongs. Toward the last half of the operation the flame should be increased. It is unnecessary to heat the crucible to redness. With care, a crucible can be used for at least 10 to 12 fusions.",
    "32.3.4 After a fusion, allow the crucible to cool. Place it in a 600-cm3 beaker, add sufficient water to cover the crucible\n(about 125 cm3 ), and digest on the steam bath or plate for at least 2 h.",
    "32.3.5 Filter the solution into a covered 400-cm3 beaker containing 5 cm3 of HCl and wash the residue thoroughly with hot Na2CO3 solution. A qualitative test for barium may be made on the residue, but no analysis for barium or correction because of its presence is necessary, unless a detailed ash analysis is desired. Acidify the filtrate to pH indicator paper with HCl and add 2 cm3 in excess. Precipitate barium sulfate\n(BaSO4) and complete the determination as described in X1.3.5.",
    "32.4 *Calculation—*Calculate the percentage of sulfur as follows:\n\nSulfur, % = [($A\\times0.1373$)/$B$] $\\times$ 100 (23)\nwhere:\nA\n= grams of BaSO4, and B\n= grams of specimen used.\n\n## 33. Sulfur, Inorganic, Antimony Absent",
    "33.1 *Scope—*This test method covers the determination of inorganic sulfur in rubber products when no antimony is present. The sample is ashed and sulfur determined in the ash by the fusion method (Section 32) if acid-soluble barium salts or lead are present, or by the zinc-nitric acid method (Appendix X1) in the absence of acid-soluble barium salts. The same method must be used for the inorganic sulfur determination as is used for the determination of combined plus inorganic sulfur.",
    "The use of Appendix X1 for the final step in the determination of inorganic sulfur does not determine the sulfur in BaSO4. It is the intent of this method to exclude BaSO4 sulfur as inorganic sulfur unless the presence of other components requires the use of Section 32, or unless total sulfur is to be determined. The method is applicable to NR, SBR, BR, IR, CR, NBR, IIR, and EPDM products.\n\n## 33.2 *Reagent—*Nitric Acid-Bromine Solution—See 32.2.1.",
    "## 33.2 *Reagent—*Nitric Acid-Bromine Solution—See 32.2.1.\n\n33.3 *Procedure—*Extract a 1.0-g specimen with acetone\n(Section 19) or with acetone-chloroform mixture (Section 21).",
    "Dry the sample, place in a porcelain crucible of about 100-cm3",
    "capacity, and distill off the rubber in a muffle furnace, using a maximum temperature of 450°C. A burner may be used for ashing, if the sample is not allowed to catch fire. A wire gauze under the crucible will aid in preventing combustion. The carbon need not be completely burned off in this ignition. If acid-soluble barium salts and lead are absent, add 3 cm3 of HNO3-Br2 mixture to the ash, cover with a watch glass, and heat for 1 h. Transfer the contents of the crucible, with washing, into a",
    "with a watch glass, and heat for 1 h. Transfer the contents of the crucible, with washing, into a 500-cm3 Erlenmeyer flask of chemically resistant material7,10 and evaporate to dryness. Proceed with the determination of sulfur as described in X1.3.3 - X1.3.5. In the presence of acid-soluble barium salts and lead, determine the sulfur by treating the ash in accordance with 32.3.2, 32.3.4, and 32.3.5.",
    "33.4 *Calculation—*Calculate the percentage of inorganic sulfur as follows:\nInorganic sulfur, % 5 @~A 30.1373!/B# 3100\n(24)\nwhere:\nA\n= grams of BaSO4, and B\n= grams of specimen used.\n\n## Fillers Analysis 34. Scope",
    "## Fillers Analysis 34. Scope\n\n34.1 The fillers in a rubber product are those inorganic materials other than free sulfur and carbon black that have been added to the product. The referee ash method (Section 35) may be used to determine the approximate amount of fillers if materials that will decompose at ashing temperature are absent\n(see 6.4). This test method is applicable to all rubbers and rubber products with certain exceptions given in the scope of the test methods.",
    "34.2 Items (18) to (28) in Section 15 list the inorganic compounding ingredients that can be determined by these methods. The form in which these are reported is not necessarily that in which they are present in the product. Exact interpretation of the results is often made difficult by the presence of large amounts of silica and other insoluble matter, and of iron and aluminum oxides; in this case clay or asbestine may be present but the amount can only be estimated. When an analysis of the",
    "case clay or asbestine may be present but the amount can only be estimated. When an analysis of the inorganic fillers is required, it shall be made in accordance with Sections 41 - 51.",
    "## 35. Fillers, Referee Ash Test Method\n\n35.1 Scope:\n35.1.1 This test method is intended for settling disagreements on fillers content by the ashing method. It is also useful for ashing rubber products for determination of inorganic sulfur in the absence of antimony (Section 33) or for ash analysis (Section 41).",
    "35.1.2 This test method is not accurate for rubbers containing halogens when zinc compounds or other metal compounds that form volatile halides are present and shall not be used if an analysis of these metals in the ash is required.",
    "35.1.3 This test method may be used for preparing samples for ash analysis on rubber products not containing halogens or antimony sulfide. However, if the sample contains carbonates that decompose at 550°C or clays or silicates that will lose water at this temperature, the ash content value will not be highly precise and will not represent the original amount of inorganic fillers present in the sample.",
    "35.2 *Summary of Test Method—*A specimen is placed in a crucible and ashed in a muffle furnace at 550 6 25°C. The mass of residue in the crucible represents the ash content.\n\n35.3 Apparatus:\n35.3.1 *Crucible,* porcelain or silica, approximately 50-cm3\ncapacity.\n\n35.3.2 *Electric Muffle Furnace,* with controls necessary to hold the temperature at 550 6 25°C.\n\n35.3.3 Calibrated Thermocouple and Temperature Readout Device.",
    "35.3.3 Calibrated Thermocouple and Temperature Readout Device.\n\n35.4 Procedure:\n35.4.1 Weigh a 1-g specimen of the sample into an ignited, weighed crucible.\n\n35.4.2 Adjust the temperature of the muffle furnace to 550\n6 25°C, place the crucible in the furnace, and close the door completely. When more than one crucible is to be placed in the furnace, the crucibles shall be placed on a tray and put into the",
    "Within\nLaboratories\nAmong\nLaboratories\nSample\nMean,\n%\nS\nCV\nS\nCV\n1\n3.79\n0.0456\n0.0133\n0.1506\n0.0431\n2\n3.65\n0.0673\n0.0191\n0.1211\n0.0332\n3\n3.88\n0.0906\n0.0226\n0.2592\n0.0668\n4\n48.78\n0.0457\n0.0009\n0.0797\n0.0016\n5\n49.60\n0.0924\n0.0019\n0.1963\n0.0040\n6\n33.77\n0.1488\n0.0044\n0.2809\n0.0083\nReproducibility\nRepeatability\nStandard deviation (S)\n0.0914\n0.2068\nCoefficient of variation (CV)\n0.0134\n0.0363\nLeast significant difference (LSD)\n0.258\n0.5849",
    "furnace at one time. The door must be closed immediately and not opened for 1 h. After 1 h, open the furnace door 3 to 5 cm and continue heating for 30 min or until all carbonaceous material is burned off.",
    "NOTE 8—If a referee ash determination is required, the temperature shall be determined by placing the calibrated thermocouple-sensing element at approximately the geometric center of the furnace cavity. The temperature shall be adjusted to be within the specific range. No more than two crucibles shall be placed in the oven and they shall be positioned directly below the thermocouple.\n\n35.4.3 Remove the crucible from the furnace, cool in a desiccator, and weigh.",
    "35.4.3 Remove the crucible from the furnace, cool in a desiccator, and weigh.\n\n35.5 *Calculations—*Calculate the percentage of ash as follows:\n\nAsh, % = [($A-B$)/C] $\\times$ 100 (25)\nwhere:\nA\n= grams of ash plus crucible, B\n= grams of crucible, and C\n= grams of specimen.\n\n35.6 *Precision:*20\n35.6.1 These precision statements have been prepared in accordance with Practice D3040. Please refer to this practice for terminology and other testing and statistical concept explanations.",
    "35.6.2 The laboratory quality control precision of this test method was determined from an interlaboratory study of six different samples by five laboratories on two days.\n\n35.6.3 A test result is a single determination. 35.6.4 The least significant difference is expressed in absolute terms as percentage points and is based on 95 % confidence limits. See Table 4.\n\n## 36. Fillers, Alternative Dry Ash Test Method",
    "## 36. Fillers, Alternative Dry Ash Test Method\n\n36.1 *Scope—*This test method is intended for use when a muffle furnace is not available for ashing a rubber product sample. It is not considered to be as accurate or precise as the muffle furnace method (Section 35) for fillers content because of lack of temperature control. It may be used, subject to the limitations stated in 35.1, for obtaining an ash for analysis.",
    "36.2 *Summary of Test Method—*A weighed sample is ashed in a weighed crucible with a gas burner, slowly to char it, and finally with sufficient heat to burn off all carbonaceous matter. The residue in the crucible represents the ash content.\n\n36.3 Apparatus:\n36.3.1 *Crucible,* porcelain or silica, 30-cm3 nominal capacity.",
    "36.3.2 Clay Triangle. 36.4 *Procedure—*Weigh a 1-g specimen into an ignited weighed crucible. Place the crucible in a clay triangle and heat with a small flame until volatile pyrolysis products have been driven off and the specimen is well charred. Increase the flame gradually to burn off carbonaceous material. The specimen must not be allowed to catch fire at any time. Specimens that catch fire must be discarded. Heat until all carbonaceous material is burned off. Cool the crucible in a",
    "fire must be discarded. Heat until all carbonaceous material is burned off. Cool the crucible in a desiccator and weigh.",
    "36.5 *Calculations—*Calculate the percentage of ash as follows:\n\nAsh, $\\%=[(A-B)/C]\\times100$ (26)\nwhere:\nA\n= grams of crucible plus ash, B\n= grams of crucible, and C\n= grams of specimen.\n\n## 37. Ash Determination By Sulfation",
    "## 37. Ash Determination By Sulfation\n\n37.1 Scope:\n37.1.1 This test method is suitable for the approximate determination of ash content of vulcanized or unvulcanized rubber products containing halogens in the rubber. The ash obtained will rarely have the same composition as an ash obtained by dry thermal ashing and will not often represent the filler content. Therefore, if a rubber is ashed by this method the report must include the statement that the ash was determined by this test method.",
    "37.1.2 This test method is the only test method permissible for preparing an ash of halogen containing rubbers if zinc or other metal compounds having volatile halides are to be determined in the ash.",
    "37.2 *Summary of Test Method—*A weighed specimen is heated in a weighed crucible in the presence of sulfuric acid. Heating with a small flame is continued until charring is complete and sulfuric acid has been driven off. Carbonaceous material is then burned off with a strong flame or in a muffle furnace.\n\n37.3 Apparatus:\n37.3.1 *Crucibles,* porcelain or silica, 30-cm3 nominal capacity.",
    "37.3 Apparatus:\n37.3.1 *Crucibles,* porcelain or silica, 30-cm3 nominal capacity.\n\n37.3.2 Clay Triangle. 37.3.3 *Electric Muffle Furnace,* with thermocouple and thermostat for control of temperature.\n\n37.4 Procedure:\n37.4.1 Weigh a 1-g specimen of the rubber, cut in small pieces, into an ignited, weighed crucible. Add 5 cm3 of H2SO4\nto the crucible so that all pieces of the specimen are wetted.",
    "37.4.2 Place the crucible in a clay triangle and heat with a small flame, cautiously. If excessive swelling or frothing occurs, remove the flame until reaction subsides and then continue heating. Continue heating at an increased rate until all sulfuric acid has been driven off, but the heating rate must be adjusted so that there is no splattering or loss of material from the crucible.",
    "37.4.3 Burn off the carbonaceous material by heating in a muffle furnace at 950 to 980°C for approximately 1 h. If an ash content is not required, the burning off of carbonaceous material may be accomplished with a flame or at a lower temperature in the muffle furnace.\n\n37.4.4 Cool the crucible in a desiccator and weigh. 37.5 *Calculations—*Calculate the percentage of ash as follows:",
    "Ash, % = [($A-B$)/C] $\\times$ 100 (27)\nwhere:\nA\n= grams of crucible plus ash, B\n= grams of crucible, and C\n= grams of specimen.\n\n## 38. Carbon Black, Method A, Nitric Acid Digestion Test Method\n\n38.1 Scope: 38.1.1 This test method covers the determination of carbon black by a nitric acid digestion method. It is applicable only to the \"R\" family of rubbers containing an unsaturated carbon chain.",
    "38.1.2 Application to any other rubber type may be possible if the rubber is degraded to fragments soluble in water, acetone, or chloroform. This test method shall be used on such other rubbers only if adequate testing of known compounds has demonstrated the usefulness of this test method.",
    "38.2 *Summary of Test Method—*The extracted sample is digested with hot concentrated nitric acid to oxidize the rubber to soluble fragments. The carbon and the acid insoluble fillers are filtered off, washed, dried, and weighed. The carbon is burned off and the loss of mass represents the black.",
    "38.3 Reagents:\n38.3.1 *Acetone—*See 19.3.\n38.3.2 *Chloroform—*See 20.3.\n38.3.3 *Sodium Chromate Solution* (100 g Na2CrO4/dm3).\n38.3.4 *Sodium Hydroxide Solution* (175 g NaOH/dm3).\n38.3.5 *Sodium Hydroxide Solution* (300 g NaOH/dm3).\n38.4 Procedure: 38.4.1 Extract a 0.5-g specimen with acetone–chloroform mixture in accordance with 21.4 if the sample is vulcanized or with acetone alone (19.4) if it is unvulcanized.",
    "38.4.2 Transfer the specimen to a 250-cm3 beaker and heat on the steam bath until it no longer smells of chloroform. Add a few cubic centimetres of HNO3 and allow to stand for about",
    "10 min. Add 50 cm3 more of HNO3, taking care to wash down the sides of the beaker, and heat on the steam bath for at least 1 h. At the end of this time there should be no more bubbles or foam on the surface. Pour the liquid, while hot, into a Gooch crucible, taking care to keep as much as possible of the insoluble material in the beaker. Filter slowly with gentle suction and wash well by decantation with hot HNO3.",
    "(**Warning—**Empty the filter flask at this point.) Wash with acetone and a mixture of equal parts of acetone and chloroform until the filtrate is colorless. Digest the insoluble material, which has been carefully retained in the beaker, for 10 min on the steam bath with 35 cm3 of NaOH solution (300 g/dm3).",
    "This treatment with alkali may be omitted if silicates are absent. Dilute to 60 cm3 with hot water and heat on the steam bath. Filter the solution of alkali and wash well with hot NaOH",
    "solution (175 g/dm3). (**Warning—**The filtration may be materially aided, particularly with some synthetic rubber products, by partial or complete neutralization of the HNO4 solution with NH4OH. Partial neutralization together with the addition of trivalent cations or anions may also aid agglomeration of the carbon black particles if they are too well dispersed to filter.)",
    "38.4.3 Next, wash the residue into the Gooch crucible with about four portions of hot HCl, using a rubber \"policeman,\" if necessary. Final transfer may be made with the warm HCl\n(1 + 7), if necessary. Neutralize the last washing with NH4OH\nand test for the presence of lead with Na2CrO4 solution.",
    "Neutralize the last washing with NH4OH and test for the presence of lead with Na2CrO4 solution. If lead is present, continue to wash with hot HCl and finally, wash with warm HCl (1 + 7). Remove the crucible from the funnel, taking care that the outside is perfectly clean, dry it in an air bath for 11⁄2\nh at 110°C, cool, and weigh; this is mass a. Burn off the carbon at a dull red heat (550 to 600°C) and reweigh; this is mass b.",
    "The difference in mass represents approximately 105 % of the carbon originally present in the form of carbon black.\n\n38.5 *Calculation—*Calculate the percentage of carbon black as follows:\nCarbon black, % 5 @~a 2 b!/~1.05 3c!# 3100\n(28)\nwhere:\nc\n= grams of specimen used.\n\n## 39. Carbon Black, Method B, Pyrolysis Test Method",
    "39.1 *Scope—*This test method covers the determination of carbon black in a rubber product, vulcanized or unvulcanized, by a pyrolysis method. The method is applicable to all \"R\" and \"M\" family rubbers except those containing halogens or nitrogen in the rubber polymer, or lead salts or phenolic resins as added components. Application to other rubbers may be possible if no carbonaceous residue is formed under the pyrolysis conditions. The method shall be used on such other polymers only if",
    "is formed under the pyrolysis conditions. The method shall be used on such other polymers only if adequate testing of known compounds has demonstrated the usefulness of the test method.",
    "39.2 *Summary of Test Method—*A weighed specimen of the rubber is extracted, placed in a combustion boat, and pyrolyzed at 800 to 900°C in a stream of nitrogen. The combustion boat containing the nonvolatile residue is cooled and weighed. The carbon black is then burned off in an air atmosphere and the boat and contents are weighed again. The loss in mass represents carbon black.",
    "39.3 Reagents:\n39.3.1 *Nitrogen,* dry and free from oxygen.\n39.3.2 Acetone. 39.3.3 Chloroform. 39.4 Apparatus: 39.4.1 *Combustion Boat,* silica. 39.4.2 *Electrically Heated Tube Furnace,* capable of being heated to 800 to 900°C. A means of advancing and withdrawing the combustion boat without allowing oxygen to enter the tube.\n\n39.4.3 *Flowmeter,* calibrated at 100 and 200 cm3 of nitrogen/min.\n\n39.4.4 *Muffle Furnace* that can be maintained at 800 to\n900°C.",
    "39.4.4 *Muffle Furnace* that can be maintained at 800 to\n900°C.\n\n39.4.5 *Extraction Apparatus—*See 19.2.",
    "39.4.5 *Extraction Apparatus—*See 19.2.\n\n39.5 Procedure: 39.5.1 Weigh about 0.2 g of the sample to the nearest 0.1\nmg. Wrap it in filter paper and extract in accordance with 19.4\nfor 4 h with acetone. If bitumens or other materials insoluble in acetone are present, extract 4 h with chloroform (20.4) except that unvulcanized rubbers shall not be extracted with chloroform (Note 9). Dry the extracted rubber in air or in an oven at\n70°C.",
    "NOTE 9—Unvulcanized carbon black masterbatches containing no added oils or plasticizers need not be extracted.\n\nNOTE 10—Unvulcanized rubber compounds must be removed from the filter paper and placed in the combustion boat before drying.\n\n39.5.2 Place the dried specimen in a silica boat and then place the boat in the cool entrance of the combustion tube. Close the entrance with the entry fitting. Connect the supply of oxygen-free nitrogen through a flow-meter to the entry fitting.",
    "Pass nitrogen through the system at about 200 cm3/min for 5\nmin. Then reduce the flow to 100 cm3/min and move the boat slowly into the hottest zone of the furnace over a period of 5 min. Leave the boat in the hot zone for 5 min more. At the end of this period withdraw the boat to the cool end of the tube (or push it to the cool exit end) and allow it to cool for 10 min, maintaining the flow of nitrogen. Remove the boat from the tube and cool it in a desiccator. Weigh to the nearest 0.1 mg.",
    "39.5.3 Place the boat in a muffle furnace (or in a tube furnace with an air supply) at 800 to 900°C until all traces of carbon are burned off. Cool in a desiccator and weigh to the nearest 0.1 mg.\n\nNOTE 11—The pyrolysis should be carried out in a fume hood. If this is not possible, lead the vapors from the exit end of the tube into an exhaust hood or into a condensing trap. Xylene or other hydrocarbon solvents may also be used to trap the pyrolysis products.",
    "39.6 *Calculation—*Calculate the carbon black content of the specimen as follows:\n\nCarbon black, $\\%=[(A-B)/C]\\times100$ (29)\nwhere:\nA\n= grams of combustion boat and residue after pyrolysis\nin nitrogen,\nB\n= grams of combustion boat and residue after ignition in\nair, and\nC\n= grams of specimen.\n\n## 40. Nitrogen Calculated As Glue",
    "40.1 *Scope—*This test method is intended for use in the determination of glue when it is used as a filler in rubber products other than NBR products. This test method may also be used to determine nitrogen from NBR polymer present in a product (see 55.1). The calculations in this section are designed for determination of glue in NR products. In the absence of other nitrogenous material the method may be applied to synthetic rubber products without correction for the nitrogen content of the",
    "may be applied to synthetic rubber products without correction for the nitrogen content of the rubber polymer. A slight error will result from nitrogen content of antioxidants and accelerators present after extraction. When glue is found to be present in a NR product",
    "(see 10.1.6) and determined by this method by calculation from nitrogen content, a correction shall be made for the natural protein in NR as shown in the calculations (see 40.4.2). The correction shall be made by the method of approximation. The rubber as compounded (see 13.1) is calculated on the basis of the total nitrogen as glue. The glue content is then corrected on the assumption that the rubber as compounded contains 0.4 % protein nitrogen and this value is used to calculate a more exact",
    "as compounded contains 0.4 % protein nitrogen and this value is used to calculate a more exact figure for rubber hydrocarbon.",
    "40.2 Reagents:\n40.2.1 *Copper Sulfate* (CuSO4).\n\n40.2.2 Paraffın.\n\n40.2.3 *Sodium Hydroxide Solution* (750 g NaOH/dm3).\n\n40.2.4 *Sodium Hydroxide, Standard Solution* (0.1 N)—\nPrepare and standardize a 0.1 N NaOH solution.\n\n40.2.5 *Sodium Sulfate* (Na2SO4).\n\n40.2.6 *Sulfuric Acid, Standard Solution* (0.1 N)—Prepare and standardize a 0.1 N sulfuric acid (H2SO4) solution.\n\n40.2.7 Zinc, Granulated.",
    "40.3 *Procedure—*Extract a 2-g specimen with acetone (Section 19) for 8 h. Remove the solvent from the specimen, and transfer the specimen from the filter paper to a 750-cm3",
    "Kjeldahl flask. Add 25 to 30 cm3 of H2SO4, 10 to 12 g of Na2SO4, and about 1 g of CuSO4. Heat gently until the first vigorous frothing ceases; then raise the heat gradually until the liquid boils. Continue the boiling until the solution becomes clear. Allow the flask to cool, dilute carefully with 150 cm3 of water, and again allow to cool. Add 100 cm3 of NaOH solution",
    "(750 g/dm3), pouring it carefully down the side of the flask so that it does not mix immediately with the acid solution. Add about 1 g of granulated zinc to prevent bumping and a piece of paraffin the size of a pea to diminish frothing. Connect the flask quickly with a condenser, the delivery tube of which dips into a 500-cm3 Erlenmeyer flask, containing 50 cm3 of 0.1 N H2SO4",
    "diluted to about 100 cm3. Carefully swirl the flask to mix the contents and start to heat gently, increase the flame as the danger of foaming-over diminishes, and finally boil briskly until about one half of the liquid has passed over into the receiver. Add methyl red solution and titrate the excess acid by means of 0.1 N NaOH solution.",
    "## 40.4 Calculations: 40.4.1 Calculate The Percentage Of Total Nitrogen As Glue, As Follows:\n\n$$\\begin{array}{ll}\\mbox{Total nitrogen as glue,\\%}&\\mbox{(30)}\\\\ =\\left[(AN-BN)\\times0.014\\times6.5\\right]/C\\times100\\end{array}$$\n\nwhere:\n\n$A$ = volume of H${}_{2}$SO${}_{4}$ used, cm${}^{3}$,\n\n$N$ = normality of the H${}_{2}$SO${}_{4}$,\n\n$B$ = volume of NaOH solution required for titration of the\n\nH${}_{2}$SO${}_{4}$, cm${}^{3}$,\n\n$N^{\\prime}$ = normality of the NaOH solution, and",
    "H${}_{2}$SO${}_{4}$, cm${}^{3}$,\n\n$N^{\\prime}$ = normality of the NaOH solution, and\n\n$C$ = grams of specimen used.\n\n40.4.2 Substitute total nitrogen as glue in the formula for calculating rubber polymer (see 13.1). Calculate the percentage of rubber as compounded from this value (see 13.1). Calculate corrected glue content as follows:\n\nGlue, corrected, % = $A$ - ($B\\times0.004\\times6.5$) (31)\n\nwhere:\n\n$A$ = percentage of total nitrogen as glue, and\n\n$B$ = percentage of rubber as compounded.",
    "where:\n\n$A$ = percentage of total nitrogen as glue, and\n\n$B$ = percentage of rubber as compounded.\n\nUse glue, corrected for accurate calculations of rubber polymer.\n\n## Analysis Of Ash 41. General Test Method",
    "## Analysis Of Ash 41. General Test Method\n\n41.1 Analyze one specimen of ash, prepared in accordance with Section 35 or 36 for silicon dioxide (SiO2) and insoluble matter, lead, iron oxide plus aluminum oxide (Fe2O3 + Al2O3), calcium oxide (CaO), and magnesium oxide (MgO) as described in Sections 42 - 46. Use 1-g specimens for soft rubber products and 2-g specimens for hard rubber products.",
    "41.2 Prepare and analyze specimens for zinc oxide (ZnO), total barium sulfate (BaSO4), barium carbonate (BaCO3), total antimony, and titanium dioxide (TiO2), in accordance with Sections 47 - 51.\n\n## 42. Silicon Dioxide And Insoluble Matter\n\n42.1 *Procedure—*Dissolve a specimen of ash in 10 cm3 of HCl, rinse the crucible thoroughly, dilute to 100 cm3, and evaporate to dryness in a casserole. Bake for 1 h at 110°C.",
    "Moisten with 10 cm3 of HCl and 3 drops of HNO3, and digest for 15 min on the steam bath. Add 100 cm3 of water, boil, filter, and wash with hot water. Dry and ignite the precipitate in a porcelain crucible. Save the filtrate for determination of lead oxide (Section 43). Weigh to determine the SiO2 and insoluble matter. If the residue is large enough to justify an analysis of SiO2, transfer to a platinum crucible and add 2 to 3 cm3 of HF",
    "and a few drops of H2SO4. Evaporate to dryness, and carefully ignite at a low red heat. The loss in mass is SiO2.",
    "42.2 Calculation:\n42.2.1 Calculate the percentages of SiO2, and of SiO2 and insoluble matter as follows:\n\n$${\\rm SiO}_{2}\\quad{\\rm and\\ insoluble\\ matter}\\,\\quad\\%\\ =\\ [(A-B)\\ /\\ C]\\times100\\tag{32}$$\n\n$${\\rm SiO}_{2}\\ \\%=(A-B)-(D-E)/C\\times100\\tag{33}$$\nwhere:\nA\n= mass of residue and porcelain crucible after ignition,",
    "B\n= mass of porcelain crucible,\nC\n= mass of original specimen, mass of residue and platinum crucible,\nD\n= mass of residue and platinum crucible after treatment\nwith HF and ignition, and\nE\n= mass of platinum crucible.",
    "with HF and ignition, and\nE\n= mass of platinum crucible.\n42.2.2 A large residue after the HF treatment may be barium sulfate (BaSO4), lead sulfate (PbSO4), titanium dioxide (TiO2), that may be identified by microscopic examination. If small amounts of Al2O3 and Fe2O3 are present in the residue, they may be dissolved by fusion with potassium pyrosulfate\n(K2S2O7), reprecipitated with NH4OH, and added to the R2O3",
    "(K2S2O7), reprecipitated with NH4OH, and added to the R2O3\nprecipitate (44.2), provided TiO2 is absent and an exact analysis for Al2O3, Fe2O3, or both is desired.",
    "## 43. Lead Oxide",
    "43.1 Reagents:\n43.1.1 *Ethanol* (95 %). 43.1.2 *Ethanol* (50 %).\n43.1.3 *Hydrogen Sulfide* (H2S).\n43.2 *Procedure—*A complete precipitation of the lead as lead sulfide (PbS) may be made if the concentration and acidity are carefully controlled. Neutralize the filtrate from the determination of SiO2 and insoluble matter with NH4OH, and add\n1 cm",
    "3 of HCl. Run a rapid stream of H2S into the solution and dilute to between 50 and 100 cm3. Continue the addition of H2S until precipitation is complete. Filter, and wash with a saturated solution of H2S. Save the filtrate for determination of iron and aluminum oxides in Section 44. If antimony is present, it will precipitate under these conditions; zinc may also be precipitated, but neither will interfere with the determination of lead. Dissolve the PbS in HNO3 (1 + 1); boil to complete",
    "will interfere with the determination of lead. Dissolve the PbS in HNO3 (1 + 1); boil to complete solution. If antimony is present it may not be dissolved by this procedure. Filter. Cool the filtrate, add 10 cm3 of H2SO4, and evaporate to dense white fumes of H2SO4. Cool, dilute with",
    "50 cm\n3 of water, add an equal volume of ethanol (95 percent), and let stand overnight. Filter through a tared Gooch crucible, wash with ethanol (50 %), and dry at 105°C.",
    "43.3 *Calculation—*Calculate the percentage of lead oxide as follows:\nLead oxide, % 5 ~A 2 B! 30.736/C 3100\n(34)\nwhere:\nA\n= mass of crucible and PbSO4, B\n= mass of crucible, C\n= mass of original specimen, and\n0.736\n= conversion factor from PbSO4 to PbO.\n\n## 44. Iron And Aluminum Oxides (R2O3)",
    "44.1 Reagents:\n44.1.1 *Ammonium Chloride* (NH4Cl), solid.\n44.1.2 *Ammonium Chloride Solution* (20 g NH4Cl/dm3).\n44.1.3 Methyl Red Indicator Solution.\n44.1.4 *Potassium Ferricyanide Indicator* (K3Fe(CN)6).\n44.1.5 *Potassium Pyrosulfate* (K2S2O7).",
    "44.1.4 *Potassium Ferricyanide Indicator* (K3Fe(CN)6).\n44.1.5 *Potassium Pyrosulfate* (K2S2O7).\n44.2 *Procedure—*Boil the filtrate from the lead sulfide precipitation (see 43.2) to expel H2S. Adjust the volume of solution to 100 to 150 cm3. Add a few drops of HNO3 and boil the solution again. Test for ferrous iron, using K3Fe(CN)6 as an outside indicator on a spot plate. If ferrous iron is present, add more HNO3 and proceed as before until all the iron is oxidized.",
    "Add 5 g of solid NH4Cl. Add NH4OH until the solution is colored definitely yellow by methyl red, but do not add an excess. Heat to boiling and boil for 5 min. When the precipitate has settled, filter, with the aid of filter pulp if the precipitate is large, and wash with NH4Cl solution. Save the filtrate for determination of calcium oxide in Section 45. Carefully char off the filter paper at a *low* temperature and ignite the residue in a freely oxidizing atmosphere.",
    "44.3 *Calculation—*Calculate the percentage of R2O3 as follows:\n\n$\\rm R_{2}O_{3}$, $\\%=[(A-B)/C]\\times100$ (35)\nwhere:\nA\n= mass of crucible and R2O3(Fe2O3 + Al2O3), B\n= mass of crucible, and C\n= mass of original specimen.\n\n44.4 Iron in the R2O3 residue may be determined, if desired, by fusing the residue with K2S2O7, dissolving the melt in H2SO4 (1 + 5) reducing the iron with amalgamated zinc, and titrating the iron with KMnO4 solution, 45.1.9.\n\n## 45. Calcium Oxide",
    "## 45. Calcium Oxide\n\n45.1 Reagents: 45.1.1 Ammonium Oxalate, Saturated Solution.\n\n45.1.2 *Ammonium Sulfate* ((NH4)2S).",
    "45.1.3 *Formic Acid Mixture—*Mix together 200 cm3 of formic acid (HCOOH, density 1.22), 770 cm3 of water, and\n30 cm\n3 of NH4OH. (**Warning—**Unopened bottles of formic acid may have sufficient pressure to cause an explosion as the top is removed. Protective clothing and shielding should be used when a bottle is first opened. Do not allow formic acid to come in contact with the skin.)",
    "45.1.4 *Formic Acid Wash Solution—*Dilute 30 cm3 of formic acid mixture (44.1.3) to 1 dm3 and saturate with H2S.",
    "45.1.5 *Hydrogen Sulfide* (H2S).\n\n45.1.6 Methyl Red Indicator Solution.\n\n45.1.7 *Oxalic Acid Solution* (100 g/dm3).\n\n45.1.8 *Oxalate Wash Solution,* containing 2 g of ammonium oxalate and 1 g of oxalic acid/dm3.",
    "45.1.9 *Potassium Permanganate, Standard Solution* (0.1\nN)—Dissolve approximately 3.2 g of potassium permanganate\n(KMnO4) in 1 dm3 of water. Age the solution at least 48 h and filter through a filter crucible (45.2.1). Standardize within 24 h of use, against the National Institute of Standards and Technology standard sample No. 40 of sodium oxalate in accordance with the instructions furnished with the standard sample.",
    "45.2 Apparatus: 45.2.1 *Filter Crucibles,* filter crucibles that will withstand the firing temperature required in the specific application.\n\n45.3 Procedure: 45.3.1 If acid-soluble barium salts were found to be absent\n(10.1.4), dilute the filtrate from the R2O3 determination to\n200 cm3, add methyl red indicator, and neutralize with H2SO4\n(1 + 36). Add 25 cm3 of formic acid mixture.",
    "45.3.2 If acid-soluble barium salts were found to be present, remove the barium as follows: Dilute the filtrate from the R2O3\ndetermination to 200 cm3, neutralize with HCl (1 + 1) and add",
    "determination to 200 cm3, neutralize with HCl (1 + 1) and add\n10 cm3 in excess. Heat to boiling. Add H2SO4 (1 + 36) to precipitate barium, but avoid a large excess. Digest until the precipitate settles, test for completeness of precipitation, and digest for at least 2 h or until the precipitate is filterable. Filter, wash, and discard the precipitate. Concentrate the filtrate to",
    "200 cm3, neutralize with NH4OH using methyl red indicator, neutralize with H2SO4 (1 + 36) and add 25 cm3 of formic acid mixture.",
    "45.3.3 Proceed at this point to remove zinc from the solutions from 45.3.1 or 45.3.2 by heating the solution to 60°C\nand saturating with H2S for 20 min. Digest for 1 h at 60°C, filter, and wash with formic acid wash solution. Test for complete removal of zinc with (NH4)2S in alkaline solution.",
    "Filter again if necessary. Make the filtrate just acid with HCl\n(1 + 1) and evaporate to 150 cm3. Filter to remove sulfur. Add methyl red indicator, heat to 50°C, neutralize with NH4OH, and add 1 cm3 in excess. Make the solution just acid with oxalic acid solution, add 12 cm3 in excess, and boil for 2 min, while stirring vigorously. Add approximately 50 cm3 of saturated ammonium oxalate solution, adding more if the solution is still acid to methyl red, dilute to 250 to 300 cm3, boil for",
    "2 min, and digest on a steam bath for 1 h. Allow to cool, filter, and wash with oxalate wash solution.",
    "45.3.4 Dissolve the precipitate in 50 cm3 of warm HCl\n(1 + 3) and reprecipitate by the above procedure, uniting filtrate and washings with the first filtrate and washings. Save all filtrates and washings for determination of magnesium oxide in Section 46. The quantities of oxalic acid and ammonium oxalate used in the reprecipitation may be one half or possibly only one fourth as large as in the first precipitation.",
    "45.3.5 If calcium oxide (CaO) is to be determined volumetrically, wash the precipitate of calcium oxalate\n(CaC2O4) finally with water, dissolve the precipitate from the paper in hot H2SO4 (1 + 5) and titrate hot with 0.1 N KMnO4, finally adding the filter paper to the mixture and finishing the titration rapidly. A sintered glass crucible of fine porosity may be advantageously substituted for the filter paper.",
    "45.3.6 If CaO is to be determined gravimetrically, dry and ignite the precipitate in a covered porcelain crucible, the ignition temperature being from 1000 to 1200°C.\n\n45.4 *Calculations—*Calculate the percentage of CaO as follows:\n45.4.1 Volumetric Method:\nCaO, % 5 @~A 3N 30.028!/C# 3100\n(36)",
    "where:\nA\n= volume of the KMnO4 solution required for titration of the specimen, cm3,\nN\n= normality of the KMnO4 solution,\nC\n= grams of original specimen, and\n0.028\n= grams of CaO equivalent to each cubic centimeter\nof 1.000 N KMnO4 solution.\n\n45.4.2 Gravimetric Method:\n\nCaO, % = [($A-D$)/$C$]\\times100$ (37)\nwhere:\nA\n= mass of precipitate plus crucible, D\n= mass of crucible, and C\n= mass of original specimen.\n\n## 46. Magnesium Oxide",
    "## 46. Magnesium Oxide\n\n46.1 Reagent:\n46.1.1 Ammonium Phosphate Solution (100 g/dm3)—\nDissolve 100 g of monohydrogen ammonium phosphate\n((NH4)2HPO4) in water and dilute to 1 dm3.\n\n46.2 Procedure: 46.2.1 Evaporate to dryness the combined filtrates and washings from the determination of calcium. Add 50 cm3 of HNO3, cover, and warm until the evolution of gas subsides.\n\nUncover and evaporate to dryness, avoiding spattering. Heat the residue on a hot plate for 2 to 3 h; overnight if convenient.",
    "Dissolve the residue in 100 cm3 of water, slightly acidify with HCl, and add 25 cm3 of (NH4)2HPO4 solution. Cool to 15°C\n(preferably in an ice bath), neutralize very slowly with NH4OH\nwhile stirring constantly, using methyl red as an indicator, and add 10 cm3 of NH4OH in excess. Let the solution stand overnight, filter without attempting to transfer the precipitate, and wash with NH4OH (1 + 14).",
    "46.2.2 Dissolve the precipitate in warm HCl (1 + 3), using the beaker from which the precipitate was filtered. Dilute to",
    "100 cm3, add 5 cm3 of (NH4)2HPO4 solution, neutralize very slowly with NH4OH while stirring constantly, and add 5 cm3 of NH4OH in excess. Let stand for at least 4 h; then filter through paper that is known not to be affected by ignition with alkaline phosphates. If paper is used, it must be burned off at very low temperatures to prevent fireproofing of the paper. Ignite to magnesium pyrophosphate (Mg3P2O7) at 1000 to 1200°C for\n60 min and weigh.",
    "46.3 *Calculation—*Calculate the percentage of magnesium oxide (MgO) as follows:\n\nMgO, % = ($A-B$) $\\times$ 0.3621/C $\\times$ 100 (38)\nwhere:\nA\n= mass of crucible and precipitate, B\n= mass of crucible, C\n= mass of original specimen, and\n0.3621\n= conversion factor for Mg2P2O7 to MgO.\n\n## 47. Zinc Oxide\n\n47.1 Scope: 47.1.1 This test method is applicable to rubber products.",
    "## 47. Zinc Oxide\n\n47.1 Scope: 47.1.1 This test method is applicable to rubber products.\n\nCalcium, magnesium, iron, titanium, aluminum, antimony, and silica do not interfere. Lead and cobalt interfere in the regular procedure. Lead interference can be prevented by use of the alternative procedure presented in 47.5.5.\n\n47.1.2 The total zinc content of the sample is determined and calculated as zinc oxide.",
    "47.1.2 The total zinc content of the sample is determined and calculated as zinc oxide.\n\n47.2 *Summary of Test Method—*The sample is ashed and the ash is dissolved in hydrochloric acid. Aluminum and fluoride are added to precipitate calcium and magnesium as the hexafluoro aluminates. Fluoride complexes iron, titanium, and excess aluminum. If large amounts of iron are present, it is further masked with 2,4-pentanedione. The pH is adjusted to 4.5 and zinc is titrated with EDTA.",
    "47.3 Apparatus:\n47.3.1 *Muffle Furnace,* capable of being heated to 550 6\n25°C.\n\n47.3.2 *Buret,* 10-cm3, graduated in 0.02-cm3 divisions.\n\n47.3.3 *Buret,* 50-cm3, graduated in 0.1-cm3 divisions:\n47.4 Reagents: 47.4.1 Acetone.\n\n47.4.2 *Aluminum Chloride Solution (0.1 M)—*Dissolve\n2.42 g of aluminum chloride hexahydrate (AlCl3·6H2O) in water and dilute to 100 cm3 with water.",
    "47.4.3 *Ammonium Fluoride Solution (3 M)—*Dissolve\n55.5 g of ammonium fluoride (NH4F) in water and dilute to\n500 cm3 with water. Store in a polyethylene or wax-coated bottle.\n\n47.4.4 *Buffer Solution—*Dissolve 60 g of acetic acid\n(HC2H3O2) and 77 g of ammonium acetate (NH4C2H3O2) in water and dilute to 1 dm3 with water.\n\n47.4.5 *Dithizone Indicator Solution—*Dissolve 0.01 g of dithizone in 10 cm3 of acetone. Prepare fresh every 48 h.",
    "47.4.6 *EDTA Solution (0.01 M)—*Dissolve 3.72 g of ethylene diamine tetraacetic acid, disodium salt, dihydrate, in water and dilute to 1 dm3.\n\n47.4.7 *Standardization—*With a pipet, transfer 25 cm3 of standard zinc chloride solution to a 250-cm3 conical flask. Add\n5 cm3 of HCl and proceed according to 47.5.4, beginning with the addition of AlCl3 solution. Use the 50-cm3 buret for titration.\n\n47.4.8 *Methyl Orange Solution* (1 g/dm3)—Dissolve 0.025 g of methyl orange in 25 cm3 of water.",
    "47.4.8 *Methyl Orange Solution* (1 g/dm3)—Dissolve 0.025 g of methyl orange in 25 cm3 of water.\n\n47.4.9 *2,4-Pentanedione Solution—*Dissolve 10 cm3 of 2,4-\npentanedione in 90 cm3 of acetone.\n\n47.4.10 *Zinc Chloride, Standard Solution—*Ignite zinc oxide in a porcelain crucible for 2 h at 550°C and cool in a desiccator. Dissolve about 1.0 g of the dried reagent, weighed to the nearest 0.001 g, in 50 cm3 of water and 20 cm3 of HCl.",
    "Transfer to a 1000-cm3 volumetric flask and dilute to the mark with water.\n\n47.4.11 *Magnesium Chloride Solution* (0.1 M)—Dissolve\n2.03 g of magnesium chloride hexahydrate (MgCl2·6H2O) in water and dilute to the 100 cm3 mark with water.",
    "47.5 Procedure: 47.5.1 Weigh approximately 1 g of sample to the nearest\n0.001 g in a 50-cm3 porcelain crucible. If the sample does not contain CR or other rubbers containing halogens, ash it in accordance with 35.4.2 or 36.4. If halogens are present, ash the sample in accordance with Section 37.",
    "47.5.2 Cool the crucible and wash the ash into a 250-cm3",
    "beaker with a stream of water. Add 5 cm3 of HCl to the crucible and warm it on a hot plate until the solution just begins to boil. Pour the washings into the beaker. Rinse the crucible once more with 5 cm3 of HCl and again add the washings to the beaker. Do not filter the solution. Then add 10 cm3 of HCl to the beaker. Break up any large cakes of ash with a glass stirring rod. Evaporate the solution to 10 cm3. If large amounts of precipitate are present some bumping and splattering may occur.",
    "to 10 cm3. If large amounts of precipitate are present some bumping and splattering may occur. This can be reduced by agitating the solution until boiling begins. Transfer the solution to a 100-cm3 volumetric flask and dilute to the mark with water.",
    "47.5.3 Select an aliquot from the following table and transfer it to a 250-cm3 conical flask, mixing the solution and suspended solids well before aliquoting. Proceed with 47.5.4 or\n47.5.5.\n\n| ZnO Expected, %   |\n|-------------------|\n| 3                 |\n| Buret Size, cm    |\n| 3                 |",
    "0 to 3\n25\n10\n3 to 8\n10\n10\n>8\n10\n50\n47.5.4 *Lead Absent—*Dilute the aliquot to 25 cm3 and add",
    "1 cm3 of concentrated HCl, 2 cm3 of AlCl3 solution, 5 cm3 of MgCl2 solution, 10 cm3 of NH4F solution, and 1 drop of methyl orange indicator solution. Add NH4OH until the indicator is pure yellow in color and add 0.5 cm3 more NH4OH. If the sample is known to be high in zinc or calcium, bring it to a boil, boil 30 s, and cool to room temperature. Add 10 cm3 of buffer solution, 60 cm3 of acetone and 5 drops of dithizone indicator solution. If the iron content is equal to or higher than that of",
    "and 5 drops of dithizone indicator solution. If the iron content is equal to or higher than that of zinc, add 5 cm3 of 2,4-pentandione solution. Titrate with EDTA solution to a yellow-green color, using the buret selected from the table in 47.5.3.",
    "47.5.5 *Lead Present—*Dilute the aliquot to 25 cm3. Add\n2 cm3 of AlCl3 solution, 10 cm3 of NH4F solution, and a drop of methyl orange indicator solution. Add NH4OH until the indicator turns orange-yellow, add 1.0 cm3 of HCl, and bring the solution to a boil. Cool the solution. Add NH4OH until the indicator turns yellow and proceed as in 47.5.4, cooling the solution in an ice bath before titration. Titrate the cold solution.\n\n47.6 Calculations: 47.6.1 Standardization:",
    "47.6 Calculations: 47.6.1 Standardization:\n\nC = W/(V $\\times$ 40)\n47.6.2 Analysis:\n\nZnO, % 5 ~V 3C 3100 3100!/~S 3A!\n(40)\n\nwhere:\nC\n= concentration of EDTA solution, g ZnO/cm3, W\n= grams of zinc oxide, V\n= volume of EDTA solution used in titration, cm3, S\n= grams of sample, and A\n= aliquot size, cm3.\n\n## 47.7 *Precision:* 21",
    "## 47.7 *Precision:* 21\n\n47.7.1 These precision data are based on tests of 6 samples by 7 laboratories on two days. The range of samples studied was from about 1 to 27 % ZnO. Precision is expressed in relative terms (2S %, D2S %).\n\n47.7.2 Repeatability (*Single-Operator*)—The repeatability has been estimated to be 63.0 % (2S %) of a determination.\n\nTwo test results should be considered acceptable if their difference does not exceed 4.2 % (D2S %) of their average value.",
    "47.7.3 Reproducibility (*Multilaboratory*)—The reproducibility has been estimated to be 64.4 % (2S %) of a determination. Two test results should be considered acceptable if their difference does not exceed 6.2 % (D2S %) of their average.\n\n## 48. Total Barium As Barium Sulfate",
    "48.1 Reagents:\n48.1.1 *Hydrogen Sulfide* (H2S).\n48.1.2 *Sodium Carbonate* (Na2CO3), solid.\n48.1.3 *Sodium Carbonate Solution* (50 g Na2CO3/dm3).\n48.1.4 *Sodium Nitrate* (NaNO3).\n48.2 *Procedure—*Analyze a specimen of ash (35.4.2 or\n36.4) that has been ashed in a 50-cm3 crucible, for total barium as follows: Fuse the specimen with 5 g of a mixture of equal parts of Na2CO3 and NaNO3. Stir well during the fusion. Cool the crucible, place it in a 400-cm3 beaker with about 125 cm3",
    "of water, and digest on the steam plate or steam bath overnight.",
    "Filter the solution and wash the residue well with hot Na2CO3",
    "solution. Wash this residue back into the original beaker with hot water, dissolve the residue in the beaker and any traces on the filter paper with HCl, and heat the solution on the steam bath. Filter and wash thoroughly with hot water. Adjust the acidity by means of NH4OH (2 + 3) and HCl (1 + 1) to provide an excess of 4 to 5 cm3 of the HCl (1 + 1) ⁄100 cm3 of water, and digest on the steam plate or steam bath overnight. Filter the solution and wash the residue well with hot Na2CO3 solution.",
    "Wash this residue back into the original beaker with hot water, dissolve the residue in the beaker and any traces on the filter paper with HCl, and heat the solution on the steam bath. Filter and wash thoroughly with hot water. Adjust the acidity by means of NH4OH (2 + 3) and HCl (1 + 1) to provide an excess of 4 to 5 cm3 of the HCl (1 + 1) ⁄100 cm3 of solution. Cool, saturate the solution with H2S, and, when the lead sulfide (PbS)",
    "has settled, filter into a 400-cm3 beaker. Wash thoroughly. The total volume of the solution shall not be over 200 cm3.",
    "Precipitate the barium with H2SO4 (1 + 16) and treat the precipitated BaSO4 in the usual manner as for sulfur determination. Barium sulfate determined above is assumed to have been added as such, and the value will usually be less than the amount of commercial BaSO4 originally compounded. If barium carbonate (BaCO3) is also present it shall be determined (Section 49) in order to correct the BaSO4 value.",
    "48.3 *Calculations—*Calculate the percentages of total barium as BaSO4 and of barium sulfate, corrected, as follows:\n\nTotal barium as BaSO4, % 5 66~A/B! 3100\n(41)\nBarium sulfate, corrected, % 5 A 2 C\n(42)\n\nwhere:\nA\n= grams of BaSO4,\nB\n= grams of specimen used, and\nC\n= percentage of BaCO3 calculated as BaSO4 (Section 49).\n\n## 49. Barium Carbonate",
    "## 49. Barium Carbonate\n\n49.1 *Scope—*If the presence of acid-soluble barium salts is indicated by the preliminary test (see 10.1.4) and if the presence of BaSO4 is also indicated by the presence of acid-insoluble ash that will give a test for barium upon fusion with Na2CO3 and treatment of the water-insoluble fusion residue with dilute H2SO4, barium salts other than BaSO4\n(usually BaCO3) must be determined.",
    "49.2 Reagents:\n49.2.1 *Ammonium Carbonate* ((NH4)2CO3). 49.2.2 *Carbon Dioxide* (CO2).\n49.2.3 *Hydrogen Sulfide* (H2S).",
    "49.3 *Procedure—*Place a 1-g specimen in a porcelain boat, and place this in a combustion tube purged with a current of CO2. Ash the sample in the tube. After ignition and cooling in the atmosphere of CO2, remove the boat, finely grind the residue in an agate mortar, transfer it to a 250-cm3 beaker, and treat with 5 to 10 g of (NH4)2CO3, 15 to 20 cm3 of NH4OH, and about 50 cm3 of water. Boil the mixture for 20 min, filter, and wash the precipitate thoroughly to remove all soluble sulfates. Wash",
    "for 20 min, filter, and wash the precipitate thoroughly to remove all soluble sulfates. Wash the residue on the filter paper back into the original beaker and add about 10 cm3 of glacial acetic acid with sufficient water to make the total volume about 100 cm3. Heat this to boiling and filter through the same paper as before. Pass H2S into the filtrate to precipitate the lead. Filter, wash, and discard the precipitate. Precipitate the barium with H2SO4",
    "(1 + 16) and determine in the usual manner.",
    "49.4 *Calculations—*Calculate the percentages of BaCO3 and of the BaSO4 equivalent of the BaCO3 as follows:\nBaCO3, % 5 @~A 30.8458!/B# 3100\n(43)\nBaCO3, as BaSO4, % 5 ~A/B! 3100\n(44)\nwhere:\nA\n= grams of BaSO4, and B\n= grams of specimen used.\n\n## 50. Total Antimony\n\n50.1 Reagents:\n50.1.1 *Hydrogen Sulfide* (H2S).\n\n50.1.2 *Methyl Red Indicator Solution—*See 44.1.3.",
    "50.1.3 *Potassium Bromate, Standard Solution* (0.1 N)—\nDissolve approximately 2.79 g of potassium bromate (KBrO3)\nin 1 dm3 of water (Note 12). Standardize this solution by means of standard arsenic trioxide (As2O3) as follows: Use a sample containing from 0.1 to 0.2 g of As2O3. Dissolve it in potassium hydroxide (KOH), neutralize with HCl, and add 15 cm3 of HCl in excess. Dilute to 100 cm3, warm to about 60 C, and titrate with KBrO3 solution, using two drops of methyl red solution",
    "(0.2 %) as indicator. When the indicator fades, add the KBrO3\nsolution, slowly, using more indicator if desired. At the end point the solution turns colorless and an added drop of indicator should be decolorized.",
    "Grams of antimony equivalent to 1 cm3 of KBrO3\n(45)\n5 ~A/B! 31.23\n\nwhere:\nA\n= grams of As2O3 used, and\nB\n= volume of KBrO3 solution required for titration of the\nsample, cm3.\nNOTE 12—Potassium bromate of known purity may be used as a\nprimary standard for making this solution. Both the solid and the solution\nare very stable. If KBrO3 is used as a primary standard, 1 cm3 of 0.1 N\nKBrO3 is equivalent to 0.006089 g of antimony.\n\n50.1.4 *Potassium Sulfate* (K2SO4).",
    "50.1.4 *Potassium Sulfate* (K2SO4).\n\n50.1.5 *Sodium Sulfite* (Na2SO3).\n\n50.1.6 *Starch Iodate Paper—*Impregnate filter paper with a solution made by heating 2 g of starch with 100 cm3 of water and, after solution, add 0.2 g of potassium iodate (KIO)\ndissolved in 5 cm3 of water.",
    "50.2 Procedure: 50.2.1 When a qualitative test indicates that antimony is present (10.1.2), weigh out a 0.5-g sample, and transfer to a Kjeldahl flask. Add 25 cm3 of H2SO4 and 10 to 12 g of K2SO4, place a funnel in the neck of the flask, and heat until the solution becomes colorless.",
    "50.2.2 Cool, wash the funnel, dilute the solution to 100 cm3\nwith water, and transfer to a 400-cm3 beaker. Dilute to 250 cm3\nwith hot water, and precipitate the antimony with H2S. Filter, and transfer the precipitate to a Kjeldahl flask. Add 15 cm3 of H2SO4 and 10 to 12 g of K2SO4, and heat as described above until the solution is colorless.",
    "50.2.3 Wash the funnel, dilute the solution to 100 cm3 with water, add 1 to 2 g of Na2SO3, and boil until all the sulfur dioxide (SO2) is driven out. This is shown when no blue color is obtained with starch iodate paper. Add 25 cm3 of HCl, dilute to 200 cm3, regulate the temperature to about 60°C, add 2\ndrops of 0.2 % methyl red solution, and titrate with 0.1 N\nKBrO3 solution until the solution is colorless.",
    "50.2.4 When the indicator starts to fade, add the KBrO3\nslowly, using another drop of indicator if desired. At the end point, an added drop of indicator should become colorless. If iron is found to be absent, it is not necessary to precipitate the antimony with H2S and the second heating in the Kjeldahl flask may be eliminated.\n\n50.3 *Calculation—*Calculate the percentage of antimony as antimony sulfide (Sb2S3), as follows:\nAntimony as Sb2S3 % 5 @~A 3N 30.0849!/B# 3100\n(46)",
    "where:\nA\n= volume of KBrO3 solution required for titration of the\nspecimen, cm3,\nN\n= normality of the KBrO3 solution, and\nB\n= grams of specimen used.\nThe percentage of Sb2S3 will not usually represent the exact\nweight of the substance as compounded since commercial antimony sulfide normally has some excess sulfur or other impurities present.\n\n## 51. Titanium Dioxide22",
    "## 51. Titanium Dioxide22\n\n51.1 *Scope—*This test method covers the determination of titanium dioxide (TiO2) in any rubber product. It may also be used qualitatively to detect the presence of TiO2 in the ash of a rubber product. This test method is based on fusion of the rubber product ash with potassium pyrosulfate, dissolution of the fused mixture in dilute H2SO4, and the formation of a colored titanium complex with hydrogen peroxide.",
    "51.2 Reagents:\n51.2.1 *Hydrogen Peroxide* (3 %)(H2O2).\n51.2.2 *Phosphoric Acid* (H3PO4).\n51.2.3 *Potassium Pyrosulfate* (K2S2O7), powder.\n51.2.4 *Titanium Dioxide* (TiO2).\n51.3 Apparatus:\n51.3.1 *Photoelectric Photometer—*A spectrophotometer or filter photometer suitable for measurement of absorbance at approximately 416 nm, with matched absorption cells 1 to 3 cm in thickness.",
    "51.4 Calibration of Photoelectric Photometer:\n51.4.1 Accurately weigh 0.125 g of TiO2 into a 30-cm3\nplatinum crucible. Add 6 g of fused K2S2O7 powder and 2 to 3",
    "platinum crucible. Add 6 g of fused K2S2O7 powder and 2 to 3\ndrops of H2SO4. Heat the crucible gently until all the pyrosulfate is melted. Gradually increase the heat until the bottom of the crucible is a dull red and continue heating until the TiO2 is completely dissolved. Allow to cool while carefully rolling the melt around the walls of the crucible to facilitate dissolution of the fused material. Place the crucible and contents in a 150-cm3",
    "beaker containing 50 cm3 of water. Carefully add, with stirring,\n25 cm3 of H2SO4. Cover the beaker and boil gently until dissolution is complete. Remove the heat and remove the crucible from the beaker with a glass rod, washing with H2SO4\n(6 + 100). Cool the solution and transfer to a 250-cm3 volumetric flask, rinsing with H2SO4 (6 + 100). Dilute to volume with water and mix well. Carry a blank through the same procedure.",
    "51.4.2 If a spectrophotometer with 1-cm cells is used for absorbance measurement, proceed as in 51.4.2.1 and 51.4.2.2.\n\nIf a filter photometer is used for this measurement, proceed as in 51.4.2.3.",
    "If a filter photometer is used for this measurement, proceed as in 51.4.2.3.\n\n51.4.2.1 Transfer a 15-cm3 aliquot of the standard titanium solution to a 50-cm3 volumetric flask, add 2 cm3 of H3PO4 and\n5 cm3 of H2O2 (3 %) to the flask, and dilute to volume with H2SO4 (6 + 100). Allow to stand 5 min and measure the absorbance in 1-cm cells at 416 nm, using H2SO4 (6 + 100) in the reference cell. Prepare the blank and measure its absorbance in the same manner.",
    "51.4.2.2 Calculate the absorptivity of TiO2 as follows:",
    "$\\rm TiO_{2}$ absorptivity, $a$, $=[(A_{A}-A_{B})\\times50]/CD$ (47)\nwhere:\nAA\n= absorbance of the diluted aliquot containing titanium,\nAB\n= absorbance of diluted blank aliquot,\nC\n= volume of aliquot taken, cm3 and\nD\n= milligrams of TiO2 per cubic centimeter of original\nsolution.\n51.4.2.3 Obtain data for a calibration curve by diluting aliquots of the TiO2 solution and of the blank to 50 cm3 with H2SO4 (6 + 100), after the addition of 2 cm3 of H3PO4 and",
    "5 cm3 of H2O2 (3 %) and measuring the absorbance against H2SO4 (6 + 100) in a filter photometer using a filter having a maximum transmittance at or near 416 nm. From these data construct a calibration curve of milligrams of TiO2 per cubic centimetre of solution against absorbance of the solution minus absorbance of the blank diluted in the same manner. Use only absorbance values between 0.15 and 1.5.",
    "51.5 Procedure: 51.5.1 Accurately weigh a 50 to 60-mg specimen of rubber product into a 3 to 4-cm3 platinum crucible. If the approximate TiO2 content is known, adjust the specimen size to assure an absorbance reading between 0.15 and 1.3. Place crucible and specimen in a cold muffle furnace and heat to 550° C, continuing heating until no carbonaceous material remains. Remove the crucible from the furnace, cool, add 1.3 to 2.0 g of fused K2S2O7 powder and 2 to 3 drops of H2SO4 to the ashed",
    "the furnace, cool, add 1.3 to 2.0 g of fused K2S2O7 powder and 2 to 3 drops of H2SO4 to the ashed specimen and to a blank crucible. Heat gently until the pyrosulfate is melted. Gradually increase the heat until the bottom of the crucible is dull red and continue heating for 10 to 15 min. Any residue at this point is silica or clay. Cool the crucible while carefully rolling the melt around the inside of the crucible.",
    "51.5.2 Place crucible and contents in a 50-cm3 beaker and cover with H2SO4 (6 + 100). Cover the beaker with a watch glass and boil the mixture slowly until dissolution is complete except for clay or silica. Remove the heat and remove the crucible from the beaker with a glass rod, washing with H2SO4",
    "(6 + 100). Filter through paper or a filter crucible if the solution is not perfectly clear and quantitatively transfer the solution to a 50-cm3 volumetric flask, using H2SO4 (6 + 100) for rinsing the beaker and filter. Add 2 cm3 of H3PO4 and 5 cm3 of H2O2\n(3 %) to the flask and dilute to volume with H2SO4 (6 + 100).",
    "Mix and allow the flask to stand for 5 min.\n\n51.5.3 Measure the absorbance of the unknown solution and the blank at 416 nm using H2SO4 (6 + 100) in the reference cell of the spectrophotometer or filter photometer. If the absorbance is greater than 1.500, add 2 cm3 of H2O2 (3 %) to an aliquot of the solution and dilute to a known volume with H2SO4\n\n## Part B. Determination Of Rubber Polymers 52. Scope",
    "52.1 These test methods cover the determination of specific rubber polymers present in a rubber product. They are applicable to crude, unvulcanized, reclaimed, and vulcanized rubbers containing IR, CR, NR, IIR, NBR, and SBR types of polymers. Since these test methods are based on the measurement of a functional group or an element, they are direct methods only when the relation between the determined quantity and the polymer or copolymer composition is known. These test methods will not",
    "determined quantity and the polymer or copolymer composition is known. These test methods will not differentiate, in general, between components of a mixture if the functional group or element determined is present in more than one component of the mixture. The applications and limitations of the test methods to the analysis of specific types of rubber products are given in the scopes of the methods. Application to types and mixtures not specified in the scope of a specific method shall be",
    "methods. Application to types and mixtures not specified in the scope of a specific method shall be verified by application to a \"control\" of known and similar composition.",
    "## 53. Direct Determination Of Natural And Synthetic Isoprene Polymers\n\n53.1 *Scope—*This test method covers the determination of isoprene polymer occurring as NR, IR, or balata in rubber products. The limitations of this test method are listed in Tables\n(6 + 100). Measure the absorbance at 416 nm. If the absorbance is less than 0.150, a larger specimen shall be used for the determination.",
    "51.6 Calculations:\n51.6.1 Calculate the percentage of TiO2 in the specimen as follows, if a spectrophotometer was used, for measuring absorbance.\n\nTitanium dioxide, % 5 @~AS 2 AB! 3100#/aE\n(48)\nwhere:\nAS\n= absorbance of specimen solution, AB\n= absorbance of blank solution, a\n= absorptivity of TiO2, (51.4.2.1), and E\n= milligrams of specimen per cubic centimetre of solution on which AS is measured.",
    "51.6.2 If a filter photometer was used for absorbance measurements, determine the absorbance for the sample minus absorbance for the blank. From the calibration curve (51.4.2.3), determine the number of milligrams of TiO2 per cubic centimetre of solution. Calculate the percentage of TiO2 as follows:\nTitanium dioxide, % 5 ~A/B! 3100\n(49)\nwhere:\nA\n= milligrams of TiO2 per cubic centimetre of solution, and B\n= milligrams of specimen per cubic centimetre of same solution.",
    "51.7 *Reproducibility—*Duplicate results by one operator should check within 0.6 %, based on the mass of the specimen.",
    "Compounding Ingredients\n| Compounding Ingredient                  | Interference                        |\n|-----------------------------------------|-------------------------------------|\n| Combined sulfur                         | none in normal soft cures           |\n| Carbon black                            | none as tested in tread stocks      |\n| Cellulose                               | negligible, 2 % or less of its mass |",
    "| Cellulose                               | negligible, 2 % or less of its mass |\n| reacts as if it were rubber hydrocarbon |                                     |\n| Asphaltic hydrocarbon                   |                                     |\n| (mineral rubber)                        |                                     |\n| removed by acetone and chloroform       |                                     |\n| extraction. If not extracted,           |                                     |",
    "| extraction. If not extracted,           |                                     |\n| approximately 45 % of its mass reacts   |                                     |\n| as if it were rubber hydrocarbon        |                                     |\n| Factice, brown                          | negligible, after acetone and       |\n| chloroform extraction                   |                                     |\n| Vistanex                                | virtually unattacked                |",
    "5 and 6. This test method consists essentially of quantitatively oxidizing the rubber polymer by means of digestion in chromic acid solution, after which the acetic acid formed is separated by distillation and determined by titration of the distillate after carbon dioxide has been removed by aeration. This procedure is also applicable to reclaimed rubber, but it has been found to give consistently lower than previously accepted estimates of the isoprene polymer content of reclaimed rubber.",
    "Acid Oxidation Procedure\n| Material                                   | Value Obtained                              |\n|--------------------------------------------|---------------------------------------------|\n| Hard NR or IR products                     | approximately 50 % of its mass reacts as if |\n| it were isoprene polymer                   |                                             |\n| NR (Balata)                                | approximately equivalent to isoprene        |",
    "| NR (Balata)                                | approximately equivalent to isoprene        |\n| polymer                                    |                                             |\n| TR                                         | approximately 18 % of its mass reacts as if |\n| it were isoprene polymer                   |                                             |\n| NBR                                        | approximately 1.5 to 2 % of its mass reacts |",
    "| NBR                                        | approximately 1.5 to 2 % of its mass reacts |\n| as if it were isoprene polymer             |                                             |\n| SBR                                        | approximately 3 % of its mass reacts as if  |\n| it were isoprene polymer                   |                                             |\n| CR                                         | approximately 3 % of its mass reacts as if  |",
    "| CR                                         | approximately 3 % of its mass reacts as if  |\n| it were isoprene polymer if a modification |                                             |\n| of the procedure is used to avoid the      |                                             |\n| interference of chlorine                   |                                             |\n| A                                          |                                             |",
    "| A                                          |                                             |\n| IIR                                        | virtually unattacked but interferes by      |\n| preventing complete reaction with NR or    |                                             |\n| IR.                                        |                                             |",
    "A This modification consists of adding neutral KI solution to the distillate after aeration and titrating any iodine that may be released with neutral Na2S2O3\nsolution before proceeding with the titration with 0.1000 N NaOH solution.",
    "53.2 Macro Method: 53.2.1 Apparatus:\n53.2.1.1 *Digestion and Distillation Assembly—*The digestion and distillation apparatus shown in Fig. 4 may be conveniently assembled on a ring stand with a tripod foot. The use of rubber connections shall be avoided where they might come into contact with the digestion mixture. Heating of the still and digestion mixture is accomplished by means of gas burners. An all-glass, small-scale apparatus, as shown in Fig. 4",
    "may also be used. Heating of the still and digestion flask is accomplished with heating mantels.",
    "53.2.1.2 *Aeration Assembly—*An aeration assembly containing a capillary tube, J (Fig. 4a) and I (Fig. 4b) which when connected to a vacuum line will maintain, through the receiving flask, an air flow of approximately 2 dm3/min. If the vacuum is less than 30 mm of mercury, a capillary tube approximately 10 cm in length with an 0.75-mm bore will maintain the required air flow. Since it is essential that the aeration be maintained at a rate within 10 to 20 % of 2 dm3/",
    "min, each capillary shall be tested before use. The following method may be used: Invert a graduate over a beaker filled with water and evacuate the air through the capillary by means of a tube extending up into the graduate. The rate of air flow will be the same as the rate at which the water fills the graduate.",
    "53.2.2 Reagents: 53.2.2.1 *Alcoholic Phenolphthalein Indicator Solution* (10\ng/dm3)—Dissolve 10 g of phenolphthalein in 500 cm3 of ethanol, and dilute to 1 dm3.\n\n53.2.2.2 *Chromic Acid Digestion Mixture—*Dissolve 200 g of chromic oxide (CrO3) in 500 cm3 of water, add 150 cm4 of H2SO4, and mix well.\n\n53.2.2.3 Sodium Hydroxide, Standard Solution (0.1 M)—\nPrepare and standardize a 0.1 M sodium hydroxide (NaOH)\nsolution.",
    "53.2.3 Procedure: 53.2.3.1 *Vulcanized Rubber Products—*Weigh a sufficient amount of the sample, sheeted to a thickness of 0.5 mm (Note\n13) to contain approximately 0.3 g of isoprene polymer. Wrap the specimen loosely in filter paper and extract by the total extract procedure as described in Section 20, or extract unwrapped specimens each weighing about 0.1 g with methyl ethyl ketone by the rapid reflux procedure (see 26.3). After extraction, dry the specimen in an oven at 100°C for 1 h.",
    "NOTE 13—The sample must be sheeted to a thickness of 0.5 mm or less, since some materials, such as unvulcanized NR or IR, may not otherwise be completely attacked by the oxidation mixture.",
    "53.2.3.2 Unvulcanized or Reclaimed Rubber Products—\nWeigh a sufficient amount of the specimen, sheeted to a thickness of 0.5 mm (Note 13), to contain approximately 0.2 g of isoprene polymer. If the material is suspected of containing mineral rubber or factice, vulcanize the material by a simple recipe and extract a specimen of the vulcanizate by the total extract procedure (Section 21) or by the rapid reflux procedure with methyl ethyl ketone (26.3) (Note 14). Dry in an oven at\n100°C for 1 h.",
    "NOTE 14—Poorly vulcanized rubber product must not be extracted with chloroform. Unvulcanized crude rubber or crude rubber products shall be extracted with acetone as described in 19.4 or 26.3. Unvulcanized rubber or rubber products shall be sheeted to the required thickness under equal or nearly equal speeds. Careful examination of the reaction mixture after digestion is necessary to detect the presence of unreacted specimen. If unreacted specimen is present after 1 h of digestion, repeat the",
    "presence of unreacted specimen. If unreacted specimen is present after 1 h of digestion, repeat the determination.",
    "53.2.3.3 Place 700 to 900 cm3 of water in the steamgenerating flask, A (of Fig. 4). Place a few cubic centimetres of water, sufficient to cover the end of the adapter, in the receiving flask, H. Mark the outside of the digestion flask, C, at a point indicating the liquid level when the flask contains 75 cm3.",
    "Transfer 50 6 1 cm3 of the chromic acid digestion mixture in the digestion flask. Lift the steam tube, B, and insert the specimen extracted in accordance with 53.2.3.1 or 53.2.3.2 into the digestion flask (Note 15). Replace the steam tube and tighten the connection. Heat the beaker of water surrounding the digestion flask to boiling, continue boiling for 1 h, and remove the burner and beaker.",
    "NOTE 15—It is not necessary to remove the filter paper quantitatively from the sample before transferring it to the digestion flask, since the interference of small amounts of cellulose is negligible.",
    "53.2.3.4 During the digestion period, heat the steamgenerating flask, A, with the stopper removed, until the contents are boiling. At the end of the digestion period, replace the stopper and outlet tube in the mouth of the steamgenerating flask, adjust the burner to maximum heat, and pass the steam through the digestion flask, C. When the volume of the liquid in the digestion flask is increased to approximately",
    "75 cm3, place a small flame under the flask, keeping it at a point that will maintain the volume in the digestion flask at\n75 cm3. Continue the distillation until 500 cm3 have been collected in the receiving flask, H. Remove the burners, immediately remove the receiving flask and the adapter, G, and rinse the adapter with water from a wash bottle, catching the washings in the receiving flask.",
    "53.2.3.5 Adjust the temperature of the liquid in the receiving flask to 25 6 5°C. Attach J to H as in aeration assembly I\nof Fig. 4, and attach to a vacuum line. Draw a stream of air through the liquid for 30 min at a rate of approximately",
    "2 dm3/min. Remove the rubber tubing and loosen the two-hole stopper. Rinse the stopper and glass tubing with water from a wash bottle, catching the rinsings in the receiving flask. Add alcoholic phenolphthalein indicator solution to the receiving flask, and titrate with 0.1 M NaOH solution. (**Warning—**The rates of loss of carbon dioxide and of acetic acid during aeration have been investigated for the temperature range, type of apparatus, and rate of air flow recommended. Variation of any of",
    "for the temperature range, type of apparatus, and rate of air flow recommended. Variation of any of these factors may lead to erroneous analytical results.)",
    "53.2.3.6 *Blank—*Make a blank determination, following the procedure described in 53.2.3.3 - 53.2.3.5, using the same amounts of all reagents. The blank should not exceed 0.2 to\n0.3 cm3.",
    "53.2.4 *Calculation—*Calculate the percentage of isoprene polymer as follows (Note 16):\nIsoprene polymer, % 5 9.08 ~A 2 B!M/C\n(50)\n\nwhere:\nA\n= volume of NaOH solution required for titration of the\nspecimen, cm3,\nB\n= volume of NaOH solution required for titration of the\nblank, cm3,\nM\n= molarity of NaOH solution, and C\n= grams of specimen used.",
    "NOTE 16—This calculation is based on the observation that a 75 % yield is always obtained in the reaction: (C5H8)n + 0 →CH3COOH, using purified NR. To convert the results to rubber as compounded, a suitable correction factor for non-rubber constituents of the crude rubber is necessary (see 13.1).\n\n53.2.5 *Bias—*Results may be expected to be accurate within\n2 %, based on the mass of the specimen. Results are usually consistent to 0.5 % or less.",
    "53.3 Small-Scale Test Method: 53.3.1 *Apparatus—*A small-scale rubber hydrocarbon apparatus (see Fig. 4a).\n\n53.3.2 *Reagents—*See 53.2.2.\n\n53.3.3 Procedure: 53.3.3.1 Weigh 0.15 to 0.25 g of milled sample prepared in accordance with 53.2.3.1 or 53.2.3.2.",
    "53.3.3.2 Place the extracted and dried sample in the digestion flask B (Fig. 4), and add 25 cm3 of digestion mixture\n(53.2.2.2). Connect all fittings except that to the still, A, and digest for 0.5 h. (The mixture should boil gently.) In the meantime, heat the water in the still to boiling.",
    "53.3.3.3 At the end of the digestion time, connect the still to the digestion flask, B, and collect 150 cm3 of distillate in the receiving flask, G, to which sufficient water has been added to cover the end of the delivery tube.\n\n53.3.3.4 Carry out the aeration in accordance with 53.2.3.5.\n\nAt the end of 0.5 h, remove the flask, add phenolphthalein and titrate with 0.05 M NaOH solution.\n\n53.3.3.5 *Blank—*Determine a blank on each new set of reagents.\n\n53.3.4 *Calculations—*See 53.2.4.",
    "53.3.3.5 *Blank—*Determine a blank on each new set of reagents.\n\n53.3.4 *Calculations—*See 53.2.4.\n\n53.3.5 *Accuracy—*See 53.2.5.\n\n## 54. Determination Of Chlorine By Oxygen Flask Combustion",
    "53.3.5 *Accuracy—*See 53.2.5.\n\n## 54. Determination Of Chlorine By Oxygen Flask Combustion\n\n54.1 Scope: 54.1.1 This test method covers the determination of all of the chlorine in a sample of rubber product, in a range from approximately 0.2 to 25 % chlorine. This test method is applicable to NR, SBR, BR, IR, IIR, EPDM, and CR products. In the absence of other chlorine containing materials, this test method may be used to determine CR rubber.",
    "54.1.2 Bromides and iodides interfere, but other common substances (for example, Zn2+, S, CN−, CO3\n2−) do not interfere.\n\n54.2 *Summary of Test Method—*The sample, wrapped in filter paper, is burned in an oxygen combustion flask; the carbon and hydrogen of the organic matter are oxidized and the chlorine compounds are converted to chloride, which is titrated with standard alcoholic silver nitrate solution.",
    "54.3 Apparatus:\n54.3.1 *Oxygen Combustion Flask (Schöniger Flask)*23—A\nchemical-resistant,7,10 thick-walled oxygen combustion flask,\n1000 cm3, with 35/25 ball-joint stopper, platinum sample carrier and pinch clasp.\n\n54.3.2 *Infrared Safety Igniter,*7,11with cabinet and infrared light (an electrical igniter is also satisfactory).\n\n54.3.3 *Buret,* 25-cm3 capacity, with 0.1-cm3 graduations.",
    "54.3.3 *Buret,* 25-cm3 capacity, with 0.1-cm3 graduations.\n\n54.3.4 *Magnetic Stirring Bar,* covered with chemicalresistant coating,12 approximately 25 mm (1 in.) long, without spinning ring around the center.\n\n54.3.5 Magnetic Stirrer. 54.3.6 *Filter Paper,* 30 by 30-mm, with a 35-mm extension, black7,14 for infrared or white7,15 for electrical ignition.",
    "54.3.7 *pH Meter,*7,24 equipped with a billet-type silver electrode7,25 and a calomel7,25 electrode in which the potassium chloride has been replaced by a saturated potassium nitrate solution, or equivalent automatic titrator.\n\n54.4 *Reagents—*To conserve reagents make only as much solution as needed for the required analyses, or that can be stored for future needs.",
    "54.4.1 Acidified Ethanolic Silver Nitrate Solution (0.01\nM)—Pipet 100 cm3 of standard26 0.1 M silver nitrate solution into a 1-dm3 volumetric flask containing about 500 cm3 of denatured ethanol (Formulas SD 3A, 1 or 2B, or 30), add 2.0 cm\n3 of nitric acid (1 + 1) and when this has cooled to room temperature dilute to volume with ethanol. Protect from the light. Titrate an accurately weighed sample of reagent grade potassium chloride (KCl) or sodium chloride (NaCl) as in",
    "54.7.12 and calculate the molarity as follows:",
    "Molarity = ($A\\times1000$)/($B\\times C$) (51)\nwhere:\na\n= mass of chloride weighed, g, b\n= molecular mass of chloride weighed, and c\n= titration volume, cm3.\n\n54.4.2 *Hydrogen Peroxide* (30 %) (**Warning—**Thirty percent hydrogen peroxide is very corrosive to the skin; wear rubber or plastic gloves and goggles when handling it.)\n54.4.3 *Nitric Acid (1 + 1)—*Mix equal volumes of nitric acid\n(HNO3) (density, 1.40 Mg/m3) and water.",
    "54.4.4 Potassium Hydroxide (2M)—Dissolve 112 g of potassium hydroxide (KOH) pellets in water and dilute to 1 dm3.\n\n54.4.5 *Oxygen,* in compressed gas cylinder.\n\n54.5 Sample Preparation and Handling: 54.5.1 The rubber must be milled finely on a laboratory roll mill before weighing.\n\n54.5.2 Due to the small sample size the rubber and filter paper should be protected from contamination, and all operations prior to combustion should be carried out with plastic gloves.",
    "54.6 *Safety Precautions—*The following safety precautions must be observed in the combustion of rubber samples:\n54.6.1 The flask must contain no residues of organic solvents or vapor, which could cause an explosion. Any such solvents used for cleaning the flask should be repeatedly rinsed out with water.",
    "54.6.2 The pressure generated by the rapid combustion could cause the flask to explode. Hence, combustion must take place in the safety chamber with the door locked or behind a safety shield or hood shield (preferably in a safety chamber which is itself behind a shield); the hands and face must be withdrawn behind a screen before the flame reaches the sample itself. Goggles, or a face shield, must be worn during this process.",
    "54.6.3 The flask should be left in the safety chamber until the last spark is extinguished. At this point it is removed; but since a slight vacuum is formed, continue wearing goggles or face shield.\n\n54.7 Procedure:\n54.7.1 Place 10 cm3 of water, 2.0 cm3 of 2 M KOH solution, the stirring magnet, and 3 drops (added by medicine dropper)\nof 30 % hydrogen peroxide solution in the 1000-cm3 combustion flask.\n\nan approximate molarity of 0.01.",
    "an approximate molarity of 0.01.\n\n54.7.2 Fold the filter paper into a U-shaped sample boat according to Fig. 1 A and B of Test Method E442.\n\n54.7.3 Weigh a sample of rubber of 30 to 60 mg, which should not exceed about 0.5 milliequivalents of chlorine, to 0.1 mg. Place the rubber sample in the sample boat.",
    "54.7.4 Fold the paper according to 8.2.4 and 8.2.5 of Test Method E442. Place the folded paper firmly in the platinum sample carrier hung on the hook of the stopper with the pointed end of the paper projecting outward.\n\n54.7.5 Insert a tube from the oxygen cylinder close to the bottom of the flask as in Fig. 2 A of Test Method E442, and blow in oxygen strongly for at least 0.5 min.",
    "54.7.6 Smoothly remove the oxygen tube and close the stopper without letting the platinum carrier drop into the liquid.\n\n54.7.7 With the stopper upright, clamp the stopper tightly with the pinch clamp.\n\n54.7.8 Place the flask in the infrared igniter chamber with the pointed end of the paper in line with the infrared beam and approximately perpendicular to it. Close the door and turn on the infrared light (or electric igniter) until the paper ignites.",
    "54.7.9 After the burning ends, stir the still-sealed flask vigorously on a magnetic stirrer for 1 h. Alternatively, it may be allowed to stand undisturbed for 2 h.\n\n54.7.10 Remove the pinch clamp, tilt the stopper to release the vacuum, and open the flask.",
    "54.7.10 Remove the pinch clamp, tilt the stopper to release the vacuum, and open the flask.\n\n54.7.11 Transfer the contents of the combustion flask (with the exception of the platinum carrier) to a 250-cm3 beaker, which is shielded from light. Rinse the sample carrier and combustion flask with six 153 portions of denatured alcohol into the beaker. Add 2 cm3 of HNO3 (54.4.3).",
    "54.7.12 Titrate the solution with 0.01 M AgNO3 solution using the pH meter arrangement described or an equivalent automatic titrator, adding the titrant in increments of 0.1 cm3.\n\nThe end point is the point of maximum change in emf, for an increment.\n\n54.7.13 Carry a blank through the whole procedure, with the sample omitted. Use this value as a correction for chlorine in reagents, etc.",
    "54.7.14 A better end point may be achieved by adding a known amount of chloride to the solution before titration and deducting this amount from the total titration.\n\n54.8 Calculations:\n54.8.1 Calculate the chlorine content as follows:",
    "54.8 Calculations:\n54.8.1 Calculate the chlorine content as follows:\n\nChlorine, $\\%=\\frac{(A-B)\\times M\\times3.55}{W}$ (52)\nwhere:\nA\n= volume of AgNO3 solution required for sample\ntitration, cm3,\nB\n= volume of AgNO3 solution required for blank titration,\ncm3,\nM\n= molarity of the AgNO3 solution, and\nW\n= mass of sample used, g.\n54.8.2 Calculate the percentage of CR polymer as compounded by:\nCR polymer as compounded, % 5 A/0.37\n(53)\nwhere:\nA\n= the percentage of chlorine.",
    "54.9 *Precision:*27\n54.9.1 These precision data are based on tests of four samples by five laboratories on 2 days. The range of samples was from approximately 1 to 23 % chlorine. Precision is expressed in absolute terms (2S, D2S).\n\n54.9.2 *Repeatability (Single-Operator)—*The repeatability has been estimated to be 60.26 percentage points (2S). Two test results should be considered acceptable if their difference does not exceed 0.37 percentage points (D2S).",
    "54.9.3 *Reproducibility (Multioperator)—*The reproducibility has been estimated to be 60.54 percentage points (2S). Two test results should be considered acceptable if their difference does not exceed 0.76 percentage points (D2S).\n\n## 55. Estimation Of Nbr Polymer",
    "## 55. Estimation Of Nbr Polymer\n\n55.1 *Scope—*An estimation of the NBR polymer content of a rubber product may be obtained from the nitrogen content of the sample if no other nitrogen containing materials are present or if a correction can be made for known nitrogen bearing materials in the sample. This test method is applicable to all rubber products.",
    "55.2 *Procedure—*The sample may be prepared in accordance with 9.2 or 9.3, or may be cut into pieces about 2 mm on an edge. Weigh a 0.5 to 1-g specimen and proceed to determine nitrogen in accordance with 40.3, except that the acetone extraction shall be omitted. Antioxidants and accelerators containing nitrogen may be at least partially removed by extraction with methanol using the acetone extract procedure",
    "(see 19.4). An alternative procedure may be used as described in Method of Test D982. If Method of Test D982 is used, proceed in accordance with Sections 3, 4, 7, and 8 except to omit Sections 6 and 9.1 and all reference to moisture-free basis.",
    "55.3 Calculations:\n55.3.1 When 40.3 is used for nitrogen determination, calculate the nitrogen content as follows:",
    "Nitrogen, $\\%=[(AN-BN)/C]\\times1.4$ (54)\nwhere:\nA\n= volume of 0.1 H2SO4 used, cm3,\nN\n= normality of H2SO4,\nB\n= volume of 0.1 N NaOH solution required for titration of\nthe H2SO4, cm3,\nN'\n= normality of the NaOH solution, and\nC\n= grams of specimen used.\n55.3.2 When nitrogen is determined in accordance with Method of Test D982, calculate the percentage of nitrogen in accordance with 8.1 of that test method.",
    "55.3.3 Calculate the percentage of NBR polymer present in the sample if the composition of the copolymer used in the rubber product is known.\n\n## 56. Direct Determination Of Iir Polymer",
    "## 56. Direct Determination Of Iir Polymer\n\n56.1 *Scope—*This test method28 is intended for use in the determination of IIR or polyisobutylene in rubber products. The method is especially useful in the determination of small amounts of IIR in rubber products. It is applicable to products containing BR, CR, IR, NR, NBR, and SBR rubbers. Application to products containing other polymers must be verified by use of control samples of known and similar composition.",
    "56.2 *Summary of Test Method—*Rubbers having unsaturated carbon chains are destroyed by digestion with nitric acid. The polymers IIR and polyisobutylene are not attacked. The residue after filtration is heated with t-butyl hydroperoxide solution to solubilize the IIR. After filtration to remove any remaining fillers, the IIR or polyisobutylene is precipitated with alcohol, dried, and weighed.",
    "56.3 Apparatus and Materials:\n56.3.1 *Steam Plate or Hot Plate* maintained at 140°C in a fume hood, and a thermometer to measure surface temperature.\n\n56.3.2 *Reflux Condensers,* Hopkins type, with standardtaper 24/40 joints.\n\n56.3.3 *Erlenmeyer Flask,* 250-cm3, with standard-taper joints.\n\n56.3.4 *Bumping Stones,* No. 6 Carborundum.",
    "56.3.4 *Bumping Stones,* No. 6 Carborundum.\n\n56.3.5 *Büchner Funnel A—*A No. 0 Büchner funnel lined first with a Reeve Angel No. 934 AH glass-fiber disk, then with medium-fiber asbestos to about 3 mm (0.125 in.) depth, and finally with a 3-mm (0.125-in.) top layer of diatomaceous earth filter aid from a suspension in acetone to a total depth of about 6 mm (0.25 in.). Remove the acetone with suction and age at least 24 h before using (Note 17).",
    "56.3.6 *Büchner Funnel B—*A No. 1 Büchner funnel lined first with a circle of S & S No. 598 filter paper, then with medium-fiber asbestos to a depth of about 3 mm (0.125 in.) and finally with a 3-mm (0.125-in.) top layer of diatomaceous earth filter aid from a suspension in acetone to a total depth of about 6 mm (0.25 in.). Remove the acetone with suction. Wash with the equal volume mixture of chloroform and 30 to 60°C petroleum ether. Remove the solvent mixture with suction. Age at least 24 h",
    "and 30 to 60°C petroleum ether. Remove the solvent mixture with suction. Age at least 24 h before using (Note 17).",
    "NOTE 17—The preparation of the filter funnels as described has been found to be important to the success of the method. The use of other materials of equivalent properties in the preparation of the filters should be tested with samples of known composition.\n\n56.3.7 *Diatomaceous Earth Filter Aid.*7,29\n56.3.8 *Filtering Fiber,* medium. 56.4 Reagents:\n56.4.1 *Acetone—*See 19.3.\n\n56.4.2 *Chloroform—*See 20.3.",
    "56.4.2 *Chloroform—*See 20.3.\n\n56.4.3 *Chloroform-Petroleum Ether Mixture* (1 + 1). Mix equal volumes of chloroform and petroleum ether.\n\n56.4.4 *Ethanol—*Formula 2B denatured ethyl alcohol or absolute ethanol.\n\n56.4.5 *Petroleum Ether,* 30 to 60°C boiling range.",
    "56.4.6 *Tert-Butyl Hydroperoxide,* commercial grade.7,30",
    "56.4.7 Xylene. 56.5 Procedure: 56.5.1 Homogenize and sheet out the sample with a tight rubber mill to a thickness of 0.5 mm. Accurately weigh a specimen of appropriate size to contain between 0.05 and 0.20 g of polyisobutylene. Do not use more than 5 g. Use 1 g for unknown range and repeat with adjusted sample size if less than 0.05 g or more than 0.20 g is found. Add to 200 cm3 of acetone in a 250-cm3 Erlenmeyer flask, connect to a reflux condenser, and reflux 1 h. Remove the sample, blot off",
    "Erlenmeyer flask, connect to a reflux condenser, and reflux 1 h. Remove the sample, blot off acetone with a paper towel, and dry for 10 min in an oven at 105 to 110°C.",
    "56.5.2 Cut into 5 by 10-mm or smaller pieces and place in a 250-cm3 beaker. Add 10 cm3 of HNO3 and allow to stand at room temperature in a hood until initial frothing reaction subsides. If the reaction is slow, warm the beaker on a hot plate at 140°C until fuming just begins and then remove immediately. If there is no reaction after 5 min on a hot plate at 140°C, remove anyway. When all reaction stops and the beaker has cooled to room temperature, add 50 cm3 of HNO3 and 10 cm3",
    "of xylene. Place on a hot plate at 140°C, cover with a watch glass, and digest 30 min. Remove the watch glass and digest at least 30 min more until xylene is completely evaporated.",
    "56.5.3 Add 1 level teaspoon of filter aid, stir with a glass rod, and filter hot through an aged prepared Büchner funnel A\ninto a 500-cm3 filtering flask containing 100 cm3 of water. Use low to moderate suction and a fume hood. Wash beaker and filter twice with 20-cm3 portions of HNO3 at room temperature.",
    "Wash copiously with at least 300 cm3 of hot water until the filtrate is colorless. Discard the filtrate and rinse the flask with water. (**Warning—**There is danger of a violent reaction between nitric acid and alcohol.) Attach the filter to the cleaned filter flask, wash with 50 cm3 of ethanol, and dry on the filter with continued suction.\n\n56.5.4 With the aid of a spoon or spatula, carefully transfer the contents of the funnel to a dry 250-cm3 Erlenmeyer flask.",
    "Use filter paper wet with chloroform to clean the last traces from the funnel. Add six to ten carborundum bumping stones,\n100 cm3 of chloroform, 100 cm3 of petroleum ether, and 5 to\n7 cm\n3 of *tert*-butyl hydroperoxide. Connect the Hopkins condenser and reflux rapidly at least 4 h. Replace any appreciable amount of evaporated solvent with chloroform-petroleum ether mixture (1 + 1).",
    "56.5.5 Filter the refluxed sample, warm, through an aged prepared Büchner funnel B into a clean, dry 500-cm3 filtering flask, using moderate suction. (Too much suction may cause some carbon black to pass through the filter and necessitate refiltering.) With a wash bottle, wash the flask and filter five times with 20-cm3 portions of warm chloroform-petroleum ether mixture (1 + 1). Be sure to wash well the edge and side wall of the funnel with the stream from the wash bottle.",
    "56.5.6 Add two No. 6 Carborundum bumping stones to a clean 250-cm3 beaker. Evaporate portions of the filtrate from",
    "56.5.5 in the 250-cm3 beaker until all the filtrate has been reduced to a small volume. Wash the filter flask well with the chloroform-petroleum ether mixture (1 + 1). Add these washings to the beaker and evaporate to about 20 cm3. Transfer the solution to an accurately weighed, clean, dry 50-cm3 Erlenmeyer flask containing two No. 6 Carborundum bumping stones and wash the beaker well with the chloroformpetroleum ether mixture (1 + 1). Carefully evaporate to about 1",
    "to 3 cm3 on a hot plate at 140°C. *Do not* evaporate to dryness.",
    "Allow the flask to cool to room temperature and then add 25 cm\n3 ethanol. (If there is no precipitate or turbidity at this point polyisobutylene is not present and the analysis may be terminated.) Boil gently on a hot plate at 140°C for at least 15 min, until the alcohol is clear and all the isobutylene coagulates and adheres to the flask. If turbidity persists, evaporate to about 2\nto 3 cm3, cool to room temperature, and add 25 cm3 of acetone.",
    "56.5.7 Cool to room temperature and carefully decant the alcohol (or acetone). Wash the precipitated polyisobutylene by swirling gently with 25 cm3 of acetone at room temperature and decanting. Dry the flask and polyisobutylene 2 h in an oven at 105 to 110°C, cool in a desiccator, and weigh.\n\n56.6 *Calculations—*Calculate the percentages of polyisobutylene and IIR as follows:\n\n$A=[(B-C)/D]\\times100$ (55)",
    "$A=[(B-C)/D]\\times100$ (55)\n\nIIR, $\\%=A\\times1.03$ (56)\nwhere:\nA\n= percentage of polyisobutylene, B\n= mass of flask and precipitated polyisobutylene, C\n= mass of flask, and D\n= mass of sample used.\n\n56.7 *Precision:*31\n56.7.1 These precision data are based on tests of 4 samples by 6 laboratories. The range of samples studied was from about 3 to 60 % IIR. Precision is expressed in relative terms (2S %, D2S %).",
    "56.7.2 *Repeatability (Single-Operator)—*The repeatability has been estimated to be 65.7 % (2S %) of a determination.\n\nTwo test results should be considered acceptable if their difference does not exceed 8.0 % (D2S %) of their average value.\n\n56.7.3 *Reproducibility (Multilaboratory)—*The reproducibility has been estimated to be 68.9 % (2S %) of a determination. Two test results should be considered acceptable if their difference does not exceed 13 % (D2S %) of their average.",
    "## 57. Estimation Of Sbr Polymers",
    "57.1 Scope:",
    "57.1.1 This test method32 is intended for the determination of the bound styrene content of SBR polymers or rubber products containing SBR polymers, including those products containing carbon black, oil-extended SBR polymers, inorganic fillers, NR, IR, and CR. Application to rubber products containing other polymers shall be verified by the use of control samples of known and similar composition. The method is considered to provide an estimation of SBR content because the bound styrene content",
    "The method is considered to provide an estimation of SBR content because the bound styrene content of the entire sample is determined. SBR content can be estimated by assuming the bound styrene content of the SBR used in the rubber product.",
    "57.1.2 The method is designed for routine application in cases where the accuracy desired does not warrant the calibration of the spectrophotometer. There is also provision for increasing the accuracy of results by calibration of the spectrophotometer.",
    "57.2 *Summary of Test Method—*The bound styrene is nitrated and oxidized to nitrobenzoic acid which is separated by extraction and is determined quantitatively by measuring its ultraviolet absorption at 265, 273.75, and 285 nm. A preliminary extraction removes interfering compounds.\n\n57.3 Apparatus: 57.3.1 *Spectrophotometer—*A spectrophotometer that will measure absorbance in the region from 260 to 290 nm.",
    "57.3.2 *Absorption Cells,* silica, 1-cm path length. 57.3.3 *Extraction Apparatus—*Soxhlet extraction apparatus or ASTM extraction apparatus (see 19.2).\n\n57.3.4 *Boiling Flasks,* 125-cm3, with standard-taper joints.",
    "57.3.5 Graham Condensers. 57.3.6 *Boiling Chips,* Carborundum, No. 10 grit. 57.4 Reagents: 57.4.1 *Diethyl Ether,* peroxide-free. 57.4.2 *Ethanol-Toluene-Azeotrope (ETA)—*Prepare by mixing 70 volumes of ethyl alcohol and 30 volumes of toluene, refluxing the mixture 4 h over calcium oxide (CaO), and distilling. Discard the first and last portions, keeping only that distillate coming over within a range of 1°C. Distilling may be omitted if absolute grain alcohol or anhydrous Formula 2-B alcohol",
    "range of 1°C. Distilling may be omitted if absolute grain alcohol or anhydrous Formula 2-B alcohol is used.",
    "57.4.3 *Nitric Acid (density 1.40)—*Concentrated nitric acid\n(HNO3).\n\n57.4.4 *Sodium Chloride Solution (saturated)—*Prepare a saturated solution of sodium chloride (NaCl) in water.\n\n57.4.5 *Sodium Hydroxide Solution (200 g/dm*3)—Dissolve\n200 g of sodium hydroxide (NaOH) in water and dilute to\n1 dm3.\n\n57.4.6 *Sodium Hydroxide Solution* (4 g/dm3)—Dissolve 4 g of NaOH in water and dilute to 1 dm3.\n\n57.4.7 *Sodium Sulfate, Anhydrous* (Na2·SO4).",
    "57.4.7 *Sodium Sulfate, Anhydrous* (Na2·SO4).\n\n57.4.8 Methyl Ethyl Ketone. 57.5 *Preparation of Sample—*Mill mass polymer or rubber product sample and sheet out to less than 0.5-mm thickness.",
    "57.6 Calibration of Spectrophotometer: 57.6.1 While calibration of the spectrophotometer used in the procedure is not always necessary, for the most accurate results, a calibration is desirable, using standard samples of styrene containing copolymers having bound styrene contents approximately the same as the copolymer present in the unknown rubber product sample. A calibration with a production sample of SBR, preferably in the 23.5 % bound styrene range, will be suitable for reasonably",
    "sample of SBR, preferably in the 23.5 % bound styrene range, will be suitable for reasonably accurate measurements on rubber products containing SBR with from 9 to 45 % bound styrene. In the presence of other rubbers, calibration to give maximum accuracy will probably require the use of a known SBR together with a known amount of any other rubber present in order to obtain a correction for absorptivity of nitrated products of the other rubber.",
    "57.6.2 Determine the bound styrene content of a reference standard SBR by treating a sample of crude SBR polymer having the appropriate bound styrene content in accordance with the refractive index method covered in Test Methods D1416. Determine the bound styrene content of the reference standard in triplicate, or with more replications if a greater confidence must be placed in the mean value obtained.",
    "NOTE 18—For most accurate calibration, use a sample of hot SBR, preferably of Type 1006 of the Description of Synthetic Rubbers and Latices (International Institute of Synthetic Rubber Producers), for 23.5 % bound styrene. Other 1000 series samples may be used, but they should be fatty acid emulsifier, salt-acid coagulated polymers.",
    "57.6.3 Treat replicate specimens (at least triplicate) of the samples that have been dried and pressed between sheets of foil in the refractive index method 57.6.2 for determination of bound styrene content, in accordance with the nitration procedure given in 57.7. Calculate the average absorptivity due to nitrated styrene at each wavelength as follows:",
    "$a_{{}_{x}}=[A_{{}_{p}}/c-a_{{}_{b}}(1-X)]/X$ (57)\nwhere:\nas\n= absorptivity due to nitrated styrene,\nAp\n= absorbance of the solution,\nc\n= concentration of specimen in solution on which absorbance is measured, g/dm3,\nX\n= average value of the fraction of bound styrene in\ncopolymer as determined in accordance with 57.6.2,\nand\nab\n= absorptivity of nitrated butadiene = 0.373 at 265 nm,\n0.310 at 273.75 nm, and 0.265 at 285 nm.",
    "ab\n= absorptivity of nitrated butadiene = 0.373 at 265 nm,\n0.310 at 273.75 nm, and 0.265 at 285 nm.\n57.6.4 Record the slit widths used in determining the above absorbance values and use approximately the same slit widths in the analysis of unknown samples in 57.7. An improvement in precision may result if the final solution used in calibration and in the determination is approximately half of the concentration specified in the procedure. Absorbance values will then be in the 0.4 to 0.7 range.",
    "57.7 Procedure:\n57.7.1 Accurately weigh a specimen of the desired size\n(Note 19) and extract it with ETA or methyl ethyl ketone\n(vulcanizates only) for 16 to 18 h in a Soxhlet extraction apparatus or in the ASTM extraction apparatus described in",
    "19.2. Alternatively, the specimen may be extracted with either solvent by the rapid reflux method described in Section 26. If this method is used, the specimen shall be cut finely as described in the procedure and 25 cm3 of solvent shall be used for each 0.1 g of specimen. Dry the extracted specimen in a vacuum oven at 100°C for 1 h.",
    "Specimen mass, g 5 4.5/estimated percent styrene in sample (58)\n57.7.2 Transfer the extracted and dried specimen to a\n125-cm",
    "125-cm\n3 flask having a standard-taper joint, and add 20 cm3 of HNO3 and a few carborundum boiling chips. Place the flask on a cold hot plate, turn the heat on and allow to reflux at a rolling boil overnight (16 to 18 h) under a water-cooled Graham condenser. Turn off heat, pour 10 to 20 cm3 of water into the top of the condenser, and allow the water to be drawn into the flask as the flask cools. Allow the reaction mixture to cool to permit handling of the flask.",
    "57.7.3 Transfer to a 400-cm3 beaker, using a stream of water from a wash bottle to rinse the flask and the standard-taper joints. Add the rinsings to the beaker. Cool the beaker to room temperature. Add 50 cm3 of NaOH solution (200 g/dm3) to the original flask and again rinse into the beaker, using water. Test the solution in the beaker with pH paper. The solution should be made strongly acid with HNO3, if the solution is not already strongly acid at this point. Cool to room temperature.",
    "with HNO3, if the solution is not already strongly acid at this point. Cool to room temperature. Transfer the solution to a 500-cm3 separatory funnel, rinse the beaker with water, and add the washings to the separatory funnel.",
    "(**Warning—**The skill with which these transfers and the subsequent extractions are performed will determine the accuracy of the analysis.)",
    "57.7.4 Shake the solution with 50 cm3 of diethyl ether and allow the layers to separate. Drain the lower aqueous layer into the original beaker. Add 25 cm3 of the saturated salt solution to the ether layer. Drain a few cubic centimetres into the original beaker to wash the stem of the separatory funnel. Shake and allow the layers to separate. Drain the salt solution into the same beaker. Drain the ether layer into a 250-cm3 beaker containing 4 to 5 g of anhydrous Na2SO4. Add 50 cm3 of ether to",
    "ether layer into a 250-cm3 beaker containing 4 to 5 g of anhydrous Na2SO4. Add 50 cm3 of ether to the separatory funnel and drain a few cubic centimeters into the 250-cm3 beaker containing the ether extract, to wash the stem of the funnel. Swirl ether in the beaker and transfer ether to another separatory funnel.",
    "57.7.5 Repeat extraction of the aqueous layer in the same manner for a total of three extractions, each ether extract being dried over the same Na2SO4 and collected in the second separatory funnel.",
    "57.7.6 Extract the combined ether extracts four times with\n50-cm3 portions of NaOH solution (4 g/dm3). Collect the aqueous extracts in a 250-cm3 volumetric flask. After each extraction, drain a few cubic centimeters of the next portion of NaOH solution, before shaking, to rinse the stem of the separatory funnel, adding the drainings to the volumetric flask.\n\nDilute to volume with NaOH solution (4 g/dm3). Mix well.\n\nPipet a 25-cm3 aliquot into a second 250-cm3 volumetric flask.",
    "Pipet a 25-cm3 aliquot into a second 250-cm3 volumetric flask.\n\nDilute to volume with NaOH solution (4 g/dm3) and mix well.\n\n57.7.7 With NaOH solution (4 g/dm3) in the blank spectrophotometer cell and the extract in a matched silica absorption cell, measure the absorbance at 265 nm, 273.75 nm, and 285 nm using a spectrometer. The dark current should be adjusted before and after each reading. If the dark current is found to have drifted during the reading, the reading should be repeated.",
    "## 57.8 Calculations:\n\n57.8.1 If the spectrophotometer has not been calibrated, calculate the apparent percentage bound styrene as follows\n(Note 20):\n\nS1 5 @~A265 33.829!/B# 2 0.57Y\n(59)\nS2 5 @~A 273.75 33.611!/B# 2 0.45Y\n(60)\nS3 5 @~A 285 34.018!/B# 2 0.43Y\n(61)\nBound styrene, % 5 ~S11S21S 3!/3\n(62)",
    "where:\nA\n= absorbance at the specified wavelength,\nB\n= mass of specimen, g, and\nY\n= fraction of styrene-containing copolymer in sample\n(Note 21).\n57.8.2 If the spectrophotometer has been calibrated in accordance with 57.6, calculate the percentage of bound styrene content as follows (Note 20):\n\nBound styrene, % 5 ~S11S 21S3!/3\n(63)\nS1 5 @~100Ax 265/c x! 2 37.3Y#/~as 265 2 0.373!\n(64)\nS2 5 @~100A x 273.75/cx! 2 31.0Y#/~as 273.75 2 0.310!\n(65)\nS3 5 @~100Ax 285/cx! 2 26.5Y#/~a s 285 2 0.265!\n(66)",
    "where:\ncx\n= concentration of specimen solution on which absorbance is measured, g/dm3,\nAx\n= absorbance of solution at specified wavelength,\nas\n= absorptivity at specified wavelength as determined in\n57.6.3, and Y\n= fraction of styrene-containing copolymer in sample\n(Note 21).",
    "NOTE 20—The use of absorbance at three wavelengths serves to correct for background due to minor interferences. An unknown sample of crude SBR having a bound stryene content close to that of the SBR used for calibration should give S1, S2, and S3 values in 57.8.2 that do not differ by more than a few tenths of a percent. Other types of samples may yield values of S1, S2, and S3 having a range as great as 1 % before the analysis is suspected of error due to interference. With the use of the",
    "as great as 1 % before the analysis is suspected of error due to interference. With the use of the formula given in 57.8.1 however, the range of S1, S2, and S3 values may be as great as",
    "2 %, because of improper wavelength calibration of the spectrophotometer",
    "## Appendixes (Nonmandatory Information) X1. Sulfur, Zinc-Nitric Acid Test Method X1.1 Scope",
    "X1.1.1 This test method covers the determination of all the sulfur, except that contained in barium sulfate (BaSO4), in a sample of rubber product or in the fillers obtained from a rubber product. If acid-soluble barium salts, antimony sulfide, or lead compounds are present this method will give erroneous results, in which case the fusion method (Section 32) should be used. The method may be used for the determination of combined plus inorganic sulfur on an extracted sample, total sulfur on an",
    "for the determination of combined plus inorganic sulfur on an extracted sample, total sulfur on an unextracted sample, or inorganic sulfur in the ash from Section 33, subject to the conditions stated above. If it is and because the constants in the formula may not be correct for the particular spectrophotometer. Any results in which this range is greater than 2 % should be considered suspect from the standpoint of interferences.",
    "NOTE 21—The fraction of styrene-containing copolymers in the sample may not always be known, but can usually be estimated with sufficient accuracy. For samples where the fraction of styrene-containing copolymers is not known but where the percentage of bound styrene in the copolymer in the sample is approximately known, an equally accurate final value for percentage of bound styrene may be obtained as follows:",
    "Calculate S1, S2, and S3 with the assumption that Y = 1. Calculate values for Y based on these apparent bound styrene percentages and recalculate S1, S2, and S3.",
    "57.9 *Precision:*33\n57.9.1 These precision data are based on tests of 3 samples tested by 7 laboratories. The range of samples studied was from about 7 to 14 % bound styrene. Precision is expressed in relative terms (2S %, D2S %).\n\n57.9.2 *Repeatability (Single-Operator)—*The repeatability has been estimated to be 63.5 % (2S % ) of a determination.\n\nTwo test results should be considered acceptable if their difference does not exceed 5.0 % (D2S %) of their average.",
    "57.9.3 *Reproducibility (Multilaboratory)—*The reproducibility has been estimated to be 68.7 % (2S %) of a determination. Two test results should be considered acceptable if their difference does not exceed 12 % (D2S %) of their average.\n\n## 58. Identification Of Rubbers By Instrumental Methods",
    "## 58. Identification Of Rubbers By Instrumental Methods\n\n58.1 *Gas Chromatography of Pyrolysis Products—*Analysis of rubbers (raw, cured compounded stock, or finished products) is possible by a combination of pyrolysis and gas chromatography. This technique can be found in Practice D3452.",
    "58.2 *Infrared—*Analysis of rubbers (raw, cured compounded stock, or finished products) is possible by infrared techniques, using pyrolyzates or films. This technique, confined to single rubbers and some blends, can be found in Test Methods D3677.",
    "used for determination of combined plus inorganic sulfur, it must also be used for determination of inorganic sulfur. It shall not be used for determination of total sulfur in compounds containing barium sulfate. The method is applicable to NR, SBR, BR, IR, and CR products and to total sulfur determination in NBR products.\n\n## X1.2 Reagents:",
    "## X1.2 Reagents:\n\nX1.2.1 *Barium Chloride Solution* (100 g BaCl2·2H2O/\ndm3)—Dissolve 100 g of barium chloride (BaCl2·2H2O) in water, add 2 to 3 drops of HCl, and dilute to 1 dm3. If there is",
    "any insoluble matter or cloudiness, heat the solution overnight on a steam bath and filter.\nX1.2.2 Bromine, Saturated Water Solution. X1.2.3 Nitric Acid, Fuming. X1.2.4 Picric Acid, Saturated Solution.\nX1.2.5 *Potassium Chlorate* (KClO3).\nX1.2.6 *Zinc-Nitric Acid Solution—*See 30.2.3.\nX1.3 Procedure: X1.3.1 Place 0.5 g of soft rubber or 0.2 g of hard rubber",
    "X1.3 Procedure: X1.3.1 Place 0.5 g of soft rubber or 0.2 g of hard rubber\n(extract the specimen with acetone (Section 19) or acetonechloroform mixture (Section 21) if organic sulfur is to be determined) in a 500-cm3 Erlenmeyer destruction flask of chemically resistant material.7,10 Add 10 cm3 of Zn-HNO3\nsolution and moisten the sample thoroughly. Let stand at least 1 h; overnight if convenient. By so doing, the sample becomes partly decomposed; this permits the addition of fuming HNO3",
    "with no danger of ignition of the sample. Add 15 cm3 of fuming HNO3 and swirl the flask rapidly to keep the sample immersed and avoid ignition. With some samples it may be necessary to cool the flask under running water.",
    "X1.3.2 When the dissolution of the rubber appears to be complete, add 5 cm3 of a saturated water solution of bromine and slowly evaporate the mixture to a foamy syrup. (For the determination of sulfur in unvulcanized mixtures use 3 cm3 of bromine in place of bromine water.)",
    "X1.3.3 If organic matter or carbon remains at this point, add a few cubic centimetres of fuming HNO3 and a few crystals of KClO3 (**Caution**) and evaporate by boiling. Repeat this operation until all carbon is gone and the solution is clear, colorless, or light yellow.",
    "## X2. Qualitative Scheme For Identification Of Rubber Polymers X2.1 Scope\n\nX2.1.1 Appendix X234 contains a semiroutine qualitative scheme with confirmatory tests for identification of rubber in rubber products by spot tests of pyrolysis products.",
    "X2.1.2 This scheme is for use in the identification of IR, CR, NR, IIR, NBR, and SBR type rubber polymers when each is present alone as a rubber or in a rubber product. Use of the scheme on mixtures of rubber polymers is not recommended unless the validity of the test has been confirmed on known mixtures.\n\n## X2.2 Terminology\n\nX2.2.1 Definition:\nX2.2.1.1 *rubber polymer—*the characteristic and major component of crude natural or synthetic rubber.\n\n## X2.3 Identification For Pyrolysis Products",
    "X2.3.1 Apparatus:\nX1.3.4 At this point either of the following procedures may be used:",
    "X1.3.4.1 *Procedure A—*Place the flask on a wire gauze and evaporate the mixture to dryness over a Tirrill burner. Then bake the mixture at the highest temperature of the burner until all nitrates are decomposed and no more nitrogen oxide fumes can be detected. The flask and its contents must be carefully annealed after this procedure by gradually decreasing the flame or by placing the flask on successively cooler sources of heat.",
    "X1.3.4.2 *Procedure B—*Evaporate the mixture, cool, add 10\ncm3 of HCl, and evaporate to dryness, avoiding spattering.\n\nRepeat this procedure once, or more than once if oxides of nitrogen are still evolved.",
    "X1.3.5 Cool the flask, add 50 cm3 of HCl (1 + 6), and digest, hot, until dissolution is as complete as possible. Filter while hot. Wash the filter and dilute the filtrate and washings to about 300 cm3. Add 10 cm3 of saturated picric acid solution, heat to 90°C, and precipitate the sulfate by dropwise addition of 10 cm3 of BaCl2 solution, while stirring vigorously. Place a watch glass over the beaker and digest the precipitate overnight, preferably at 60 to 80°C. Filter the BaSO4 and wash with",
    "and digest the precipitate overnight, preferably at 60 to 80°C. Filter the BaSO4 and wash with water until the filter is colorless. Dry, ash, and finally ignite the precipitate, at 650 to 900°C, with free access to air. Cool in a desiccator and weigh to constant mass.",
    "X1.4\nCalculation—Calculate the percentage of sulfur as follows:\n\nSulfur, % = [($A\\times0.1373$)/$B$] $\\times$ 100 (X1.1)\nwhere:\nA\n= grams of BaSO4, and B\n= grams of specimen used.\n\nX2.3.1.1 *Distillation Apparatus—*Test tubes, 10 by 75-mm, equipped with a glass condensing tube about 4 mm in outside diameter attached to the test tube by means of a cork stopper.\n\nThe condensing tube shall be bent at least 90 deg and shall extend about 100 mm beyond the bend.",
    "The condensing tube shall be bent at least 90 deg and shall extend about 100 mm beyond the bend.\n\nX2.3.1.2 *Receiver—*Test tubes, 10 by 75-mm, for collecting distillate.\n\nX2.3.1.3 *Test Tubes,* 16 by 150-mm.",
    "X2.3.1.3 *Test Tubes,* 16 by 150-mm.\n\nX2.3.2 Reagents: X2.3.2.1 Solution I—Dissolve\n1.0\ng of p-dimethylaminobenzaldehyde and 0.01 g of hydroquinone in\n100 cm3 of absolute methanol. Add 5 cm3 of HCl and 10 cm3\nof ethylene glycol. Adjust the density to 0.851 Mg/m3 at\n25/4°C by the addition of a calculated amount of methanol or ethylene glycol. The reagent is stable over a period of several months when stored in a brown bottle.",
    "X2.3.2.2 *Solution II—*Dissolve 2.00 g of sodium citrate\n(2Na3C6H5O7·11H2O), 0.2 g of citric acid, 0.03 g of bromocresol green, and 0.03 g of Metanil yellow in 500 cm3 of water.\n\nX2.3.3 *Procedure—*Strip the rubber from any adhering fabric. Place 0.5 g of the sample in a test tube and attach the side",
    "Rubber Polymer\nSolution I\nSolution\nII\nInitial Color\nColor after Heating\nColor\nBlank\npale yellow\npale yellow\ngreen\nCR\nyellow\npale yellow\nred\nNBR\norange red\nred\ngreen\nSBR\nyellow green\ngreen\ngreen\nNR or IR\nbrown\nviolet blue\ngreen\nIIR\nyellow (droplet\nfloats)\npale blue green\ngreen",
    "arm. Heat with a microburner or very small Bunsen flame until the sample begins to decompose. When vapors appear at the mouth of the side arm, immerse the end beneath the surface of",
    "1.3 cm3 of Solution II contained in the receiver test tube. After it is evident whether a color change will take place or not, remove the tube and continue the distillation into 1.3 cm3 of Solution I in another test tube. Permit the receivers to cool, and shake. Note whether the drops sink or float in Solution I and note the color changes in both solutions. Transfer Solution I to a 16- to 150-mm test tube and add 5 cm3 of absolute methanol.",
    "Heat on a water bath at 100°C for 3 min and note the color that develops. Record all observations, and classify the material by means of Table X2.1.\n\n## X2.4 Identification By Spot Tests\n\nX2.4.1 Reagents:\nX2.4.1.1 *CR-NBR Spot Test Papers—*Dissolve 2.0 g of cupric acetate and 0.25 g of Metanil yellow in 500 cm3 of methanol. Impregnate filter paper squares with the solution, dry, and cut into strips.",
    "X2.4.1.2 *CR-NBR Wetting Solution—*Dissolve 2.5 g of benzidene dihydrochloride in a mixture of 500 cm3 of methanol and 500 cm3 of water. Add 10 cm3 of an aqueous solution of hydroquinone (0.1). Store in a brown bottle.\n\nNOTE X2.1—A precipitate, which usually forms on standing, does not affect the efficiency of the solution. If the solution is protected from light and air, it can be used for several months.\n\nX2.4.1.3 *IIR Spot Test Papers—*Use blank filter paper strips.",
    "X2.4.1.3 *IIR Spot Test Papers—*Use blank filter paper strips.\n\nX2.4.1.4 *IIR Wetting Solution—*Add 5.0 g of yellow mercuric oxide (HgO) to a mixture of 15 cm3 of H2SO4 and 80 cm3\nof water. Bring to a boil, and continue heating until the oxide dissolves. Cool and dilute to 100 cm3 with water.\n\nX2.4.1.5 *SBR-NR-IR Spot Test Papers—*Impregnate filter paper squares with a solution of\n3\ng of p-dimethylaminobenzaldehyde and 0.05 g of hydroquinone in\n100 cm3 of ethyl ether. Dry and cut into strips.",
    "NOTE X2.2—Papers stored in brown glass bottles are stable for several weeks but will lose their efficiency if stored in light.",
    "X2.4.1.6 *SBR-NR-IR Wetting Solution—*Dissolve 30 g of trichloroacetic acid in isopropanol and dilute to 100 cm3 with isopropanol. (**Warning—**Avoid contact of this reagent with the skin.)\nX2.4.2 Procedure:\nX2.4.2.1 Wet a strip of each type of spot test paper with the corresponding wetting solution and hold each in turn in a parallel position about 5 mm above the surface of a heating",
    "Rubber Polymer\nCR-NBR Test\nIIR Test\nSBR-NR-IR Test\nCR\nred\nblankA\ngreen\nNBR\ngreen\npale brown\nyellow-green\nSBR\nblankA\nbrown\nblue-green\nNR or IR\nblankA\nbrown\nblue\nIIR\nblankA\nyellow\npale lavender\nA Blank color tests may be pale brown rather than colorless.\n\nelement that is pressed against the sample. Record the colors obtained and classify the sample by means of Table X2.2.",
    "X2.4.2.2 The heating element may be an electrically-heated knife or iron or an iron or file tip heated by a flame. It should be hot enough to cause dense fumes of pyrolysis product to be produced but not sufficiently hot to ignite the rubber. With vigorous evolution of fumes, a test may be carried out in 4 to 6 s. Care should be taken to obtain a good color response on the side facing the fumes without scorching the paper or the impregnating materials.\n\n## X2.5 Confirmatory Tests",
    "## X2.5 Confirmatory Tests\n\nX2.5.1 Reagents:\nX2.5.1.1 Acetone. X2.5.1.2 Bromine. X2.5.1.3 Chloroform. X2.5.1.4 Ethyl Ether.\n\nX2.5.1.5 β*-Naphthol in Sodium Hydroxide* (50 g/dm3).\n\nX2.5.1.6 *Iodine Solution,* containing 0.2 g of iodine/dm3 of CCl4.\n\nX2.5.1.7 *Petroleum Ether,* boiling range 40 to 60°C. X2.5.1.8 Phenol.\n\nX2.5.1.9 *Sodium Hydroxide Solution* (50 g/cm3).\n\nX2.5.1.10 *Sodium Hydroxide Solution* (200 g/dm3).\n\nX2.5.1.11 *Sodium Nitrite Solution* (18 g NaNO2/dm3).",
    "X2.5.1.11 *Sodium Nitrite Solution* (18 g NaNO2/dm3).\n\nX2.5.1.12 *Zinc,* granulated. X2.5.2 *Procedure—*Confirm the identification of rubber polymer made by pyrolysis products or spot tests by means of the following confirmatory tests:\nX2.5.2.1 *CR—*Shake a 0.2-g sample with 2 cm3 of iodine solution. If the violet color fades noticeably in 2 to 3 min, CR is indicated. Burn the sample in contact with a clean copper wire. A persistent green flame indicates chlorine.",
    "X2.5.2.2 SBR-NR-IR:\na) Asphaltic extenders may interfere with distinguishing between SBR and NR or IR by the pyrolysis test.\n\nb) If 2 cm3 of chloroform show an appreciable darkening when shaken with a 0.2-g sample of vulcanized rubber product, extract a fresh sample with chloroform in accordance with\n20.4, dry the extracted sample in a vacuum oven for 1 h at 70°C, and repeat the pyrolysis test.",
    "c) If 2 cm3 of acetone show an appreciable darkening when shaken with a 0.2-g sample of rubber or unvulcanized rubber product, extract a fresh sample with acetone in accordance with\n19.4 or 26.3, dry the extracted sample in a vacuum oven for 1\nh at 70°C, and repeat the pyrolysis test.",
    "X2.5.2.3 *NR-IR—*Extract a fresh portion of the sample with acetone in accordance with 19.4 or 26.3. Place a few milligrams of the extracted sample in a small evaporating dish and swell it in a little CHCl3. Add a few drops of bromine and let stand for about 2 min. Add about 1 g of phenol and warm on a steam bath to remove the CHCl3. A blue to red-violet color indicates NR or IR.",
    "X2.5.2.4 *SBR—*Boil 1 to 2 g of dried, acetone-extracted sample (19.4) under reflux with 20 cm3 of HNO3 for 1 h. Dilute by pouring into 100 cm3 of water. Extract with 50, 25, and\n25-cm3 portions of ethyl ether. Combine the ether extracts and wash twice with 15-cm3 portions of water, discarding the water washings. Extract the ether solution with three 15-cm3 portions of NaOH solution (50 g/dm2) and finally with 20 cm3 of water.",
    "Discard the ether. Combine the caustic extracts and water washing, make just acid with HCl, and add 20 cm3 in excess.\n\nHeat on a steam bath and reduce the nitrobenzoic acid by adding 5 g of granulated zinc. Make the solution alkaline with a NaOH solution (200 g/dm3), adding sufficient excess to just dissolve the precipitate that forms. Extract twice with ether and discard the ether. Make the aqueous solution acid with HCl, cool to room temperature, and add 2 cm3 of NaNO2 solution.",
    "Pour this diazotized solution into an excess of solution of\nβ-naphthol in NaOH. A vivid scarlet color indicates SBR.\n\nX2.5.2.5 IIR:\n(1) Destructive distillation of IIR yields a white vapor difficult to condense. A light yellow mobile oil may be obtained.",
    "ASTM International takes no position respecting the validity of any patent rights asserted in connection with any item mentioned in this standard. Users of this standard are expressly advised that determination of the validity of any such patent rights, and the risk of infringement of such rights, are entirely their own responsibility.",
    "This standard is subject to revision at any time by the responsible technical committee and must be reviewed every five years and if not revised, either reapproved or withdrawn. Your comments are invited either for revision of this standard or for additional standards and should be addressed to ASTM International Headquarters. Your comments will receive careful consideration at a meeting of the responsible technical committee, which you may attend. If you feel that your comments have not",
    "the responsible technical committee, which you may attend. If you feel that your comments have not received a fair hearing you should make your views known to the ASTM Committee on Standards, at the address shown below.",
    "This standard is copyrighted by ASTM International, 100 Barr Harbor Drive, PO Box C700, West Conshohocken, PA 19428-2959, United States. Individual reprints (single or multiple copies) of this standard may be obtained by contacting ASTM at the above address or at 610-832-9585 (phone), 610-832-9555 (fax), or service@astm.org (e-mail); or through the ASTM website (www.astm.org). Permission rights to photocopy the standard may also be secured from the Copyright Clearance Center, 222 Rosewood",
    "to photocopy the standard may also be secured from the Copyright Clearance Center, 222 Rosewood Drive, Danvers, MA 01923, Tel: (978) 646-2600; http://www.copyright.com/",
    "(2) Place about 1 g of dried, acetone-extracted sample in a test tube provided with a stopper and a bent delivery tube passing through a stopper almost to the bottom of a second test tube having a side arm. Cool the second tube with ice. By means of a delivery tube, connect the side arm of the second test tube to a small open test tube containing 0.5 g of mercuric acetate in 10 to 15 cm3 of methanol. Heat the rubber strongly so that it is virtually all decomposed and distilled off. Discard the",
    "Heat the rubber strongly so that it is virtually all decomposed and distilled off. Discard the liquid that collects in the second test tube. Evaporate the methanol from the third tube but do not heat excessively toward the end of the evaporation. Boil the residue with 25 cm3",
    "of petroleum ether and filter from insoluble matter. Evaporate the filtrate to a small volume, chill in ice, and scratch the sides of the vessel to induce crystallization. Dry the mercury derivative at 30 to 40°C and determine the melting point (about 55°C). Carry out a mixed melting point determination with the mercury derivative made from known IIR. The derivative is thought to be methoxyisobutyl-mercuriacetate,",
    "\\begin{tabular}{l c c}  & CH${}_{3}$ & CH${}_{2}$-Hg-COOCH${}_{3}$ \\\\ CH${}_{3}$O & CH${}_{3}$ & CH${}_{2}$-Hg-COOCH${}_{3}$ \\\\ \\end{tabular}"
  ]
}