{
  "source": "ASTM D573 2004 R2019.md",
  "chunks": [
    "# Designation: D573 −04 (Reapproved 2019) Standard Test Method For Rubber—Deterioration In An Air Oven1\n\nThis standard is issued under the fixed designation D573; the number immediately following the designation indicates the year of original adoption or, in the case of revision, the year of last revision. A number in parentheses indicates the year of last reapproval. A\nsuperscript epsilon (´) indicates an editorial change since the last revision or reapproval.",
    "This standard has been approved for use by agencies of the U.S. Department of Defense.\n\n## 1. Scope\n\n1.1 This test method covers a procedure to determine the influence of elevated temperature on the physical properties of vulcanized rubber. The results of this test method may not give an exact correlation with service performance since performance conditions vary widely. This test method may, however, be used to evaluate rubber compounds on a laboratory comparison basis.",
    "1.2 The values stated in SI units are to be regarded as the standard. The values given in parentheses are for information only.\n\n1.3 This standard does not purport to address all of the safety concerns, if any, associated with its use. It is the responsibility of the user of this standard to establish appropriate safety, health, and environmental practices and determine the applicability of regulatory limitations prior to use.",
    "(For specific precautionary statement, see Note 1.)\n1.4 This international standard was developed in accordance with internationally recognized principles on standardization established in the Decision on Principles for the Development of International Standards, Guides and Recommendations issued by the World Trade Organization Technical Barriers to Trade (TBT) Committee.\n\n## 2. Referenced Documents",
    "2.1 *ASTM Standards:*2\nD15 Method of Compound and Sample Preparation for\nPhysical Testing of Rubber Products (Withdrawn 1975)3\nD412 Test Methods for Vulcanized Rubber and Thermoplastic Elastomers—Tension\nD1349 Practice for Rubber—Standard Conditions for Testing\nD3182 Practice for Rubber—Materials, Equipment, and Procedures for Mixing Standard Compounds and Preparing Standard Vulcanized Sheets\nD3183 Practice for Rubber—Preparation of Pieces for Test\nPurposes from Products",
    "D3183 Practice for Rubber—Preparation of Pieces for Test\nPurposes from Products\nD3184 Practice for Rubber—Evaluation of NR (Natural\nRubber)\nD3185 Test Methods for Rubber—Evaluation of SBR\n(Styrene-Butadiene Rubber) Including Mixtures With Oil\nD4483 Practice for Evaluating Precision for Test Method\nStandards in the Rubber and Carbon Black Manufacturing Industries\nE145 Specification for Gravity-Convection and Forced-\nVentilation Ovens",
    "## 3. Summary Of Test Method\n\n3.1 Specimens of vulcanized rubber are exposed to the deteriorating influence of air at specified elevated temperatures for known periods of time, after which their physical properties are determined. These are compared with the properties determined on the original specimens and the changes noted.\n\n3.2 Unless otherwise specified, the determination of the physical properties shall be carried out in accordance with Test Methods D412.",
    "3.3 Except as may be otherwise specified in this test method, the requirements of Practices D3182 and D3183 shall be complied with and are made part of this test method.\n\n3.4 In case of conflict between the provisions of this test method and those of detailed specifications or test methods for a particular material, the latter shall take precedence.\n\n## 4. Significance And Use",
    "## 4. Significance And Use\n\n4.1 Rubber and rubber products must resist the deterioration of physical properties with time caused by oxidative and thermal aging. This test method provides a way to assess these performance characteristics of rubber, under certain accelerated conditions as specified.\n\n4.2 Please refer to Annex A1 for important information on standard compounds used for precision testing for accelerated test aging evaluation.\n\n## 5. Apparatus",
    "## 5. Apparatus\n\n5.1 Type IIB ovens specified in Test Method E145 are satisfactory for use through 70°C. For higher temperatures, Type IIA ovens are necessary.\n\n5.1.1 The interior size shall be as follows or of an equivalent volume:\n\nInterior size of air oven:\nmin\n300 by 300 by 300 mm (12 by 12 by 12 in.)\nmax\n900 by 900 by 1200 mm (36 by 36 by 48 in.)\n\n5.1.2 Provision shall be made for suspending specimens vertically without touching each other or the sides of the aging chamber.",
    "5.1.3 The heating medium for the aging chamber shall be air circulated within it at atmospheric pressure.\n\n5.1.4 The source of heat is optional but shall be located in the air supply outside of the aging chamber proper.",
    "5.1.5 The temperature should be automatically recorded over the entire test period using a temperature-measuring device capable of measuring at the specified temperature to within 61°C. Located in the upper central portion of the chamber near the center of the aging specimens. For apparatus not equipped with automatic recording capabilities, temperature shall be measured with sufficient frequency to ascertain that the temperature limits specified in 10.2 are adhered to.",
    "5.1.6 Automatic temperature control by means of thermostatic regulation shall be used.\n\n5.1.7 The following special precautions shall be taken in order that accurate, uniform heating is obtained in all parts of the aging chamber:\n5.1.7.1 The heated air shall be thoroughly circulated in the oven by means of mechanical agitation. When a motor-driven fan is used, the air must not come in contact with the fan motor brush discharge because of danger of ozone formation.",
    "5.1.7.2 Baffles shall be used as required to prevent local overheating and dead spots.\n\n5.1.7.3 The thermostatic control device shall be so located as to give accurate temperature control of the heating medium. The preferred location is adjacent to the recording thermometer.\n\n5.1.7.4 An actual check shall be made by means of maximum reading thermometers placed in various parts of the oven to verify the uniformity of the heating.\n\n## 6. Sampling",
    "## 6. Sampling\n\n6.1 The sample size shall be sufficient to allow for the determination of the original properties on three specimens and also on three or more specimens for each exposure period of the test. At least 24 h must elapse between completion of the vulcanization of the samples and the start of the aging test.",
    "6.2 When minimum requirements are specified, one test on three dumbbells shall be considered sufficient. But if the results are below the specified requirements, two additional specimens shall be prepared from the original sample and tested. Should the results of either of these tests be below the specified requirements, the sample shall be considered to have failed to meet the specifications.\n\n## 7. Test Specimens",
    "## 7. Test Specimens\n\n7.1 Dumbbell-shaped specimens prepared as described in Test Methods D412 shall be considered standard. Their form shall be such that no mechanical, chemical, or heat treatment will be required after exposure. If any adjustments (for example, to thickness) are necessary, they should be performed prior to exposure.",
    "7.2 The cross-sectional dimensions of test specimens for calculating the physical properties shall be measured prior to exposure in the aging chamber. Gage lines used for measuring elongation shall be applied after the specimens have been aged. Only specimens of similar dimensions having approximately the same exposed areas may be compared with each other.\n\n## 8. Number Of Test Specimens",
    "## 8. Number Of Test Specimens\n\n8.1 At least three test specimens shall be used to determine the original physical properties of each sample and also three or more specimens of the same material for each exposure period of the test.",
    "8.2 When minimum requirements are specified, one test shall be made for tensile strength and elongation. If the results are below the specified requirements, two additional specimens shall be prepared from the original sample and tested. Should the results of either of these tests be below the specified requirements, the samples shall be considered to have failed to meet the specifications.\n\n## 9. Tests Of Unaged Specimens",
    "## 9. Tests Of Unaged Specimens\n\n9.1 The stress-strain properties or tensile strength and ultimate elongation and any other required properties of the original unaged specimens shall be determined within 96 h of the start of the aging period. Results on specimens that are found to be imperfect shall be discarded and retests shall be made.",
    "9.2 When rubber compounds are to be tested for the purpose of determining compliance with specifications, it shall be permissible to determine the original properties required in 9.1\nsimultaneously with the determination of the values after the first aging period even though the elapsed time exceeds 96 h.\n\n## 10. Procedure For Accelerated Aging",
    "## 10. Procedure For Accelerated Aging\n\n10.1 Place the specimens for aging in the oven after it has been preheated to the operating temperature. If possible, avoid simultaneous aging of a mixed group of different compounds. For instance, high-sulfur compounds should not be aged with low-sulfur compounds and those containing antioxidants shall not be aged with those having no antioxidants. Some migration is known to occur.",
    "10.2 The operating temperature may be any elevated standard temperature as shown in Practice D1349, as agreed upon.\n\n10.3 Start the aging interval at the time the specimens are placed in the oven and continue for a measured time interval.\n\nThe selection of suitable intervals of aging will depend on the rate of deterioration of the particular material being tested. Intervals frequently used are 3, 7, and 14 days.",
    "10.4 Use aging intervals such that the deterioration will not be so great as to prevent determination of the final physical properties. In experimental work, it is desirable to use a range of periods, while for routine tests of known materials, fewer intervals may be employed.",
    "10.5 At the termination of the aging interval, remove the specimens from the oven, cool to room temperature on a flat surface, and allow them to rest not less than 16 h nor more than 96 h before determination of the physical properties. Apply the gage lines to the specimens for use in measuring elongations.\n\n## 11. Physical Tests Of Aged Specimens",
    "11.1 The tensile strength and ultimate elongation or the stress-strain properties of the specimens aged for different intervals shall be determined as the intervals terminate in the progress of aging, disregarding the fact that more specimens may still be aging. In determining the physical properties after aging, the final values shall be the median of results from three specimens except that under the following conditions two additional specimens shall be exposed and tested and the median of",
    "the following conditions two additional specimens shall be exposed and tested and the median of the values for the five specimens shall be used:",
    "11.1.1 If one or more values do not meet the specified requirements when testing for compliance with specifications.",
    "11.1.2 If referee tests are being made. After completion of the tests, the broken specimens shall be examined visually and manually and their condition noted.\n\n## 12. Calculation\n\n12.1 Express the results of the aging test as a percentage of the change in each physical property (tensile strength, ultimate elongation, or tensile stress), calculated as follows:\n\n$P=[(A-O)/O]\\times100$ (1)\nwhere:\nP\n= percentage change in property, O\n= original value, and A\n= value after aging.\n\n## 13. Report",
    "## 13. Report\n\n13.1 Report the following information:\n13.1.1 The results calculated in accordance with Section 12,\n13.1.2 All observed and recorded data on which the calculations are based,\n13.1.3 Type of aging test, 13.1.4 Aging interval, 13.1.5 Aging temperature, 13.1.6 Duration, temperature, and data of vulcanization of\nthe rubber, if known,\n13.1.7 Dates of original and final determinations of physical\nproperties, and\n13.1.8 Dimensions of test specimens.",
    "Material or\nCompound\nMean Test\nLevel\nWithin\nLaboratories\nBetween\nLaboratories\nSr\nr\nSR\nR\nNR (1G)\n−56.6\n3.28\n9.28\n5.91\n16.7\nSBR (9B)\n−14.2\n3.42\n9.68\n3.02\n8.55\nNBR (1F)\n−11.5\n2.46\n6.96\n2.49\n7.05\nCR (2D)\n−10.6\n3.83\n10.8\n5.11\n14.5\nOESBR (10B3)\n−7.6\n2.34\n6.62\n5.56\n15.7\nIIR (2E)\n−1.1\n3.47\n9.82\n3.77\n10.7\nPooled Values\n...\n3.18\n9.00\n3.90\n11.04\n\nPart 2—Percent Change in Elongation, Average of 48, 96 h Aging",
    "| NR (1G)       | −55.6   |   5.08 |   14.4 |   7.79 |   22.0 |\n|---------------|---------|--------|--------|--------|--------|\n| SBR (9B)      | −48.3   |   5.38 |  15.2  |   6.09 |   17.2 |\n| OESBR (10B3)  | −40.5   |   3.2  |   9.06 |   5.11 |   14.5 |\n| NBR (1F)      | −39.6   |   7.1  |  20.1  |   7.11 |   20.1 |\n| CR (2D)       | −12.1   |   7.85 |  22.2  |   9    |   25.5 |\n| IIR (2E)      | −6.2    |   2.56 |   7.24 |   3.97 |   11.2 |",
    "| IIR (2E)      | −6.2    |   2.56 |   7.24 |   3.97 |   11.2 |\n| Pooled Values | ...     |   5.2  |  14.7  |   6.51 |   18.4 |",
    "NOTE 1—The averaging of results for 48 and 96 h of aging gives an increased DF estimate of precision.\n\nNOTE 2—\nSr = within laboratory standard deviation r = repeatability (in measurement units) (r) = repeatability (in percent) SR = between laboratory standard deviation R = reproducibility (in measurement units) (R) = reproducibility (in percent)\n\n## 14. Precision And Bias4",
    "## 14. Precision And Bias4\n\n14.1 This precision and bias section has been prepared in accordance with Practice D4483. Refer to this practice for terminology and other statistical calculation details.",
    "14.2 A Type 2 (interlaboratory) precision was evaluated in\n1974. Both repeatability and reproducibility are short term, a period of a few days separates replicate test results. A test result is expressed on the basis of a median value, as specified by Test Methods D412 obtained on three determinations or measurements of the property or parameter in question.",
    "14.3 Six different materials were used in the interlaboratory program, these were tested in three laboratories on two different days. These precision results were obtained for a variety of compounds prepared in accordance with Methods D15 prior to its removal from the Annual Book of ASTM\nStandards. Please see Annex A1 for more details on this work.",
    "14.4 The results of the precision calculations for repeatability and reproducibility for both percent tensile strength change and percent elongation change are given in Table 1, in ascending order of material average or level, for each of the materials evaluated.",
    "14.4.1 The precision of this test method may be expressed in the format of the following statements that use an appropriate value of *r, R, (r)*, or (R), that is, that value to be used in decisions about test results (obtained with the test method). The *appropriate value* is that value of r or R associated with a mean level in the precision tables closest to the mean level under consideration at any given time, for any given material in routine testing operation.",
    "14.5 *Repeatability—*The repeatability, r, of this test method has been established as the *appropriate value* tabulated in the precision tables. Two single test results, obtained under normal test method procedures, that differ by more than this tabulated r (for any given level) must be considered as derived from different or non-identical sample populations.",
    "14.6 *Reproducibility—*The reproducibility, R, of this test method has been established as the *appropriate value* tabulated in the precision tables. Two single test results obtained in two different laboratories, under normal test method procedures, that differ by more than the tabulated R (for any given level)\nmust be considered to have come from different or nonidentical sample populations.",
    "14.7 The precision results indicate that the repeatability and reproducibility of both percent tensile strength change and\n\n## Annex (Mandatory Information) A1. Former Test Method (D15) Compounds Used For Precision Testing A1.1 Introduction",
    "A1.1.1 Testing to develop precision data was begun by some Subcommittees in D11 prior to the removal of Methods D15, Compound and Sample Preparation for Physical Testing of Rubber Products. In this initial precision work, some of the standard compounds that were currently included in Methods D15 were used. Since that time, these standard Methods D15 compounds have been either modified or removed from the Annual Book of ASTM Standards. They were replaced by a series of new standards, for",
    "from the Annual Book of ASTM Standards. They were replaced by a series of new standards, for example, Test Methods D3184 on NR, Test Methods D3185 on SBR, and so forth.",
    "--`,```,````,,`,,`,,``,,,``,```,-`-`,,`,,`,`,,`---\nA1.1.2 To provide a source of reference for the compounds removed from Methods D15, those compounds used in measuring precision, especially those used in Subcommittee D11.15, are included in Tables A1.1-A1.6 taken directly from Methods D15. These tables are listed below.",
    "A1.1.3 The formulations for the compounds in Tables A1.1-A1.6 are placed in this test method temporarily. This test method is selected as a location since it is the most frequently used standard test for evaluating compounds for accelerated aging performance.\n\n## A1.2 Cure Times For Compounds",
    "## A1.2 Cure Times For Compounds\n\nA1.2.1 The cure times for compounds selected in the D11.15 precision testing are as follows:\npercent elongation change are essentially the same. Also the value of r or R, or both, does not vary with the magnitude of percent elongation or percent tensile strength change. No values are given for (r) or (R) because of the near zero average values for some of the materials.",
    "14.8 *Bias—*In test method terminology, bias is the difference between an average test value and the reference (or true) test property value. Reference values do not exist for this test method since the value (of the test property) is exclusively defined by the test method. Bias, therefore, cannot be determined.\n\n## 15. Keywords\n\n15.1 accelerated aging; elevated temperature; oxidative aging; rubber articles; rubber products; thermal aging",
    "|                            | Time,   | Temper-   |\n|----------------------------|---------|-----------|\n| Compound                   | min,    | ature,° C |\n| Polychloroprene (neoprene) | 30      | 150       |\n| Natural (1G)               | 30      | 145       |\n| SBR (9B)                   | 50      | 145       |\n| OE–SBR (10B3)              | 50      | 145       |\n| Butyl (2E)                 | 80      | 150       |\n| NBR (1F)                   | 40      | 150       |",
    "## A1.3 Materials And Mixing\n\nA1.3.1 In the precision test programs that generated Type 2\nPrecision data for D11.15 standards, that is, that precision which includes compound weighing, mixing, and curing components of variation, a special testing procedure was employed.",
    "A common supply was set up for all the materials needed to prepare compounds in accordance with the tables of this Annex. All laboratories that participated in any interlaboratory program drew their materials from this common uniform supply; thus the within-materials source of variation was reduced to the lowest possible (practical) level.",
    "A1.3.2 Mixes of the selected compounds were made on specified days (2 days normally being selected) to determine within-laboratory variability as specified in Practice D4483.\n\n| NBS           |   9B |\n|---------------|------|\n| SBR or OE-SBR |  100 |\n| Zinc oxide    |  370 |\n| Stearic acid  |  372 |\n| Sulfur        |  371 |\n| Furnace black |      |\n| A             |      |\n| 378           |   50 |\n| TBBS          |  384 |\n| 156.75        |      |\n| Batch factor  |    3 |",
    "A Current Industry Reference Black (IRB) may be used in place of NBS 378, although slightly different results may be obtained. Weigh ingredients to nearest 0.1 g for SBR and carbon black and to the nearest 0.01 g for other ingredients.",
    "| Material      |    NBS |\n|---------------|--------|\n| 10B1 Non-OE   |        |\n| Rubbers       |        |\n| 10B2 25-Oil   |        |\n| Rubbers       |        |\n| 10B3 37.5-Oil |        |\n| Rubbers       |        |\n| 10B4 50-Oil   |        |\n| Rubbers       |        |\n| 10B5 62.5-Oil |        |\n| Rubbers       |        |\n| 10B6 75-Oil   |        |\n| Rubbers       |        |\n| SBR           | 100    |\n| OE-SBR        | 125    |\n| Zinc oxide    | 370    |\n| Stearic acid  | 372    |",
    "| OE-SBR        | 125    |\n| Zinc oxide    | 370    |\n| Stearic acid  | 372    |\n| Sulfur        | 371    |\n| Furnace black |        |\n| A             |        |\n| 378           |  50    |\n| TBBS          | 384    |\n| 156.75        | 195.94 |",
    "A Current Industry Reference Black (IRB) may be used in place of NBS 378, although slightly different results may be obtained.\n\nMaterial\nNBS Standard\nSample No.\nID\n2D\nNeoprene W\n...\n100\n100\nMagnesium oxide\n376\n4\n4\nStearic acid\n372\n0.5\n1\nSRF carbon black\n382\n...\n29\nZinc oxide\n370\n5\n5\n2-Mercaptoimidazoline\n...\n0.35\n0.5\nPhenyl beta naphthylamine\n377\n2\n2\nSpecific gravity (calculated)\n1.29\n1.39\n\nA For mill mixing, use 3 × recipe weight.",
    "A For mill mixing, use 3 × recipe weight.\n\nMaterial\nNBS Standard\nSample No.\nIE\n2E\n3E\nButyl rubber\n388\n100\n100\n100\nZinc oxide\n370\n5\n5\n3\nSulfur\n371\n2\n2\n1.75\nStearic acid\n372\n...\n3\n1\nBenzothiazyl disulfide\n373\n...\n0.5\n...\nTetramethyl thiuram-disulfide\n374\n1\n1\n1\nChannel black\n375\n...\n50\n...\nOil furnace black (HAF type)\n378B\n...\n...\n50\nSpecific gravity (calculated)\n0.97\n1.12\n1.13",
    "A For mill mixing, use 2 × recipe weight. B IRB or Industry Reference Black may be used as a suitable alternative, but the same results may not be obtained.\n\nMaterial\nNBS Standard\nSample No.\nIG\nNatural rubberA\n...\n100.00\nStearic acid\n372\n3.00\nZinc oxide\n370\n5.00\nBenzothiazyl disulfide\n373\n0.60\nSulfur\n371\n2.50\nCarbon black\n...\n50.00B\nSpecific gravity (calculated)\n1.13",
    "A Available from the Firestone Tire and Rubber Co. Specially selected Liberian crepe with 600 % modulus of 700 ± 100 psi when tested in compound 1A.\n\nB For all carbon blacks except FT and MT. For those blacks where 75 parts are used, the calculated specific gravity is 1.19.\n\nMaterial\nNBS Standard\nSample No.\nIF\nNitrile rubber\n391\n100\nZinc oxide\n370\n5\nSulfur\n371\n1.5\nStearic acid\n372\n1\nBenzothiazyl disulfide\n373\n1\nGas furnace black\n382\n40\nSpecific gravity (calculated)\n1.18",
    "ASTM International takes no position respecting the validity of any patent rights asserted in connection with any item mentioned in this standard. Users of this standard are expressly advised that determination of the validity of any such patent rights, and the risk of infringement of such rights, are entirely their own responsibility.",
    "This standard is subject to revision at any time by the responsible technical committee and must be reviewed every five years and if not revised, either reapproved or withdrawn. Your comments are invited either for revision of this standard or for additional standards and should be addressed to ASTM International Headquarters. Your comments will receive careful consideration at a meeting of the responsible technical committee, which you may attend. If you feel that your comments have not",
    "the responsible technical committee, which you may attend. If you feel that your comments have not received a fair hearing you should make your views known to the ASTM Committee on Standards, at the address shown below.",
    "This standard is copyrighted by ASTM International, 100 Barr Harbor Drive, PO Box C700, West Conshohocken, PA 19428-2959, United States. Individual reprints (single or multiple copies) of this standard may be obtained by contacting ASTM at the above address or at 610-832-9585 (phone), 610-832-9555 (fax), or service@astm.org (e-mail); or through the ASTM website (www.astm.org). Permission rights to photocopy the standard may also be secured from the Copyright Clearance Center, 222 Rosewood",
    "to photocopy the standard may also be secured from the Copyright Clearance Center, 222 Rosewood Drive, Danvers, MA 01923, Tel: (978) 646-2600; http://www.copyright.com/"
  ]
}