{
  "source": "DO-334对照.md",
  "chunks": [
    "RTCA, Inc. \n\nRTCA公司 \n1150 18th Street, NW, Suite 910 \n西北18街1150号,910套房 \nWashington, DC 20036 \n华盛顿特区20036 \n\n# Minimum Operational Performance Standards (Mops) For 最低操作性能标准(Mops) Strapdown Attitude And Heading Reference Systems\n\n## (Ahrs) 捷联姿态与航向基准系统\n\n \n \nPrepared by: SC-219 \nRTCA DO-334 RTCA DO-334 \n编制人:SC-219 \n© 2012 RTCA, Inc. \n\nMarch 21, 2012 2012年3月21日 \n©2012 RTCA公司 \n\nCopies of this document may be obtained from \n本文件的副本可从以下地址获得 \n\nRTCA, Inc.",
    "Copies of this document may be obtained from \n本文件的副本可从以下地址获得 \n\nRTCA, Inc. \n\nRTCA公司 \nTelephone: 202-833-9339 \n电话:202-833-9339 \nFacsimile: 202-833-9434 \nInternet: www.rtca.org \n传真:202-833-9434互\n联网: www.rtca.org \n \nPlease visit the RTCA Online Store for document pricing and ordering information. \n\n有关文档定价和订购信息,请访问RTCA在线商店。 \n\nThis report was prepared by Special Committee 219 (SC-219) and approved by the RTCA Program Management Committee (PMC) on March 21, 2012.",
    "本报告由特别委员会219(SC-219)编制,并于2012年3月21日由RTCA计划管理委员会(PMC)\n批准。",
    "RTCA, Incorporated is a not-for-profit corporation formed to advance the art and science of aviation and aviation electronic systems for the benefit of the public. The organization functions as a Federal advisory committee, and develops consensus-based recommendations on contemporary aviation issues. RTCA's objectives include but are not limited to: \nRTCA,Incorporated是一家非盈利性公司,旨在促进航空和航空电子系统的艺术和科学,以造福 公众。该组织是一个联邦咨询委员会,就当代航空问题提出基于共识的建议。RTCA的目标包括但\n不限于:",
    " \ncoalescing aviation system user and provider technical requirements in a manner that helps government and industry meet their mutual objectives and responsibilities; \n \n结合航空系统用户和供应商的技术要求,以帮助政府和行业实现其共同目标和责任; \n \n \nanalyzing and recommending solutions to the system technical issues that aviation faces as it continues to pursue increased safety, system capacity and efficiency; \n \n分析并推荐解决方案,以解决航空业在不断提高安全性、系统容量和效率的过程中所\n面临的系统技术问题; \n \n",
    " \n分析并推荐解决方案,以解决航空业在不断提高安全性、系统容量和效率的过程中所\n面临的系统技术问题; \n \n \ndeveloping consensus on the application of pertinent technology to fulfill user and provider requirements, including development of minimum operational performance standards for electronic systems and equipment that support aviation; and \n \n就相关技术的应用达成共识,以满足用户和供应商的要求,包括为支持航空的电子\n系统和设备制定最低操作性能标准;和 \n \n",
    " \n就相关技术的应用达成共识,以满足用户和供应商的要求,包括为支持航空的电子\n系统和设备制定最低操作性能标准;和 \n \n \nassisting in developing the appropriate technical material upon which positions for the International Civil Aviation Organization and the International Telecommunication Union and other appropriate international organizations can be based. \n \n协助编制适当的技术材料,作为国际民用航空组织、国际电信联盟和其他适当国际组\n织的职位基础。",
    " \n协助编制适当的技术材料,作为国际民用航空组织、国际电信联盟和其他适当国际组\n织的职位基础。 \n \nThe organization's recommendations are often used as the basis for government and private sector decisions as well as the foundation for many Federal Aviation Administration Technical Standard Orders and several advisory circulars.",
    "该组织的建议经常被用作政府和私营部门决策的基础,以及许多联邦航空管理局技术标准命令和\n一些咨询通告的基础。 \n\n \nSince RTCA is not an official agency of the United States Government, its recommendations may not be regarded as statements of official government policy unless so enunciated by the U.S. government organization or agency having statutory jurisdiction over any matters to which the recommendations relate. \n\n由于RTCA不是美国政府的官方机构,其建议不得被视为政府官方政策的声明,除非由对建议所涉\n及的任何事项具有法定管辖权的美国政府组织或机构宣布。 \n\n \n \nThis Page Intentionally Left Blank \n本页特意留空",
    "This Page Intentionally Left Blank \n本页特意留空 \n\n \n \nThis Page Intentionally Left Blank \n本页特意留空 \n\n## 1.0 Purpose And Scope 目的和范围 1.1 Introduction 介绍",
    "This document contains minimum operational performance standards for Strapdown Attitude and Heading Reference Systems (AHRS). This document is intended for equipment that does not use gimbaled sensors. This document is intended for equipment that outputs attitude (pitch and roll). It also addresses functions of heading, turn, slip, and the display of this information. This document does not specify the format of data outputs. These standards specify equipment characteristics that should be",
    "the format of data outputs. These standards specify equipment characteristics that should be useful to designers, manufacturers, installers and users of the equipment.",
    "本文件包含捷联姿态和航向基准系统(AHRS)的最低操作性能标准。本文件适用于不使用万向架传感 器的设备。本文件适用于输出姿态(俯仰和滚转)的设备。它还解决了航向、转弯、侧滑的功能以及 这些信息的显示。本文件未规定数据输出的格式。这些标准规定了对设备的设计者、制造商、安装者\n和使用者有用的设备特性。 \n\nCompliance with these standards is recommended as one means of assuring that the equipment will perform its intended function(s) satisfactorily under all conditions normally encountered in routine aeronautical operation. Any regulatory application of this document is the sole responsibility of appropriate governmental agencies.",
    "建议将符合这些标准作为确保设备在日常航空操作中通常遇到的所有条件下令人满意地执行其预期功\n能的一种手段。本文件的任何监管应用均由适当的政府机构全权负责。",
    "Section 1.0 of this document provides information needed to understand the rationale for equipment characteristics and requirements stated in the remaining sections. It describes typical equipment applications and operation goals, as envisioned by the members of Special Committee 219, and establishes the basis for the standards stated in Sections 2.0 through 3.0. Definitions and assumptions essential to proper understanding of this document are also provided in this section.",
    "部分 1.0  提供了理解其余章节中所述设备特性和要求的基本原理所需的信息。它描述了219特别委\n员会成员所设想的典型设备应用和操作目标,并为章节中所述的标准建立了基础。 2.0 通过 3.0. \n\n本节还提供了正确理解本文件所必需的定义和假设。 \n\n \nSection 2.0 contains the minimum performance standards for the equipment. These standards specify the required performance under standard and environmental conditions. Also included are recommended laboratory and manufacturer flight evaluation procedures necessary to demonstrate equipment compliance with the stated minimum requirements.",
    "部分 2.0 包含设备的最低性能标准。这些标准规定了在标准和环境条件下所需的性能。还包括推荐\n的实验室和制造商飞行评估程序,以证明设备符合规定的最低要求。 \n\n \nSection 3.0 describes the performance required of the installed equipment. Tests for the installed equipment \nare included when performance cannot be adequately determined through laboratory testing. \n部分 3.0  描述已安装设备所需的性能。当无法通过实验室测试充分确定性能时,包括对已安装设备\n的测试。 \n \nAppendix A discusses demonstrating equipment performance using simulation in lieu of flight evaluation. 附录A讨论了使用模拟代替飞行评估来演示设备性能。",
    "This document considers an equipment configuration consisting of an Attitude and Heading Reference Unit (AHRU) with complementary peripheral equipment specified by the AHRS manufacturer. \n\n本文件考虑了由姿态与航向基准装置(AHRU)和AHRS制造商规定的辅助外围设备组成的设备配置。 \n \nOperation performance standards for functions or components that refer to equipment capabilities that exceed the stated minimum requirements are identified as optional features. 超过规定最低要求的设备功能或部件的操作性能标准被确定为可选功能。",
    "The word \"equipment\" as used in this document includes all components and units necessary for the system to properly perform its intended function(s). For example, the \"equipment\" may include an AHRU, an associated mounting tray, and a magnetic sensing unit. In the case of this example, all of the foregoing components and units comprise the \"equipment.\" It should not be inferred from this example that each AHRS equipment design will necessarily include all of the foregoing components or units.",
    "that each AHRS equipment design will necessarily include all of the foregoing components or units. This will depend on the specific design chosen by the manufacturer.",
    "本文件中使用的\"设备\"一词包括系统正确执行其预期功能所需的所有部件和单元。例如,\"设备\"可以 包括AHRU、相关联的安装托盘和磁感测单元。在该示例的情况下,所有前述部件和单元构成\"设备\"。\n不应从该示例中推断出每个AHRS设备设计将必须包括所有前述部件或单元。这将取决于制造商选择的\n具体设计。 \n© 2012 RTCA, Inc. \n\n©2012 RTCA公司 \n\n## 1.2 System Overview 系统概述\n\nAs shown in Figure 1-1, the AHRS system may consist of: 如图1-1所示,AHRS系统可包括: \n\n \n\n## 1.2.1 Attitude And Heading Reference Unit (Ahru) 姿态航向基准装置(Ahru)\n\nThe AHRU includes: AHRU包括:",
    "The AHRU includes: AHRU包括: \n\n \nInertial sensing unit which includes a series of angular rate sensors, \naccelerometers and/or \ninclinometers. 惯性感测单元,其包括一系列角速率传感器、加速计和/或倾斜计。 \n \nElectronics package that processes the sensor data into a usable output format. \n将传感器数据处理为可用输出格式的电子组件。 \n \nIntegral power supply assembly. 整体式电源组件。 \n \nMechanical housing, in which the above components are embedded, which is \n\"strapped down\" \n(not gimbaled) to an aircraft frame. 机械外壳,上述部件嵌入其中,\"捆绑\"(而不是万向节)到飞机框架上。",
    "## 1.2.2 Magnetic Sensing Unit (Msu) 磁传感单元(Msu)\n\n \n1.2.3 \nOption(s): 选项: \n \n \nMounting tray to assist in precision alignment to aircraft axis 安装托盘有助于与飞机轴线精确对准 \n \nMemory device(s) which preserve critical alignment data, as well as other \ninformation \n保存关键对准数据以及其他信息的存储器设备 \n \nInstallation hardware, connectors, fasteners, etc. 安装硬件、连接器、紧固件等 \n \n1.2.4 \nComplementary aiding devices: \n补充辅助设备: \n \n \nAir data 大气数据 \n \nGPS 全球定位系统 \n \nEtc. 等等。 \n© 2012 RTCA, Inc. ©2012 RTCA公司",
    "## Aircraft Power 飞机动力 1.3 Operational Applications(S) 操作应用程序\n\nOne or more AHRS may be used on an aircraft to supply attitude and heading information to the pilots of the aircraft to aid them with the control and guidance of the aircraft. \n\n可以在飞行器上使用一个或多个AHR来向飞行器的飞行员提供姿态和航向信息,以帮助他们控制和引\n导飞行器。",
    "可以在飞行器上使用一个或多个AHR来向飞行器的飞行员提供姿态和航向信息,以帮助他们控制和引\n导飞行器。 \n\n \nThe AHRS may be used to supply attitude and heading, and other information such as angular rates and accelerations to autopilots or stability augmentation equipment on the aircraft. AHRS可用于向飞机上的自动驾驶仪或增稳设备提供姿态和航向以及其他信息,如角速率和加速度。",
    "Information from the AHRS may be used by other equipment on the aircraft to control their functions. For example, attitude and heading information may be used in an antenna pointing system. \n飞机上的其他设备可以使用来自AHRS的信息来控制它们的功能。例如,可以在天线指向系统中使用姿\n态和航向信息。",
    "This document does not define the intended function for the AHRS, and instead requires that the AHRS manufacturer provide performance data to support installation. Thus, the 本文件未定义AHRS的预期功能,而是要求AHRS制造商提供性能数据以支持安装。因此, onus is placed on the installer to define the intended use of AHRS, determine appropriate performance requirements, and establish that the AHRS complies with those requirements. For example, instead of defining attitude accuracy classes based on functions such as primary attitude",
    "example, instead of defining attitude accuracy classes based on functions such as primary attitude indicator, secondary attitude indicator, or attitude stabilization device, the document defines five attitude accuracy categories with no definition of the intended use of each of these accuracy levels. As a result, the installation of AHRS will require installation-specific certification and review for each project.",
    "安装人员有责任定义AHRS的预期用途,确定适当的性能要求,并确定AHRS符合这些要求。例如,不是 基于诸如主要姿态指示器、次要姿态指示器或姿态稳定装置的功能来定义姿态精度等级,该文件定义 了五个姿态精度类别,而没有定义这些精度级别中的每一个的预期用途。因此,AHRS的安装将需要对\n每个项目进行特定的安装认证和审查。 \n\n## 1.4 Required Functions 所需功能 1.4.1 Attitude 态度\n\nThe attitude from the AHRS is the common aircraft pitch and roll information needed to control the aircraft.",
    "For a more thorough understanding of the required availability and integrity of this function, consult with the aircraft Functional Hazard Assessment (FHA) for the intended application. \n\n来自AHRS的姿态是控制飞机所需的通用飞机俯仰和滚转信息。为了更彻底地了解该功能所需的可用性\n和完整性,请咨询飞机功能危害评估(FHA)以了解其预期用途。 \n\n \nThe attitude requirements are found in Section 2.2.2. 姿态要求见第节 2.2.2. \n\n## 1.5 Optional Functions 可选功能 1.5.1 Heading 航向",
    "## 1.5 Optional Functions 可选功能 1.5.1 Heading 航向\n\n \nHeading from the AHRS, magnetic or non-magnetic, is the common information used by pilots to determine the direction the aircraft is pointing. 来自AHRS的航向(磁性或非磁性)是飞行员用来确定飞机指向的常用信息。 \n\n \nThe heading requirements are found in Section 2.2.3. 标题要求见第节 2.2.3. \n\n \n\n## 1.5.2 Turn And Slip 转弯打滑",
    "## 1.5.2 Turn And Slip 转弯打滑\n\n \nThe turn and slip functions provide the rate and the coordination (slip or skid) of the turn. The AHRS turn and slip performance requirements are provided in Section 2.2.5. \n\n转弯和打滑功能提供了转弯的速度和协调(打滑或打滑)。AHRS转弯和打滑性能要求在第节中提供 \n2.2.5 . \n\n## 1.5.3 Other Functions 其他功能\n\n \nThe AHRS may also provide angular rates and linear accelerations, but these functions are not addressed in this document. \n\nAHRS还可提供角速率和线性加速度,但这些功能在本文件中未提及。 \n\n \n\n## 1.6 Operational Goals 运营目标",
    "The goal of the AHRS is to provide attitude, and optionally heading, turn, standard turn bank angle, slip, angular rate, acceleration, and other information. This information is used to enable a pilot, autopilot or other equipment in the aircraft to control and guide the aircraft in a safe manner. The accuracy requirements of the outputs depend on the application. Different accuracy categories have been specified to help in distinguishing AHRS of different capabilities.",
    "AHRS的目标是提供姿态和可选的航向、转弯、标准转弯倾斜角、滑转、角速率、加速度和其他信息。 该信息用于使飞行员、自动驾驶仪或飞行器中的其他设备能够以安全的方式控制和引导飞行器。输出\n的精度要求取决于应用。已经指定了不同的精度类别,以帮助区分不同能力的航姿系统。 \nSome equipment may be capable of generating heading without a Magnetic Sensor Unit (MSU). Some equipment may only be capable of providing magnetic heading when operating with an MSU. Categories for these and other capabilities are specified. \n\n一些设备可能能够在没有磁传感器单元(MSU)的情况下生成航向。某些设备可能仅在与MSU一起运行\n时才能提供磁航向。指定了这些和其他功能的类别。 \n \n© 2012 RTCA, Inc. ©2012 RTCA公司",
    "## 1.7 Ahrs Categories Ahrs类别 1.7.1 Modes Of Operation 操作模式\n\nAn AHRS system may have multiple modes of operation. The equipment will be categorized in accordance with the functions and accuracy that it provides in each of these modes. The manufacturer will declare the performance category for each operating mode (except degraded modes) using a six-characteralphanumeric string as denoted in Table 2-1, Table 2-2, and Table 2-3. Requirements for degraded modes are specified in Section 2.2.4.",
    "AHRS系统可以具有多种操作模式。设备将根据其在每种模式下提供的功能和精度进行分类。制造商将 使用中所示的六个字符的字母数字字符串来声明每个操作模式(降级模式除外)的性能类别 表2-1, \n表2-2, 和 表2-3。 降级模式的要求在第节中规定 2.2.4. \n\n## 1.7.2 Category Strings 类别字符串",
    "The first two characters of a category string are reserved for the mode's attitude performance. The third and fourth characters of a category string are reserved for the mode's heading performance and availability. The fifth and sixth characters of a category string are reserved for the mode's turn and slip availability. An AHRS will have one or more category strings, each associated with an operating mode. An example of an AHRS with four available operating modes is shown in Table 1-1. Each",
    "mode. An example of an AHRS with four available operating modes is shown in Table 1-1. Each operating mode has its own category string.",
    "类别字符串的前两个字符保留用于模式的姿态性能。类别字符串的第三和第四个字符是为模式的标题 性能和可用性保留的。类别字符串的第五个和第六个字符是为模式的转向和滑移可用性保留的。AHRS 将具有一个或多个类别字符串,每个类别字符串与一个操作模式相关联。具有四种可用操作模式的\nAHRS示例如所示 表1-1。 每个操作模式都有自己的类别字符串。 \n\n## 表1-1 Ahrs类别字符串示例",
    "Category String 类别字符串 \nMode Description 模式说明 \nAttitude \nHeading \nTurn and \nCategory \nCategory \nSlip \nCategory \n态度类别 \n标题类别 \n转弯和打\n滑类别 \nA3 \nH3 \nT3 \nMode 1: Attitude static accuracy of 0.5° is provided. Magnetic slaving is used to provide 1.5° static heading accuracy. Both turn rate and slip outputs are provided. 模式1:提供0.5°的姿态静态精度。磁伺服用于提供1.5°的静 态航向精度。同时提供转数和转差率输出。 \nA3 \nH8 \nT3",
    "A3 \nH8 \nT3 \nMode 2: Attitude static accuracy of 0.5° is provided. DG mode is provided with 5° drift in one hour. Both turn rate and slip outputs are provided. 模式2:提供0.5°的姿态静态精度。DG模式在一小时内提供5° 漂移。同时提供转数和转差率输出。 \nA4 \nH4 \nT3 \nMode 3: Attitude static accuracy of 1.0° is provided. Magnetic slaving is used to provide 2.0° static heading accuracy. Both turn rate and slip outputs are provided. 模式3:提供1.0°的姿态静态精度。磁从动用于提供2.0°静态 航向精度。同时提供转数和转差率输出。 \nA4 \nHX \nTX \n德克萨\n斯州 \n赫 克\n斯",
    "A4 \nHX \nTX \n德克萨\n斯州 \n赫 克\n斯 \nMode 4: Attitude static accuracy of 1.0° is provided. Heading, turn rate, standard turn bank angle, and slip outputs are not provided. 模式4:提供1.0°的姿态静态精度。不提供航向、转弯率、标 准转弯倾斜角和滑动输出。",
    "## 1.8 Test Procedures 测试程序",
    "The test procedures specified in this document are intended to be used as one means of demonstrating compliance with the applicable performance requirements. Although specific test procedures are cited, it is recognized that other equivalent methods may be acceptable. Alternate procedures may be used if they provide at least equivalent information. In such cases, the procedures cited herein should be used as one criterion in evaluating the acceptability of the alternate procedures.",
    "本文件中规定的测试程序旨在用作证明符合适用性能要求的一种方法。虽然引用了具体的试验程序, 但应认识到其他等效方法也是可以接受的。如果至少提供同等信息,则可以使用替代程序。在这种情\n况下,本文引用的程序应作为评估替代程序可接受性的一个标准。 \n\nThe order of tests specified suggests that the equipment be subjected to a succession of tests as it moves from design, and design qualification, into operational use. For example, compliance with the requirements of Section 2.0 will have been demonstrated as a precondition to satisfactory completion of the installed system tests of Section 3.0.",
    "规定的试验顺序表明,当设备从设计和设计鉴定进入操作使用时,应进行一系列试验。例如,遵守第\n节的要求 2.0 将被证明是圆满完成第节安装系统测试的前提条件 3.0. \n\n \n1. \nEnvironmental Tests 环境测试 \n \nEnvironmental test requirements are specified in Section 2.3. The procedures and their associated requirements are intended to provide a laboratory means of determining the electrical and mechanical performance of the equipment under environmental conditions expected to be encountered in actual operations. \n\n环境试验要求见第节 2.3 .该程序及其相关要求旨在提供一种实验室方法,以确定设备在实\n际操作中可能遇到的环境条件下的电气和机械性能。",
    "环境试验要求见第节 2.3 .该程序及其相关要求旨在提供一种实验室方法,以确定设备在实\n际操作中可能遇到的环境条件下的电气和机械性能。 \n\n \nUnless otherwise specified, the environmental conditions and test procedures contained in RTCA/DO-160G (or other version acceptable to the certification authority), Environmental Conditions and Test Procedures for Airborne Equipment, will be used to demonstrate equipment compliance. \n除非另有规定,否则将使用RTCA/DO-160G(或认证机构可接受的其他版本)《机载设备的环\n境条件和测试程序》中包含的环境条件和测试程序来证明设备的符合性。 \n \n\n## 2. Laboratory Tests And Flight Evaluations 实验室试验和飞行评估",
    "## 2. Laboratory Tests And Flight Evaluations 实验室试验和飞行评估\n\n \nLaboratory test and flight evaluation procedures are specified in Section 2.4. These procedures provide a means of demonstrating compliance with the requirements of Section 2.2. Results may be used by equipment manufacturers as design guidance, for monitoring manufacturing compliance and, in certain cases, for obtaining formal approval of equipment design.",
    "实验室试验和飞行评估程序在第 2.4. 这些程序提供了一种证明符合第节要求的方法 2.2.  \n设备制造商可将结果用作设计指南,用于监控制造合规性,在某些情况下,用于获得设备设\n计的正式批准。 \n\n \n\n## 3. Installed Equipment Tests 已安装设备测试\n\n \nThe installed equipment test procedures and their associated limits are specified in Section 3.0. Installed tests are normally performed under two conditions: 第3.0节规定了已安装设备的测试程序及其相关限制。安装测试通常在两种条件下进行:",
    "a. With the aircraft on the ground and using simulated or operational \nsystem inputs. \n飞机在地面上并使用模拟或操作系统输入。 \nb. With the aircraft in flight using operational system inputs appropriate to \nthe equipment \nunder test. 飞机在飞行中使用适合于被测设备的操作系统输入。 \n© 2012 RTCA, Inc. ©2012 RTCA公司 \n\n## 1.9 Definitions Of Terms And Acronyms 术语和缩略语的定义\n\nThe following terms are used in this document: 本文件中使用了以下术语:",
    "Term 期限 \nDefinition 定义 \nAccelerometer 加速计 \nA sensor used to measure acceleration. The inertial acceleration sensed includes both acceleration due to changes in velocity, as well as the acceleration induced by gravity. \n用于测量加速度的传感器。所感测的惯性加速度包括由于速度变化而产生的\n加速度以及由重力引起的加速度。 \nAHRS 航姿系统 \nAttitude and Heading Reference System. Equipment on an aircraft that provides attitude and optionally heading information to other systems on the aircraft. \n姿态航向基准系统。飞机上的设备,用于向飞机上的其他系统提供姿态和航",
    "姿态航向基准系统。飞机上的设备,用于向飞机上的其他系统提供姿态和航\n向信息。 Attitude and Heading Reference Unit. Portion of the AHRS \ncontaining the inertial \nAHRU 阿鲁 \nsensors. 姿态和航向基准装置。包含惯性传感器的AHRS部分。 Source of information derived from barometric source(s) such as air \nspeed, altitude \nAir Data 大气数据 \nand vertical speed. 从气压源(如空速、高度和垂直速度)导出的信息源。 Angular rotation rates. May be measured relative to the aircraft \nbody axes (body \nAngular Rates 角速率 \nrates) or a rate of change of Euler angles. \n角旋转率。可以相对于飞机机身轴线(机身速率)或欧拉角的变化率进行测\n量。",
    "rates) or a rate of change of Euler angles. \n角旋转率。可以相对于飞机机身轴线(机身速率)或欧拉角的变化率进行测\n量。 \nAnnunciation 报喜 \nAn output or indication of a specific event intended for, but not limited to, presentation to the pilot, provided for maintenance purposes, or flight control purposes. \n特定事件的输出或指示,用于但不限于呈现给飞行员,用于维护目的或飞行\n控制目的。 \nAttitude 态度 \nOrientation of the aircraft. Measured by Euler angles relative to local level. In this document attitude refers to pitch and roll angles only.",
    "飞机的方向。通过相对于局部高程的欧拉角测量。在本文件中,姿态仅指俯\n仰角和滚动角。 Linear accelerations expressed in the aircraft body axes. 用机身轴线表示的线性加速度。 \nBody Accelerations 车身加速度 \nBody axes are the mutually orthogonal aircraft longitudinal, lateral \nand vertical \nBody Axes 体轴 \naxes. 机身轴线是相互正交的飞机纵向、横向和垂直轴线。 Angular rotation rates expressed in the body axes of the aircraft. 以飞机机身轴线表示的角旋转速率。 \nBody Rates 身体率 \nLevel of attitude, heading, turn and slip performance and \ncharacteristics that are \nCategory 类别",
    "Level of attitude, heading, turn and slip performance and \ncharacteristics that are \nCategory 类别 \ndenoted by alphanumeric characters. 由字母数字字符表示的姿态、航向、转弯和侧滑性能和特性的水平。 \nDG Mode DG模式",
    "Category 类别 \ndenoted by alphanumeric characters. 由字母数字字符表示的姿态、航向、转弯和侧滑性能和特性的水平。 \nDG Mode DG模式 \nDirectional Gyro Mode. A mode where valid heading output is determined through the use of inertial sensors (i.e., angular rate sensors and accelerometers) without aiding from a magnetic sensing unit. The pilot is provided a means to activate the DG mode, and set or adjust the heading value. For DG mode considerations, see Section 2.2.3.4.",
    "定向陀螺模式。一种模式,其中通过使用惯性传感器(即,角速率传感器和 加速计)来确定有效航向输出,而无需磁传感单元的帮助。为飞行员提供激 活DG模式并设置或调整航向值的方法。有关DG模式的注意事项,请参见第节 \n2.2.3.4.",
    "This term is defined by the test conditions specified within this document. \n\n该术语由本文件中规定的测试条件定义。 \n\n## Dynamic Condition 动态条件\n\n \n© 2012 RTCA, Inc. \n\n©2012 RTCA公司",
    "Term \n期限 \nDefinition \n定义 \nEuler Angles 欧拉角 \nEuler angles are three angles introduced by Leonhard Euler to describe the orientation of a rigid body such as an aircraft. Euler angles define the attitude and heading of an aircraft in terms of a series of three rotations from a north-pointing \nlocal level coordinate system to the aircraft body coordinate system. The rotations",
    "local level coordinate system to the aircraft body coordinate system. The rotations \nconsist of: heading rotation about the normal (down) axis; pitch rotation about the lateral axis; and roll rotation about the longitudinal axis. 欧拉角是莱昂哈德·欧拉(Leonhard Euler)引入的三个角,用于描述刚体\n(如飞机)的方向。欧拉角根据从北向局部水平坐标系到飞机机身坐标系的 一系列三个旋转来定义飞机的姿态和航向。旋转包括:绕正常(向下)轴的\n航向旋转;绕横轴的俯仰旋转;和绕纵向轴线的滚转。 Rate of change of the pitch, roll, and heading Euler angles. 俯仰、滚转和航向欧拉角的变化率。 \nEuler Rates 欧拉率 External Aiding 外部援助",
    "Euler Rates 欧拉率 External Aiding 外部援助 \nAny source of information provided from a system external to the AHRS inertial system or function. Potential external aiding sources include air data, MSU data \nand GPS data. \n从AHRS惯性系统或功能外部的系统提供的任何信息源。潜在的外部辅助来源\n包括大气数据、MSU数据和GPS数据。 \ng \nThe local acceleration due to local gravity and Earth's centripetal \nacceleration, \ncommonly used as a unit of acceleration measurement. \n由于局部重力和地球的向心加速度而产生的局部加速度,通常用作加速度测\n量的单位。 \nGPS 全球定位系统",
    "由于局部重力和地球的向心加速度而产生的局部加速度,通常用作加速度测\n量的单位。 \nGPS 全球定位系统 \nGlobal Positioning System. In this document, GPS is often utilized as an example of an external source of navigation information. In most cases, the examples would apply to any GNSS (Global Navigation Satellite System) or other satellite-based aid used to augment AHRS performance. \n全球定位系统。在该文献中,GPS经常被用作导航信息的外部源的示例。在 大多数情况下,这些示例将适用于任何GNSS(全球导航卫星系统)或用于增\n强AHRS性能的其他基于卫星的辅助设备。 A method of navigation in polar regions frequently used by the",
    "强AHRS性能的其他基于卫星的辅助设备。 A method of navigation in polar regions frequently used by the \nmilitary. \n军方经常使用的一种极地导航方法。 \nGrid 格网 Gyrocompassing 陀螺罗盘 \nThe function of determining true heading based on measurements of the direction of the rotation rate of the Earth at the current position. At high latitudes gyrocompassing becomes less accurate as the horizontal component of Earth's rotation rate is reduced. \n根据地球在当前位置的自转速率方向的测量值确定真实航向的功能。在高纬\n度地区,随着地球自转速率的水平分量的减少,陀螺罗盘变得不太精确。 \nGyro 陀螺",
    "根据地球在当前位置的自转速率方向的测量值确定真实航向的功能。在高纬\n度地区,随着地球自转速率的水平分量的减少,陀螺罗盘变得不太精确。 \nGyro 陀螺 \nGyroscope. A device for maintaining or measuring changes to its orientation in inertial space. A strapdown AHRS includes strapdown gyros that measure angular rotation rates about three axes. Strapdown gyros are also called rotation rate sensors. In this document the term gyro refers to any sensor regardless of the sensing technology, not just spinning-mass instruments.",
    "陀螺仪。在惯性空间中保持或测量其方向变化的装置。捷联航姿系统包括测 量绕三个轴的角旋转速率的捷联陀螺仪。捷联陀螺也称为转速传感器。在本 文件中,术语陀螺仪是指任何传感器,而不考虑传感技术,而不仅仅是旋转\n质量仪器。 \nHeading 航向 \nThe relative angle between the projection of the longitudinal axis of the aircraft onto the local level frame and some definition of North, for example either True North or Magnetic North. Heading is positive for angles clockwise from (east of) North. \n飞机纵轴在当地水平面框架上的投影与某一定义的北(例如真北或磁北)之",
    "飞机纵轴在当地水平面框架上的投影与某一定义的北(例如真北或磁北)之\n间的相对角度。从北(东)顺时针方向的角度,航向为正。 A changing heading error, which typically occurs when an AHRS is \nin DG mode. \n航向变化误差,通常发生在AHRS处于DG模式时。 \nHeading Drift 航向漂移 \nInstrument Landing System 仪表着陆系统 \nILS 伊尔斯",
    "Instrument meteorological conditions. 仪器气象条件。 \nIMC \nIMC \n© 2012 RTCA, Inc. \n\n©2012 RTCA公司",
    "Term \n期限 \nDefinition \n定义 \nInstrument flight rules. 仪表飞行规则。 \nIFR 仪表飞行规则 \nA system that produces inertial measurements such as acceleration \nor rotation rate. \n产生惯性测量(如加速度或旋转速率)的系统。 \nInertial System 惯性系统 Local Level 地方一级 \nA reference plane that is level with respect to the gravity vector at the current fixed position. This is the same level reference produced by an inclinometer or bubble level if stationary at the current position. \n相对于当前固定位置的重力矢量水平的参考平面。如果在当前位置静止,这",
    "相对于当前固定位置的重力矢量水平的参考平面。如果在当前位置静止,这\n是由倾斜仪或气泡水准仪产生的相同水平参考。 A device used to measure the magnetic field or flux. Flux detectors used with AHRS are often mechanically gimbaled devices which measure the local horizontal magnetic field. \n用来测量磁场或磁通量的装置。与AHR一起使用的通量检测器通常是测量局\n部水平磁场的机械万向架装置。 \nMagnetic Flux Detector or Flux Valve \n磁通量检测器或磁\n量阀 \nAircraft heading defined relative to Magnetic North. 相对于磁北确定的飞机航向。 \nMagnetic Heading 磁航向 Magnetic North 磁北",
    "Magnetic Heading 磁航向 Magnetic North 磁北 \nThe direction pointed to by an ideal, level magnetic compass in the current location. The direction is defined by the direction of the horizontal (level) component of the Earth's magnetic field at the current location. This can be significantly different than True North. \n理想的水平磁罗盘在当前位置所指向的方向。方向由当前位置的地球磁场的\n水平(水平)分量的方向定义。这可能与真正的北方有很大不同。",
    "In this document \"MSU\" is any device used to sense the local magnetic field such as a magnetometer, a magnetic flux detector, or magnetic flux valve. \n\n在本文中,\" MSU \"是用于感测局部磁场的任何装置,例如磁力计、磁通量检\n测器或磁通量阀。",
    "Magnetic Sensor Unit (MSU) \n磁传感器单元\n(MSU) \nCorrection of the AHRS heading estimate using measurements of \nthe Earth's \nmagnetic field. 使用地球磁场测量值修正AHRS航向估计。 \nMagnetic Slaving 磁性从动 Magnetic Variation 磁变 \nAlso called \"magnetic declination\", is the angle between magnetic north and true north at the current location. Declination is considered positive when magnetic north is east of true north and negative when west. \n也称为\"磁偏角\",是当前位置的磁北和真北之间的角度。当磁北偏东时,磁\n偏角被认为是正的,当磁北偏西时,磁偏角被认为是负的。 \nMode 模式",
    "也称为\"磁偏角\",是当前位置的磁北和真北之间的角度。当磁北偏东时,磁\n偏角被认为是正的,当磁北偏西时,磁偏角被认为是负的。 \nMode 模式 \nA functional state of the AHRS. For example, a mode could be a state where the AHRS is fully aided and provides its highest categories of performance. Any condition which results in a change in performance category triggers a change of mode. A sustained loss of a type of aiding data will typically cause the AHRS to change modes.",
    "AHRS的功能状态。例如,一种模式可以是一种状态,在这种状态下,AHRS得 到充分的帮助,并提供其最高的性能类别。任何导致性能类别变化的条件都 会触发模式变化。一种类型的辅助数据的持续丢失通常会导致AHRS改变模\n式。 \nMust 必须 \nThe term \"must\" in this document is used for items which are requirements, but are invoked by a \"shall\" statement either in this document or some other document (e.g. a regulation). \n本文件中的\"必须\"一词用于要求的项目,但在本文件或其他文件(如法规)\n中由\"必须\"一词引用。 \nPitch 音高",
    "本文件中的\"必须\"一词用于要求的项目,但在本文件或其他文件(如法规)\n中由\"必须\"一词引用。 \nPitch 音高 \nThe angle between local level and the longitudinal axis of the aircraft. It is defined as positive for the nose of the aircraft pointing above local level. \n当地水平面与飞机纵轴之间的夹角。它被定义为飞机机头指向当地高度以上\n的正值。",
    "The square root of the mean of the squares of the original data. 原始数据平方平均值的平方根。",
    "Term \n期限 \nDefinition \n定义 \nRoll 滚动 \nThe angle of rotation about the longitudinal axis of the aircraft. Roll is defined as 0° when the aircraft is upright and the lateral axis is in the level plane. It is defined as positive for the right wing of the aircraft below the left wing. \n绕飞机纵轴旋转的角度。当飞机直立且横轴在水平面内时,滚转定义为0°。\n它被定义为飞机右翼低于左翼的正值。 \nShall 应该",
    "绕飞机纵轴旋转的角度。当飞机直立且横轴在水平面内时,滚转定义为0°。\n它被定义为飞机右翼低于左翼的正值。 \nShall 应该 \nThe term \"shall\" in this document is used to indicate requirements, for items which are requirements, as opposed to \"should\" items which are recommendations. \n本文件中的\"应\"一词用于表示要求,指的是作为要求的项目,而不是作为建\n议的\"应该\"项目。 The \nterm \n\"should\" \nin \nthis \ndocument \nis \nused \nto \ndenote \nShould 应该 \nrecommendations or guidelines that do not constitute a requirement. \n这个 术语 \n\" \"应该\" \" 在中 这 \n文档 \n是 用过的\n \n向 \n表示不构成要求的建议或指南。 \nStandard Turn Bank Angle 标准转弯倾斜角",
    "A bank angle calculated such that if the aircraft is flown in a constant altitude coordinated turn at the present true airspeed and the said calculated bank angle, a standard heading rate of change results. The standard heading rate of change is 180 deg/min by default, but may be selected to be 90 deg/min for higher classes of aircraft. \n\n计算的倾斜角,使得如果飞机以当前真空速和所述计算的倾斜角以恒定高度 协调转弯飞行,则产生标准航向变化率。默认情况下,标准航向变化率为\n180度/分钟,但对于更高级别的飞机,可以选择90度/分钟。",
    "Static Condition 静态条件 \nThis term is defined by the test conditions specified within this document. Static condition is not necessarily equivalent to straight and level flight. \n该术语由本文件中规定的测试条件定义。静止状态不一定等同于直线和水平\n飞行。 Refers to a system that uses direct mounting of sensors (without \ngimbals) to a \nStrapdown 捷联式 \nvehicle. 指的是将传感器(没有万向节)直接安装到车辆上的系统。 An apparent angular rate of the aircraft due to motion over the \nsurface of the \nTransport Rate 运输率",
    "surface of the \nTransport Rate 运输率 \nearth. 由于在地球表面上的运动而产生的飞机的视在角速率。 Aircraft heading defined relative to True North. 相对于正北确定的飞机航向。 \nTrue Heading 真航向 \nThe direction along the earth's surface toward the geographic North \nPole. \n沿地球表面朝向地理北极的方向。 \nTrue North \n真北 Truth Reference 真相参考 \nAn AHRS or navigation system of which heading and attitude outputs are assessed to be more accurate than the unit being tested by a least a factor of two. \n一种AHRS或导航系统,其航向和姿态输出被评估为比正在测试的单元至少精",
    "一种AHRS或导航系统,其航向和姿态输出被评估为比正在测试的单元至少精\n确两倍。 Unless otherwise specified, refers to the local Earth vertical. 除非另有规定,否则指的是当地的地球垂线。 \nVertical Axis 垂直轴 \nStalling speed or minimum steady flight speed at which the airplane \nis controllable \n失速速度或飞机可控的最小稳定飞行速度 \nVs 与 \nStalling speed or minimum steady flight speed in the landing \nconfiguration. \nVso VSO \n着陆构型中的失速速度或最小稳定飞行速度。",
    "## 2.0 Equipment Performance Requirements And Test Procedures 设备性能要求和试验程序 2.1 General Requirements 一般要求\n\nSection 2.1 contains general requirements. There are no associated tests in Section 2.4. Verify these requirements by analysis, inspection, tests, or a combination thereof. \n\n部分 2.1  包含一般要求。第2.4节中没有相关测试。通过分析、检查、测试或其组合来验证这些要\n求。 \n\n \n\n## 2.1.1 Airworthiness 适航性",
    "部分 2.1  包含一般要求。第2.4节中没有相关测试。通过分析、检查、测试或其组合来验证这些要\n求。 \n\n \n\n## 2.1.1 Airworthiness 适航性\n\nIn the design and manufacture of the equipment, the manufacturer **shall** provide for installation so as not to impair the airworthiness of the aircraft. 在设备的设计和制造中,制造商应提供安装,以免影响飞机的适航性。 \n\n \n\n## 2.1.2 Intended Function 预期功能\n\n \nThe equipment **shall** perform its intended function(s), as defined by the manufacturer, and its proper use shall not create a hazard to other users of the National Airspace System.",
    "设备应执行制造商规定的预期功能,其正确使用不应对国家空域系统的其他用户造成危险。 \n\n \n\n## 2.1.3 Fire Protection 防火\n\n \nAll materials used **shall** be self-extinguishing except for small parts (such as knobs, fasteners, seals, grommets and small electrical parts) that would not contribute significantly to the propagation of a fire. \n\n使用的所有材料应为自熄性材料,但不会导致火灾蔓延的小零件(如旋钮、紧固件、密封件、索环和\n小型电气零件)除外。 \n\n \n\n## 2.1.4 Operation Of Controls 控制装置的操作",
    "## 2.1.4 Operation Of Controls 控制装置的操作\n\n \nThe equipment **shall** be designed so that controls intended for use during flight cannot be operated in any \nposition, combination or sequence which would result in a condition detrimental to the reliability of the equipment or operation of the aircraft. \n设备的设计应确保在飞行期间使用的控制装置不能在任何位置、组合或顺序下操作,这将导致对设备\n的可靠性或飞机的操作产生不利影响。 \n \n\n## 2.1.5 Accessibility Of Controls 控件的可访问性",
    "## 2.1.5 Accessibility Of Controls 控件的可访问性\n\n \nControls which do not require adjustment during flight **shall** not be readily accessible to flight personnel. \n在飞行过程中不需要调整的控制装置应不容易被飞行人员接近。 \n \n\n## 2.1.6 Effects Of Test 测试的效果\n\n \nThe equipment **shall** be designed so that the application of specified test procedures **shall** not be detrimental to equipment performance following the application of the tests, except as specifically allowed. 设备的设计应确保规定试验程序的应用不会对试验应用后的设备性能产生不利影响,除非特别允许。",
    "## 2.1.7 Design Assurance 设计保证",
    "The hardware and software **shall** be designed and developed such that the probability of providing hazardously misleading information and the probability of loss of function are acceptable based on the overall allocated attitude and heading reference system integrity and continuity requirements, respectively. These requirements apply when the equipment is in its installed configuration for the most stringent intended application. To demonstrate compliance, it will be necessary to conduct a",
    "most stringent intended application. To demonstrate compliance, it will be necessary to conduct a safety assessment to evaluate the system's implementation against known failure conditions. Different design assurance levels for the various AHRS functions may apply.",
    "硬件和软件的设计和开发应使提供危险误导信息的概率和功能损失的概率分别基于总体分配的姿态和\nThe manufacturer **shall** declare in the installation manual the hardware and software design assurance levels of the equipment. \n\n制造商应在安装手册中声明设备的硬件和软件设计保证等级。 \n\nTo support installation approval, the manufacturer should supply information regarding failure modes and failure probabilities for loss of function, malfunction, annunciated misleading data, and un-annunciated misleading data. \n\n为了支持安装批准,制造商应提供有关功能损失、故障、已通告的误导性数据和未通告的误导性数据\n的故障模式和故障概率的信息。",
    "为了支持安装批准,制造商应提供有关功能损失、故障、已通告的误导性数据和未通告的误导性数据\n的故障模式和故障概率的信息。 \n\n \nThe following two paragraphs define an acceptable means of compliance based on the hazard classification for complex electronic hardware and software. 以下两段根据复杂电子硬件和软件的危险分类定义了可接受的符合性方法。 \n\n## 2.1.7.1 Complex Electronic Hardware Compliance 复杂电子硬件符合性",
    "## 2.1.7.1 Complex Electronic Hardware Compliance 复杂电子硬件符合性\n\nAn acceptable means of compliance is to show that the hardware design assurance level is commensurate with the hazard classification. For complex custom airborne electronic hardware, RTCA/DO-254 (or other version acceptable to the certification authority), Design Assurance Guidance for Airborne Electronic Hardware, provides an acceptable means of compliance.",
    "一种可接受的合规方法是表明硬件设计保证级别与危险分类相当。对于复杂的定制机载电子硬件, RTCA/DO-254(或认证机构可接受的其他版本)《机载电子硬件设计保证指南》提供了一种可接受的\n符合性方法。 \n\n \n\n## 2.1.7.2 Software Compliance 软件合规性",
    "## 2.1.7.2 Software Compliance 软件合规性\n\n \nAn acceptable means of compliance is to show that the software design assurance level is commensurate with the hazard classification. For software, RTCA/DO-178B (or other version acceptable to the certification authority), Software Considerations in Airborne Systems and Equipment Certification, provides an acceptable means for showing that software complies with applicable airworthiness requirements.",
    "一种可接受的符合性方法是表明软件设计保证级别与危险分类相当。对于软件,RTCA/DO-178B(或认 证机构可接受的其他版本)《机载系统和设备认证中的软件考虑》提供了一种可接受的方法,用于证\n明软件符合适用的适航要求。 \n\n \n\n## 2.1.8 Multiple Operating Modes And Performance Categories 多种操作模式和性能类别\n\n \nIf the AHRS implements multiple operating modes (for example, operation with or without an aiding source) \nthe manufacturer **shall** declare the performance category of all modes of operation except any degraded modes whose requirements are defined in Section 2.2.4.",
    "如果AHRS执行多个操作模式(例如,在有或没有辅助源的情况下操作),制造商应声明所有操作模式\n的性能类别,但其要求在第节中定义的任何降级模式除外 2.2.4. \n \nInclusion of degraded modes is not required. A manufacturer may invalidate the data in lieu of providing a degraded mode capability. 不需要包括降级模式。制造商可以使数据无效来代替提供降级模式能力。 \n \nSystem transition from any mode to another **shall** be free from unacceptable transients, discontinuities, and \nadverse interactions with other aircraft systems. \n从任何模式到另一模式的系统过渡应无不可接受的瞬态、不连续性以及与其他飞机系统的不利相互作\n用。",
    "从任何模式到另一模式的系统过渡应无不可接受的瞬态、不连续性以及与其他飞机系统的不利相互作\n用。 \n \nThe manufacturer **shall** conduct testing and/or analysis of each mode to ensure compliance with the performance category standards or degraded mode standard in Section 2.2.4. The installation manual shall \nclearly identify all operating modes and associated equipment performance. \n制造商应对每种模式进行测试和/或分析,以确保符合第节中的性能类别标准或降级模式标准 2.2.4. \n安装手册应明确说明所有操作模式和相关设备性能。",
    "制造商应对每种模式进行测试和/或分析,以确保符合第节中的性能类别标准或降级模式标准 2.2.4. \n安装手册应明确说明所有操作模式和相关设备性能。 \n \nThe following paragraph describes an acceptable method for showing compliance with Section 2.3, Section 2.4.4 or 2.4.8 in place of repeating the test in each mode. \n下一段描述了一种可接受的方法,用于证明符合第节的要求 2.3,  部分 2.4.4  或 2.4.8  而不是\n在每个模式中重复测试。 \n \nVerify performance to a specific environmental test or flight evaluation in the mode where the equipment is",
    "in the most stringent category being certified. While performing the test or evaluation, record all of the equipment's outputs and sensor data. Rerun the test or evaluation in the same mode using the equipment's software and the recorded sensor data. To validate replayed software, verify the results from the replayed data matches the recorded resulting data within the expected processing precision. Next, run",
    "在设备处于最严格认证类别的模式下,验证特定环境试验或飞行评估的性能。执行测试或评估时,记 录设备的所有输出和传感器数据。使用设备软件和记录的传感器数据,在相同模式下重新运行测试或 评估。要验证回放软件,请验证回放数据的结果是否与预期处理精度内的记录结果数据匹配。下一个,\n跑 \n© 2012 RTCA, Inc. ©2012 RTCA公司 \nthe equipment's software in the other modes being certified and verify the outputs comply with its category requirements for the mode being tested or evaluated.",
    "认证其他模式下的设备软件,并验证输出是否符合测试或评估模式的类别要求。 \n\n## 2.1.9 Range Of Operation 操作范围\n\nThe equipment **shall** be designed to operate and output pitch, roll and heading data through all attitudes and headings. 设备应设计为通过所有姿态和航向操作和输出俯仰、滚转和航向数据。",
    "Operational limits on the angular rates, linear accelerations or other parameters of the equipment **shall** be specified by the manufacturer. The AHRS **shall** be designed to continuously output data without invalidating the outputs up to at least ± 70 deg/sec angular rates in each axis, at least ± 2 g body axis longitudinal and lateral acceleration, and at least ± 4 g body axis normal acceleration.",
    "设备的角速率、线性加速度或其他参数的操作限制应由制造商规定。AHRS应设计为连续输出数据,而\n不会使输出无效,每个轴上的角速率至少为±70度/秒,体轴纵向和横向加速度至少为±2 G,体轴法\n向加速度至少为±4 G. \n\n \nNote: The foregoing functional requirement does not impose a performance requirement over the operating range of the equipment. Performance requirements are specified in Section 2.2. \n\n注:上述功能要求并未对设备的工作范围提出性能要求。性能要求在第节中规定 2.2. \n\n \n\n## 2.1.10 Magnetic Field Strength 磁场强度",
    "Unless otherwise specified, the tests within this standard using MSU input should be made with a total magnetic field strength between 0.20 Gauss and 0.55 Gauss, and with a magnetic field inclination within either the range of +30° to +70° or the range of -30° to - 70°. If testing is done at different magnetic field strengths or inclinations, the manufacturer **shall** test or perform analysis to show the equipment will meet the requirements for at least one magnetic field condition having",
    "to show the equipment will meet the requirements for at least one magnetic field condition having characteristics as specified above.",
    "除非另有规定,否则本标准中使用MSU输入的试验应在总磁场强度介于0.20高斯和0.55高斯之间,磁\n场倾角在+30°至+70°或-30°至-70°范围内的情况下进行。如果在不同的磁场强度或倾角下进行测试, 制造商应进行测试或分析,以证明设备将满足至少一个具有上述规定特征的磁场条件的要求。",
    "If the test equipment causes magnetic field disturbances that would interfere with obtaining accurate test results, then the magnetic field measurements may be simulated and provided to the equipment under test via a digital communication protocol identical to that used in an actual installed instrument. Such simulated magnetic measurements must properly account for potential errors in the MSU, changes in the measurements due to any motion prescribed by the test, and the worst-case magnetic",
    "changes in the measurements due to any motion prescribed by the test, and the worst-case magnetic measurement errors anticipated in an actual vehicle installation of the equipment.",
    "如果测试设备引起将干扰获得准确测试结果的磁场干扰,则可以模拟磁场测量,并经由与实际安装的 仪器中使用的数字通信协议相同的数字通信协议将磁场测量提供给被测设备。此类模拟磁性测量必须 正确考虑MSU中的潜在误差、由于试验规定的任何运动而导致的测量变化,以及在设备的实际车辆安\n装中预期的最坏情况磁性测量误差。 \n\n \n\n## 2.1.11 Geographical Restrictions 地域限制",
    "## 2.1.11 Geographical Restrictions 地域限制\n\n \nThe manufacturer **shall** specify the geographical limits over which the equipment does not meet the performance requirements of this document. For example, outside of the manufacturer's specified range of latitudes, the heading accuracy of a magnetically slaved AHRS is unlikely to meet its specified performance. \n\n制造商应规定设备不符合本文件性能要求的地理限制。例如,在制造商规定的纬度范围之外,磁从动\nAHRS的航向精度不太可能满足其规定的性能。 \n\n\n## 2.2 Equipment Performance - Standard Conditions 设备性能-标准条件",
    "## 2.2 Equipment Performance - Standard Conditions 设备性能-标准条件\n\n \n\n## 2.2.1 General Requirements 一般要求\n\n \n\n## 2.2.1.1 Conditions 条件\n\n \nThe test conditions are established in Section 2.4.1.1. \n\n© 2012 RTCA, Inc. \n\n©2012 RTCA公司 \n\n## 2.2.1.2 Stationary Starting 静止起动\n\n \nThe equipment **shall** start and provide valid attitude outputs within 3 minutes after normal rated power is applied. \n\n设备应在施加正常额定功率后3分钟内启动并提供有效的姿态输出。",
    "设备应在施加正常额定功率后3分钟内启动并提供有效的姿态输出。 \n\n \nIf applicable, the equipment **shall** start and provide valid turn and slip outputs within 3 minutes after normal rated power is applied. 如适用,设备应在施加正常额定功率后3分钟内启动并提供有效的转向和滑动输出。",
    "For heading category H1, the equipment **shall** start and provide valid heading output within 10 minutes after normal rated power is applied, when operating in latitudes less than ± 60°. The manufacturer **shall** specify the alignment time above ± 60°. 对于航向类别H1,当在小于±60°的纬度运行时,设备应在施加正常额定功率后10分钟内启动并提供有 效的航向输出。制造商应规定±60°以上的对准时间。 \n\n \nFor heading categories H2 through H5, the equipment **shall** start and provide valid heading output within 3 \nminutes after normal rated power is applied.",
    "对于航向类别H2至H5,设备应在施加正常额定功率后3分钟内启动并提供有效航向输出。 \n\n \nFor heading categories H6 through H11 the availability of DG mode heading **shall** be within 5 minutes of startup. 对于航向类别H6至H11,DG模式航向的可用性应在启动后5分钟内。 \n\n \nNote: \n注意:",
    "1. \nMinor aircraft motion resulting from normal wind buffet and servicing of the aircraft, including loading fuel, cargo and passengers, should not significantly influence the ability of the equipment to align or the resulting system accuracy. \n正常风振和飞机维修(包括装载燃料、货物和乘客)导致的较小飞机运动不应显著影响设备\n的对准能力或由此产生的系统精度。 \n2.",
    "正常风振和飞机维修(包括装载燃料、货物和乘客)导致的较小飞机运动不应显著影响设备\n的对准能力或由此产生的系统精度。 \n2. \nAny constraints or limitations associated with equipment alignment should be documented by the equipment manufacturer. Examples of such limitations include required availability of aiding inputs or other conditions under which alignment is not possible or requires additional time. \n设备制造商应记录与设备校准相关的任何约束或限制。这种限制的示例包括辅助输入的所需\n可用性或不可能对准或需要额外时间的其他条件。",
    "## 2.2.1.3 In-Flight Or In-Motion Alignment 飞行中或运动中对准\n\n \nIn-flight or in-motion alignment should be supported. When supported, restrictions on the conditions where in-motion alignment is available and the subsequent performance that is provided **shall** be specified. \n\n应支持飞行中或运动中对准。当支持时,应规定对动态对准可用的条件和所提供的后续性能的限制。 \n\n \n\n## 2.2.1.4 Annunciations 通告",
    "应支持飞行中或运动中对准。当支持时,应规定对动态对准可用的条件和所提供的后续性能的限制。 \n\n \n\n## 2.2.1.4 Annunciations 通告\n\n \nAn appropriate annunciation per the definition in Section 1.9 **shall** be provided when the AHRS detects conditions where it does not meet the highest declared performance category. 根据第节中的定义发出适当的通知 1.9  当AHRS检测到不符合最高声明性能类别的情况时,应提供。 \n\n \nIn addition, each of the following conditions **shall** be adequately annunciated: \n此外,还应充分说明以下每一种情况:",
    "1. \nLoss of attitude, heading, or turn and slip 失去姿态、航向或转弯和滑倒 \n2. \nOperation in a DG mode if a non-DG mode is provided 如果提供非DG模式,则在DG模式下运行 \n3. \nOperation in degraded mode 降级模式下的操作 \nNote: These annunciations may not be required to be displayed to the pilot depending on the intended \n\nfunction of the AHRS. However when data is provided to the pilot for control of the aircraft, the annunciation \nis required. \n注:根据AHRS的预期功能,可能不需要向飞行员显示这些通告。然而,当数据被提供给飞行员以控制\n飞机时,需要通告。",
    "## 2.2.1.5 Output Characteristics 输出特性\n\nThe minimum characteristics may or may not be sufficient for all installations. For example, more stringent requirements may be needed when the AHRS is used to drive an autopilot. \n\n最低特性可能适用于所有安装,也可能不适用于所有安装。例如,当AHRS用于驱动自动驾驶仪时,可\n能需要更严格的要求。 \n\n## 2.2.1.5.1 Output Resolution 输出分辨率",
    "最低特性可能适用于所有安装,也可能不适用于所有安装。例如,当AHRS用于驱动自动驾驶仪时,可\n能需要更严格的要求。 \n\n## 2.2.1.5.1 Output Resolution 输出分辨率\n\nThe resolution of the pitch, roll, and if provided, heading, turn, standard turn bank angle, and slip **shall** be defined by the manufacturer. 俯仰、滚转、航向(如有)、转弯、标准转弯倾斜角和滑动的分辨率应由制造商确定。 \n\n \n\n## 2.2.1.5.2 Update Rate 更新率\n\nThe update rate of the pitch, roll, and if provided, heading, turn, standard turn bank angle, and slip **shall** be a minimum of 10 hertz. 俯仰、滚转、航向(如有)、转弯、标准转弯倾斜角和滑动的更新速率应至少为10赫兹。",
    "## 2.2.1.5.3 Latency 潜伏期\n\nThe latency of the pitch, roll, and if provided, heading, turn, standard turn bank angle, and slip, which is the interval between the motion and the time a measurement is output, **shall** be a maximum of 200 msec. This does not include filter phase delay. \n\n俯仰、滚转、航向(如有)、转弯、标准转弯倾斜角和滑动的等待时间(即运动和输出测量结果的时\n间之间的间隔)最大应为200毫秒。这不包括滤波器相位延迟。 \n\n \n\n## 2.2.1.5.4 Filtering 过滤",
    "## 2.2.1.5.4 Filtering 过滤\n\n \nThe filtering of the pitch, roll, heading, and other output parameters, **shall** be defined by the manufacturer. \n\nThe noise content and resulting phase delay should be considered. 俯仰、滚转、航向和其他输出参数的过滤应由制造商确定。应考虑噪声含量和由此产生的相位延迟。 \n\n \n\n## 2.2.1.5.5 Range 范围",
    "## 2.2.1.5.5 Range 范围\n\n \nThe equipment **shall** be designed to operate through all attitudes and headings. During and subsequent to rotation of the equipment through pitch angles greater than 89° or less than -89° the equipment **shall** continue to function correctly in all regards without need for re-initialization, caging or resetting of the equipment. 设备应设计为在所有姿态和航向下运行。在设备以大于89°或小于-89°的俯仰角旋转期间和之后,设 备应在所有方面继续正常运行,而无需重新初始化、锁定或重置设备。",
    "## 2.2.2 Attitude Performance Requirements 姿态性能要求 2.2.2.1 Equipment Categories 设备类别\n\nThe equipment **shall** be categorized according to attitude accuracy performance as described in Table 2-1. \n\n设备应根据姿态精度性能进行分类,如 表2-1。 \n\nAttitude Accuracy \n \n \n姿态精度 \n \nCategory 类别 \nDynamic and Flight \nStatic Conditions \nConditions \n静态条件 \n动态和飞行条件 \nA1 \n0.1° \n0.2° \nA2 \n0.2° \n0.5° \nA3 \n0.5° \n1.0° \nA4 \n1.0° \n2.5° \nA5 \n1.0° \n2.5° (see note 2) \n2.5°(见注2) \n\nNote: \n注意:",
    "1. \nAll values are either evaluated as maximum (i.e., \"not to exceed\") or 2-RMS values as specified in Sections 2.3 and 2.4. \n所有的值都被评估为最大值(即\"不超过\")或章节中规定的2-均方根值 2.3  和2.4。 \n2. \nCategory A5 equipment flight evaluation pass/fail verification is determined by visual comparison with a truth reference, rather than through data collection with a truth reference and statistical analysis of results (2.5° is a maximum allowable error during flight evaluations). \nA5类设备飞行评估通过/失败验证是通过与真实参考的目视比较来确定的,而不是通过真实",
    "A5类设备飞行评估通过/失败验证是通过与真实参考的目视比较来确定的,而不是通过真实\n参考的数据收集和结果的统计分析来确定的(2.5°是飞行评估期间的最大允许误差)。",
    "## 2.2.2.2 Static Accuracy 静态精度\n\n \nThe equipment **shall** meet the attitude static accuracy limits as defined in Table 2-1 and tested in accordance with Sections 2.3 and 2.4. 设备应满足表2-1中规定的姿态静态精度限制,并根据第节进行测试。 2.3  和2.4。 \n\n \n\n## 2.2.2.3 Dynamic Accuracy 动态精度\n\n \nThe equipment **shall** meet the attitude dynamic and flight accuracy limits as defined in Table 2-1 and tested in accordance with Sections 2.3 and 2.4. \n\n设备应满足表2-1中规定的姿态动态和飞行精度限制,并根据第节进行测试。 2.3  和2.4。",
    "设备应满足表2-1中规定的姿态动态和飞行精度限制,并根据第节进行测试。 2.3  和2.4。 \n\n\n## 2.2.3 Heading Performance Requirements 航向性能要求\n\n \n\n## 2.2.3.1 Equipment Categories 设备类别\n\n \nThe equipment **shall** be categorized according to the source of heading information as described in Table 2-2. \n\n应根据表2-2所述的航向信息来源对设备进行分类。 \n\n## 表2-2平巷性能要求\n\n \n \nHeading Accuracy 航向精度 \n \nSource of Heading \n\n\nDynamic and Flight \nInformation \nStatic Conditions \nConditions \n航向信息源 \nCategory 类别 \n静态条件 \n动态和飞行条件",
    "Non-Magnetic Heading \n1.0° \n2.0° \nH1 \nDetermination (i.e., \nGyrocompassing system) \n非磁性航向测定(即陀螺罗\n盘系统) \n1.0° \n2.0° \nH2 \nMagnetic Slaving \n磁性从动 \n1.5° \n4.0° \nH3 \nMagnetic Slaving \n磁性从动 \n2.0° \n6.0° \nH4 \nMagnetic Slaving \n磁性从动 \n2.0° \n6.0° \nH5 \nMagnetic Slaving \n磁性从动 \n(10° during maneuvers up \nto \n±30° roll. No requirement \noutside ±30° roll.) \n(10°机动直到±30°滚转。\n±30°滚转外无要求。) \n(see Note 2) \n(见注2)",
    "Heading Drift Accuracy, Under Static and \nDynamic and Flight Conditions \n静态、动态和飞行条件下的航向漂移精度 \n2° in 6 hours \nH6 \nDG Mode \nDG模式 \n6小时内2° \n2° in 3 hours \nH7 \nDG Mode \nDG模式 \n3小时内2° \n5° in 1 hour \nH8 \nDG Mode \nDG模式 \n1小时内5° \n30° in 1 hour \nH9 \nDG Mode \nDG模式 \n1小时内30° \n5° in 10 minutes \nH10 \nDG Mode \nDG模式 \n10分钟内5° \n10° in 10 minutes \nH11 \nDG Mode \nDG模式 \n10分钟内10° \nNo heading capability \nn/a \nHX \n赫克\n无航向能力 \n斯 \n\n \n\nNote: \n注意:",
    "Note: \n注意: \n\n1. \nCategories H1 through H4 are evaluated as maximum (i.e., \"not to exceed\") or 2-RMS values as specified in Sections 2.3 and 2.4. \n类别H1至H4评估为最大值(即\"不超过\")或2-均方根值,如第节所述。 2.3  和2.4。 \n2. \nThis equipment flight evaluation pass/fail verification is determined by visual comparison with a",
    "truth reference, rather than through data collection with a truth reference and statistical analysis of \nresults (6.0° is a max error 2 minutes after resuming steady flight after the maneuver). \n该设备飞行评估通过/失败验证是通过与真实参考的目视比较来确定的,而不是通过真实参\n考的数据收集和结果的统计分析来确定的(6.0°是机动后恢复稳定飞行2分钟后的最大误\n差)。 \n\n© 2012 RTCA, Inc. \n\n©2012 RTCA公司",
    "3. \nFor category H1, if a magnetic variation model is used to convert from true heading to magnetic heading, the error inherent in the model is not included in the table values. This also applies to units that utilize GPS as an aiding sensor to correct heading error. \n对于类别H1,如果使用磁变化模型将真航向转换为磁航向,则模型中固有的误差不包括在表\n值中。这也适用于利用GPS作为辅助传感器来校正航向误差的装置。 \n4. \nFor category H1, the heading accuracy requirement is applicable at latitudes lower than ± 60°. \n对于类别H1,航向精度要求适用于低于±60°的纬度。 \n5.",
    "对于类别H1,航向精度要求适用于低于±60°的纬度。 \n5. \nCategories H10 and H11 are generally intended for relatively short term use when the magnetic slaving source could be disturbed (e.g.: during take-off or landing on oil drilling platforms). \nH10和H11类通常用于磁从动源可能受到干扰时的相对短期使用(例如:在石油钻井平台上起\n飞或降落时)。",
    "## 2.2.3.2 Static Accuracy 静态精度\n\nThe equipment **shall** meet the heading accuracy limits as defined in Table 2-2 and tested in accordance with Sections 2.3 and 2.4. \n\n设备应满足表2-2中规定的航向精度限制,并根据章节进行测试。 2.3  和2.4。 \n\n## 2.2.3.3 Dynamic Accuracy 动态精度\n\nThe equipment **shall** meet the heading dynamic and flight accuracy limits as defined in Table 2-2 and tested in accordance with Sections 2.3 and 2.4. 设备应满足表2-2中规定的航向动态和飞行精度限制,并根据章节进行测试。 2.3  和2.4。 \n\n## 2.2.3.4 Dg Mode Considerations Dg模式注意事项",
    "## 2.2.3.4 Dg Mode Considerations Dg模式注意事项\n\nA Directional Gyro (DG) mode **shall** include a means for the operator to activate the DG mode and manually adjust the heading. A valid heading output is determined through the use of inertial sensors (i.e., angular rate sensors and accelerometers) without aiding from a magnetic sensing unit. The AHRS may automatically activate the DG mode. \n\n定向陀螺仪(DG)模式应包括操作员激活DG模式和手动调整航向的方法。通过使用惯性传感器(即,\n角速率传感器和加速度计)来确定有效航向输出,而无需来自磁感测单元的帮助。AHRS可自动激活DG\n模式。",
    "When operating in DG mode, the AHRS should not compensate for transport rate. For example, when \ncrossing over or near the Earth's poles with a straight-line ground track, heading should not reverse direction. \n在DG模式下运行时,AHRS不应补偿运输率。例如,当以直线地面轨迹跨越或接近地球两极时,航向不\n应反向。 \n \nNote: \n注意:",
    "1. \nShort-term cutoff logic which ignores magnetic information during brief periods (e.g., during turns) does not constitute a DG mode. Likewise, automatic modes which ignore magnetic information for indefinite periods of time, and during which heading is appropriately invalidated, also does not constitute a DG mode. \n在短时间内(例如,在转弯期间)忽略磁信息的短期切断逻辑不构成DG模式。同样,在不确\n定的时间段内忽略磁信息并且在此期间航向被适当地无效的自动模式也不构成DG模式。 \n2.",
    "Strapdown AHRS systems intended for use in a rotorcraft may be required to provide either (a) a DG mode as described above, or (b) provide an alternate means to address departure from landing platforms with significant magnetic disturbance. If an alternate means is provided, it may be desirable to include a means of setting a pilot-selectable initial heading, followed by a time-limited period of non-magnetic operation sufficient to complete take-off from the landing platform or another",
    "of non-magnetic operation sufficient to complete take-off from the landing platform or another automatic means of re-selecting magnetically-slaved heading.",
    "拟用于旋翼机的捷联式航姿参考系统可能需要提供(a)如上所述的DG模式,或(B)提供替 代手段,以解决从具有显著磁干扰的着陆平台偏离的问题。如果提供替代装置,则可能希望 包括设置飞行员可选择的初始航向的装置,随后是足以完成从着陆平台起飞的非磁性操作的\n时间限制周期,或者包括重新选择磁性从动航向的另一自动装置。",
    "## 降级模式性能要求",
    "The intended function of a degraded mode (if provided) is to provide basic attitude performance, despite one or more AHRS failures. A degraded mode is intended to allow \n降级模式(如果提供)的预期功能是提供基本的姿态性能,尽管有一个或多个AHRS故障。降级模式旨在",
    "允许 a pilot to maintain positive aircraft control while maneuvering under IMC, including IFR en route operations, climbs, descents, holds, fly an instrument approach to minimums, and return the aircraft back to level following an upset. Precision flying is secondary. A degraded mode may not be sufficient for all installations. Issues such as suitability and crew workload impacts are evaluated at time of installation. Specifically, degraded mode requirements do not consider autopilot input or ILS",
    "of installation. Specifically, degraded mode requirements do not consider autopilot input or ILS approach requirements. Degraded mode accuracies are stated as maximum, not-to-exceed errors.",
    "一名飞行员在IMC下机动时保持积极的飞机控制,包括仪表飞行规则(IFR)航路操作、爬升、下降、 等待、仪表进场飞行到最小值,以及在扰动后将飞机返回到水平位置。精确飞行是次要的。降级模式 可能不适用于所有安装。在安装时对诸如适用性和机组人员工作量影响等问题进行评估。具体来说,\n降级模式要求不考虑自动驾驶仪输入或ILS进近要求。降级模式精度规定为最大值,不得超过误差。 \n\n## 2.2.4.1 Incorporation Of Degraded Mode 合并降级模式\n\n \nThe AHRS may provide a degraded mode of operation. A degraded mode **shall** only be permissible if the equipment provides at least one operational mode with a declared category of performance. \n\nAHRS可以提供降级的操作模式。仅当设备提供至少一种具有声明性能类别的操作模式时,才允许降级\n模式。",
    "AHRS可以提供降级的操作模式。仅当设备提供至少一种具有声明性能类别的操作模式时,才允许降级\n模式。 \n\n \n\n## 2.2.4.2 Degraded Mode Accuracy (Pitch/Roll) 降级模式精度(俯仰/滚转)\n\n \nWhile operating in a degraded mode, the AHRS **shall** be stable, free of oscillations, steps, or other objectionable transients under all conditions. 在降级模式下运行时,AHRS应稳定,在所有条件下均无振荡、阶跃或其他不良瞬态。 \n\n \n\n## 2.2.4.2.1 Degraded Mode Pitch Accuracy 降级模式节距精度",
    "## 2.2.4.2.1 Degraded Mode Pitch Accuracy 降级模式节距精度\n\n \nDuring un-accelerated, straight and level flight, the degraded mode pitch accuracy **shall** be less than or equal to ± 3°. During accelerations or maneuvers, and within the first 60 seconds following accelerations or maneuvers, the pitch error **shall** be less than or equal to ± 6° in the range of ± 10° pitch. Outside of ± 10° pitch, the pitch **shall** be in the correct direction and not provide objectionable pitch information.",
    "在非加速、直线和水平飞行期间,降级模式的俯仰精度应小于或等于±3°。在加速或机动过程中,以 及在加速或机动后的前60秒内,俯仰误差应小于或等于±6°,俯仰范围为±10°。在±10°节距之外,节 距应在正确的方向上,并且不提供不良节距信息。 \n\n## 2.2.4.2.2 Degraded Mode Roll Accuracy 降级模式滚转精度",
    "During un-accelerated, straight and level flight, the degraded mode roll accuracy **shall** be less than or equal to \n± 4°. During accelerations or maneuvers, and within the first 60 seconds following accelerations or maneuvers, the roll error **shall** be less than or equal to \n在非加速、直线和水平飞行期间,降级模式滚转精度应小于或等于±4°。在加速或机动过程中,以及 在加速或机动后的前60秒内,滚转误差应小于或等于",
    "在非加速、直线和水平飞行期间,降级模式滚转精度应小于或等于±4°。在加速或机动过程中,以及 在加速或机动后的前60秒内,滚转误差应小于或等于 \n± 8° up to ± 25° roll. Outside of ± 25° roll, the roll **shall** be in the correct direction and not provide objectionable roll information. ±8°至±25°滚转。在±25°滚转范围外,滚转方向应正确,且不得提供不良滚转信息。",
    "Note: It is generally more acceptable to output a bank angle that is larger than the actual bank angle than to output a bank angle that is smaller than the actual bank angle. \n\n注意:输出大于实际倾斜角的倾斜角通常比输出小于实际倾斜角的倾斜角更可接受。 \n\n \n\n## 2.2.4.3 Degraded Mode Accuracy (Heading) 降级模式精度(航向)\n\n \nWhile operating in a degraded mode, the AHRS heading **shall** be stable, free of oscillations, steps, or other objectionable transients under all conditions. 在降级模式下运行时,AHRS航向应稳定,在所有条件下均无振荡、阶跃或其他不良瞬态。",
    "## 2.2.4.3.1 Slaved Heading 奴隶般的航向\n\n \nDuring un-accelerated, straight and level flight, the degraded mode heading accuracy **shall** be less than or equal to ± 12°. During accelerations or maneuvers, and within the first 60 seconds following accelerations or maneuvers, the heading error **shall** be less than or equal to ± 24°. \n\n在非加速、直线和水平飞行期间,降级模式航向精度应小于或等于±12°。在加速或机动过程中,以及 在加速或机动后的前60秒内,航向误差应小于或等于±24°。 \n© 2012 RTCA, Inc. \n\n©2012 RTCA公司 \n\n## 2.2.4.3.2 Free Gyro Heading 自由陀螺航向",
    "©2012 RTCA公司 \n\n## 2.2.4.3.2 Free Gyro Heading 自由陀螺航向\n\nIf a degraded free gyro mode is offered, the AHRS heading drift **shall** not exceed 20° in 10 minutes. \n\n如果提供降级自由陀螺模式,则AHRS航向漂移在10分钟内不得超过20°。 \n\n## 2.2.5 Turn And Slip Performance Requirements 转弯和打滑性能要求\n\nTable 2-3 defines the turn rate, standard turn bank angle and slip categories. Sections 2.2.5.1, 2.2.5.2 and 2.2.5.3 establish the performance accuracies and requirements for each category.",
    "表2-3定义了转弯率、标准转弯倾斜角和滑移类别。部分 2.2.5.1, 2.2.5.2 和 2.2.5.3 确定每个类\n别的性能精度和要求。 \n\n## 表2-3转弯和打滑类别",
    "| Category                             | Description                                                       |\n|--------------------------------------|-------------------------------------------------------------------|\n| 类别                                 |                                                                   |\n|                                      |                                                                   |",
    "| 描述                                 |                                                                   |\n|                                      |                                                                   |\n| T1                                   | Turn rate, standard turn bank angle and slip information provided |\n| 提供转弯率、标准转弯倾斜角和滑转信息 |                                                                   |",
    "| 提供转弯率、标准转弯倾斜角和滑转信息 |                                                                   |\n|                                      |                                                                   |\n| T2                                   | Turn rate and standard turn bank angle information provided       |\n| 提供转弯角速度和标准转弯倾斜角信息   |                                                                   |",
    "| 提供转弯角速度和标准转弯倾斜角信息   |                                                                   |\n|                                      |                                                                   |\n| T3                                   | Turn rate and slip information provided                           |\n| 提供转弯率和滑转信息                 |                                                                   |",
    "| 提供转弯率和滑转信息                 |                                                                   |\n|                                      |                                                                   |\n| T4                                   | Standard turn bank angle and slip information provided            |\n| 提供标准转弯倾斜角和侧滑信息         |                                                                   |",
    "| 提供标准转弯倾斜角和侧滑信息         |                                                                   |\n|                                      |                                                                   |\n| T5                                   | Turn rate information provided                                    |\n| 提供的转弯率信息                     |                                                                   |",
    "|                                      |                                                                   |\n| T6                                   | Standard turn bank angle information provided                     |\n| 提供标准转弯倾斜角信息               |                                                                   |\n|                                      |                                                                   |",
    "| T7                                   | Slip information provided                                         |\n| 提供的滑动信息                       |                                                                   |\n|                                      |                                                                   |\n| TX                                   |                                                                   |",
    "| 德克萨斯州                           |                                                                   |\n|                                      |                                                                   |\n| No turn or slip information provided |                                                                   |\n| 未提供转弯或打滑信息                 |                                                                   |",
    "| 未提供转弯或打滑信息                 |                                                                   |\n|                                      |                                                                   |",
    "## 2.2.5.1 Rate Of Turn Performance Requirements 回转率性能要求\n\nWith the equipment level and subjected to the turn rates specified about the vertical axis, the turn rate output shall be within the values prescribed in Table 2-4. \n\n在设备水平和垂直轴规定的转弯率下,转弯率输出应在表2-4规定的数值范围内。",
    "在设备水平和垂直轴规定的转弯率下,转弯率输出应在表2-4规定的数值范围内。 \n\n\n| Turn Rate    | Tolerance    |\n|--------------|--------------|\n| (deg/min)    | (deg/min)    |\n| 转数(度/     | 公差(度/     |\n| 分)          |              |\n|              |              |\n| 分)          |              |\n|              |              |\n| 0            | ±8           |\n| 36           | ±9           |\n| 90           | ± 18         |\n| 180          | ± 36         |\n| 240          | ± 48         |",
    "The preferred method for computing turn rate is based on heading rate. If the turn rate is not based on heading rate, the manufacturer **shall** provide its definition of how turn rate is computed. \n\n计算转弯速率的首选方法是基于航向速率。如果转弯速率不是基于航向速率,制造商应提供其如何计\n算转弯速率的定义。 \n\n## 2.2.5.2 Standard Turn Bank Angle Performance Requirement 标准转弯倾斜角性能要求",
    "Standard turn bank angle is a calculated bank angle dependent upon the current aircraft true airspeed. If a constant altitude coordinated turn is flown at the standard turn bank angle, then a standard heading rate of 180 or 90 degrees per minute (deg/min) will result at the current airspeed. When the aircraft is flown in a \nconstant altitude coordinated turn at the standard turn bank angle, the resultant turn rate **shall** be 180 ± 36, or",
    "90 ± 18 deg/min. The 180 deg/min specification is the default value; a 90 deg/min specification may be selected or may be configurable for application to higher classes of aircraft. \n标准转弯倾斜角是根据当前飞机真空速计算的倾斜角。如果以标准转弯倾斜角飞行恒定高度协调转弯, 则在当前空速下将产生每分钟180或90度(deg/min)的标准航向速率。当飞机以标准转弯倾斜角进行\n恒定高度协调转弯飞行时,合成转弯速率应为180±36或90±18°/min.180度/分钟规格为默认值;可以 选择90°/min的规格,或者可以配置为应用于更高等级的飞行器。",
    "## 2.2.5.3 Slip Skid Performance Requirements 滑撬性能要求\n\n \nThe range of the slip indicator **shall** be at least ± 7°. Within that range, the output **shall** be \naccurate to within ± \n2°. 侧滑指示器的范围应至少为±7°。在该范围内,输出应精确到±2°以内。 \n\n## 2.2.6 Aiding 协助",
    "## 2.2.6 Aiding 协助\n\n \nThe AHRS may use aiding sources, such as GNSS, air data, magnetic sensors, etc., in deriving AHRS outputs. Aiding inputs may take different forms, and have different levels of influence on the AHRS outputs, depending on the specific aiding scheme implemented by the manufacturer. Aiding sensors may be integral to the AHRS equipment design, or they may be separate components.",
    "在导出AHRS输出时,AHRS可以使用辅助源,例如GNSS、大气数据、磁传感器等。根据制造商实施的特 定辅助方案,辅助输入可以采取不同的形式,并且对AHRS输出具有不同程度的影响。辅助传感器可以\n集成到AHRS设备设计中,或者它们可以是单独的部件。 \n\n \nIf aiding is implemented the following requirements apply. 如果实施援助,则适用以下要求。 \n\n## 2.2.6.1 Aiding Source Performance 辅助源性能",
    "For external aiding sources, the AHRS manufacturer **shall** define the minimum aiding source performance and integrity requirements. This can be accomplished by identifying the specific aiding equipment or by specifying the performance requirements for aiding sources. Particular attention must be paid to ensuring that the integrity of the aiding inputs is suitable for the intended use of the AHRS equipment. For this reason, when defining the minimum aiding source performance it is recommended",
    "equipment. For this reason, when defining the minimum aiding source performance it is recommended to start with",
    "对于外部辅助源,AHRS制造商应规定最低辅助源性能和完整性要求。这可以通过识别特定的辅助设备 或通过指定辅助源的性能要求来实现。必须特别注意确保辅助输入的完整性适合AHRS设备的预期用途。\n因此,在定义最小辅助源性能时,建议从 \n© 2012 RTCA, Inc.",
    "©2012 RTCA公司 \nestablished standards, such as TSO-C145, TSO-C146, and TSO-C196 for GNSS sources, or TSO-C106 for air data sources. \n\n已建立的标准,如用于全球导航卫星系统来源的Tso-C145、Tso-C146和TSOC196,或用于大气数据来源\n的TSOC106。 \nNote: \n注意:",
    "1. \nAHRS utilizing GNSS aiding to augment the AHRS output should comply with the integrity monitoring requirements as specified for TSO-C145, TSO-C146, or TSO C196 compliant GNSS sources. Aiding sources meeting only the minimum requirements of TSO-C129 may not provide sufficient availability or performance to perform properly in high interference environments. \n利用GNSS辅助来增强AHRS输出的AHRS应符合Tso-C145、Tso-C146或Tso C196兼容GNSS源规定 的完整性监测要求。仅满足Tso-C129的最低要求的辅助源可能无法提供足够的可用性或性能\n以在高干扰环境中正确执行。 \n2.",
    "以在高干扰环境中正确执行。 \n2. \nThe GNSS TSOs effective as of this writing do not include performance requirements for velocity accuracy or integrity. RTCA SC-159 has determined that horizontal position accuracy (HFOM) and integrity (HPL) cannot be correlated to the velocity performance. RTCA SC-159 has published \na velocity accuracy test in DO-310. This velocity accuracy test is also available in AC 20- 138B. At this time, no vetted method for determining velocity integrity has been published.",
    "在撰写本文时生效的GNSS Tso不包括速度精度或完整性的性能要求。RTCA SC-159已确定水 平位置精度(HFOM)和完整性(HPL)不能与速度性能相关联。RTCA SC-159在DO-310中发布 了速度精度测试。该速度精度测试也可用于AC 20-138B.目前,尚未公布确定速度完整性的\n审查方法。 \n3.",
    "审查方法。 \n3. \nThe foregoing requirements presume that the AHRS aiding sources are used as an integral portion of the AHRS attitude computation, and therefore require stringent monitoring, performance, and integrity checking. Aiding sources that are used to simply cross check the AHRS output or detect faults in AHRS input sources may not require the same fidelity as an aiding source which is used as an \nintegral component of the AHRS attitude computations.",
    "integral component of the AHRS attitude computations. \n上述要求假定AHRS辅助源用作AHRS姿态计算的组成部分,因此需要严格的监控、性能和完整 性检查。用于简单地交叉检查AHRS输出或检测AHRS输入源中的故障的辅助源可能不需要与用\n作AHRS姿态计算的组成部分的辅助源相同的保真度。",
    "## 2.2.6.2 Loss Of Aiding 援助损失",
    "Following the detected loss of aiding, if the AHRS cannot meet the requirements of its current operational mode, the AHRS **shall** revert to a different operational mode, a degraded mode, or invalidate its output. The AHRS **shall** annunciate the mode change, which may indicate a performance change or loss of function in accordance with Section \n在检测到辅助损失后,如果AHRS不能满足其当前运行模式的要求,则AHRS应恢复到不同的运行模式、\n降级模式或使其输出无效。根据第节,AHRS应通告模式变化,这可能表明性能变化或功能损失",
    "在检测到辅助损失后,如果AHRS不能满足其当前运行模式的要求,则AHRS应恢复到不同的运行模式、\n降级模式或使其输出无效。根据第节,AHRS应通告模式变化,这可能表明性能变化或功能损失 \n2.2.1.4. The manufacturer **shall** provide information on the impact of the loss of aiding.",
    "2.2.1.4.  制造商应提供有关AID损失影响的信息。 \n\n## 2.2.6.3 Annunciated Faults From Aiding Source 来自辅助源的通告故障\n\nIf the AHRS receives a fault indication from an aiding source, where the fault can result in AHRS \nperformance not meeting the requirements of its current operational mode, then the AHRS **shall** transition to another operational mode, a degraded mode, or invalidate its output. \n\n如果AHRS接收到来自辅助源的故障指示,其中故障可能导致AHRS性能不满足其当前运行模式的要求,\n则AHRS应转换到另一种运行模式、降级模式或使其输出无效。",
    "如果AHRS接收到来自辅助源的故障指示,其中故障可能导致AHRS性能不满足其当前运行模式的要求,\n则AHRS应转换到另一种运行模式、降级模式或使其输出无效。 \n\n## 2.2.6.4 Faulted And Non-Normal Performance 故障和非正常性能",
    "Depending on the intended use of the AHRS equipment, an aircraft level safety assessment may require that undetected or latent faults in the AHRS equipment, including undetected faults in the AHRS aiding inputs, be mitigated to an acceptable level. The manufacturer **shall** identify and document (via installation limitations) potential undetected aiding source faults and non-normal performance that are likely to occur",
    "(see Note below). The AHRS design **shall** ensure that \"likely\" aiding source faults and non-normal performance are mitigated as required for the intended use. This mitigation can be accomplished through fault detection and mitigation at the input, real time monitoring of the AHRS performance, controlling the design assurance of the aiding source, or other means. The extent of fault monitoring and mitigation needs to be commensurate with the intended application and criticality of the",
    "and mitigation needs to be commensurate with the intended application and criticality of the equipment.",
    "根据AHRS设备的预期用途,飞机级安全评估可能要求将AHRS设备中未检测到的或潜在的故障(包括 AHRS辅助输入中未检测到的故障)降低到可接受的水平。制造商应确定并记录(通过安装限制)潜在\n的未检测到的辅助源故障和可能发生的非正常性能(见下面的注释)。AHRS的设计应确保\"可能的\"辅\n助源故障和非正常性能按照预期用途的要求得到缓解。这种缓解可以通过输入处的故障检测和缓解、 AHRS性能的实时监控、控制辅助源的设计保证或其他手段来实现。故障监测和缓解的程度需要与设备\n的预期应用和关键程度相称。 \n© 2012 RTCA, Inc. ©2012 RTCA公司",
    "Note: The term \"likely\" is used to limit the possible number of undetected aiding source \nfaults. The equipment should be analyzed in the context of 14 CFR part 23, 25, 27 or 29.1309 \nto identify how the aiding source is used and the resultant effects on performance. \n注:术语\"可能\"用于限制未检测到的辅助源故障的可能数量。应在14 CFR第23、25、\n27或29.1309部分的背景下对设备进行分析,以确定如何使用辅助源以及对性能产生的\n影响。 \n\n## 2.3 Equipment Performance - Environmental Conditions 设备性能-环境条件",
    "## 2.3 Equipment Performance - Environmental Conditions 设备性能-环境条件\n\nThe environmental tests and performance requirements described in this subsection are intended to provide a laboratory means of determining the overall performance characteristics of the equipment under conditions representative of those which may be encountered in actual aeronautical operations. \n\n本小节所述的环境试验和性能要求旨在提供一种实验室方法,以确定设备在实际航空操作中可能遇到\n的典型条件下的总体性能特征。",
    "Unless otherwise specified, the test procedures applicable to a determination of equipment performance under environmental test conditions are contained in RTCA/ DO- 160G, Environmental Conditions and Test Procedures for Airborne Equipment. General information on the use of RTCA/DO-160G is contained in Sections 1 through 3 of that document. Also, a method of identifying which environmental tests were conducted and other amplifying information on the conduct of the tests is contained in Appendix",
    "conducted and other amplifying information on the conduct of the tests is contained in Appendix A of RTCA/DO-160G. For additional guidance on RTCA/DO-160G, refer to AC 21-16G.",
    "除非另有规定,适用于确定环境试验条件下设备性能的试验程序包含在RTCA/DO-160G《机载设备环境 条件和试验程序》中。关于使用RTCA/DO-160G的一般信息包含在该文件的第1至3节中。此外, RTCA/DO-160G的附录A中包含了确定进行了哪些环境试验的方法以及关于进行试验的其他补充信息。\n有关RTCA/DO-160G的其他指南,请参阅AC 21-16G. \n\n \nSome of the performance requirements in Section 2.2 are not required to be tested to all of the conditions contained in RTCA/DO-160G. Table 2-5 shows the environmental tests which are required to meet this standard. \n\n部分中的一些性能要求 2.2  不需要在RTCA/DO-160G中包含的所有条件下进行测试。表2-5显示了满\n足本标准所需的环境试验。",
    "部分中的一些性能要求 2.2  不需要在RTCA/DO-160G中包含的所有条件下进行测试。表2-5显示了满\n足本标准所需的环境试验。 \n\n \nWhen the physical test environment prevents normal determination of operational performance, manufacturer shall specify an acceptable alternative technique to determine performance to the maximum extent practical. \n\nFor example, such a condition may exist when a magnetic sensing unit is placed near a source of significant magnetic fields, such as is commonly found with vibration tables.",
    "当物理测试环境妨碍操作性能的正常测定时,制造商应规定一种可接受的替代技术,以最大限度地测 定性能。例如,当磁感测单元被放置在有效磁场源附近时,这种情况可能存在,例如通常在振动台中\n发现的情况。",
    "Requirements in this section are used to demonstrate that the performance requirements of Section 2.2 are met when subjected to environmental test conditions defined in RTCA/DO-160G. The AHRS performance \nrequirements are defined for a system, equipment and associated functions. The manufacturer **shall** define the \nitems of AHRS equipment and associated wiring that are required for the system that will undergo RTCA/DO-160G environmental tests.",
    "本节中的要求用于证明本节的性能要求 2.2 符合RTCA/DO-160G规定的环境试验条件。为系统、设备\n和相关功能定义了AHRS性能要求。制造商应确定将进行RTCA/DO-160G环境试验的系统所需的AHRS设备\n和相关接线的项目。 \n \nThe manufacturer need only test the functions that are supported by the system/ equipment. If a complete system is not tested, the untested subsystem errors **shall** be accounted for via analysis or other methods.",
    "制造商只需测试系统/设备支持的功能。如果未测试完整的系统,则应通过分析或其他方法对未测试\n的子系统错误进行解释。",
    "DO-160G Ref. \nDO-160G参考 \nEnvironmental Test 环境试验 \nSection \n部分 \nTemperature and Altitude 温度和海拔 Temperature Variation 温度变化 Humidity 湿度 \nOperational Shocks and Crash \nSafety \n \n操作冲击和碰撞安全 Vibration 震动 Explosion proof 防爆 \n10 \nOptional \nWaterproof 防水的 \n11 \nOptional \nFluids susceptibility 流体敏感性 \n12 \nOptional \nSand and dust 沙尘 \n13 \nOptional \nFungus resistance 真菌抗性 \n14 \nOptional \nSalt spray 盐雾 \n15 \n√ \nNA \nMagnetic effect 磁效应 \n16 \n√ \nStatic \nPower input 电源输入 \n17 \n√ \nStatic \nVoltage spike 电压尖峰 \n \n18",
    "NA \nMagnetic effect 磁效应 \n16 \n√ \nStatic \nPower input 电源输入 \n17 \n√ \nStatic \nVoltage spike 电压尖峰 \n \n18 \nAudio frequency conducted susceptibility 音频传导敏感度 \n19 \n√ \nStatic \nInduced signal susceptibility 感应信号敏感度 \n \n \n20 \nRF susceptibility 射频敏感度 \n21 \n√ \nNA \nEmission of RF energy 射频能量发射 \n \n22 \nLightning induced transient susceptibility 雷电感应暂态敏感度 \n23 \nOptional \nLightning Direct Effects 闪电直接影响 \n24 \nOptional \nIcing 结冰 \n25 \n√ \nNA \nElectrostatic Discharge 静电放电 \n26 \nOptional \nFire, Flammability 火灾,易燃性 \nMinimum",
    "25 \n√ \nNA \nElectrostatic Discharge 静电放电 \n26 \nOptional \nFire, Flammability 火灾,易燃性 \nMinimum \n \n \nRequired \nEnvironmental \nTest \n最低要求的环境\nPerformance \nRequirement \n性能要求 \n试验 \n4 \n√ \nStatic \n静态的 \n5 \n√ \nDynamic \n动态的 \n6 \n√ \nNA \n纳纳 \nDynamic \n \n7 \n√ \n动态的 \n8 \n√ \nDynamic \n动态的 \n9 \nOptional \nNA \n可选 \n纳纳 \nNA \n可选 \n纳纳 \nNA \n可选 \n纳纳 \nNA \n可选 \n纳纳 \nNA \n可选 \n纳纳 \nNA \n可选 \n纳纳 纳纳 \n静态的 静态的 \nStatic \n \n√ \n静态的 静态的 \nStatic / \n \n√ \nDynamic \n静态/动\n态 \n纳纳 \nStatic \n \n√ \n静态的 \nNA \n可选 \n纳纳 \nNA \n可选 \n纳纳 \n纳纳 \nNA \n可选 \n纳纳",
    "Note: \n注意: \n\n1. Performance requirement applicable during the prescribed environmental test. \n在规定的环境试验期间适用的性能要求。 \n2. For the definition of \"Static\", \"Dynamic\" and \"Static/Dynamic\", see Section \n2.3.1. \n有关\"静态\"、\"动态\"和\"静态/动态\"的定义,请参阅 2.3.1. \n3. \"Optional\" indicates tests which are not required by this MOPS. \n\"可选\"表示本MOPS不要求的测试。 \n\n## 2.3.1 Performance Standard For Environmental Testing 环境试验的性能标准\n\nThe test procedures specified in this section apply during environmental testing. \n\n本节规定的试验程序适用于环境试验。",
    "Mount the AHRS in a fixed position and subject it to the test environment when DO-160 requires validation of performance during exposure. Monitor the attitude, heading, turn, and slip (as applicable) and status indications. The attitude and heading **shall** not deviate from the initial reading by more than the amount specified in the Attitude Accuracy columns of Table 2-1 and the Heading Accuracy columns of Table 2-2 respectively. Depending on which DO-160 test is being performed use either",
    "columns of Table 2-2 respectively. Depending on which DO-160 test is being performed use either the Static Conditions column or Dynamic and Flight Conditions column as directed in the Performance Requirement column of Table 2-5.",
    "当DO-160要求在暴露期间验证性能时,将AHRS安装在固定位置,并将其置于测试环境中。监控姿态、\n航向、转弯和侧滑(如适用)以及状态指示。姿态和航向与初始读数的偏差不得超过\"姿态精度\"栏中\n规定的数值。 表2-1 的航向精度列 表2-2 分别是。根据正在进行的DO-160试验,使用静态条件栏或\n动态和飞行条件栏,如性能要求栏所示。 表2-5。 \n\nWhen DO-160 requires validation of performance following exposure to the environment, the following tests **shall** be accomplished. \n\n当DO-160要求在暴露于环境后进行性能验证时,应完成以下试验。",
    "1. 2.4.2.1 Attitude Static Accuracy \n2.4.2.1  姿态静态精度 \n2. 2.4.2.2 Attitude Scale Factor Static Accuracy \n2.4.2.2  姿态比例因子静态精度 \n3. 2.4.3.1 Heading Static Accuracy \n2.4.3.1  航向静态精度 \n4. 2.4.3.3 Static Accuracy, DG Mode, Category H6 through H11 \n2.4.3.3  静态精度,DG模式,H6至H11类 \n5. 2.4.5.1 Turn Rate Test Procedures \n2.4.5.1  转弯速率测试程序 \n6. 2.4.5.2 Standard Turn Bank Angle Test Procedures \n2.4.5.2  标准转弯倾斜角试验程序 \n7. 2.4.5.3 Slip Skid Test Procedures \n2.4.5.3  防滑试验程序",
    "2.4.5.2  标准转弯倾斜角试验程序 \n7. 2.4.5.3 Slip Skid Test Procedures \n2.4.5.3  防滑试验程序 \nNote: An Acceptance Test Procedure that validates hardware functionality following exposure may be adequate, as long as it tests any item that could be affected by the environmental test.",
    "注:在暴露后验证硬件功能的验收测试程序可能是足够的,只要它测试了可能受环境测试影响的任何\n项目。 \n\n \nThe static and dynamic tolerances are defined in Table 2-1, and Table 2-2 for each category of equipment. \n\nThe turn and slip **shall** not deviate by more than 150% of the limits specified in Section 2.2.5 for all environments. The status shall remain valid during all tests that require validation of performance during the exposure to the environment.",
    "表2-1和表2-2规定了各类设备的静态和动态公差。转弯和滑动的偏差不得超过第节中规定的限值的\n150 2.2.5  适用于所有环境。在暴露于环境期间需要验证性能的所有测试期间,该状态应保持有效。 \n\n \nWhere \"Static / Dynamic\" (DO-160G Section 20) is specified in Table 2-5, if the attitude or heading deviates by more than the static requirement, the frequency at which the susceptibility occurred **shall** be dwelled for a minimum of 5 seconds and the attitude and heading output **shall** not deviate by more than the dynamic limit.",
    "For AHRS intended for helicopter applications it is recommended that the dwell be extended to 15 seconds and documented in the environmental qualification document.",
    "如果表2-5中规定了\"静态/动态\"(DO-160G第20节),如果姿态或航向偏离超过静态要求,则敏感性\n出现的频率应至少停留5秒,且姿态和航向输出的偏离不得超过动态限制。对于拟用于直升机的AHRS,\n建议将停留时间延长至15秒,并记录在环境鉴定文件中。 It is understood that the mounting of the AHRS in a fixed position does not test all of the functionality that affects the accuracy of the AHRS system. For example, rate sensor scale factor performance could vary over temperature to an extent that the unit would no longer meet the performance requirements. AHRS",
    "performance characteristics that are not tested by being mounted in a fixed position **shall** be validated by the manufacturer through other means such as analysis, design, calibration, or informal testing.",
    "可以理解,将AHRS安装在固定位置并不能测试影响AHRS系统精度的所有功能。例如,速率传感器比例 因子性能可能随温度变化到该单元不再满足性能要求的程度。安装在固定位置时未进行测试的AHRS性\n能特性应由制造商通过其他方法(如分析、设计、校准或非正式测试)进行验证。 \n© 2012 RTCA, Inc. ©2012 RTCA公司 \nFor units with a DG mode, the unit **shall** meet the DG requirements over the environments. The manufacturer may verify the unit meets these requirements by analysis, test or a combination of both. \n\n对于采用DG模式的机组,机组应满足整个环境的DG要求。制造商可通过分析、测试或两者的结合来验\n证装置是否满足这些要求。 \n\n\n## 2.4 Equipment Test Procedures 设备测试程序",
    "## 2.4 Equipment Test Procedures 设备测试程序\n\n \n\n## 2.4.1 General Tests 一般测试\n\n \n\n## 2.4.1.1 Conditions 条件\n\n \n\n## 2.4.1.1.1 Definitions Of Terms And Conditions Of Test 试验条款和条件的定义\n\n \nThe following are definitions of terms and the conditions under which the tests described in this subsection should be conducted. 以下是进行本小节所述试验的术语定义和条件。",
    "1. Power Input Voltage - Unless otherwise specified, all tests **shall** be conducted with the power input \nvoltage adjusted to a selected design voltage within the range for which the equipment is designed \nplus or minus 2%. The input voltage **shall** be measured at the input terminals of the equipment \nunder test. \n电源输入电压——除非另有规定,否则所有试验均应在电源输入电压调整至选定设计电压的\n情况下进行,该选定设计电压的范围为设备设计的±2%。应在被测设备的输入端测量输入电 压。 \n2. Power Input Frequency \n电源输入频率 \na.",
    "情况下进行,该选定设计电压的范围为设备设计的±2%。应在被测设备的输入端测量输入电 压。 \n2. Power Input Frequency \n电源输入频率 \na. \nIn the case of equipment designed for operation from an AC source of essentially \nconstant frequency (e.g., 400 Hz), the input frequency **shall** be adjusted to design \nfrequency plus or minus 2%. \n如果设备设计为从基本恒定频率(如400 Hz)的交流电源运行,则应将输入频率调\n整为设计频率的±2%。 \nb. In the case of equipment designed for operation from an AC source of variable frequency",
    "b. In the case of equipment designed for operation from an AC source of variable frequency \n(e.g., 300 to 1,000 Hz), unless otherwise specified, tests **shall** be conducted with the input \nfrequency adjusted to within 5% of a selected frequency and within the range for which the equipment is designed. \n除非另有规定,否则对于设计用于从可变频率(例如300至1,000 Hz)的交流电源 运行的设备,应将输入频率调整至选定频率的5%以内,并在设备的设计范围内进行\n测试。 \n3. Test Equipment - All equipment used in the performance of the tests should be identified by make,",
    "model and serial number where appropriate, and its latest calibration date. When appropriate, all test equipment calibration standards should be traceable to national and/or international standards. \n测试设备-测试中使用的所有设备应通过品牌、型号和序列号(如适用)及其最新校准日期\n进行标识。在适当的情况下,所有测试设备的校准标准应可追溯到国家和/或国际标准。 \n4. Ambient Conditions - Unless otherwise specified, all tests **shall** be made within the following \nambient conditions: 环境条件-除非另有规定,否则所有试验应在以下环境条件下进行: \na.",
    "ambient conditions: 环境条件-除非另有规定,否则所有试验应在以下环境条件下进行: \na. \nTemperature: +15° to +35° Celsius (+59° to +95° Fahrenheit) 温度:+15°至+35°摄氏度(+59°至+95°华氏度) \nb. Relative Humidity: Not greater than 85% \n相对湿度:不大于85% \nc. \nAmbient Pressure: equivalent to -1,500 to +8,000 feet of altitude 环境压力:相当于-1,500至+8,000英尺高度 \nWhen tests are conducted at ambient conditions which differ from the above values, allowances shall be made and the differences recorded.",
    "当在不同于上述数值的环境条件下进行试验时,应留有余量并记录差值。",
    "5. Connected Loads - Unless otherwise specified, all tests **shall** be performed with the equipment \nconnected to loads having the impedance values for which it is designed. 连接负载-除非另有规定,否则所有测试应在设备连接到具有设计阻抗值的负载时进行。 \n6. If appropriate for the test being conducted, equipment installation procedures \n如果适用于正在进行的测试,设备安装程序 \nshall be performed before testing. \n应在试验前进行。 \n7. Whenever a rotation rate is specified, a short period of time to change to and from that rotation rate",
    "is allowed. 无论何时指定转速,都允许在短时间内改变到该转速或从该转速改变。 \n© 2012 RTCA, Inc.",
    "©2012 RTCA公司 \n\n## 2.4.1.1.2 Required Test Equipment 所需的测试设备\n\nFor the verification of the performance required in Section 2.2 the following test equipment is suggested as one possible means of taking required measurements: 为了验证第2.2节中要求的性能,建议使用以下测试设备作为进行所需测量的一种可能方法:",
    "1. Equipment for providing mechanical interface of the AHRS (Laboratory Test and \nFlight Evaluation) \n提供AHRS机械接口的设备(实验室试验和飞行评估) \na. \nTray or mounting plate if applicable 托盘或安装板(如适用) \n2. Equipment for providing the electrical interface of the AHRS (Laboratory Test \nand Flight \nEvaluation) 提供AHRS电气接口的设备(实验室试验和飞行评估) \na. \nPower Supply \n供电 \nb. Digital Interface (if applicable) \n数字接口(如适用) \nc. \nAnalog Interface (if applicable) 模拟接口(如适用) \n3. Rate table (Laboratory Test) \n费率表(实验室测试)",
    "c. \nAnalog Interface (if applicable) 模拟接口(如适用) \n3. Rate table (Laboratory Test) \n费率表(实验室测试) \n4. Scorsby table or equivalent (Laboratory Test) \nScorsby表格或同等表格(实验室测试) \n5. Flight evaluation aircraft (Flight Evaluation) \n飞行评估飞机(飞行评估) \n6. Data logger (Laboratory Test and Flight Evaluation) \n数据记录器(实验室试验和飞行鉴定) \n7. Reference measurement system (truth reference) adequate to the performance \ncategories (Flight \nEvaluation) 适用于性能类别(飞行评估)的基准测量系统(真值基准) \n \n2.4.1.2 \nOn Ground (Stationary) Starting \n地面(静止)起动",
    "Evaluation) 适用于性能类别(飞行评估)的基准测量系统(真值基准) \n \n2.4.1.2 \nOn Ground (Stationary) Starting \n地面(静止)起动 \n \nWith the equipment on a stable level support, apply nominally rated power. Valid attitude, heading, turn and \nslip (as provided) output errors **shall** not exceed the static accuracy specified in Table 2-1, Table 2-2 and \nSection 2.2.5 within the time specified in Section 2.2.1.2. \n在设备处于稳定水平支撑的情况下,施加标称额定功率。有效姿态、航向、转弯和滑动(按规定)输\n出误差不得超过表2-1、表2-2和第节中规定的静态精度 2.2.5  在第2.2.1.2节规定的时间内。 \n \n2.4.1.3",
    "出误差不得超过表2-1、表2-2和第节中规定的静态精度 2.2.5  在第2.2.1.2节规定的时间内。 \n \n2.4.1.3 \nIn-Flight or In-Motion Alignment 飞行中或运动中对准 \n \nIf in-flight alignment is provided, the manufacturer **shall** verify the performance by test or analysis.",
    "如果提供了飞行中对准,制造商应通过试验或分析来验证性能。 \n\n \n\n## 2.4.1.4 Annunciations 通告\n\n \nStart the AHRS in a normal operating mode. In each operating mode specified in Section 在正常操作模式下启动AHRS.在第节中规定的每种操作模式下 \n2.2.1.4 the appropriate annunciation **shall** be observed. \n\n2.2.1.4  应遵守适当的通知。 \n\n \n\n## 2.4.1.5 Output Characteristics Tests 输出特性测试\n\n \n\n## 2.4.1.5.1 Output Resolution Test 输出分辨率测试\n\nThe AHRS **shall** meet the manufacturer defined output resolution requirements.",
    "The AHRS **shall** meet the manufacturer defined output resolution requirements. \n\nThis can be demonstrated through test or analysis. AHRS应满足制造商规定的输出分辨率要求。这可以通过测试或分析来证明。 \n\n## 2.4.1.5.2 Update Rate Test 更新率测试\n\nThe AHRS **shall** meet the manufacturer defined update rate requirements. This can be demonstrated through test or analysis. AHRS应满足制造商规定的更新率要求。这可以通过测试或分析来证明。 \n\n## 2.4.1.5.3 Latency Test 潜伏期测试",
    "## 2.4.1.5.3 Latency Test 潜伏期测试\n\nThe AHRS **shall** meet the manufacturer defined latency requirements. This can be demonstrated through test or analysis. \n\nAHRS应满足制造商规定的延迟要求。这可以通过测试或分析来证明。 \n\n## 2.4.1.5.4 Filtering Test 过滤测试\n\nThe AHRS **shall** meet the manufacturer defined filtering requirements. This can be demonstrated through test or analysis. AHRS应满足制造商规定的滤波要求。这可以通过测试或分析来证明。 \n\n## 2.4.1.5.5 Range Test 距离测试",
    "## 2.4.1.5.5 Range Test 距离测试\n\nRotate the equipment a minimum of 360° around the lateral axis. Pitch, roll, and if provided, heading, turn, standard turn bank angle, and slip outputs **shall** be continuously provided. Within 10 seconds of the completion of the maneuver, the pitch, roll, and heading errors in all axes **shall** not exceed the dynamic accuracy requirement for its category. 将设备绕横轴旋转至少360°。应连续提供纵摇、横摇和航向(如有)、转弯、标准转弯倾斜角和滑动 输出。在机动完成后的10秒内,所有轴的俯仰、滚转和航向误差不得超过其类别的动态精度要求。",
    "Rotate the equipment a minimum of 360° around the longitudinal axis. Pitch, roll, and if provided, heading, \nturn, standard turn bank angle, and slip outputs **shall** be continuously provided. Within 10 seconds of the completion of the maneuver, the pitch, roll, and heading errors in all axes **shall** not exceed the dynamic \naccuracy requirement for its category. 将设备绕纵轴旋转至少360°。应连续提供纵摇、横摇和航向(如有)、转弯、标准转弯倾斜角和滑动 输出。在机动完成后的10秒内,所有轴的俯仰、滚转和航向误差不得超过其类别的动态精度要求。",
    "Rotate the equipment a minimum of 360° around the vertical axis. Pitch, roll, and if provided, heading, turn, \nstandard turn bank angle, and slip outputs **shall** be continuously provided. Within 10 seconds of the completion of the maneuver, the pitch, roll, and heading errors in all axes **shall** not exceed the dynamic \naccuracy requirement for its category. 将设备绕垂直轴旋转至少360°。应连续提供纵摇、横摇和航向(如有)、转弯、标准转弯倾斜角和滑 动输出。在机动完成后的10秒内,所有轴的俯仰、滚转和航向误差不得超过其类别的动态精度要求。",
    "## 2.4.2 Attitude Performance Test Procedures 姿态性能测试程序\n\n \n\n## 2.4.2.1 Attitude Static Accuracy And Alignment 姿态静态精度与对准",
    "Place the AHRS in each of the attitudes listed in Table 2-6 within ± 1.0°. At each attitude, power the AHRS and allow it to stabilize. For each position in Table 2-6, the absolute attitude error (the attitude error relative to the true position of the AHRS) **shall** not exceed the static value for the declared performance category found in Table 2-1. 将AHRS放置在表2-6中所列的每个姿态中,在±1.0°范围内。在每个姿态下,为AHRS供电并使其稳定。\n对于表2-6中的每个位置,绝对姿态误差(相对于AHRS真实位置的姿态误差)不得超过表2-1中所述性\n能类别的静态值。",
    "Roll Position (deg) \nPitch Position \n滚转位置(度) \n(deg) \n节距位置(度) \n0.0 \n0.0 \n0.0 \n+15.0 \n0.0 \n-15.0 \n+15.0 \n0.0 \n-15.0 \n0.0 \n\n© 2012 RTCA, Inc. \n\n©2012 RTCA公司 \n\n## 2.4.2.2 Attitude Scale Factor Static Accuracy 姿态比例因子静态精度",
    "With the equipment level and stabilized, rotate the equipment in one axis within 5 seconds to achieve a test position specified in Table 2-7 ± 1.0°. Within 1 second after the equipment is at the test position specified, the error in the attitude outputs **shall** not exceed the static accuracy called out in Table 2-1 for the declared performance category. After the measurement at each position in Table 2-7, return the equipment to level position and allow it to stabilize before moving to the",
    "in Table 2-7, return the equipment to level position and allow it to stabilize before moving to the next test position. 在设备水平且稳定的情况下,在5秒内沿一个轴旋转设备,以达到表2-7±1.0°中规定的试验位置。在",
    "设备处于规定的试验位置后的1秒内,姿态输出的误差不得超过表2-1中所述的声明性能类别的静态精 度。在表2-7中的每个位置进行测量后,将设备恢复到水平位置,并在移动到下一个测试位置之前使\n其稳定。",
    "| Roll Position    | Pitch Position    |\n|------------------|-------------------|\n| (deg)            | (deg)             |\n| 滚转位置         | 节距位置(度)      |\n|                  |                   |\n| (度)             |                   |\n|                  |                   |\n| +60.0            | 0.0               |\n| -60.0            | 0.0               |\n| +30.0            | 0.0               |\n| -30.0            | 0.0               |\n| 0.0              | +60.0             |",
    "| -30.0            | 0.0               |\n| 0.0              | +60.0             |\n| 0.0              | -60.0             |\n| 0.0              | +30.0             |\n| 0.0              | -30.0             |",
    "## 2.4.2.3 Multi-Axis Dynamic Accuracy Flight Evaluation 多轴动态精度飞行鉴定",
    "2.4.2.3.1 \nCategories A1, A2, A3 and A4 \nA1、A2、A3和A4类",
    "The dynamic accuracy of the attitude outputs is tested using a flight evaluation that conforms to the requirements specified in Section 2.4.8. The flight evaluation is conducted using a truth reference device. Record the output of the AHRS and the output of the truth reference simultaneously during the flight to allow for analysis of the difference between the two outputs. Compare the output of the equipment with the output of the truth reference and calculate the RMS error as described in",
    "of the equipment with the output of the truth reference and calculate the RMS error as described in Section 2.4.8. This calculated RMS output error multiplied by two **shall** not exceed the flight condition accuracy specification defined in Table 2-1 for the performance category.",
    "姿态输出的动态精度使用符合第节中规定要求的飞行评估进行测试 2.4.8 .使用真实参考装置进行飞\n行评估。在飞行过程中,同时记录AHRS的输出和真实参考的输出,以便分析两个输出之间的差异。将 设备的输出与真值参考的输出进行比较,并计算RMS误差,如第节所述 2.4.8. 计算的均方根输出误\n差乘以2不得超过表2-1中规定的性能类别的飞行条件精度规范。",
    "Note: The accuracy requirements for flight are defined as 2*RMS limits. For example, if the flight evaluation \nanalysis gives an RMS error of 1.1°, then the 2*RMS error for the flight is 2.2°. This value of 2.2° must be \nless than or equal to the flight evaluation accuracy specification defined in Table 2-1. \n注:飞行精度要求定义为2*RMS限值。例如,如果飞行评估分析给出的均方根误差为1.1°,则飞行的 2*均方根误差为2.2°。这个2.2°的值必须小于或等于表2-1中定义的飞行评估精度规范。 \n \n2.4.2.3.2 \nCategory A5 \n类别A5",
    "The dynamic accuracy of the attitude outputs is tested using a flight evaluation that conforms to the requirements specified in Section 2.4.8. Compare the output of the equipment with the output of the truth reference. The truth reference device and the AHRS attitude indication should be visible to the test pilot or test engineer during the flight. Compare the output of the equipment with the output of the truth reference during and after each maneuver defined in the flight evaluation. The",
    "output of the truth reference during and after each maneuver defined in the flight evaluation. The observed difference in roll and pitch angles between the equipment and the truth reference **shall** not exceed the flight condition accuracy specification defined in Table 2-1 for performance category A5.",
    "姿态输出的动态精度使用符合第节中规定要求的飞行评估进行测试 2.4.8. 将设备的输出与真实参考 的输出进行比较。在飞行过程中,真实参考装置和AHRS姿态指示应对试飞员或试飞工程师可见。在飞 行评估中定义的每个机动期间和之后,将设备的输出与真实参考的输出进行比较。观察到的设备和真\n实参考之间的滚转角和俯仰角的差异不得超过表2-1中规定的性能类别A5的飞行条件精度规范。 \n© 2012 RTCA, Inc. \n\n©2012 RTCA公司 \n\n## 2.4.3 Heading Performance Test Procedures 航向性能测试程序 2.4.3.1 Heading Static Accuracy 航向静态精度",
    "## 2.4.3 Heading Performance Test Procedures 航向性能测试程序 2.4.3.1 Heading Static Accuracy 航向静态精度\n\nThe equipment **shall** meet the heading accuracy under static conditions as described in Table 2-2 according to the applicable equipment category. These limits represent maximum allowable deviation values. \n\n根据适用的设备类别,设备应满足表2-2所述的静态条件下的航向精度。这些限值表示最大允许偏差\n值。 \n\n## 2.4.3.1.1 Heading Error For Categories H1 Through H5 类别H1至H5的航向错误",
    "With the equipment placed on a level surface, power it on and allow it to initialize. Position the equipment at a heading of 0°. Rotate the equipment through a full 360° about the vertical axis, stopping at 30° increments to record measurements, waiting one minute or until heading is stabilized, whichever is greater before recording data. The magnitude of the error at each point **shall** not exceed the static accuracy limit defined in Table 2-2.",
    "将设备放置在水平面上,打开电源并进行初始化。将设备定位在0°航向。将设备绕垂直轴旋转360°, 以30°的增量停止以记录测量结果,等待一分钟或直到航向稳定,以较大者为准,然后记录数据。每 个点的误差幅度不得超过表2-2中规定的静态精度限值。 \n\n \n\n## 2.4.3.1.2 Heeling Test For Categories H2 Through H5 H2至H5类的横倾试验",
    "This test is only applicable for categories H2 through H5. Place the equipment on a level surface and operate in slaved mode. Position the equipment at a heading of 360°. Tilt the equipment and MSU (or simulated MSU) about the roll axis by 10°. Allow the equipment to stabilize. Record the heading. Rotate the equipment through a full 360° about the vertical axis, stopping at 30° increments for measurements. Note the heading at each 30° increment after waiting one minute or until heading is",
    "measurements. Note the heading at each 30° increment after waiting one minute or until heading is stabilized, whichever is greater. The magnitude of the difference between the measurement while tilted and the measurement while level at each point **shall** not exceed twice the performance category static limit.",
    "本试验仅适用于H2至H5类。将设备放置在水平面上,并在从动模式下运行。将设备放置在360°的航向 上。将设备和MSU(或模拟MSU)围绕滚动轴倾斜10°。让设备稳定下来。记录标题。将设备绕垂直轴 旋转360°,以30°的增量停止测量。等待一分钟或直到航向稳定(以较大者为准)后,注意每30°增量 的航向。每一点倾斜时的测量值与水平时的测量值之间的差值不得超过性能类别静态限值的两倍。 \n\n \nRepeat the test with the equipment tilted about the pitch axis instead of the roll axis. 在设备相对于俯仰轴而不是滚转轴倾斜的情况下,重复该试验。 \n\n \n\n## 2.4.3.1.3 Field Strength Variation For Categories H2 Through H5 H2至H5类的场强变化",
    "This test is only applicable for categories H2 through H5. Place the equipment on a level surface at a heading of 45°. The applied magnetic field should be set to total field strength of 0.57 ± 0.02 Gauss at a dip angle of 72° ± 1°. Power the equipment and allow it to initialize. Record the heading output. Change the dip angle of the applied magnetic field to 80° ± 1° while maintaining the same total field strength. Record the heading after waiting one minute or until heading is stabilized,",
    "total field strength. Record the heading after waiting one minute or until heading is stabilized, whichever is greater. The difference between the heading output at the initial dip angle and the heading output at the second dip angle **shall** not exceed the static accuracy limit defined in Table 2-2. 本试验仅适用于H2至H5类。将设备以45°的航向放置在水平面上。所施加的磁场应设置为总场强 0.57±0.02高斯,倾角为72°±1°。给设备加电并使其初始化。记录标题输出。将所施加磁场的倾角改 为80°±1°,同时保持相同的总磁场强度。等待一分钟后记录航向,或直到航向稳定,以较大者为准。 初始倾角下的航向输出与第二倾角下的航向输出之差不得超过表2-2中规定的静态精度限值。",
    "2.4.3.2 \nHeading Dynamic Accuracy, Category H1 through H5 \n航向动态精度,H1至H5类 \n \n2.4.3.2.1 \nCategories H1 through H4 类别H1至H4 \n \nThe equipment **shall** meet the heading accuracy under flight conditions as described in Table 2-2, according to the applicable equipment category. These limits represent 2*RMS values measured against a truth reference. Perform the test using a flight evaluation with a truth reference device. Section 2.4.8 contains a description of the flight evaluation profile.",
    "根据适用的设备类别,设备应满足表2-2所述的飞行条件下的航向精度。这些限值表示相对于真值参 考测量的2*RMS值。使用带有真实参考装置的飞行评估进行测试。部分 2.4.8  包含飞行评估配置文\n件的说明。 \n© 2012 RTCA, Inc. \n\n©2012 RTCA公司 \nNote: The AHRS under test may output magnetic and/or true heading. If available, both should be tested. The truth reference data should be converted to either magnetic or true, whichever is being evaluated. \n\n注:测试中的AHRS可能输出磁和/或真实航向。如果可用,应对两者进行测试。真实参考数据应转换\n为\"磁性\"或\"真实\",以评估的为准。 \n\n \n\n## 2.4.3.2.2 Category H5 类别H5",
    "Test the dynamic accuracy of the heading output using a flight evaluation that conforms to the requirements specified in Section 2.4.8. Conduct the flight evaluation using a truth reference device. The truth reference device and the AHRS heading indication should be visible to the test pilot or test engineer during the flight. Compare the output of the equipment to the output of the truth reference during and after each maneuver defined in the flight evaluation. Record the comparison after each",
    "during and after each maneuver defined in the flight evaluation. Record the comparison after each maneuver. The observed difference in heading angle between the equipment and the truth reference **shall** not exceed the flight condition accuracy specification defined in Table 2-2 for performance category H5.",
    "使用符合第节中规定要求的飞行评估来测试航向输出的动态精度 2.4.8.  使用真实参考装置进行飞 行评估。在飞行过程中,真实参考装置和AHRS航向指示应对试飞员或试飞工程师可见。在飞行评估中 定义的每个机动期间和之后,将设备的输出与真实参考的输出进行比较。记录每次机动后的比较结果。\n设备和真实参考之间观察到的航向角差异不得超过表2-2中规定的性能类别H5的飞行条件精度规范。 \n\n \n2.4.3.3 \nStatic Accuracy, DG Mode, Category H6 through H11 \n静态精度,DG模式,H6至H11类 \n \nThese tests only apply to equipment that implements a DG mode. 这些测试仅适用于实施DG模式的设备。 \n\n \n\n## 2.4.3.3.1 Dg Mode Heading Drift Test Dg模式航向漂移测试",
    "## 2.4.3.3.1 Dg Mode Heading Drift Test Dg模式航向漂移测试\n\n \nStart the equipment and allow it to initialize per normal operating procedures. 启动设备,并按照正常操作程序进行初始化。",
    "Switch the equipment into DG mode and record the heading for the duration defined in the time component of the accuracy specification in Table 2-2. The deviation from the initial reading **shall** not exceed the Heading Drift Accuracy angle defined in Table 2-2 at any time during the test duration. If earth rate is not compensated in the AHRS, then the amount of earth rate applicable to the test location **shall** be corrected in the AHRS data prior to computing the error. For example, for",
    "location **shall** be corrected in the AHRS data prior to computing the error. For example, for category H8, the error must not exceed 5.0° at any point during the 1 hour test.",
    "将设备切换至DG模式,并记录表2-2中精度规范时间部分规定的持续时间内的航向。在试验期间的任 何时候,与初始读数的偏差不得超过表2-2中规定的航向漂移精度角。如果在AHRS中未对地速进行补 偿,则在计算误差之前,应在AHRS数据中修正适用于试验位置的地速。例如,对于H8类,在1小时试\n验期间,任何一点的误差不得超过5.0°。 \n\n \n\n## 2.4.3.3.2 Dg Mode Scale Error Dg模式比例误差\n\n \nStart the equipment and allow it to initialize per normal operating procedures. 启动设备,并按照正常操作程序进行初始化。",
    "Switch the equipment into DG mode and record the initial reading as the zero point of the following calculations. Rotate the equipment 30° around the vertical axis within 5 seconds. Within one second of stopping at the test position record the heading. Repeat the 30° rotations, taking data at each test position until \na full 360° has been completed. The error in heading reported at each position **shall** not exceed 2°.",
    "将设备切换至DG模式,并将初始读数记录为以下计算的零点。在5秒内将设备绕垂直轴旋转30°。在测 试位置停止后的一秒内,记录航向。重复30°旋转,在每个测试位置采集数据,直到完成完整的360°。 每个位置报告的航向误差不得超过2°。",
    "## 2.4.3.3.3 Dg Mode Heading Stability Dg模式航向稳定性",
    "Start the equipment and allow it to initialize per normal operating procedures, including aiding if used. Activate the DG mode. 启动设备,并允许其按照正常操作程序进行初始化,包括辅助操作(如使用)。激活DG模式。",
    "Tilt the equipment to 54° ± 2° about either pitch or roll. Record the heading output within 1 second of achieving this position. Rotate the equipment 360° about the vertical at a rate between 30 and 50 deg/sec and record the output within 1 sec of completing the rotation. The second reading **shall** not differ from the initial reading by more than 2°. Repeat this test rotating in the opposite direction.",
    "将设备倾斜至54°±2°(俯仰或滚转)。在到达该位置的1秒内记录航向输出。以30至50度/秒的速度将 设备绕垂直方向旋转360°,并在完成旋转后1秒内记录输出。第二次读数与初始读数的差异不得超过 2°。以相反方向旋转重复此测试。 \n\n## 2.4.3.4 Dynamic Accuracy, Dg Mode 动态精度,Dg模式\n\nFlight evaluation is used to validate the DG Mode performance for AHRS that include a DG Mode Category (Category H6 through H11). \n\n飞行评估用于验证包括DG模式类别(类别H6至H11)的AHR的DG模式性能。",
    "For category H6 through H9 use the flight test maneuvers described in Section 2.4.8, optionally excluding maneuvers with bank angles exceeding 40°. If the time for the defined flight evaluation is less than the time specified within the category, the maximum drift when compared to the truth reference **shall** not exceed the specified drift multiplied by the flight time divided by the category specified time. If the time for the defined flight evaluation is greater than the time specified",
    "specified time. If the time for the defined flight evaluation is greater than the time specified within the category, the flight evaluation can be limited to the category time.",
    "对于H6至H9类,使用第节中描述的飞行试验机动。 2.4.8, 可选地排除倾斜角超过40°的机动。如果\n规定的飞行评估时间小于类别中规定的时间,则与真实参考比较时,最大漂移不得超过规定漂移乘以 飞行时间除以类别规定时间。如果定义的飞行评估的时间大于类别中指定的时间,则飞行评估可以限\n制为类别时间。",
    "For DG Mode Category H10 and H11, the drift **shall** be validated during two 10 minute segments of the flight. The first segment starts when the aircraft is stationary on the ground and ends when the aircraft is in flight. The second segment starts when the aircraft is in flight and ends when the aircraft is stationary on the ground. The maximum drift when compared to the truth reference **shall** not exceed the specified drift for either of the two segments.",
    "对于DG模式类别H10和H11,应在两个10分钟的飞行段内验证漂移。第一段从飞机在地面静止时开始, 到飞机飞行时结束。第二段从飞机飞行时开始,到飞机在地面上静止时结束。与真实参考相比,最大\n漂移不得超过两段中任何一段的规定漂移。 \n\n \nPrior to each drift test allow the AHRS to stabilize per the manufacturer operation instructions. 在每次漂移试验之前,按照制造商的操作说明使AHRS稳定。",
    "2.4.3.5 \nDG Mode Indication DG模式指示 \n \nThis test only applies to AHRS that support a DG mode. Operate the AHRS in its normal condition, with \naiding as applicable. Switch DG mode on and off. Proper annunciation of the mode **shall** be observed. \n本测试仅适用于支持DG模式的AHR.在正常条件下,在适用的辅助条件下操作AHRS.打开和关闭DG模式。\n应观察模式的正确指示。 \n \n\n## 2.4.3.6 Dg Mode Pilot Adjustment Of Heading Dg模式飞行员航向调整",
    "## 2.4.3.6 Dg Mode Pilot Adjustment Of Heading Dg模式飞行员航向调整\n\n \nOperate the AHRS in DG mode and manually adjust the heading by the manufacturer specified means. \nProper heading adjustment **shall** be observed. \n在DG模式下操作AHRS,并通过制造商规定的方式手动调整航向。应观察适当的航向调整。 \n\n## 2.4.4 Degraded Mode Flight Evaluation 降级模式飞行评估",
    "## 2.4.4 Degraded Mode Flight Evaluation 降级模式飞行评估\n\n \nBegin with the AHRS operating in a normal mode. Simulate applicable failures or remove requisite aiding as appropriate to drive the AHRS into degraded mode(s). These tests are only applicable to equipment with at least one optional degraded mode. Each degraded mode supported **shall** be tested. \n\n首先让AHRS在正常模式下运行。模拟适用的故障或移除必要的辅助设备(视情况而定),以驱动AHRS\n进入降级模式。这些测试仅适用于具有至少一种可选降级模式的设备。应测试支持的每个降级模式。",
    "首先让AHRS在正常模式下运行。模拟适用的故障或移除必要的辅助设备(视情况而定),以驱动AHRS\n进入降级模式。这些测试仅适用于具有至少一种可选降级模式的设备。应测试支持的每个降级模式。 \n\n \nAccomplish the designated flight maneuvers for degraded mode from Table 2-9. During all maneuvers the \nAHRS **shall** be free of oscillations, steps, or other objectionable transients and meet the requirements of \nSection 2.2.4.2 and Section 2.2.4.3. \n完成表2-9中降级模式的指定飞行机动。在所有机动过程中,AHRS应无振荡、阶跃或其他不良瞬态,\n并满足第节的要求 2.2.4.2  和部分 2.2.4.3 . \n \n\n## 2.4.5 Turn And Slip Test Procedures 转弯和打滑试验程序",
    "## 2.4.5 Turn And Slip Test Procedures 转弯和打滑试验程序\n\n \nThis section establishes the test procedures for equipment with turn rate, standard turn bank angle and/or slip \nindicator outputs as prescribed in Section 2.2.5. \n本节规定了设备的测试程序,包括第节中规定的转弯率、标准转弯倾斜角和/或侧滑指示器输出 \n2.2.5. \n\n© 2012 RTCA, Inc. \n\n©2012 RTCA公司 \n\n## 2.4.5.1 Turn Rate Test Procedures 转弯速率测试程序",
    "© 2012 RTCA, Inc. \n\n©2012 RTCA公司 \n\n## 2.4.5.1 Turn Rate Test Procedures 转弯速率测试程序\n\nThe equipment is mounted level. Apply the turn rates specified in Table 2-4 about the vertical axis. The turn rate output **shall** equal the actual within the tolerance prescribed in Table 2-4. \n\n设备水平安装。将表2-4中规定的转弯速率应用于垂直轴。在表2-4规定的公差范围内,转弯率输出应\n等于实际值。",
    "设备水平安装。将表2-4中规定的转弯速率应用于垂直轴。在表2-4规定的公差范围内,转弯率输出应\n等于实际值。 \n\n \nIf the turn rate is not based on heading rate the manufacturer **shall** provide the definition of turn rate for the equipment. 如果转弯速率不是基于航向速率,则制造商应提供设备转弯速率的定义。 \n\n## 2.4.5.2 Standard Turn Bank Angle Test Procedures 标准转弯倾斜角试验程序",
    "## 2.4.5.2 Standard Turn Bank Angle Test Procedures 标准转弯倾斜角试验程序\n\nFor any airspeed within the design range of the equipment, the standard turn rate bank angle output shall indicate a bank angle that would result in a turn rate of 180 ± 36 or 90 \n对于设备设计范围内的任何空速,标准转弯速率倾斜角输出应指示将导致180±36或90的转弯速率的倾\n斜角 ± 18 deg/min when the turn is coordinated. Compliance with this requirement may be demonstrated by analysis. 当转弯协调时,±18度/分钟。可通过分析证明符合此要求。 \n\n## 2.4.5.3 Slip Skid Test Procedures 防滑试验程序",
    "## 2.4.5.3 Slip Skid Test Procedures 防滑试验程序\n\nRoll the equipment to at least the angular range specified in Section 2.2.5.3. The output of the slip data at 0° \n(level) and the endpoints of the roll range tested **shall** be within the tolerances specified in Section 2.2.5.3. \n\n将设备滚动到至少第节中规定的角度范围 2.2.5.3.  0°(水平)时的滑移数据输出和试验的滚动范\n围端点应在第节规定的公差范围内 2.2.5.3. \n\n## 2.4.6 Aiding Tests 辅助测试 2.4.6.1 Loss Of Aiding Source Data 辅助源数据丢失",
    "For each AHRS mode that uses an external aiding source data, start with the AHRS in a steady state operating condition with all aiding sources enabled and valid. Remove an aiding source. The AHRS shall respond in accordance with Section 2.4.6.4. If the given AHRS mode uses more than one aiding source, repeat the test by removing all possible combinations of the aiding sources until the system responses to all possible losses are verified.",
    "对于使用外部辅助源数据的每个AHRS模式,在所有辅助源启用且有效的情况下,以稳态操作条件下的 AHRS开始。移除辅助源。AHRS应根据第节做出响应 2.4.6.4.  如果给定的AHRS模式使用一个以上的\n辅助源,则通过去除所有可能的辅助源组合来重复测试,直到验证了系统对所有可能损失的响应。 \n\n## 2.4.6.2 Annunciated Aiding Source Data Faults 通告的辅助源数据故障",
    "For each AHRS mode that uses an external aiding source data, start with the AHRS in a steady state operating condition, with all aiding sources enabled and valid. Change the status of the aiding source data. \nThe AHRS **shall** respond in accordance with Section \n对于使用外部辅助源数据的每个AHRS模式,从稳态运行条件下的AHRS开始,所有辅助源启用且有效。",
    "对于使用外部辅助源数据的每个AHRS模式,从稳态运行条件下的AHRS开始,所有辅助源启用且有效。\n更改辅助源数据的状态。AHRS应根据第节做出响应 2.4.6.4. If the given AHRS mode uses more than one aiding source or if there is more than one way for the aiding to report its status, repeat the test invalidating each, one at a time. \n2.4.6.4.  如果给定的AHRS模式使用一个以上的辅助源,或者如果辅助设备有一个以上的方法来报告\n其状态,则重复测试,使每个无效,一次一个。",
    "## 2.4.6.3 Un-Annunciated Aiding Source Data Faults 未通告的辅助源数据故障\n\n \nFor those un-annunciated faults identified by the manufacturer as required in Section 2.2.6.4, induce each fault in the aiding source data and verify that the AHRS responds in accordance with Section 2.4.6.4. This test may also be satisfied by analysis. \n对于制造商根据第节的要求确定的未通告故障 2.2.6.4,  在辅助源数据中引入每个故障,并验证\nAHRS是否按照第节的要求响应 2.4.6.4.  该试验也可通过分析来满足。 \n \n© 2012 RTCA, Inc. ©2012 RTCA公司",
    "## 2.4.6.4 Test For Aiding Source Issues 辅助源问题测试 2.4.6.4.1 Pitch/Roll Test 纵摇/横摇试验\n\nFollowing the change in condition of an aiding source, the AHRS **shall** make the proper annunciation in accordance with Section 2.2.1.4 and **shall** do at least one of the following: \n在援助来源的条件发生变化后,AHRS应根据第节进行适当的通知 2.2.1.4 并应至少做到以下一项:",
    "1. Meet the requirements of Section 2.2.2 for the current mode. \n满足章节要求 2.2.2  对于当前模式。 \n2. Switch to a different mode (A1-A5) and meet the requirements for that mode. \n切换到不同的模式(A1-A5)并满足该模式的要求。 \n3. Switch to a degraded mode and meet the requirements in Section 2.2.4. \n切换到降级模式并满足第节中的要求 2.2.4. \n4. Remove and/or invalidate the output. \n删除和/或使输出无效。 \n\n## 2.4.6.4.2 Heading Test 航向试验",
    "## 2.4.6.4.2 Heading Test 航向试验\n\nFollowing the change in condition of an aiding source, the AHRS **shall** make the proper annunciation in accordance with 2.2.1.4 and **shall** do at least one of the following: \n在援助来源的状况发生变化后,AHRS应根据以下要求发出适当的通知 2.2.1.4  并应至少做到以下一\n项:",
    "1. Meet the requirements of Section 2.2.3 for the current mode. \n满足章节要求 2.2.3  对于当前模式。 \n2. Switch to a different mode (H1-H11) and meet the requirements for that mode. \nPilot activation of \nDG mode is an acceptable means of meeting this requirement. \n切换到不同的模式(H1-H11)并满足该模式的要求。DG模式的飞行员激活是满足该要求的可\n接受方法。 \n3. Switch to a degraded mode and meet the requirements in Section 2.2.4. \n切换到降级模式并满足第节中的要求 2.2.4. \n4. Remove and/or invalidate the output. \n删除和/或使输出无效。 \n\n## 2.4.6.4.3 Turn And Slip Test 转向和滑转试验",
    "## 2.4.6.4.3 Turn And Slip Test 转向和滑转试验\n\nFollowing the change in condition of an aiding source, the AHRS **shall** make the proper annunciation in accordance with 2.2.1.4 and **shall** do at least one of the following: \n在援助来源的状况发生变化后,AHRS应根据以下要求发出适当的通知 2.2.1.4  并应至少做到以下一\n项: \n\n \n1. Meet the requirements of Section 2.2.5 for the current mode. \n满足章节要求 2.2.5  对于当前模式。 \n2. Remove and/or invalidate the output. \n删除和/或使输出无效。 \n\n## 2.4.7 Multi-Axis Dynamic Accuracy Laboratory Test 多轴动态精度实验室测试",
    "2.4.7.1 \nHeading Modes, Category H1 through H5 航向模式,H1至H5类",
    "For equipment that offers magnetic slaving or gyro compassing heading modes of operation (heading performance categories H1 through H5), mount the equipment on a Scorsby table or equivalent. After application of normal rated power and following the alignment period, record the heading and attitude output values. Oscillate the equipment in roll, pitch and yaw at an angle of at least ± 7.5° at a frequency of 5 to 7 cycles per minute for 30 minutes and return the equipment to a level position. It",
    "of 5 to 7 cycles per minute for 30 minutes and return the equipment to a level position. It is permissible to conduct this test in three 30 minute portions of dual-axis simultaneous motion: 1) roll- pitch, 2) roll-yaw and 3) pitch-yaw with 90° of phase between the two axes for each portion of the test. Within 10 seconds after returning to the level position, record the heading and attitude outputs. The ending heading and attitude values **shall** not differ from the initial readings by more",
    "The ending heading and attitude values **shall** not differ from the initial readings by more than the dynamic limits in Table 2-1 and Table 2-2 (for heading performance categories H1 through H5).",
    "对于提供磁性从动或陀螺罗盘航向操作模式的设备(航向性能类别H1至H5),将设备安装在Scorsby 工作台或同等设备上。在施加正常额定功率后,在对准周期后,记录航向和姿态输出值。以每分钟5\n至7个周期的频率,以至少±7.5°的角度,在滚转、俯仰和偏航方向上摆动设备30分钟,并将设备恢复\n到水平位置。允许在三个30分钟的双轴同步运动中进行该试验:1)滚动-俯仰,2)滚动-偏航和3)\n俯仰-偏航,每个试验部分的两个轴之间的相位为90°。在返回水平位置后的10秒内,记录航向和姿态\n输出。结束航向和姿态值与初始读数的差异不得超过表2-1和表2-2中的动态限值(适用于航向性能类\n别H1至H5)。 \n© 2012 RTCA, Inc. \n\n©2012 RTCA公司 \n\n## 2.4.7.2 Dg Heading Modes, Category H6 Through H11 Dg航向模式,H6至H11类",
    "For AHRS that offer DG heading modes of operation (heading performance categories H6 through H11)",
    "mount the equipment on a Scorsby table or equivalent. After application of normal rated power and following the alignment period, switch the equipment into DG heading mode and record the heading and attitude output values. Oscillate the equipment in roll, pitch and yaw at an angle of at least ± 7.5° at a frequency of 5 to 7 cycles per minute for the duration specified in Table 2-8. Return the equipment to a level position. It is permissible to conduct this test in three portions of dual-axis",
    "to a level position. It is permissible to conduct this test in three portions of dual-axis simultaneous motion: 1) roll-pitch, 2) roll-yaw and 3) pitch-yaw with 90° of phase between the two axes for each portion of the test. Within 10 seconds after returning to the level position, record the heading and attitude outputs. The ending attitude values **shall** not differ from the initial readings by more than the dynamic limits in Table 2-1, and the ending heading value **shall** not differ from",
    "more than the dynamic limits in Table 2-1, and the ending heading value **shall** not differ from the initial reading by more than the maximum allowable heading drift value specified in Table 2-8.",
    "对于提供DG航向操作模式(航向性能类别H6至H11)的AHR,将设备安装在Scorsby工作台或同等设备 上。在施加正常额定功率后,在对准期间,将设备切换到DG航向模式,并记录航向和姿态输出值。在\n表2-8中规定的持续时间内,以每分钟5至7个周期的频率,以至少±7.5°的角度,在滚动、俯仰和偏航\n中摆动设备。将设备放回水平位置。允许在双轴同步运动的三个部分中进行该试验:1)滚动-俯仰,\n2)滚动-偏航和3)俯仰-偏航,每个试验部分的两个轴之间的相位为90°。在返回水平位置后的10秒\n内,记录航向和姿态输出。结束姿态值与初始读数的差异不得超过表2-1中的动态限值,结束航向值\n与初始读数的差异不得超过表2-8中规定的最大允许航向漂移值。 \n\n## 表2-8 Dg模式Scorsby表测试参数",
    "| DG Mode Heading                | Duration of Applied    | Maximum Allowable Heading    |\n|--------------------------------|------------------------|------------------------------|\n| Performance Category           | Scorsby Table Test     | During Scorsby Table Test    |\n| 斯科斯比摇床试验期间的最大允许 |                        |                              |\n| Motion                         |                        |                              |",
    "| Motion                         |                        |                              |\n| DG模式航向性能类别             |                        |                              |\n|                                |                        |                              |\n| 应用Scorsby工作台测试          |                        |                              |\n| 航向漂移                       |                        |                              |",
    "| 航向漂移                       |                        |                              |\n|                                |                        |                              |\n| 运动的持续时间                 |                        |                              |\n|                                |                        |                              |\n| (degrees)                      |                        |                              |",
    "| (degrees)                      |                        |                              |\n| (度)                           |                        |                              |\n|                                |                        |                              |\n| H6                             | 6 hours                | 2.0                          |\n| 6小时                          |                        |                              |",
    "| 6小时                          |                        |                              |\n|                                |                        |                              |\n| H7                             | 3 hours                | 2.0                          |\n| 3小时                          |                        |                              |\n|                                |                        |                              |",
    "|                                |                        |                              |\n| 5.0                            | H8                     | 1 hour                       |\n| 1小时                          |                        |                              |\n|                                |                        |                              |\n| 30.0                           | H9                     | 1 hour                       |",
    "| 30.0                           | H9                     | 1 hour                       |\n| 1小时                          |                        |                              |\n|                                |                        |                              |\n| H10                            | 10 minutes             | 5.0                          |\n| 10分钟                         |                        |                              |",
    "| 10分钟                         |                        |                              |\n|                                |                        |                              |\n| H11                            | 10 minutes             | 10.0                         |\n| 10分钟                         |                        |                              |\n|                                |                        |                              |",
    "## 2.4.7.3 Equipment With No Heading Output, Category Hx 无航向输出的设备,Hx类",
    "For equipment that does not offer heading output (heading performance categories HX), mount the equipment on a Scorsby table or equivalent. After application of normal rated power and following the alignment period, record the attitude output values. Oscillate the equipment in roll, pitch and yaw at an angle of at least ± 7.5° at a frequency of 5 to 7 cycles per minute for 30 minutes. Return the equipment to a level position. It is permissible to conduct this test in three portions of dual-axis",
    "to a level position. It is permissible to conduct this test in three portions of dual-axis simultaneous motion: 1) roll-pitch, 2) roll-yaw and 3) pitch-yaw with 90° of phase between the two axes for each portion of the test. Within 10 seconds after returning to the level position, record the attitude outputs. The ending attitude values **shall** not differ from the initial readings by more than the dynamic limits in Table 2-1.",
    "对于不提供航向输出的设备(航向性能类别HX),将设备安装在Scorsby工作台或同等设备上。在施\n加正常额定功率后,并在对准周期后,记录姿态输出值。以每分钟5至7个周期的频率,以至少±7.5°\n的角度,在滚动、俯仰和偏航中摆动设备30分钟。将设备放回水平位置。允许在双轴同步运动的三个 部分中进行该试验:1)滚动-俯仰,2)滚动-偏航和3)俯仰-偏航,每个试验部分的两个轴之间的相\n位为90°。在返回水平位置后的10秒内,记录姿态输出。终止姿态值与初始读数的差值不得超过表2-1\n中的动态限值。 \n\n## 2.4.8 Flight Evaluation For Declared Performance Categories 申报性能类别的飞行评估",
    "## 2.4.8 Flight Evaluation For Declared Performance Categories 申报性能类别的飞行评估\n\nPerform a flight evaluation to ensure compliance with the dynamic performance requirements which are shown in the Dynamic and Flight Conditions columns of Table 2-1 and Table 2-2. Although testing in a single aircraft type cannot guarantee performance in all aircraft types, the flight evaluation is intended to exercise the \n进行飞行评估,以确保符合表2-1和表2-2的动态和飞行条件栏中所示的动态性能要求。虽然单一机型\n的试验不能保证所有机型的性能,但飞行评估的目的是运用 \n© 2012 RTCA, Inc.",
    "equipment under dynamic conditions that cannot be mechanically simulated with static ground testing. The flight evaluation **shall** include shallow, standard and steep turns in both the left and right directions, extended periods of acceleration and deceleration, significant changes in altitude, straight and level flight, and uncoordinated maneuvers with lateral acceleration in both right and left directions (such as side slips). Table 2-9 shows a recommended flight profile which exercises the",
    "directions (such as side slips). Table 2-9 shows a recommended flight profile which exercises the AHRS with all the dynamic conditions described above. During the actual flight evaluation, the profile may be modified as needed to accommodate air traffic, logistics and local conditions provided equivalent maneuvers are performed. It is intended that this evaluation be accomplished in a single flight. For DG mode, categories H6 through H9 (if included), the flight evaluation **shall** be a",
    "flight. For DG mode, categories H6 through H9 (if included), the flight evaluation **shall** be a minimum of one hour.",
    "动态条件下的设备,不能用静态地面试验进行机械模拟。飞行评估应包括左右两个方向的浅转弯、标 准转弯和陡转弯、长时间的加速和减速、高度的显著变化、直线和水平飞行以及左右两个方向横向加 速的不协调机动(如侧滑)。表2-9显示了在上述所有动态条件下使用AHRS的推荐飞行剖面。在实际 飞行评估期间,可以根据需要修改剖面,以适应空中交通、后勤和当地条件,前提是执行等效机动。",
    "计划在一次飞行中完成该评估。对于DG模式,H6至H9类(如果包括),飞行评估应至少为一小时。 Throughout the flight evaluation collect data (e.g., computer acquisition, video, or manual) from the AHRS and the reference system. For Categories A1 through A4 and H1 through H4, the flight evaluation results shall be determined by measuring twice the RMS difference of the AHRS and the truth reference system.",
    "The data used to calculate the RMS should include all maneuvers and a portion of each straight and level flight immediately following the maneuver. The total time of straight and level flight following the maneuvers, included in the RMS calculation, **shall** not exceed the total time of the maneuvers. Maneuver number 2, in particular, should be counted as maneuver time and not part of the straight and level time.",
    "在整个飞行评估过程中,从AHRS和参考系统收集数据(例如,计算机采集、视频或手册)。对于A1至 A4类和H1至H4类,应通过测量两倍的AHRS和真实参考系的均方根差来确定飞行评估结果。用于计算 RMS的数据应包括所有机动和紧随机动之后的每次直线和水平飞行的一部分。包括在RMS计算中的机动 之后的直线和水平飞行的总时间不得超过机动的总时间。特别是2号机动,应计为机动时间,而不是\n直线和水平时间的一部分。 \n\n \nThe manufacturer shall provide the actual flight test profile used to meet the requirements of this section. This profile will include the speed range through which the flight test was conducted. \n\n制造商应提供用于满足本节要求的实际飞行试验剖面。该剖面将包括进行飞行试验的速度范围。",
    "制造商应提供用于满足本节要求的实际飞行试验剖面。该剖面将包括进行飞行试验的速度范围。 \n\n \nFor categories A1 through A4, at any time during the flight evaluation, the one second averages of the differences between the truth system and the AHRS pitch and roll **shall** not exceed two times the value specified in the Dynamic and Flight Conditions column of Table 2-1.",
    "对于A1至A4类,在飞行评估期间的任何时候,真实系统与AHRS俯仰和滚转之间的差异的一秒平均值不\n得超过表2-1动态和飞行条件栏中规定值的两倍。 \n \nFor categories H1 through H4, at any time during the flight evaluation, the one second averages of the differences between the truth system and the AHRS heading **shall** not exceed two times the value specified in the Dynamic and Flight Conditions column of Table 2-2. \n\n对于类别H1至H4,在飞行评估期间的任何时候,真实系统和AHRS航向之间的差异的一秒平均值不得超\n过表2-2的动态和飞行条件栏中规定的值的两倍。 \n\n \nNote: \n注意:",
    "1. Before the data between the truth system and AHRS are compared, minor adjustments may be \nmade to the data to account for the mounting alignment, timing and filtering differences between the truth system and the AHRS being tested. \n在比较真实系统和AHRS之间的数据之前,可以对数据进行微小的调整,以说明真实系统和被\n测试的AHRS之间的安装对准、定时和滤波差异。 \n2. Note: The following flight evaluation maneuvers may not be adequate to ensure proper operation",
    "2. Note: The following flight evaluation maneuvers may not be adequate to ensure proper operation \nin an aircraft other than the one in which testing was performed. For example, helicopters may operate at low speeds and in an uncoordinated manner (See Table 3-1). \n注:以下飞行评估机动可能不足以确保在进行试验的飞机以外的飞机上正确操作。例如,直\n升机可能以低速和不协调的方式运行(见 表3-1 ).",
    "Flight Evaluation Profile: Standard Maneuvers \n飞行评估剖面:标准机动 \nNo. \nManeuver \n不。 \n机动 \n1 \nTaxi, Take Off, Climb Out 出租车,起飞,爬出去 \n \nNo 不 \n2 \nStraight and level 笔直而水平 \n10 minutes 10分钟 \n3 \nStandard rate left turn 标准费率左转 \n360° of heading change 360°航向变化 \n4 \nStandard rate right turn \n标准费率右转 \n360° of heading change \n360°航向变化 \n5 \nStandard rate left or right turn 标准费率左转或右转 \n180° of heading change at 1.3 Vs 1.3 vs时航向变化180° \n6 \nStandard rate left or right turn 标准费率左转或右转",
    "180° of heading change at 1.3 Vs 1.3 vs时航向变化180° \n6 \nStandard rate left or right turn 标准费率左转或右转 \n180° of heading change at high-speed cruise 高速巡航时航向变化180° \n7 \nHalf Standard rate left turn 半标准费率左转 \n180° of heading change 航向变化180° \n8 \nHalf Standard rate right turn 半标准速率右转 \n180° of heading change 航向变化180° \n9 \nShallow bank left turn, 6° bank 浅岸左转,6°岸 \n90° of heading change 航向变化90° \n10 \nShallow bank right turn, 6° bank 浅岸右转,6°岸 \n90° of heading change 航向变化90° \n11",
    "10 \nShallow bank right turn, 6° bank 浅岸右转,6°岸 \n90° of heading change 航向变化90° \n11 \nSteep turn left, 45° bank 陡峭的左转,45°倾斜 \n360° of heading change 360°航向变化 \n12 \nSteep turn right, 45° bank 陡峭右转,45°河岸 \n360° of heading change 360°航向变化 \n13 \nSteep turn left, 60° bank 陡峭的左转,60°倾斜 \n540° of heading change 航向变化540° \n14 \nSteep turn right, 60° bank 陡峭的右转,60°倾斜 \n540° of heading change 航向变化540° \n15 \nLazy eight 懒八 \n \nNo 不 \n1.15 Vso, 90 seconds 1.15 VSO,90秒 \n16",
    "540° of heading change 航向变化540° \n15 \nLazy eight 懒八 \n \nNo 不 \n1.15 Vso, 90 seconds 1.15 VSO,90秒 \n16 \nMaintain minimum speed 保持最低速度 Straight and level 笔直而水平 \n17 \nAccelerate (Note 2) 加速(注2) \nMin 1 knots/s for 40 seconds 最小1节/秒,持续40秒 \n18 \nDecelerate (Note 2) 减速(注2) \nMin 1 knots/s for 40 seconds 最小1节/秒,持续40秒 \n19 \nPitch Up 向上倾斜 \nFrom max level speed, pitch up and maintain delta 7.5° nose up until 1.3 Vs or 90 seconds, whichever comes first \n从最大水平速度开始,向上俯仰并保持机头向上\n7.5°,直到1.3vs或90秒,以先到者为准 \n20",
    "从最大水平速度开始,向上俯仰并保持机头向上\n7.5°,直到1.3vs或90秒,以先到者为准 \n20 \nPitch Down 向下倾斜 \nFrom 1.3 Vs, pitch down and maintain delta 7.5° nose down until near maximum speed or 90 seconds, whichever comes first 从1.3Vs开始,向下俯仰,并保持德尔塔7.5°机头 向下,直到接近最大速度或90秒,以先到者为准 \nCondition \nEvaluate in \nDegraded \n条件 \nMode \n在降级模式\n下求值 \nYes 是的 \nYes 是的 \nYes \n是的 Yes 是的 \nYes 是的 Yes 是的 Yes 是的 \nYes 是的 Yes 是的 \nYes 是的 \nYes 是的 \nNo 不 No 不 \nYes 是的 Yes 是的 Yes 是的 Yes 是的 Yes 是的",
    "Yes 是的 Yes 是的 Yes 是的 \nYes 是的 Yes 是的 \nYes 是的 \nYes 是的 \nNo 不 No 不 \nYes 是的 Yes 是的 Yes 是的 Yes 是的 Yes 是的 \n| Min sustained lateral acceleration of 0.1g, 30            | seconds              |   21  | Steady heading side slip - right    |\n|-----------------------------------------------------------|----------------------|-------|-------------------------------------|\n| 稳定航向侧滑-右                                           |                      |       |                                     |",
    "|                                                           |                      |       |                                     |\n| 最小持续横向加速度0.1G,30秒                               |                      |       |                                     |\n|                                                           |                      |       |                                     |",
    "| Yes                                                       |                      |       |                                     |\n| 是的                                                      |                      |       |                                     |\n|                                                           |                      |       |                                     |",
    "| Min sustained lateral acceleration of 0.1g, 30            | seconds              |   22  | Steady heading side slip - left     |\n| 稳定航向侧滑-左                                           |                      |       |                                     |\n|                                                           |                      |       |                                     |",
    "| 最小持续横向加速度0.1G,30秒                               |                      |       |                                     |\n|                                                           |                      |       |                                     |\n| Yes                                                       |                      |       |                                     |",
    "| 是的                                                      |                      |       |                                     |\n|                                                           |                      |       |                                     |\n| 23                                                        | Approach and Landing |       |                                     |",
    "| 进场着陆                                                  |                      |       |                                     |\n|                                                           |                      |       |                                     |\n| Yes                                                       |                      |       |                                     |",
    "| 是的                                                      |                      |       |                                     |\n|                                                           |                      |       |                                     |\n| Descent from en route environment, followed by full       |                      |       |                                     |",
    "| procedure non precision (dive and drive) approach,        |                      |       |                                     |\n| with missed to the hold, 2 turns in the hold, and another |                      |       |                                     |\n| approach to a full stop landing.                          |                      |       |                                     |",
    "| 从途中环境下降,然后是完整的程序非精确(俯冲                |                      |       |                                     |\n| 和驾驶)进场,错过了货舱,在货舱内转弯2次,                   |                      |       |                                     |\n| 另一次进场完全停止着陆。                                  |                      |       |                                     |\n|                                                           |                      |       |                                     |",
    "Note: \n注意: \n \n\n1. All maneuvers, except number 1, 2, 14 and 21 should be followed by at least 60 seconds of straight \nand level operation to assess equipment response and stability. If the equipment has settled sooner \nthan 60 seconds, a shorter straight and level operation is permissible. \n除1号、2号、14号和21号外,所有机动之后应进行至少60秒的直线和水平操作,以评估设备\n的响应和稳定性。如果设备在60秒内稳定,则允许进行较短的直线和水平操作。 \n2. Pitch changes may be used to achieve the desired acceleration/deceleration \nprofile. \n桨距变化可用于实现所需的加速/减速曲线。",
    "## 2.5 Requirements For Display Of Pitch, Roll, Heading And Turn And Slip Information 俯仰、滚转、航向、转弯和滑转信息显示要求\n\nThe requirements of this section apply to AHRS that include an optional display or to a stand-alone display system that will present information generated by an AHRS. This section contains design requirements. The associated tests are in Section 2.6. \n\n本节的要求适用于包括可选显示器的AHRS,或适用于将显示AHRS生成的信息的独立显示系统。本节包\n含设计要求。相关测试见第节 2.6.",
    "本节的要求适用于包括可选显示器的AHRS,或适用于将显示AHRS生成的信息的独立显示系统。本节包\n含设计要求。相关测试见第节 2.6. \n\n \nThese requirements are derived from the historically accepted marking requirements of the applicable TSOs for pitch, roll, direction, turn and slip. Compatibility with emerging cockpit display technology may require characteristics differing from those specified herein. In these cases an alternate means of compliance will be acceptable upon the approval of the certification authority.",
    "这些要求源自适用Tso对俯仰、滚转、方向、转弯和滑动的历史认可标记要求。与新兴的驾驶舱显示 技术的兼容性可能需要不同于本文所述的特性。在这些情况下,在认证机构批准后,可接受替代的合\n规方式。 \n\n \nIn addition to meeting the requirements of this section, requirements such as those found in SAE ARP 4102/7 and/or minimum operational performance specifications associated with TSO C113 are acceptable. \n\n除满足本节要求外,SAE ARP 4102/7和/或与Tso C113相关的最低运行性能规范中的要求也是可以接\n受的。",
    "除满足本节要求外,SAE ARP 4102/7和/或与Tso C113相关的最低运行性能规范中的要求也是可以接\n受的。 \n\n \nPerformance requirements, such as accuracy or latency, for the display portion of the system are not defined in this document. Performance of complete systems will have to be evaluated during installation approval. \n本文件未定义系统显示部分的性能要求,如精度或延迟。在安装批准期间,必须对整个系统的性能进\n行评估。 \n\n## 2.5.1 General Display Requirements 一般显示要求",
    "## 2.5.1 General Display Requirements 一般显示要求\n\n \nThe display hardware should conform to an accepted standard for display quality requirements, such as visibility, parallax, reflectance, viewing angles, jitter, and flicker. One example of an accepted standard is TSO-C113. \n\n显示器硬件应符合显示器质量要求的公认标准,例如可见度、视差、反射率、视角、抖动和闪烁。可\n接受标准的一个示例是Tso-C113。 \n\n \n\n## 2.5.2 Annunciation 报喜\n\n \nThe display **shall** indicate when a condition is required to be annunciated as identified in Section 2.2.1.4.",
    "显示器应显示需要通知的条件,如第节所述 2.2.1.4. \n\n \n\n## 2.5.3 Pitch And Roll 俯仰和翻滚",
    "Present pitch and roll angles such that over the range of indication the earth horizon presentation shall appear as viewed by the pilot when looking forward out of the aircraft. \n显示俯仰角和滚转角,以便在指示范围内,当飞行员从飞机向前看时,地球地平线显示应显示为飞行\n员所见。 \n \nThe pitch display **shall** provide minor graduation lines every 5° and major graduation lines every 10° between -30° and +50°. This entire range need not be visible at one time. The major graduations **shall** be",
    "marked with their numerical value. The design **shall** provide suitable contrast between sky and ground segments such that pitch up/down are 节距显示器应在-30°和+50°之间每隔5°提供一条小刻度线,每隔10°提供一条大刻度线。这整个范围\n不需要一次都可见。主要刻度应标有其数值。设计应在天空和地面部分之间提供适当的对比度,以便\n俯仰向上/向下 \n© 2012 RTCA, Inc.",
    "©2012 RTCA公司 \nimmediately recognizable. Some indication of both sky and ground **shall** always be visible even at extreme attitudes. 立即可识别。即使在极端情况下,天空和地面的一些指示也应始终可见。 \n\n \nA 0° pitch reference **shall** be provided. The 0° pitch reference may be adjustable to accommodate a range of pitch attitude trim. \n\n应提供0°节距参考。0°俯仰基准可以调整,以适应一定范围的俯仰姿态配平。",
    "应提供0°节距参考。0°俯仰基准可以调整,以适应一定范围的俯仰姿态配平。 \n\n \nThe display **shall** provide a roll attitude index that indicates through 360 ° of bank with markings at least for \n0° and 30° right and left roll angles. 显示器应提供一个滚转姿态指数,该指数至少在0°和30°左右滚转角范围内显示360°倾斜。 \n\n \nNote: Some regulations require that adjustments of attitude reference not be accessible to the flight crew. \n\n注:有些规定要求飞行机组人员不能接近姿态基准的调整。 \n\n \n\n## 2.5.4 Direction Indicator 方向指示器",
    "注:有些规定要求飞行机组人员不能接近姿态基准的调整。 \n\n \n\n## 2.5.4 Direction Indicator 方向指示器\n\n \nDirection, if provided, **shall** be indicated using either of the two following methods: \n如果提供了方向,则应使用以下两种方法中的任何一种进行指示:",
    "1. A rotating dial or dial segment with a fixed datum or lubber line; dial rotation \n旋转刻度盘或具有固定基准线或滑线的刻度盘部分;刻度盘旋转 \nshall be counterclockwise for right turns. \n右转时应为逆时针方向。 \n2. A horizontal scale display with fixed datum or lubber line; scale graduations \n具有固定基准面或基准线的水平刻度显示器;刻度刻度 \nshall move to the left for right turns. \n右转弯时应向左移动。",
    "具有固定基准面或基准线的水平刻度显示器;刻度刻度 \nshall move to the left for right turns. \n右转弯时应向左移动。 \nThe indicator **shall** provide minor graduation lines at 5° or smaller intervals with major graduation lines every 10°. In addition, direction numerals **shall** be provided at 30°, 60°, 120°, 150°, 210°, 240°, 300°, and \n330°. The markings at 0° (360°), 90°, 180°, and 270° 指示器应以5°或更小的间隔提供次要刻度线,每10°提供主要刻度线。此外,应在30°、60°、120°、 150°、210°、240°、300°和330°处提供方向数字。0°(360°)、90°、180°和270°处的标记",
    "shall be either numerals or the letters \"N\", \"E\", \"S\", and \"W\" respectively.",
    "应分别为数字或字母\" N \"、\" E \"、\" S \"和\" W \"。",
    "Direction of flight indications may be shown using aircraft heading or ground track. If more than one \noperating mode is provided, the direction reference **shall** be clearly indicated to the pilot. In addition, the \ndirection of flight reference may be displayed in various units, such as magnetic north, true north, or grid \nnorth reference. The direction reference **shall** be indicated if more than one method is available. \n飞行指示的方向可以使用飞机航向或地面航迹来显示。如果提供了多个操作模式,则应向飞行员清楚",
    "飞行指示的方向可以使用飞机航向或地面航迹来显示。如果提供了多个操作模式,则应向飞行员清楚\n地指示方向参考。此外,飞行方向参考可以以各种单位显示,例如磁北、真北或网格北参考。如果有\n一种以上的方法可用,则应指示方向参考。 \n \nIn addition, a digital display of aircraft direction may be provided to supplement the compass card or heading scale indications. 此外,可提供飞机方向的数字显示,以补充罗盘卡或航向刻度指示。",
    "2.5.5 \nTurn Rate, Standard Turn Bank Angle and Slip/Skid 转弯率、标准转弯倾斜角和滑动/打滑 \n \nTurn rate, standard turn bank angle and slip are optional functions. 转弯率、标准转弯倾斜角和滑移是可选功能。 \n \n2.5.5.1 \nTurn Rate 转弯率 \n \nThe turn rate **shall** be indicated by a pointer deflecting in the direction of the turn, or by other means equally suitable. If the aircraft is not turning, the pointer **shall** align with the center tick mark or be removed from \nview. \n转弯速率应通过在转弯方向上偏转的指针或其他同样合适的方式指示。如果飞机不转弯,指针应与中",
    "view. \n转弯速率应通过在转弯方向上偏转的指针或其他同样合适的方式指示。如果飞机不转弯,指针应与中\n心刻度线对齐或从视图中移除。 \nWhen displaying rate of turn by means of a pointer on a fixed scale, indices for standard rate (180 deg/min) \nshall be provided. Indices for half standard rate (90 deg/min) may be provided.",
    "当通过指针在固定刻度上显示转弯率时,应提供标准转弯率(180度/分钟)的指数。可提供半标准速\n率(90度/分钟)的指数。 \n \nThe range of the rate of turn indicator **shall** be a minimum of ± 240 deg/min. \n\n转动率指示器的范围应至少为±240 deg/min. \n\n \n\n## 2.5.5.2 Standard Turn Bank Angle 标准转弯倾斜角\n\nThe standard rate bank angle **shall** be indicated on the roll scale in both directions when it is displayed. \n\n显示时,应在滚动标尺的两个方向上显示标准倾斜角。 \n\n## 2.5.5.3 Slip/Skid 滑动/打滑",
    "显示时,应在滚动标尺的两个方向上显示标准倾斜角。 \n\n## 2.5.5.3 Slip/Skid 滑动/打滑\n\nSlip/skid **shall** be indicated by a figure or object moving with respect to a reference or by other means equally suitable. One example is a ball moving in a tube with reference marks centered in the tube, one ball width apart. Another example is a rhombus moving with respect to a roll marker triangle. \n\n滑动/打滑应通过相对于参考移动的图形或物体或其他同样合适的方式来指示。一个例子是在管中移\n动的球,参考标记在管中居中,相距一个球的宽度。另一个例子是相对于滚动标记三角形移动的菱形。",
    "滑动/打滑应通过相对于参考移动的图形或物体或其他同样合适的方式来指示。一个例子是在管中移\n动的球,参考标记在管中居中,相距一个球的宽度。另一个例子是相对于滚动标记三角形移动的菱形。 \n\n \nWhen the AHRU is static on the bench and is rolled in a direction, the slip indicator (e.g. ball or rhombus) \nshall deflect in that same direction. \n\n当AHRU在工作台上静止并在一个方向上滚动时,滑动指示器(例如球或菱形)应在同一方向上偏转。 \n\n \nIt is recognized that different scaling may be required for different applications. The manufacturer shall specify the scaling. 应当认识到,不同的应用可能需要不同的缩放比例。制造商应规定缩放比例。",
    "The slip indicator width (e.g. ball or rhombus width) **shall** be 3° to 8°. The range each side of level **shall** be \nthe greater of one and a half indicator widths or 7°. \n滑动指示器的宽度(例如球形或菱形宽度)应为3°至8°。液位每侧的范围应为1.5个指示器宽度或7°\n中的较大值。 \n \n \n2.6 \nDisplay Tests. \n显示测试。 \n \n2.6.1 \nGeneral Display Tests. \n一般显示测试。 \n \nConforming to an acceptable standard may be accomplished by analysis or test. 符合可接受的标准可以通过分析或测试来实现。",
    "2.6.2 \nDisplay Annunciation Test. 显示通告测试。 \n \nFor each condition in Section 2.2.1.3 that requires a display annunciation, verify that the display annunciates the condition. 对于第2.2.1.3节中需要显示通告的每个条件,验证显示通告该条件。 \n\n \n\n## 2.6.3 Pitch And Roll Display Test 俯仰和横滚显示测试\n\n \nThe pitch and roll display **shall** ensure the following: \n俯仰和滚动显示应确保:",
    "1. Pitch displays minor graduation lines at 5° between -30° and +50°. \nPitch在-30°和+50°之间的5°处显示次要刻度线。 \n2. Pitch displays major graduation lines every 10° between -30° and +50°. \nPitch在-30°和+50°之间每隔10°显示一条主要刻度线。 \n3. Pitch displays major graduations are marked with their numerical value. \n节距显示器主要刻度标有其数值。 \n4. Pitch display provides suitable contrast between sky and ground. \n俯仰显示在天空和地面之间提供适当的对比度。 \n5. Roll indicates through 360° of bank. \n滚转表示通过360°倾斜。",
    "俯仰显示在天空和地面之间提供适当的对比度。 \n5. Roll indicates through 360° of bank. \n滚转表示通过360°倾斜。 \n6. The roll attitude index has markings for 0° and 30° right and left roll angles. \n滚转姿态指数有0°和30°左右滚转角的标记。",
    "7. A 0° pitch reference is provided. \n提供0°俯仰基准。 \n\n## 2.6.4 Direction Indicator Display Test 方向指示器显示测试\n\nThe direction indicator **shall** perform as follows: \n方向指示器的性能如下:",
    "1. The AHRS displays direction by one of the two methods described in Section \n2.5.4. \nAHRS通过第2.5.4节所述的两种方法之一显示方向。 \n2. The AHRS displays minor graduation lines at 5° or smaller intervals. \nAHRS以5°或更小的间隔显示次要刻度线。 \n3. The AHRS displays major graduation lines every 10°. \nAHRS每隔10°显示一条主刻度线。 \n4.   The AHRS display has makings at 30°, 60°, 120°, 150°, 210°, 240°, 300°, and AHRS显示器具有30°、60°、120°、150°、210°、240°、300°和 \n330°. The markings at 0° (360°), 90°, 180°, and 270° may be either numerals or",
    "330°. The markings at 0° (360°), 90°, 180°, and 270° may be either numerals or \nthe letters \"N\", \n\"E\", \"S\", and \"W\" respectively. \n330°.0°(360°)、90°、180°和270°处的标记可以分别是数字或字母\" N \"、\" E \"、\" S \"和 \" W \"。 \nIf the direction indicator can display both heading and ground track, ensure the display provides a clear indication to the pilot whether heading or ground track is being displayed.",
    "如果方向指示器可以同时显示航向和地面航迹,确保显示器向飞行员提供清晰的指示,无论显示的是\n航向还是地面航迹。 \n\n \n\n## 2.6.5 Turn And Slip Indicator Tests 转向和侧滑指示器测试\n\n \n\n## 2.6.5.1 Rate Of Turn Display Test 转数显示试验\n\n \nThe rate of turn **shall** be displayed in accordance with Section 2.5.5.1. \n\n应按照第2.5.5.1节的要求显示转弯率。 \n\n \n\n## 2.6.5.2 Standard Turn Bank Angle Display Test 标准转弯倾斜角显示试验\n\n \nThe standard rate bank angle **shall** be displayed in accordance with Section 2.5.5.2. \n\n应根据第2.5.5.2节显示标准倾斜角。 \n\n \n\n## 2.6.5.3 Slip/Skid Display Test 滑动/打滑显示测试",
    "应根据第2.5.5.2节显示标准倾斜角。 \n\n \n\n## 2.6.5.3 Slip/Skid Display Test 滑动/打滑显示测试\n\n \nThe slip/skid **shall** be displayed in accordance with Section 2.2.5.3. \n\n滑动/打滑应按照第节的规定显示 2.2.5.3. \n\n \n© 2012 RTCA, Inc. ©2012 RTCA公司 \n\n## 3.0 Installed Equipment Performance And Test Requirements 已安装设备的性能和试验要求",
    "This section states considerations for achieving an acceptable level of performance for AHRS equipment when installed in an aircraft. Installed performance requirements are consistent with those specified in Section 2.0 as verified by the equipment manufacturer through flight evaluation, laboratory testing, and environmental testing. Acceptable installed performance is dependent on adherence to the AHRS equipment manufacturer's installation instructions and limitations. Parties performing a",
    "the AHRS equipment manufacturer's installation instructions and limitations. Parties performing a first of type integration of an AHRS into a make/model or class of aircraft will need to verify that the installed performance of the AHRS is appropriate for its intended function.",
    "本节说明了安装在飞机上的AHRS设备达到可接受性能水平的注意事项。安装的性能要求与第节中规定 的要求一致 2.0  由设备制造商通过飞行评估、实验室测试和环境测试进行验证。可接受的安装性能 取决于是否遵守AHRS设备制造商的安装说明和限制。将AHRS首次集成到某一品牌/型号或类别的飞机\n中的各方需要验证AHRS的安装性能是否适合其预期功能。 \n\n## 3.1 Equipment Installation 设备安装 3.1.1 Accessibility 可达性",
    "## 3.1 Equipment Installation 设备安装 3.1.1 Accessibility 可达性\n\n \nAs installed, controls and monitors provided for in-flight operation **shall** be readily accessible from the pilot's normal seated position. The appropriate operator/crew member(s) **shall** have an unobstructed view of any displayed data when in the normally seated position. \n\n安装后,用于飞行操作的控制器和监视器应易于从飞行员的正常座位位置接近。适当的操作员/机组\n成员在正常就座位置时,应能够无障碍地查看任何显示的数据。 \n\n \n\n## 3.1.2 Aircraft Environment 飞机环境",
    "## 3.1.2 Aircraft Environment 飞机环境\n\n \nEquipment environmental qualification levels **shall** be compatible with the actual environmental condition expected in the specific location on the aircraft where the equipment will be installed. 设备环境鉴定等级应与飞机上安装设备的特定位置预期的实际环境条件相兼容。 \n\n \n\n## 3.1.3 Display Visibility 显示可见性",
    "## 3.1.3 Display Visibility 显示可见性\n\n \nDisplay data **shall** be easily readable by the flight crew under all cockpit ambient light conditions ranging from dark night to direct sunlight environments. 在从黑夜到阳光直射环境的所有驾驶舱环境光线条件下,显示数据应易于机组人员读取。 \n\n \nNote: Visors, glare-shields or filters may be an acceptable means of obtaining daylight visibility. \n\n注:护目镜、遮光罩或滤光镜可能是获得日光能见度的可接受方法。 \n\n \n\n## 3.1.4 Dynamic Response 动态响应",
    "注:护目镜、遮光罩或滤光镜可能是获得日光能见度的可接受方法。 \n\n \n\n## 3.1.4 Dynamic Response 动态响应\n\n \nInstalled equipment performance **shall** be verified during normal aircraft maneuvers and flight operations to validate there are no adverse effects on the AHRS operation due to the installation. \n\n应在正常飞机机动和飞行操作期间验证安装的设备性能,以确认安装不会对AHRS操作产生不利影响。 \n\n \n\n## 3.1.5 Interference Effects 干扰效应",
    "应在正常飞机机动和飞行操作期间验证安装的设备性能,以确认安装不会对AHRS操作产生不利影响。 \n\n \n\n## 3.1.5 Interference Effects 干扰效应\n\n \nThe equipment **shall** not be the source of harmful conducted or radiated interference nor be adversely affected by conducted or radiated interference from other equipment or systems installed in the aircraft. \n\n设备不得成为有害传导或辐射干扰源,也不得受到飞机上安装的其他设备或系统的传导或辐射干扰的\n不利影响。",
    "Note: Electromagnetic compatibility problems noted after installation of this equipment may result from such factors as the design characteristics of previously installed systems or equipment and the physical installation itself. It is not intended that the equipment manufacturer design for all installation environments. The installing facility will be responsible for resolving any incompatibility between this equipment and previously installed equipment in the aircraft.",
    "注:安装本设备后发现的电磁兼容性问题可能是由以前安装的系统或设备的设计特性以及物理安装本 身等因素造成的。设备制造商的设计并不适用于所有安装环境。安装设施将负责解决该设备与飞机上\n以前安装的设备之间的任何不兼容性。 \n© 2012 RTCA, Inc. \n\n©2012 RTCA公司 \n\n## 3.1.6 Inadvertent Turnoff 无意的岔道\n\nAppropriate protection **shall** be provided to avert the inadvertent turnoff of the equipment. \n\n应提供适当的保护,以避免设备意外关闭。 \n\n \n\n## 3.1.7 Aircraft Power Source 飞机电源",
    "应提供适当的保护,以避免设备意外关闭。 \n\n \n\n## 3.1.7 Aircraft Power Source 飞机电源\n\nSystems that perform critical functions or whose continued operation is required for safe flight and landing shall be powered from suitably rated power sources, including any requirements for redundant or separate power inputs. Power sources should be appropriately qualified. \n\n执行关键功能或安全飞行和着陆所需连续运行的系统应由适当额定电源供电,包括冗余或单独电源输\n入的任何要求。电源应适当合格。 \n\n## 3.2 Conditions Of Test 试验条件",
    "执行关键功能或安全飞行和着陆所需连续运行的系统应由适当额定电源供电,包括冗余或单独电源输\n入的任何要求。电源应适当合格。 \n\n## 3.2 Conditions Of Test 试验条件\n\n \nThe following subparagraphs define conditions under which tests specified in Section 3.3 \n以下各小段定义了第节中规定的试验条件 3.3 \nshall be conducted. \n\n应进行。 \n\n \n\n## 3.2.1 Conformity 从众",
    "应进行。 \n\n \n\n## 3.2.1 Conformity 从众\n\nAs installed, the equipment **shall** conform to the detailed design developed for the integration of the AHRS equipment into the target platform. All AHRS equipment manufacturer's limitations and requirements shall be considered in developing the installation design. Deviation from the requirements of the AHRS manufacturer must be evaluated for their potential effects on AHRS installed performance.",
    "安装后,设备应符合为将AHRS设备集成到目标平台而开发的详细设计。在开发安装设计时,应考虑所\n有AHRS设备制造商的限制和要求。必须评估与AHRS制造商要求的偏差对AHRS安装性能的潜在影响。 \n\n \nAs installed, visually inspect the installed equipment to determine the use of acceptable workmanship and adherence to the installation design. 安装后,目视检查已安装的设备,以确定是否使用了可接受的工艺并符合安装设计。 \n\n \n\n## 3.2.2 Power Input 电源输入\n\n \nUnless otherwise specified, all aircraft electrically operated equipment and systems shall \n除非另有规定,否则所有飞机电动设备和系统应 \nbe turned on before conducting interference test. 在进行干扰测试之前打开。",
    "## 3.3 Test Procedures For Installed Equipment Performance 已安装设备性能测试程序",
    "The following test procedures provide one means of determining installed equipment performance. Although specific test procedures are cited, it is recognized that other methods may be preferred by the installing activity. These alternate procedures may be used if they provide at least equivalent information. In such cases, the procedures cited herein should be used as one criterion in evaluating the acceptability of the alternate procedures.",
    "以下测试程序提供了一种确定已安装设备性能的方法。虽然引用了具体的测试程序,但应认识到,安 装活动可能首选其他方法。如果这些替代程序至少提供了等效信息,则可以使用这些替代程序。在这\n种情况下,本文引用的程序应作为评估替代程序可接受性的一个标准。 \n\n## 3.3.1 Ground Tests 地面试验 3.3.1.1 Equipment Function 设备功能\n\n \nVary all controls of the equipment through their full range to determine that the equipment is operating according to the manufacturer's instruction and that each control performs its intended function. \n\n在其整个范围内改变设备的所有控制装置,以确定设备是否按照制造商的说明运行,以及每个控制装\n置是否执行其预期功能。 \n \n\n## 3.3.1.2 Interference Effects 干扰效应",
    "With the equipment energized, operate the other electrically operated aircraft equipment and systems to determine that significant conducted or radiated interference does not \n在设备通电的情况下,操作其他电气操作的飞机设备和系统,以确定显著的传导或辐射干扰不",
    "在设备通电的情况下,操作其他电气操作的飞机设备和系统,以确定显著的传导或辐射干扰不 \n \nexist. Evaluate all reasonable combinations of control settings and operating modes. Operate communication and navigation equipment on the low, high and at least one but preferably four mid-band frequencies. Make note of system or modes of operation that should also be evaluated during flight. If appropriate, repeat tests using emergency power with the aircraft's batteries alone and the inverters operating.",
    "存在。评估控制设置和操作模式的所有合理组合。在低频、高频和至少一个但最好是四个中频带频率 上操作通信和导航设备。记录在飞行过程中也应评估的系统或操作模式。如果合适,在仅有飞机电池\n和逆变器运行的情况下,使用应急电源重复测试。 \n\n## 3.3.2 Flight Evaluation Procedures 飞行评估程序 3.3.2.1 Evaluation Procedure 评估程序\n\nThe installed performance of the highest claimed normal operating mode of the equipment **shall** be evaluated in accordance with the requirements of Section 2.4.8. All operating limitations and procedures associated with the installation **shall** be adhered to during these tests.",
    "应根据第节的要求,评估设备在声称的最高正常运行模式下的安装性能 2.4.8.  在这些试验期间,\n应遵守与安装相关的所有操作限制和程序。 \n\n \nThe installed performance of a degraded operating mode **shall** be evaluated in accordance with the requirements of Section 2.2.4. 降级运行模式的安装性能应按照第节的要求进行评估 2.2.4. \n\n## 3.3.2.2 Rotorcraft-Specific Flight Evaluation Procedures 旋翼机专用飞行鉴定程序\n\n \nAlthough there are no specific rotorcraft design or flight test requirements for the AHRS, these flight test procedures are provided to aid in installation approval for rotorcraft.",
    "虽然对AHRS没有具体的旋翼机设计或飞行试验要求,但提供这些飞行试验程序是为了帮助旋翼机的安\n装批准。 \n\n \nFor equipment intended for use in rotorcraft, the maneuvers of Table 3-1 should be conducted and the performance of the equipment should be evaluated and documented. All operating limitations and procedures associated with the installed equipment should be adhered to during these tests.",
    "对于拟用于旋翼机的设备,应进行表3-1的操作,并对设备的性能进行评估和记录。在这些测试过程\n中,应遵守与已安装设备相关的所有操作限制和程序。 \n \nSome maneuvers listed address problematic flight conditions previously noted, while others are intended to aggressively exercise the AHRS design and to validate computational integrity. Airspeed, altitude and target g-levels are as required or as desired to complete each maneuver. \n\n列出的一些机动动作解决了前面提到的有问题的飞行条件,而另一些则旨在积极地运用AHRS设计并验\n证计算的完整性。空速、高度和目标过载水平是完成每个机动所需要或期望的。 \n\n\n## 表3-1旋翼机飞行动作",
    "Flight Evaluation Profile: 飞行评估剖面: Recommended Maneuvers for Equipment Intended for Rotorcraft 旋翼机用设备的推荐机动动作 \nNo. \n不。 \nTest 测试 \nCondition 条件 \n1 \nExtended duration coordinated turn \n(1 each \n10 minutes duration at cruise airspeed 在巡航空速下持续10分钟 \ndirection) \n延长持续时间协调转弯(每个方向1\n次) \n2 \nLow speed coordinated turn 低速协调转弯 \n360° each direction at 20 to 30 knots airspeed 在20至30节空速时,每个方向360° Target airspeed: as required to avoid exceeding load \nfactor limit \n3 \nSymmetric Pull Up \n对称上拉 \n目标空速:根据需要,避免超过过载限制",
    "factor limit \n3 \nSymmetric Pull Up \n对称上拉 \n目标空速:根据需要,避免超过过载限制 \nTarget airspeed: as required to avoid exceeding load \nfactor limit \n4 \nSymmetric Push Over 对称推过 \n目标空速:根据需要,避免超过过载限制 \n5 \nRoll Reversal 滚转反转 \nCruise airspeed 巡航空速 \n6 \nLeft Rolling Pull Up 左滚动拉起 \nCruise airspeed 巡航空速 \n7 \nRight Rolling Pull Up 右侧滚动拉起 \nCruise airspeed 巡航空速 \n8 \nLeft Steady Heading Side Slip 左稳向侧滑 \nAt approach airspeed 在进场空速下 \n9 \nRight Steady Heading Side Slip 右稳向侧滑 \nAt approach airspeed 在进场空速下 \n10",
    "9 \nRight Steady Heading Side Slip 右稳向侧滑 \nAt approach airspeed 在进场空速下 \n10 \nHover Reposition Aft 向后悬停重新定位 \n30 seconds duration 持续时间30秒 \n11 \nHover Reposition Forward 向前悬停重新定位 \n30 seconds duration 持续时间30秒 \n12 \nPedal Turn 踏板转向 \nManeuver initiated from hover regime 从悬停状态开始的机动 \n13 \nLeft Sideward Flight 左侧飞行 \nManeuver initiated from hover regime 从悬停状态开始的机动 \n14 \nRight Sideward Flight 右侧飞行 \nManeuver initiated from hover regime 从悬停状态开始的机动 \n15 \nLong duration deceleration to \nhover",
    "Maneuver initiated from hover regime 从悬停状态开始的机动 \n15 \nLong duration deceleration to \nhover \nManeuver initiated at approach airspeeds (typical \nprofile flown \n长时间减速至悬停 \nfrom MAP to ground) 在进近空速下开始机动(从地图到地面的典型飞行剖面) \n16 \nMax power takeoff 最大功率输出 \nManeuver initiated from hover regime 从悬停状态开始的机动 \n17 \nQuick stop 快停 \nManeuver initiated from approach airspeed 从进近空速开始的机动",
    "© 2012 RTCA, Inc. ©2012 RTCA公司 \n\n## Membership 会员资格 Attitude And Heading Reference Systems (Ahrs) Rtca Special Committee 219 姿态和航向基准系统(Ahrs)Rtca特别委员会219",
    "| Chair        | Organization                         |\n|--------------|--------------------------------------|\n| 椅子         | 组织                                 |\n|              |                                      |\n| Keith Kerley | Rockwell Collins, Commercial Systems |\n| 基思         |                                      |\n| ·            |                                      |\n| 克里         | 罗克韦尔柯林斯,商业系统              |\n|              |                                      |",
    "| Secretary    | Organization                  |\n|--------------|-------------------------------|\n| 秘书         | 组织                          |\n|              |                               |\n| Curtis Call  | Honeywell International, Inc. |\n| 柯蒂斯的电话 | 霍尼韦尔国际公司              |\n|              |                               |",
    "| RTCA Liaison     | Organization    |\n|------------------|-----------------|\n| RTCA联络人       | 组织            |\n|                  |                 |\n| Jennifer Iversen | RTCA, Inc.      |\n| 詹妮弗           |                 |\n| ·                |                 |\n| 伊弗森           | RTCA公司        |\n|                  |                 |",
    "Member 成员 \nOrganization 组织 \nTom Arthur 汤姆·亚瑟 \nOhio University - Avionics Engineering Center 俄亥俄大学航空电子工程中心 \nMatthias Baunach 马蒂亚斯·鲍纳赫 \nNorthrop Grumman Corporation 诺斯罗普·格鲁曼公司 \nWilliam Brodegard 威廉·布罗德加德 \nAspen Avionics, Inc. 阿斯彭航空电子公司 \nTom Brooks 汤姆·布鲁克斯 \nBell Helicopter Textron, Inc. 贝尔直升机德事隆公司 \nChip Bulger 芯片膨胀机 \nFederal Aviation Administration 联邦航空局 \nMichael Cawley 迈克尔·考利 \nNorthrop Grumman Corporation 诺斯罗普·格鲁曼公司 \nDarrell Davis 达雷尔·戴维斯 \nDAC International DAC国际 \nJames Doty 詹姆斯·多蒂",
    "Darrell Davis 达雷尔·戴维斯 \nDAC International DAC国际 \nJames Doty 詹姆斯·多蒂 \nRockwell Collins, Inc. 罗克韦尔柯林斯公司 \nGregory Frye 格雷戈里·弗莱 \nFederal Aviation Administration 联邦航空局 \nDesilles Gael 德西莱斯·盖尔 \nThales Avionics Limited 泰雷兹航空电子有限公司 \nDara Gibson 达拉·吉布森 \nFederal Aviation Administration 联邦航空局 \nJean-Claude Goudon 让·克劳德·古东 \nSagem Defense Securite 萨基姆防务安全公司 \nShimin Gu 顾世民 \nCARERI 卡瑞里 \nDonald Johnson 唐纳德·约翰逊 \nL-3 Communications L-3通信 \nManfred Krings 曼弗雷德·克林斯 \nNorthrop Grumman Corporation 诺斯罗普·格鲁曼公司",
    "L-3 Communications L-3通信 \nManfred Krings 曼弗雷德·克林斯 \nNorthrop Grumman Corporation 诺斯罗普·格鲁曼公司 \nShehzad Latif 谢赫扎德·拉蒂夫 \nUniversal Avionics Systems Corporation 通用航空电子系统公司",
    "© 2012 RTCA, Inc. \n\n©2012 RTCA公司 \n\n \n \nThis Page Intentionally Left Blank \n本页特意留空 \n\n## Appendix A: Validation Of Equipment Performance Using Simulation 附录A:使用模拟验证设备性能 A.1 Simulation Fidelity 模拟逼真度",
    "In lieu of flight evaluation, the AHRS dynamic heading and attitude performance may be verified through the use of a high fidelity simulation. A very high level of confidence in the simulation results should be attained to bypass the flight evaluation activity. The importance of achieving accurate results with the simulation cannot be overstated. The simulation should account for all significant sources of error including:",
    "代替飞行评估,可以通过使用高保真模拟来验证AHRS动态航向和姿态性能。在模拟结果中应获得非常 高的置信度,以绕过飞行评估活动。通过模拟获得准确结果的重要性怎么强调都不过分。模拟应说明\n所有重要的误差源,包括:",
    "1. Sensor misalignment (gyro, accelerometer) \n传感器未对准(陀螺仪、加速计) \n2. Sensor scale factor (gyro, accelerometer, MSU, barometric altitude) \n传感器比例系数(陀螺仪、加速计、MSU、气压高度) \n3. Sensor bias (gyro, accelerometer, MSU, barometric altitude, TAS) \n传感器偏差(陀螺仪、加速计、MSU、气压高度、TAS) \n4. Sensor noise (gyro, accelerometer, MSU) \n传感器噪声(陀螺仪、加速计、MSU) \n5. Sensor range limit (gyro, accelerometer) \n传感器范围限制(陀螺仪、加速计) \n6. Speed-dependent noise (barometric altitude, TAS) \n速度相关噪声(气压高度,TAS)",
    "传感器范围限制(陀螺仪、加速计) \n6. Speed-dependent noise (barometric altitude, TAS) \n速度相关噪声(气压高度,TAS) \n7. Other known sensitivity factors to sensor error if any (e.g. g-sensitivity of gyro) \n传感器误差的其他已知灵敏度因素(如有)(例如陀螺仪的G灵敏度) \n8. AHRU installation alignment \nAHRU安装校准 \n9. Algorithm estimations \n算法估计 \n10. Environmental variables including \n环境变量包括 \na. \nTemperature ramps 温度斜坡 \nb. Vibration (including acoustically induced vibration) \n振动(包括声致振动) \nc.",
    "Temperature ramps 温度斜坡 \nb. Vibration (including acoustically induced vibration) \n振动(包括声致振动) \nc. \nWeather induced actions such as horizontal and vertical wind gusts 天气引起的作用,如水平和垂直阵风 \nd. Air Data \n大气数据 \ne. \nGPS Errors GPS误差",
    "## A.2 Simulation Validation 模拟验证\n\nThe simulation should be validated to ensure it accurately predicts real-world measurement error characteristics produced by the in-service equipment under a flight profile with the characteristics similar to the one described in Section 2.4. This validation process should demonstrate the following: \n应对模拟进行验证,以确保其准确预测飞行剖面下现役设备产生的真实世界测量误差特性,其特性类\n似于第节中所述的特性。 2.4.  该验证过程应证明以下内容:",
    "1. Validate that the simulated input signals are represented appropriately. A successful validation \nshould demonstrate that: 验证模拟输入信号的表示是否正确。成功的验证应证明: \na. \nThe simulated trajectory of the vehicle is as expected. This should include all relevant \ntrajectory parameters not only including body rates and body accelerations (or",
    "trajectory parameters not only including body rates and body accelerations (or \nincrements), but also attitudes, velocities, accelerations, position, and altitude. The simulated trajectory can be verified by comparing the desired trajectory to the attitudes, position, altitude, and velocities that are physically expected, and, as a crosscheck, those that are generated from the simulated sensor data (body rates and body accelerations or increments). A canonical way of checking the",
    "车辆的模拟轨迹与预期一致。这应该包括所有相关的轨迹参数,不仅包括机身速率 和机身加速度(或增量),还包括姿态、速度、加速度、位置和高度。可以通过将 期望轨迹与物理上预期的姿态、位置、高度和速度进行比较,并且作为交叉检查, 将从模拟传感器数据(身体速率和身体加速度或增量)生成的那些进行比较,来验\n证模拟轨迹。检查的规范方法",
    "附录A A-2 \nphysical consistency of the simulated trajectory is to compare simulated data to real flight data of an identical aircraft in identical flight conditions. When applicable, a complimentary way to insure physical consistency of the simulated trajectory is to check physical consistency of the aircraft dynamics model. \n模拟轨迹的物理一致性是将模拟数据与相同飞机在相同飞行条件下的真实飞行数据 进行比较。适用时,确保模拟轨迹物理一致性的补充方法是检查飞机动力学模型的\n物理一致性。",
    "b. The simulated signal errors are accurately modeled. The simulated signal errors can be \nvalidated by comparing the statistics of real sensor errors to the statistics of the simulated sensor errors. This comparison has to be done either in the dynamic conditions of the test trajectory, or in any condition ensuring that the modeled sensor errors accurately predict the error characteristics when used in the context of the test trajectory.",
    "对模拟信号误差进行了精确建模。可以通过将真实传感器误差的统计量与模拟传感 器误差的统计量进行比较来验证模拟信号误差。这种比较必须在测试轨迹的动态条 件下进行,或者在任何条件下进行,以确保当在测试轨迹的环境中使用时,模型化\n的传感器误差准确地预测误差特性。 \nc. \nThe environment is simulated with appropriate degree of fidelity, meaning that all \nsignificant environment effects (static and dynamical, uniform and gradients) are duly modeled and other environment effects are proved insignificant. The analysis should include; \n以适当的保真度模拟环境,这意味着所有重要的环境影响(静态和动态、均匀和梯\n度)都被适当地建模,并且其他环境影响被证明是不重要的。分析应包括: \ni. Vibration \n震动",
    "以适当的保真度模拟环境,这意味着所有重要的环境影响(静态和动态、均匀和梯\n度)都被适当地建模,并且其他环境影响被证明是不重要的。分析应包括: \ni. Vibration \n震动 \nii. Acoustic noise \n声学噪声 \niii. Wind \n风 \niv. Magnetic field, with magnetic anomalies \n磁场,有磁异常 \nv. Temperature \n温度 \n2. Validate that the algorithm performs the same in the simulation as it does when it is on hardware \ntarget. This can be achieved by passing the same input data into both the algorithm in simulation",
    "target. This can be achieved by passing the same input data into both the algorithm in simulation \nand the algorithm on target, and then comparing the output. Any source of simulated/real input can \nbe the basis of the proof, and likewise any platform (target or other) can be used to execute the algorithm, as long as the tested algorithm is byte-per-byte identical to the one on target and the test trajectory is sufficiently complex to exercise all aspects of the algorithm.",
    "验证算法在模拟中的执行情况与在硬件目标上的执行情况相同。这可以通过将相同的输入数 据传递到模拟中的算法和目标上的算法中,然后比较输出来实现。模拟/真实输入的任何来 源都可以是证明的基础,同样,任何平台(目标或其他)都可以用于执行算法,只要测试的\n算法与目标上的算法每字节相同,并且测试轨迹足够复杂以执行算法的所有方面。 \n3.  Validate that the analysis based on the simulation provides accurate results. It should be \ndemonstrated that: 验证了基于仿真的分析提供了准确的结果。应该证明: \na. \nThe inputs into the analysis are correct, including the sensor error budget. The error budget should be described in the system specification, \nagainst which it can be verified.",
    "against which it can be verified. \n分析的输入是正确的,包括传感器误差预算。误差预算应在系统规范中进行描述,\n并可根据系统规范进行验证。 \nb. The mathematical models and algorithms (e.g. computation of RMS or other statistics) \nused in the analysis should be validated for correctness and accuracy. \n应验证分析中使用的数学模型和算法(如RMS或其他统计数据的计算)的正确性和\n准确性。",
    "应验证分析中使用的数学模型和算法(如RMS或其他统计数据的计算)的正确性和\n准确性。 \nThe simulation results should be validated with actual AHRS flight test performance. The acceptable deviation of the simulation from the actual flight test should be within the limits expected from an analysis.",
    "附录A A-2 \n仿真结果需要用实际的航姿系统试飞性能来验证。模拟与实际飞行试验的可接受偏差应在分析的预期\n范围内。"
  ]
}