{
  "source": "MIL-H-8790D 1981.md",
  "chunks": [
    "## Military Specification\n\n# Hose Assemblies, Rubber, Hydraulic High Pressure (3000 Psi)\n\nThis specification is approved for use by all Departments and Agencies of the Department of Defense. \n\n## 1. Scope\n\n*1.1 Scope. This specification covers hose assemblies for use in hydraulic systems using,MIL-H-83282 hydraulic fluid. \n\n1.2 Classification. Hose assemblies shall be furnished in the sizes listed on MS28759, MS28762, MS2892Q, MS28921, MS28922, MS28923, and MS28924 as speci­\nfied (see 6.2).",
    "## 2. Applicable Documents *2.1 Government Documents.\n\n2.1.1 Specifications and Standards. \n                                     Unless otherwise specified, the \nfollowing specifications and standards of the issue listed in that issue of \nthe Department o.f Defense Index of Specifications and Standards (DoDISS) \nspecified in the·solicitation form a part of this specification to the extent \nspecified herein:",
    "SPECIFICATIONS \nFEDERAL \nAdhesive, Rubber Base, General Purpose \nMMM-A-1617 \nMILITARY \nMIL-P-775 \nMIL-C-5501 \nMIL-H-5606 MIL-L-6082 \nMIL-H-8788 \nHose, Hose Assemblies, Rubber, \nplastic, Fabric, or Metal (including \nTubing), and Fittings, Nozzles and \nStrainers, Packing of \nCap and Plug, Protective, Dust and \nMoisture Seal \nHydraulic Fluid, Petroleum Base, \nAircraft, Missile and Ordnance \nLubricating Oil: \nAirt:raft \nReciprocating (piston) Engine \nHose, Hydraulic, High Pressure",
    "Beneficial comments (recommendations, additions, deletions) and any pertinent data which may be of use in improving this document should be addressed to: \nHQ AFLC CASO/LODS, Federal Center, Battle Creek MI 49016 by using the self­\naddressed Standardization Document Improvement Proposal (DD Form 1426) \nannearin2 at the end of this document or by letter.",
    "MIL-F-8789 MIL-S-45180 \n* \nMIL-H-83282 \nFitting End, Attachable Hydraulic, \nPressure Hose \nSealing Compound, Gasket, Hydrocarbon \nFluid, Water Resistant \nHydraulic Fluid, Fire Resistant \nSynthetic Hydrocarbon Base, Aircraft \n\nSTANDARDS \nMILITARY",
    "MIL-STD-105 MIL-STD--129 \nMl.L-:STIJ-J.:>l \nMS28759 MS28762 \nMS28920 \nMS28921 MS28922 MS28923 \nRubber, Hydraulic (3000 \nto Elbow 90 , Flared \nMS.28924 \nRubber, Hydraulic (3000 \nto Elbow 90 , Flared \nSampling Procedures and Tables for In­\nspection by Attributes \nMarking for Shipment and Storage \nAGE Controls of Age-sensitive Elasto­\nmatic Material \nHose Assembly, Hydraulic and Pneuma­\ntic, (3000 psi)., Flared Tube \nHose Assembly, Hydraulic and Pneumatic",
    "tic, (3000 psi)., Flared Tube \nHose Assembly, Hydraulic and Pneumatic \nHigh Pressurğ- (3000 psi) Flareless Tube Hose Assembly, Rubber, Hydraulic (3000 \npsi), Fitting End To Elbow 45 , Flared \nTube \nHose Assembly, Rubber, Hydraulic (3000 \npsi), Fitting End To Elbow 90 , Flared \nTube \nHose Assembly, Rubber, Hydraulic (3000 \npsi), Elbow 45 \nto Elbow 45 , Flared \nTube \nHose Assembly, \npsi), Elbow 45 \nTube \nHose Assembly, \npsi), Elbow 90 \nTube",
    "(Copies of specifications, standards, handbooks, drawings, and publications required by manufacturers in connection with specific acquisition functions should be obtained from the contracting.activity or as directed by the contracting officer,)",
    "*2.2 Other Publications •. The following document formsĠ part of this \n specification to the extent specified herein, \n                                                The issues of the documents \n which are inġicated as DoD adopted shall be the issue listed in the current \n DoDISS and the supplement thereto, if appl_icable. \n\n(Application for copies of the above publication should be addressed to the \nConsolidated ClassificaĢion Committee, 202 Chicago Union Station, Chicago, \nIllinois 60606.)",
    "*2.3 Order of Precedence. \nIn the event of a·ccnflict betwee..ģ the text of \nthis specification and the references cited herein, the text of this ·speci­\nfication shall **take** precedence. \n\n## 3. Requirements",
    "3.1 General. The hose assemblies furnished under this-specifications shall \nconsist of hose conforming to MIL-H-8788 and end fittings conforming to \nMIL-F-8789, which when assembled, meet the quality assurance provisions of \nsection 4 herein. \n                   Prior to assembly, MMM-A-1617 or MIL-S-45180A type II \nsealant shall be applied to each end of the MIL-H-8788 hose. \n                                                             The sealant",
    "The sealant \nshall provide a moisture seal for the exposed wire braid and shall not be \nharmful to the hose or fitting material.",
    "3.1.1 Loosening or changing end fitting position. After the end fittings \nhave been installed on the hose, there shall be no loosening or changing \nof an end fitting position on the hose. \n\n3.2 Data. Unless otherwise specified in the contract or order, no data are \nrequired by this specification or any of the documents referenced in section \n2 herein (see 6.2).",
    "3. 3 Length. Hose assemblies shall be made only to the length increments \nspecified on MS28759, MS28762, MS28920, MS28921, MS28922, MS28923, and \nMS28924. \n\n3.4 Orientation angle of bent tube couplings. When hose assemblies in \naccordance with MS28922, MS28923, or MS28924 are required, the orientation \nangle shall be as specified (see 6.2).",
    "*3.5 Performance. Hose assemblies shall satisify the performance requirements \nspecified in Table I and Section 4, when subjected to the following tests:",
    "a. \nb. \nc. d. \ne. \nHydraulic proof pressure•-----------------(4.6.1) \nCoupling------------\n--------·---\n(4 .6.2) \nLeakage-----------\n------(4.6.3) \nBurst pressure--\n--------\n----(4.6.4) \nHydraulic impulse test-\n----------(4.6.5) \nHose \nSize \nNo. \nProof \nBurst \nOperating \nBend \nAssembly Length in Ac-\nPressure \nPressure \nPressure \nRadius ·cordance with MS28759, \npsi \npsi. \npsi \nInside MS28762, and MS28920 \n(min) \n(min) \nInches \nthrough MS28924 \n(min) \n,• \n4 \n5 \n6 \n8 \n10 \n12 \n16 \n8,000 \n16,000",
    "(min) \n(min) \nInches \nthrough MS28924 \n(min) \n,• \n4 \n5 \n6 \n8 \n10 \n12 \n16 \n8,000 \n16,000 \n3,000 \n3 \n16 \n7,000 \n14,000 \n3,000 \n3 3/8 \n18 \n7,000 \n14,000 \n3,000 \n5 \n21 \n7,000 \n14,000 \n3,000 \n5 3/4 \n24 \n6,000 \n12,000 \n3,000 \n6 1/2 \n30 \n'6,000 \n12,000 \n3,000 \n7 3/4 \n33 \n5,000 \n10,000 \n3,000 \n9 5/8 \n24",
    "*3.6 Identification of product. Each hose assembly shall be identified with a \n durable permanently attached tag. \n                                   Thia tag shall show the MS number, date of \n assembly, and manufacturer's name or trademark. \n\n3.7 Age control. \n\nHose assemblies shall meet the age limitation requirements specified in MIL-STD-1523. \n\n3.8 End fitting nut thread class. \n\nAfter pressure testing Class 2B threads are acceptable on end fitting nuts.",
    "After pressure testing Class 2B threads are acceptable on end fitting nuts. \n\n*3.9 Workmanship, \nWorkmanship shall be of the quality necessary to produce \nhose assemblies free from ell defects that will affect proper functioning in \nservice. Assemblies must be clean and dry in accordance with MIL-P-775. \n\n## 4. Quality Assurance Provisions",
    "*4. 1 Responsibility for inspections. \nUnless otherwise specified in the contract \nor purchase order, the contractor is responsible for the performance of all \ninspection requirements as specified herein, \nExcept as otherwise specified \nin the contract or purchase.order, the contractor may use his own or any \nother. facilities suitable for the performance of the inspection requirements \nspecified herein, unless disapproved by the Government, \nThe Government",
    "specified herein, unless disapproved by the Government, \nThe Government \nreserves the right to perform any of the inspection set forth in the speci­\nfication where sƕch inspections are deemed necessary to assure supplies \nand services conform to prescribed requirements. \n*4. 2 Classifications of inspections. \nThe inspection requirements specified \nherein are classified as follows: \na. \nQualification inspection (see 4. 3) \nb. \nQuality conformance inspection (see 4.4)",
    "a. \nQualification inspection (see 4. 3) \nb. \nQuality conformance inspection (see 4.4) \n*4. 3 Qualification inspection. \nSampling test shall be conducted in con­\nformance with MIL-STD-105. \nAny hose assembly failing to meet the require­\nments of the routine test (4.3 and 4. 3) shall be caused for rejecting the \nlot represented, \nBefore a lot or part of a lot that has been previously \nrejected by the procuring agency - .  \n(Government or Commercial) csn be",
    "rejected by the procuring agency - .  \n(Government or Commercial) csn be \nsubmitted for test, full particulars concerning the cause of previous \nreject shall be submitted by the contractor. \n*4. 4 Quality conformance inspection. \nThe quality conformance test shall \nconsist of: \na. \nExaminations-,------\n---( \n4. 4 \n, \n1) \nb. \nIndividual Test------------(4. 4,2) \nc. \nSampling Test----------(4,4. 3) \nd. \nHydraulic Impulse Test-------(4.4. 4)",
    "## 4. 4.1 Examinations\n\n4. 4,1. 1 Examination of product, Each hose assembly shall be carefully examined visually to determine conformance to this specification with respect to materials, workmanship, and l)larking, and conformance to the applicable standards. \n\n4.4.2 Individual tests, Each hose assembly submitted for acceptance under contract shall be subjected to the following tests, as specified under 4.6.",
    "a. \nHydraulic proof pressure-----(4.6. 1) \nb. \nCouplingƖ-----------------(4. 6.2) \n4.4. 3 Sampling tests. \n\nEight hose assemblies individually selected at random from each 10,000 hose assemblies or less, of each size submitted under con­\ntract, shall be subjected, in order, to the following tests as specified un­\nder 4. 5. These test assemblies shall not be delivered as part of the contract.",
    "a. \nLeakage---------------------------------------(4. 6.3) \nb. \nBurst pressure---------------------------------(4. 6.4) \n4.4. 4 Hydraulic impulse test. \n\nFive hose assemblies shall be individually selected at random from each 10,000 hose assemblies (or fraction thereof) , for each dash size. \n\nThey shall be subjected to the hydraulic impulse test \n(4. 6.5) and shall not be delivered as part of the contract. \n\n4.4. 5 Examination of preparation for delivery.",
    "4.4. 5 Examination of preparation for delivery. \n\nAn examination shall be made to determine that packaging, packing, and marking comply with the requirements of section 5 of this specification. \n\n## 4. 5 Test Conditions.\n\n*4. 5. 1 Test fluid. \nUnless otherwise specified, the test fluid shall be \nlubricating oil conforming to grade 1100 of MIL-L-6082 or hydraulic fluid \nconforming to MIL-H-5606 or MIL-H-83282 or water. \nHoses must be cleaned and \ndried after test. \n\n## 4. 6 Test Methods.",
    "## 4. 6 Test Methods.\n\n4. 6.1 Hydraulic proof pressure. \n\nThe test shall be made by applying the pressure not less than 30 seconds nor more than 5 minutes. \n\nEach assembly shall be subjected to the hydraulic proof pressure of Table I without indication of failure or leakage. \n\n4.6,2 Coupling, The bulging of hose innƗr tubes caused by the attachment of the end fittings shall be measured by means of a ball-end type gage as specified in the coupling test of section 4 of MIL-H-8788.",
    "Bulg diameter of the inner tube smaller than the minimum allowed in Figure 1 shall be cause for rejection.",
    "*4. 6. 3 Leakage. \nThis test shall be made on two unaged samples, \nHydraulic \nfluid conforming to MIL-H-5.606 or MIL-H-83282 or water shall be used, and \nthe pressure shall be accomplished on leakage specimens as follows. \nSeventy \npercent of the minimum burst value shown in Table I shall be obtained and \nheld for 5 minutes, then reduced to zero, after which the pressure shall be \nraised to 70 percent of the minimum burst pressure for a final 5 minute \ncheck.",
    "raised to 70 percent of the minimum burst pressure for a final 5 minute \ncheck. \nThe adjacent outer cover shall be carefully checked during this period \nfor any wicking or leakage of the test fluid which might indicate leakage of \nthe hose. \nThere shall be no direct leakage from the end fitting, and no \nseepage back through the fabric which might produce separation or swelling of \nthe hose.· A written record shall be kept of leakage and-of the additional",
    "the hose.· A written record shall be kept of leakage and-of the additional \ntightening which might be necessary to stop ali leakage at the end fitting if \nthe threaded type of end fittings is used, \nAfter· completion of the leakage \ntest on these samples, they shall be subjected to the burst pressure test \nspecified in 4,5. 4. \nThe assemblies shall be a minimum of 12 inches in length,",
    "*4.6.4 Burst pressure. \n                        Two unaged assemblies shall be subjected to the \nhydraulic burst pressure specified in Table I within 24 hours after assembly \nof the end fittings to the hose. The tests shall be made with hydraulic \nfluid conforming to MIL-H-5606 or MIL-H-83282 or water. The rate of \npressure rise shall be 25,000 + 0, -10,000 psi per minute. Pressure shall \nbe applied until failure occurs. Below the burst pressure, the end fittings",
    "be applied until failure occurs. Below the burst pressure, the end fittings \nshall not blow off or loosen, and there shall be no external leakage from \n the hose or end fittings. During this test, the hose assembly shall be \nfastened at one end to the source of pressure, the hose shall be extended \nstraight, and the free end shall not be restrained or fastened in any way. \nThe actual pressure at which the samples burst or otherwise fail shall be",
    "The actual pressure at which the samples burst or otherwise fail shall be \nrecorded. The assemblies shall be a minimum of 12 inches in length.",
    "*4.6.5 Hydraulic impulse test. \n                                The hydraulic impulse samples shall be of \nlengths specified in Table I. \n                                They shall be subject to the applicable proof \npressure specified in Table I, prior to pulsing. \n                                                   The assemblies shall then \n be connected to manifolds installed in a testing machine which will produce \n dynamic pressure impulses in the inlet manifold of the magnitudes and fre­",
    "dynamic pressure impulses in the inlet manifold of the magnitudes and fre­\n quency ahowu in Figure 2. \n                            Electronic measuring devices shall be used to \n measure and indicate the impulse pressures. The -16 size only shall be \n tested without surge peaks and in a straight position; one end may be \n free. \n        The test fluid shall conform to MIL-H-5606 or MIL-H-83282, except \n that up to 25 percent of MIL-L-6082 oil may be added to the test .fluid",
    "that up to 25 percent of MIL-L-6082 oil may be added to the test .fluid \n and shall be held at a· temperature of 120 + 2rf F measured in the manifold. \nLeakage, burst or coupling blowoff shall be-evidence of failure. · The \n minimum impulse cycles shall be specified in Table II.",
    "Minimum \nMinimum Average \nMaximum Impulse .Cycles \nSize \nImpulse \nImpulse Cycles \nthat can be used to \nCycles \n(1) \ncompute average (2) \n4 \n100,000 \n5 \n100,000 \n6 \n100,000 \n8 \n75,000 \n100,000 \n150,000 \n10 \n50,000 \n75,000 \n100,000 \n12 \n35,000 \n50,000 \n70,000 \n16 \n45,000 \n55,000 \n75,000 \n\n  (1) Average of four test assemblies. \n  (2) When test assemblies impulse cycles are averaged, the maximum cycles \nthat can be used to compute the average shall not exceed the figures given \nin this column.",
    "## *5. Packaging\n\n•s:1 Preservation, packaging and packing. \nPreservation, packaging and \npacking of the hose assemblies shall be in accordance with MIL-P-775. \nBoth \nends of each hose assembly shall be sealed with plugs conforming to \nMIL-C-5501. \n5.2 Levels. \n\nThe levels of preservation and packaging shall be level A or C \nand the levels of packing shall be A, ·B or C as specified.",
    "5.3 Marking of shipments. \n                            Interior packages and exterior shipping containers \nshall be marked in accordance with MIL-SĜl29. \n                                                  The identification shall \ninclude the hose cure date. \n\n## 6. Notes\n\n6. 1 Intended use. \n\nThe hose assemblies are intended for use in hydraulic systems when used in accordance with the applicable assembly standard and st operating pressures not to exceed 3000 psi.",
    "6, 2 Ordering data. Procurement documents should specify: \n\n(a) Title, number, and date of this specification. \n(b) Size and length of hose assemblies to be furnished in accordance with the applicable hose assembly standard (see 1. 2) . \n\n(c) Bent tube orientation angles. \n(d) Data requirements (see 3. 2) , \n(e) Applicable levels of preservation and packaging, and packing (see \n5. 2. \n\n*6. 3 Qualification.",
    "*6. 3 Qualification. \n\nWith respect to products requiring qualification, awards will be made only for products which are at the time set for opening of bids, qualified for inclusion in the applicable Qualified Products List whether or not such products have actually been so listed by that date.",
    "The attention of the contractors is called to these requirements, and\"manufacturers are urged to arrange to have the products that they propose to offer to the Federal Government tested for qualification in order that they may be eligible to be awarded contracts or orders for the products covered by this specification.",
    "The activity responsible for the Qualified Products List is San Antonio ALC/MMIRCC, Kelly AFB, Texas 78241, and information pertaining to qualificaƘ \ntion of product may be obtained from that activity. \n\nThis specificatioƙ superseded MIL-H-5512 for hose formerly covered under MIL-H-5512 will be procured fittings may be procured under MIL-F-8789. \n\n6.4 Superseding data. \n\nassemblies. \n\nBulk hose under MIL-H-8788. \n\nEnd \n6. 5 Changes from previous issue.",
    "The margins of this specification are marked with an asterisk to indicate where changes (additions, modifications, corrections, deletions) from the previous issue are made, This was done as a convenience only and the.Government assumes no liability whatsoever for any inaccuracies in these notations, Bidders and contractors are cautioned to evaluate the requirements of this document based on the entire content irrespective of the marginal notations and relationship to the last previous issue,",
    "entire content irrespective of the marginal notations and relationship to the last previous issue, Preparing Activity:",
    "· Air Force - 99 \nCustodians: \nAir Force - 99 \nArmy - ME \nNavy - AS \nProject 4720-0398 \nReview Activities: \nArmy - MI, AV \nDLA - CS \nINSTRUCTIONS: \nThi• aheel i■ 10 be filled out by personnel, either Govemment or contractor, involve_d in the use of the 11pecific■tion in procurement of product• **(qr** ultim■le u11e by the Department of **Dden■**e.",
    "Th•• ■heet is provided for obtaining information on the use of this epecirication which will in■ure that suitable product■ \ncan be procured with - minimum amount of delay and at the lea1u coat.",
    "Comment■ and the retum of 1hi11 form will be appreciated. Fold on lines on reverse side, staple in comer, and ■end to preparing activity. Comments and suglil:e■tion• submitted on this form do not constitute or imply authorization to waive any portion of thr referenced documc,:.t(s) or serve to amend con.trectu&I requirem.rite.",
    "## I. Has Any Part Of The Specification Created Problems Or Required Interpretation In Procure­ B. Recommendations Foiiii Correcting T'\"'E Oef'Iciencies L. Is The Specification Restrictive'\n\nDEPARTMENT OF THE AIR FORCE \nOFFICIAL BUSINESS \nPENALTY FOR PRIVATE use S300. \n\n## Business Rl;Ply Mail\n\nFIRS\"T CLASS \nPERMIT NO, 73238 \nWASHINGTON D. C. \n\n## Postage Will Be Paid By The **Department** Of The Air Force\n\nHQ AFLC CASO/LODS \nFederal Center Battle Creek MI 49016"
  ]
}