{
  "source": "RTCA DO-309 2008.md",
  "chunks": [
    "RTCA, Inc. \n\n1828 L Street, NW, Suite 805 \nWashington, DC 20036, USA \n \nMINIMUM OPERATIONAL PERFORMANCE STANDARDS (MOPS) \nFOR \nHELICOPTER TERRAIN AWARENESS AND WARNING SYSTEM (HTAWS) \nAIRBORNE EQUIPMENT \nCopies of this document may be obtained from RTCA, Inc. \n\n1828 L Street, NW, Suite 805 \nWashington, DC 20036, USA \n \nTelephone: 202-833-9339 \nFacsimile: 202-833-9434 \nInternet: www.rtca.org Please call RTCA for pricing and ordering information. \n\n\n## Foreword",
    "This report was prepared by Special Committee 212 (SC-212) and approved by the RTCA Program Management Committee (PMC) on March 13, 2008. RTCA, Incorporated is a not-for-profit corporation formed to advance the art and science of aviation and aviation electronic systems for the benefit of the public. The organization functions as a Federal Advisory \nCommittee and develops consensus based recommendations on contemporary aviation issues. RTCA's objectives include but are not limited to: \n-",
    "- \ncoalescing aviation system user and provider technical requirements in a manner that helps government and industry meet their mutual objectives and responsibilities; \n \n- \nanalyzing and recommending solutions to the system technical issues that aviation faces as it continues to pursue increased safety, system capacity and efficiency; \n \n-",
    "- \ndeveloping consensus on the application of pertinent technology to fulfill user and provider requirements, including development of minimum operational performance standards for electronic systems and equipment that support aviation; and \n \n- \nassisting in developing the appropriate technical material upon which positions for the",
    "International Civil Aviation Organization and the International Telecommunication Union and other appropriate international organizations can be based. The organization's recommendations are often used as the basis for government and private sector decisions as well as the foundation for many Federal Aviation Administration Technical Standard Orders. Since RTCA is not an official agency of the United States Government, its recommendations may not be",
    "regarded as statements of official government policy unless so enunciated by the U.S. government \norganization or agency having statutory jurisdiction over any matters to which the recommendations relate.",
    "## Executive Summary",
    "A review of a ten-year period (1994 thru 2004) of data has indicated that controlled flight into terrain",
    "(CFIT) has been a major contributor of helicopter accidents, especially those resulting in fatalities.  The data suggests that CFIT accidents can happen during day and night under both visual meteorological conditions (VMC) and instrument meteorological conditions (IMC). The application of a Terrain Avoidance and Warning System (TAWS) (originally developed for fixedwing aircraft) in helicopter operations offers great promise in reducing the number of CFIT accidents.",
    "However, helicopters operate in widely diverse environments, including under visual and instrument flight rules (VFR and IFR) and in both on- and off-airport operations, often with significant low altitude exposure. Existing TAWS performance standards are insufficient to support these diverse operations.",
    "Subsequently, the United States Federal Aviation Administration (FAA) requested that RTCA Inc. form a committee to develop a Minimum Operational Performance Standard (MOPS) for a Helicopter Terrain Awareness and Warning System (HTAWS) in an effort to reduce the helicopter accident rate.  RTCA created the Special Committee SC- 212 to meet this goal. In order to develop a MOPS with the most beneficial alert/warning functions that support the unique helicopter VFR/IFR operational conditions, a",
    "alert/warning functions that support the unique helicopter VFR/IFR operational conditions, a ten-year period of existing helicopter CFIT accident data was analyzed to provide a basis for testing and to aid in the development of the MOPS. Emphasis was placed on helicopter VFR operations into and out of remote and/or unimproved locations without runways, lighting, or navigational aids.  Nine representative test scenarios were extracted from the CFIT",
    "accident cases as representative examples.  Appendix A of this document contains summaries of these accident cases. Emphasis was also placed on minimizing nuisance alerts during normal helicopter operations. With collective experience from across the helicopter industry, RTCA SC-212 developed this Minimum Operational Performance Standard (MOPS) for Helicopter Terrain Awareness and Warning System (HTAWS).  The CFIT accident cases were used as a basis to develop the test scenarios. This MOPS",
    "(HTAWS).  The CFIT accident cases were used as a basis to develop the test scenarios. This MOPS defines the most beneficial alert/warning functions that support the unique flight characteristics of helicopters while at the same time attempting to minimize nuisance alerting.",
    "## List Of Figures",
    "Figure 1-1  HTAWS System Overview ........................................................................................................2",
    "Figure A-2  Bluefield, WV - BH-412 - N70AM - 4/22/94 (Plan) ............................................................39 Figure A-3  Bluefield, WV - BH-412 - N70AM - 4/22/94 (Profile).........................................................39 Figure A-4  Ludieres, France - AS-350B - F-GKHP - 5/14/97 (Plan)......................................................41 Figure A-5  Ludieres, France - AS-350B - F-GKHP - 5/14/97 (Profile)..................................................42 Figure A-6",
    "- F-GKHP - 5/14/97 (Profile)..................................................42 Figure A-6  Puivert, France - AS-350 - F-GDFG - 7/4/97 (Plan).............................................................44 Figure A-7  Puivert, France - AS-350 - F-GDFG - 7/4/97 (Profile).........................................................44 Figure A-8  North Sea - SK-76B - PH-KHB - 12/20/97 (Plan)................................................................47",
    "Figure A-9  North Sea - SK-76B - PH-KHB - 12/20/97 (Profile) ............................................................48",
    "Figure A-10  St. Petersburg, FL - BK-117 - N428MB - 4/25/00 (Plan)...................................................50 Figure A-11  St. Petersburg, FL - BK-117 - N428MB - 4/25/00 (Profile) ...............................................51 Figure A-12  Clyde, TX - AS-350-B3 - N439AE - 2/20/03 (Plan)...........................................................53 Figure A-13  Clyde, TX - AS-350-B3 - N439AE - 2/20/03 (Profile).......................................................53 Figure A-14",
    "- N439AE - 2/20/03 (Profile).......................................................53 Figure A-14  Gulf of Mexico, USA - SK-76A++ - N579EH - 3/23/04 (Plan) .........................................56 Figure A-15  Gulf of Mexico, USA - SK-76A++ - N579EH - 3/23/04 (Profile)......................................56 Figure A-16  Boonville, Indiana - BH-206L-1 - N137AE - 4/20/04 (Plan)..............................................59 Figure A-17  Boonville, Indiana - BH-206L-1 - N137AE - 4/20/04",
    "Figure A-17  Boonville, Indiana - BH-206L-1 - N137AE - 4/20/04 (Profile)..........................................60 Figure A-18  Battle Mountain, Nevada - BH-407 - N2YN - 8/21/04 (Plan) ............................................62 Figure A-19  Battle Mountain, Nevada - BH-407 - N2YN - 8/21/04 (Profile).........................................63",
    "## List Of Tables",
    "Table 2-1  Caution and Warning Alert Colors............................................................................................13",
    "Table 2-2  Recommended HTAWS Alert Prioritization Scheme ...............................................................13 Table 2-3  Descent Warning Criteria ..........................................................................................................14 Table A-5-1  Accidents Selected for Study ................................................................................................37 Table A-5-2  Probable Flight Path, Bluefield, WV CFIT",
    "Table A-5-2  Probable Flight Path, Bluefield, WV CFIT Accident............................................................40 Table A-5-3  Probable Flight Path, Ludieres, France CFIT Accident ........................................................42 Table A-5-4  Probable Flight Path, Puivert, France CFIT Accident...........................................................45 Table A-5-5  Probable Flight Path, North Sea CFIT",
    "Table A-5-5  Probable Flight Path, North Sea CFIT Accident...................................................................48",
    "Table A-5-6  Probable Flight Path, St. Petersburg, FL CFIT Accident......................................................51",
    "Table A-5-7  Probable Flight Path, Clyde, TX CFIT Accident ..................................................................54 Table A-5-8  Probable Flight Path, Gulf of Mexico, USA CFIT Accident ................................................57 Table A-5-9  Probable Flight Path, Boonville, IN CFIT Accident .............................................................60 Table A-5-10  Probable Flight Path, Battle Mountain, NV CFIT Accident ...............................................63",
    "## 1 Purpose And Scope 1.1 Introduction",
    "This document defines the Minimum Operational Performance Standards (MOPS) for a Helicopter Terrain Awareness and Warning System (HTAWS). These standards specify system characteristics that should be useful to designers, manufactures, installers and users of the equipment. The word \"equipment\", as used within this document, includes all components and units necessary (as determined by the manufacturer or installer) for the system to properly perform its intended function(s). For example, the",
    "or installer) for the system to properly perform its intended function(s). For example, the \"equipment\" may include: sensor(s), a computer unit, an input/output unit that interfaces with other aircraft displays and/or systems, a control unit, and a display unit. In the case of this example, all of the foregoing components and units comprise the \"equipment.\" It should not be inferred from this example that each HTAWS equipment design will necessarily include all of the foregoing components or",
    "that each HTAWS equipment design will necessarily include all of the foregoing components or units. This will depend on the specific design chosen by the manufacturer.",
    "## 1.1.1 Compliance",
    "In this document, the term \"shall\" is used to indicate a requirement of the HTAWS",
    "equipment.  The term \"should\" is used to denote a recommendation that would improve the HTAWS equipment, but does not constitute a requirement.  The term \"may\" is used to denote a permissive situation. An approved design should comply with every requirement which shall be verifiable by inspection, test, analysis, or demonstration. Compliance with these standards is recommended as one means of assuring that the equipment will perform its intended functions(s) satisfactorily under all conditions",
    "that the equipment will perform its intended functions(s) satisfactorily under all conditions normally encountered in routine aeronautical operation. Any regulatory application of this document is the sole responsibility of appropriate governmental agencies.",
    "Operation performance standards for functions or components that refer to equipment capabilities that exceed the stated minimum requirements shall be identified as optional features. Performance requirements and associated test procedures should be developed for these optional features. \n\n## 1.1.2 Document Contents",
    "Section 1 of this document provides information needed to understand the rationale for equipment characteristics and requirements stated in the remaining sections. It describes typical equipment applications and operation goals, as envisioned by the members of Special Committee 212, and establishes the basis for the standards stated in Sections 2",
    "through 4. Definitions and assumptions essential to proper understanding of this document are also provided in this section. Section 2 contains the minimum performance standards for the equipment. These standards specify the required performance under standard and environmental conditions.",
    "Also included are recommended bench test procedures necessary to demonstrate equipment compliance with the stated minimum requirements. Section 3 describes the performance required of the installed equipment. Tests for the installed equipment are included when performance cannot be adequately determined through bench testing. Section 4 describes the operation performance characteristics for equipment installations and defines condition that will assure the equipment user that operations can be",
    "installations and defines condition that will assure the equipment user that operations can be conducted safely and reliably in the expected operational environment.",
    "## 1.2 System Overview\n\nA typical HTAWS as defined in this document will take inputs from a Horizontal Position Source, a Vertical Position Source, a Terrain Database and an Obstacle Database.  An HTAWS algorithm processes the inputs and generates display information, aural alerts and visual alerts to meet the intended purpose of HTAWS.",
    "Horizontal \nPosition Source \nTerrain/Obstacle \nDisplay \nVertical  \nPosition Source \nHTAWS \nAlgorithms \nVisual        \nAlerts \nOther Aircraft \nData Source(s) \nAural         \nAlerts \nTerrain \nDatabase \nObstacle \nDatabase",
    "The actual architecture of an HTAWS system is not defined or constrained by this document.  It is envisioned that various implementations are possible, including standalone LRUs, software modules within multi-function equipment, and hybrid implementations between these two extremes. \n\n## 1.3 Operational Application(S)",
    "## 1.3 Operational Application(S)\n\nThe HTAWS is intended for use in rotorcraft primarily during the cruise phase in Visual Meteorological Condition (VMC) and in Instrument Meteorological Condition (IMC) \nunder Instrument Flight Rules (IFR). \n\n## 1.4 Intended Function",
    "The HTAWS, as defined within this document, is an alerting system. It is intended to provide terrain and obstacle aural and visual alerts. HTAWS is designed to reduce the risk of CFIT accidents by providing increased situational awareness of the surrounding terrain and obstacles, mainly during the cruise phase in Visual Meteorological Condition (VMC) and in Instrument Meteorological Condition (IMC) under Instrument Flight Rules (IFR). HTAWS is not intended to be used as an aid for navigation.",
    "## 1.5 Operational Goals\n\nThe operational goal of HTAWS is to improve pilots' situational awareness and to reduce the risk of CFIT accidents by alerting pilots of impending CFIT. HTAWS designs should emphasize:",
    "a. Terrain and obstacle alerting functions that support unique helicopter VFR/IFR \noperations. \nb. Minimizing nuisance alerts, especially during VFR operations into and out of \nremote/unimproved locations without runways, lighting or NAVAIDs. \nc. Consistency with existing TAWS equipment design and operation. \n\n## 1.6 Assumptions\n\nThe design requirements and guidelines presented in this document assume several system characteristics and applications as listed below:",
    "a. The HTAWS may be stand-alone or part of an integrated system. \nb. The HTAWS display may be stand-alone or part of a multi-function display. c. The HTAWS has onboard terrain and obstacle databases. \nd. The HTAWS is an alerting system. The system does not guarantee successful \nrecovery from a conflict due to factors such as pilot response, aircraft performance, and database limitations. \ne. As escape recovery maneuvers vary based on the particulars of each specific",
    "e. As escape recovery maneuvers vary based on the particulars of each specific \nsituation, no standardized recovery technique is defined.",
    "## 1.7 Test Procedures",
    "The test procedures specified in this document are intended to be used as one means of demonstrating compliance with the performance requirement. Although specific test procedures are cited, it is recognized that other methods may be preferred. These alternate procedures may be used if they provide at least equivalent information. In such cases, the procedures cited herein should be used as one criterion in evaluating the acceptability of the alternate procedures. The order of tests specified",
    "criterion in evaluating the acceptability of the alternate procedures. The order of tests specified suggests that the equipment be subjected to a succession of tests as it moves from design, and design qualification, into operational use. For example, compliance with the requirements of Section 2 shall have been demonstrated as a precondition to satisfactory completion of the installed system tests of Section 3.",
    "## 1.7.1 Environmental Tests\n\nEnvironmental test requirements are specified in Subsection 2.3. The procedures and their associated limit requirements are intended to provide a laboratory means of determining the electrical and mechanical performance of the equipment under environmental conditions expected to be encountered in actual operations.",
    "Unless otherwise specified, the environmental conditions and test procedures contained in RTCA/DO-160E, Environmental Conditions and Test Procedures for Airborne Equipment, will be used to demonstrate equipment compliance. \n\n## 1.7.2 Bench Tests",
    "## 1.7.2 Bench Tests\n\nBench test procedures are specified in Subsection 2.4. These tests provide a laboratory means of demonstrating compliance with the requirements of Subsection 2.2. Test results may be used by equipment manufacturers as design guidance, for monitoring manufacturing compliance and, in certain cases, for obtaining formal approval of equipment design. \n\n## 1.7.3 Installed Equipment Tests",
    "The installed equipment test procedures and their associated limits are specified in Section 3. Although bench and environmental test procedures are not included in the installed equipment tests, their successful completion is a precondition to completion of the installed equipment testing. In certain instances, however, installed equipment testing may be used in lieu of bench test simulation of such factors as power supply characteristics, interference from or to other equipment installed on",
    "such factors as power supply characteristics, interference from or to other equipment installed on the aircraft, etc. Installed equipment tests are normally performed under two conditions:",
    "a. With the aircraft on the ground and using simulated or operational system inputs. \nb. With the aircraft in flight using operational system inputs appropriate to the \nequipment under test. \nTest results may be used to demonstrate functional performance in the intended operational environment. \n\n## 1.7.4 Operational Tests",
    "## 1.7.4 Operational Tests\n\nThe operational tests are specified in Section 4. These test procedures and their associated limits are intended to be conducted by operating personnel as one means of ensuring that the equipment is functioning properly and can be reliably used for its intended function(s). \n\n## 1.8 Definitions Of Terms\n\nTerms used within this document:",
    "a. Alert - A visual or aural stimulus presented either to attract attention or to \nconvey information regarding system status or condition. \nb. Aural Alert - A verbal statement used to annunciate a condition, situation or \nevent. \nc. AC (Advisory Circular) - United States Federal Aviation Administration \nguidance for the design and installation of aviation equipment on civil aircraft. \nd. Caution Alert - An alert requiring flight crew awareness. Subsequent corrective",
    "d. Caution Alert - An alert requiring flight crew awareness. Subsequent corrective \naction will normally be necessary. \ne. CFIT (Controlled Flight into Terrain) - An accident or incident in which the \naircraft, under the flight crew's control, is inadvertently flown into terrain, \nobstacles, or water. \nf. CFR (Code of Federal Regulations) - Codification of the general and permanent \nrules published in the Federal Register by the executive departments and",
    "rules published in the Federal Register by the executive departments and \nagencies of the Federal Government of the United States of America. \ng. FAA (Federal Aviation Administration) h. Failure - The inability of the equipment or any subpart of that equipment to \nperform its intended function within previously specified limits. \ni. \nFalse Alert - A warning or caution alert that occurs when the designed terrain or \nobstacle warning or caution threshold of the system is not exceeded. \nj.",
    "obstacle warning or caution threshold of the system is not exceeded. \nj. \nFAR (Federal Aviation Regulation) \nk. GPS (Global Positioning System) l. \nHazard - A state or set of conditions that, together with other conditions in the \nenvironment, could result in an adverse safety impact. \nm. Hazardously Misleading Information - An incorrect depiction of the terrain or \nobstacle threat relative to the aircraft during an alert condition (excluding source \ndata).",
    "obstacle threat relative to the aircraft during an alert condition (excluding source \ndata). \nn. HTAWS (Helicopter Terrain Awareness and Warning System) o. IFR (Instrument Flight Rules) - Refers to the aviation regulations governing the \nprocedures for conducting flight under instrument meteorological conditions \n(IMC). \np. IMC (Instrument Meteorological Conditions) - Describes weather conditions that",
    "(IMC). \np. IMC (Instrument Meteorological Conditions) - Describes weather conditions that \nnormally require pilots to fly primarily by reference to the aircraft's instruments in order to maintain separation from the surrounding terrain and other aircraft. \nq. MOPS (Minimum Operational Performance Standards) r. Nuisance Alert - An alert that occurs when there is no threat or is unnecessary \nfor the intended operation. \ns. QFE - Corrected Barometric Altitude relative to field elevation. t.",
    "s. QFE - Corrected Barometric Altitude relative to field elevation. t. \nRFM (Rotorcraft Flight Manual) \nu. RFMS (Rotorcraft Flight Manual Supplement) v. TAWS (Terrain Awareness and Warning System) - Refers to terrain awareness \nand warning systems in fixed-wing aircraft. \nw. TCAS (Traffic Collision Avoidance System) \nx. TSO (Technical Standard Order) - A minimum performance standard issued by",
    "x. TSO (Technical Standard Order) - A minimum performance standard issued by \nthe United States Federal Aviation Administration for specified materials, parts, processes, and appliances used on civil aircraft. \ny. VFR (Visual Flight Rules) - Refers to the aviation regulations that govern the \nprocedures for conducting flight under visual meteorological conditions (VMC). \nz. Visual Alert - The use of projected or displayed information to present a \ncondition, situation, or event.",
    "condition, situation, or event. \naa. VMC (Visual Meteorological Conditions) - Describes weather conditions in \nwhich pilots have sufficient visibility to fly an aircraft while maintaining visual separation from the surrounding terrain as well as other aircraft. \nbb. WAAS (Wide Area Augmentation System) \ncc. Warning Alert - An alert that requires immediate flight crew attention and \ndecision.",
    "## 1.9 References\n\nReferences used within this document:",
    "a. AC 23-18, Installation of Terrain Awareness and Warning System (TAWS) \nApproved for Part 23 Airplanes, Federal Aviation Administration \nb. AC 25-23, Airworthiness Criteria for the Installation Approval of a Terrain \nAwareness and Warning System (TAWS) for Part 25 Airplanes, Federal Aviation \nAdministration \nc. AC 27-1B, Certification of Normal Category Rotorcraft, Federal Aviation \nAdministration \nd. AC 29-2C, Certification of Transport Category Rotorcraft, Federal Aviation \nAdministration",
    "d. AC 29-2C, Certification of Transport Category Rotorcraft, Federal Aviation \nAdministration \ne. ARINC 743A, Global Navigation Satellite System (GNSS) Sensor, Aeronautical \nRadio, Inc. \nf. FAR Part 91, General operating and flight rules, Federal Aviation Administration \ng. FAR 135, Operating Requirements: Commuter And On Demand Operations And \nRules Governing Persons On Board Such Aircraft, Federal Aviation \nAdministration",
    "Rules Governing Persons On Board Such Aircraft, Federal Aviation \nAdministration \nh. RTCA/DO-160E, Environmental Conditions and Test Procedures for Airborne \nEquipment, RTCA Incorporated \ni. \nRTCA/DO-161A, Minimum Performance Standards - Airborne Ground \nProximity Warning Equipment, RTCA Incorporated \nj. \nRTCA/DO-178B, Software Considerations in Airborne System and Equipment \nCertification, RTCA Incorporated \nk. RTCA/DO-200A, Standards for Processing Aeronautical Data, RTCA \nIncorporated \nl.",
    "k. RTCA/DO-200A, Standards for Processing Aeronautical Data, RTCA \nIncorporated \nl. \nRTCA/DO-254, Design Assurance Guidance for Airborne Electronic Hardware, \nRTCA Incorporated. \nm. TSO-C92c, Airborne Ground Proximity Warning Equipment, Federal Aviation \nAdministration \nn. TSO-C129a, Airborne Supplemental Navigation Equipment Using the Global \nPositioning System, Federal Aviation Administration \no. TSO-C145b, Airborne Navigation Sensors Using The Global Positioning System",
    "o. TSO-C145b, Airborne Navigation Sensors Using The Global Positioning System \nAugmented By The Satellite Based Augmentation System, Federal Aviation \nAdministration \np. TSO-C146b, Stand-Alone Airborne Navigation Equipment Using The Global \nPositioning System Augmented By The Satellite Based Augmentation System, \nFederal Aviation Administration \nq. TSO-C151b, Terrain Awareness and Warning System, Federal Aviation \nAdministration",
    "## \n\n \nThis Page Intentionally Left Blank \n\n## 2 Equipment Performance Requirements And Test Procedures 2.1 General Requirements\n\nThe requirements identified in this section must be met for all components of the HTAWS airborne equipment. \n\n## 2.1.1 Airworthiness\n\nIn the design and manufacture of the equipment, the manufacturer shall provide for installation so as not to impair the airworthiness of the aircraft. \n\n## 2.1.2 Intended Function",
    "## 2.1.2 Intended Function\n\nThe equipment shall perform its intended function, as defined by this document and the manufacturer. \n\n## 2.1.3 Fire Protection\n\nAll materials used shall be self-extinguishing except for small parts (such as knobs, fasteners, seals, grommets and small electrical parts) that would not contribute significantly to the propagation of a fire. \n\n## 2.1.4 Equipment Interfaces",
    "## 2.1.4 Equipment Interfaces\n\nThe equipment shall be designed so that normal or abnormal HTAWS equipment operation shall not adversely affect the operation of other equipment.  The normal or abnormal operation of other equipment shall not adversely affect the HTAWS equipment except as specifically allowed.",
    "Note: \n       These requirements assume the proper installation of the HTAWS \nequipment.  These requirements also assume an adequate design and proper \ninstallation of the equipment interfacing with the HTAWS equipment. \n\n## 2.1.5 Effects Of Test\n\nThe equipment shall be designed so that the application of specified test procedures shall not be detrimental to the equipment's performance except as specifically allowed in this document. \n\n## 2.1.6 Design Assurance",
    "## 2.1.6 Design Assurance\n\nThe hardware and software shall be designed so that misleading information and the unannunciated loss of function shall be improbable.  Both conditions are considered to be major failure conditions and shall not be more probable than 10-5 per flight hour. \n\n## 2.1.6.1 Hardware Compliance",
    "## 2.1.6.1 Hardware Compliance\n\nThe hardware shall be developed to comply with the test conditions specified in the latest revision of RTCA/DO-160 (or equivalent standard) at the start of qualification testing for the base hardware. The complex electronic hardware shall be designed to comply with RTCA/DO-254 (or equivalent standard). The baseline hardware produced prior to this MOPS standard may use their existing DO-160 testing level and complex electronic hardware approval methods.",
    "## 2.1.6.2 Software Compliance\n\nSoftware implementing the HTAWS functionality defined within this document shall be developed in accordance with RTCA/DO-178B.  Anomalous behavior of the HTAWS software shall be considered a major failure condition, so the software that is developed shall comply with the appropriate software level of the RTCA/DO-178B specification accordingly.   \n\n## 2.2 Equipment Performance - Standard Conditions 2.2.1 Display 2.2.1.1 Terrain And Obstacle Data Depiction",
    "a. The HTAWS shall be capable of showing terrain and obstacle data in color on a \ncockpit display. \nNotes:",
    "1. \nThe display hardware may be stand alone or interfaced with existing equipment, such as weather radar (WXR), navigation displays, or other \ncompatible display systems. The actual display presentation format will \ndepend on the onboard display hardware, the options made available by the HTAWS manufacturer, and the features desired by the customer or user. Regardless of what format is used, the display presentation should enhance the flight crew's awareness of terrain and obstacle hazards.",
    "2. \nThe HTAWS manufacturer may consider selecting a display where multiple functions are presented. In these cases, a means to select or deselect the display of terrain and obstacle information should be provided. However, care should be exercised in selecting such a multifunction implementation, to ensure that the display sharing is appropriate for the specific functions. The use of the HTAWS display should not",
    "unacceptably detract from the usability of existing functions. Since the HTAWS display is not to be used for navigation, the use of the display should not impair the ability of the pilot to perform required navigation functions. An example of such impairment would be an installation that forces the pilot to choose between the HTAWS display and the needed navigation information in situations where both could be effectively used simultaneously and continuously (e.g., instrument approach in the",
    "both could be effectively used simultaneously and continuously (e.g., instrument approach in the vicinity of hazardous terrain and obstacles). If the timesharing of the display between HTAWS and other functions is deemed acceptable, the design should facilitate simple switching between the functions, with minimal time delays, so both functions are sufficiently accessible in realistic flight scenarios.",
    "b. The terrain and obstacle data shall be depicted relative to the aircraft's horizontal \nand vertical position. \nc. Variations in terrain and obstacle elevation depicted relative to the aircraft's \naltitude shall be visually distinct.  \nNotes:",
    "1. \nThe terrain and obstacle display should be designed so that the flight crew can readily determine if the terrain or an obstacle is a threat to the aircraft. \n2. \nTerrain or obstacles that are more than 1,500 feet below the aircraft's \naltitude need not be depicted. \n3. \nChoice of color depictions should carefully consider the helicopter operational environment. \nd. The terrain and obstacle data depicted shall be oriented to heading, track, or north \nup.",
    "d. The terrain and obstacle data depicted shall be oriented to heading, track, or north \nup.  \ne. The display orientation of the terrain and obstacle data should be heading up. In a \nsystem without a heading input, in a region of flight where track cannot be determined, the display shall be oriented north up or be blank. \nf. The display orientation shall be indicated clearly to the flight crew. g. If the terrain or obstacle data is presented on a shared display, the terrain and",
    "obstacle mode and terrain and obstacle information shall be easily distinguishable from weather and other features. \nh. If additional terrain and obstacle view modes are provided, they shall not present \ninformation that is inconsistent or incompatible with the features described above. Color, range scale and textual information shall be consistent with the other view modes. When transitioning between view modes, the range scale shall remain the same for each view mode.",
    "## 2.2.1.2 Auto Display Functions\n\nThe HTAWS should be capable of supporting Auto Display Functions.  The Auto Display Functions shall not impair the pilot's use of essential flight or navigational information.  The HTAWS shall provide a mechanism for the pilot to return to the original display mode. \n\nNote: \nAuto Display Functions are changes to the display mode, range or content that are initiated by the HTAWS without pilot action. \n\n## 2.2.2 Alerts",
    "## 2.2.2 Alerts\n\nThe HTAWS shall provide aural and visual terrain and obstacle alerts. \n\n## 2.2.2.1 Aural Terrain And Obstacle Alert",
    "a. A HTAWS aural alert shall be issued when a terrain or obstacle alert condition \ncomes into effect. \nb. The HTAWS terrain and obstacle aural warning alert shall be periodic while the \nalert condition is in effect. \nc. The HTAWS should support an aural alert acknowledge function to suppress",
    "c. The HTAWS should support an aural alert acknowledge function to suppress \nmultiple terrain and obstacle aural caution alerts from a given event. A given event is defined as the transition from non-caution alert state into a caution alert state. The acknowledge function shall not suppress terrain or obstacle aural warning alerts. \nd. The HTAWS aural alert shall be removed when the alert condition is no longer in \neffect.",
    "d. The HTAWS aural alert shall be removed when the alert condition is no longer in \neffect. \ne. The HTAWS aural alert volume level shall be configurable to accommodate \nvarying flight noise levels. \nf. The aural alerts shall be clear, concise, and unambiguous. Each aural alert should \nstart with \"caution\" or \"warning\" followed by a word or phrase identifying the \nhazard. \"Caution terrain\" and \"warning obstacle ahead\" are both clear and concise examples of aural alerts.",
    "## 2.2.2.2 Visual Terrain And Obstacle Alert",
    "a. A HTAWS visual alert shall be issued when a terrain or obstacle alert condition \ncomes into effect. \nb. The HTAWS shall provide continuous visual indications while caution and \nwarning alert conditions are in effect. \nc. The HTAWS visual alert shall be removed when the alert condition is no longer \nin effect. \nd. Terrain or obstacles that generate alerts shall be displayed in a manner consistent",
    "in effect. \nd. Terrain or obstacles that generate alerts shall be displayed in a manner consistent \nwith the caution and warning alert levels and be distinguishable from nonhazardous terrain or obstacles. The display feature shall be color coded as follows:",
    "## \n\n| Alert Type    | Associated Color    |\n|---------------|---------------------|\n| Warning       | Red                 |\n| Caution       | Amber/Yellow        |",
    "e. The colors and textures used for terrain and obstacle threats shall be consistent \nwith other FAA and RTCA guidance (such as FAR 27/29.1322 and TSO C113) \nas well as intuitive and indicative of the immediacy of the threat. \nf. The selected colors shall complement the discrete visual and aural alerts that are \npresented to the flight crew. Accordingly, any colors that are used for the threat terrain and obstacle display should match the colors used for discrete visual \nalerts.",
    "## 2.2.2.3 Alert Prioritization\n\na. The HTAWS shall have an internal prioritization alerting scheme for each of the \nfunctions. The priority scheme shall ensure that a more critical alert overrides the presentation of any lesser priority alert. \n\n|   Priority  | Description       |\n|-------------|-------------------|\n|          1  | Terrain Warning   |\n|          2  | Obstacle Warning  |\n|          3  | Terrain Caution   |\n|          4  | Obstacle Caution  |\n|          5  | HTAWS INOP Status |",
    "b. The HTAWS should have an interactive capability with other external alerting \nsystems so that an alerting priority can be automatically executed. \nNote:  The purpose of this feature is to avoid confusion or chaos on the flight deck during multiple alerts from different alerting systems (such as TCAS). \n\n## 2.2.2.4 Alert Envelope",
    "a. For level flight toward terrain or an obstacle at or above the aircraft's altitude, the \nHTAWS shall provide a caution alert at least 20 seconds and a warning alert at least 10 seconds before the projected impact while the aircraft is operating within the speed ranges defined by the HTAWS manufacturer.  \nb. For descending flight with a descent rate of more than 300 fpm over terrain or an \nobstacle, the HTAWS shall provide a warning alert at least by the height above",
    "obstacle, the HTAWS shall provide a warning alert at least by the height above \nterrain or obstacle specified in Column E of Table 2-3 while the aircraft is \noperating within the speed ranges defined by the HTAWS manufacturer.",
    "| A           | B           | C              | D             | E            |\n|-------------|-------------|----------------|---------------|--------------|\n| Altitude    | Altitude    | Total Altitude | Minimum       |              |\n| Lost with   | Required to | Lost due to    | HTAWS Warning |              |\n| Vertical    |             |                |               |              |\n| Speed       | 1 Second    | Level Off      | Recovery      | Alert Height |",
    "| Speed       | 1 Second    | Level Off      | Recovery      | Alert Height |\n| Pilot Delay | with .25 G  | Maneuver       | Above Terrain |              |\n| (FPM)       |             |                |               |              |\n| (FT)        | (FT)        | (FT)           | (FT)          |              |\n| -300        | 5           | 2              | 7             | 107          |\n| -500        | 8           | 4              | 12            | 112          |",
    "| -500        | 8           | 4              | 12            | 112          |\n| -750        | 12          | 10             | 22            | 122          |\n| -1000       | 17          | 17             | 34            | 134          |\n| -1500       | 25          | 39             | 64            | 164          |\n| -2000       | 33          | 69             | 102           | 202          |\n|             |             |                |               |              |",
    "c. The HTAWS shall not provide terrain or obstacle alerts during level flight when \nthe aircraft is at more than 400 feet above the highest terrain or obstacle within a defined corridor. The corridor is defined as the larger of 0.6 NM or 30 seconds of forward speed left and right of the flight path projected for 60 seconds ahead of the aircraft. \nd. The HTAWS should not provide terrain alerts during normal approach and \ntakeoff.",
    "d. The HTAWS should not provide terrain alerts during normal approach and \ntakeoff. \ne. The HTAWS may provide a \"Reduced Protection Mode\" where operations below \nthe defined Alert Envelopes are allowed without issuing alerts.   \nf. If a \"Reduced Protection Mode\" is provided, the mode shall only be available by \nmanual flight crew selection. \ng. If a \"Reduced Protection Mode\" is provided, a visual indication to the flight crew \nshall be provided while operating in the Reduce Protection Mode.",
    "## 2.2.3 Horizontal And Vertical Position Source\n\na. The HTAWS shall use a horizontal position source and a vertical position source \nthat provides the required level of accuracy for its intended function. \nNotes:",
    "1. \nIf GPS equipment is used as a position source, it is recommended the \nequipment meet the requirements of TSO-C129a. \n2. \nIf a Wide Area Augmentation System (WAAS) is used as a position source, it is recommended the equipment meet the requirements of TSO-C145a. \n3. \nPosition sources should provide 95% horizontal and vertical position \naccuracy figure of merit (FOM) estimate. See ARINC-743A as a guideline. \nb. The HTAWS functions that require a position source for operation shall be",
    "b. The HTAWS functions that require a position source for operation shall be \nautomatically disabled when the source has degraded to a point where its \naccuracy can no longer support its intended function.",
    "## 2.2.4 Terrain And Obstacle Databases",
    "a. The manufacturer shall present the development and methodology used to \nvalidate and verify the terrain and obstacle information. RTCA/DO-200A/ EUROCAE ED 76, Standards for Processing Aeronautical Data, shall be used as \na guideline.  \nb. The manufacturer shall demonstrate that the accuracy and resolution of the \nterrain and obstacle databases is suitable for the intended operation. The highest resolution database should be used where necessary and available.",
    "c. The HTAWS shall be capable of accepting updated databases. \nd. User entered data points and databases shall not corrupt the manufacturer \nprovided databases. \ne. The HTAWS may provide the capability for the user to enter user-defined \nobstacles based upon position and height data known to the user.  \nf. The horizontal datum used for the databases shall be compatible with the datum \nused for the horizontal position source.",
    "used for the horizontal position source. \ng. The vertical datum used for the databases shall be compatible with the datum \nused for the vertical position source.",
    "## 2.2.5 System Inhibit\n\nA means for the flight crew to inhibit the HTAWS function(s) should be provided. \n\nNote:  This option should have specific coverage in the Rotorcraft Flight Manual (RFM) or Rotorcraft Flight Manual Supplement (RFMS). \n\n## 2.2.6 System Status Indications",
    "## 2.2.6 System Status Indications\n\na. An inhibited, failed, or inoperative HTAWS shall be indicated to the flight crew \nin a manner consistent with the flight deck design philosophy. \nNote:  The HTAWS should provide an indication to the flight crew when the function is automatically inhibited.",
    "b. The HTAWS shall be capable of providing the status and version information to \nthe flight crew for at least the following items: \n1. \nTerrain Database \n2. \nObstacle Database \n3. \nSoftware \nc. The HTAWS shall have a self-test function to verify system operation and \nintegrity. It shall monitor the equipment itself, input power, input signals, and",
    "integrity. It shall monitor the equipment itself, input power, input signals, and \naural and visual outputs. Failure of the system to successfully pass the self-test shall be annunciated in accordance with paragraph (a) of this section.",
    "Note:  Flight crew verification of the aural and visual outputs during a self-test is an acceptable method for monitoring aural and visual outputs. \n\n## 2.3 Equipment Performance - Environmental Conditions\n\nThe HTAWS equipment shall meet the environmental performance as per the applicable environmental test conditions set forth in RTCA/DO-160E, Environmental Conditions and Test Procedures for Airborne Equipment.",
    "## 2.4 Equipment Test Procedures 2.4.1 Definitions Of Terms And Conditions Of Test\n\nThe following are definitions of terms and the conditions under which the tests described in this subsection should be conducted.",
    "a. Power Input Voltage - Unless otherwise specified, all tests shall be conducted \nwith the power input voltage adjusted to design voltage plus or minus 2%. The \ninput voltage shall be measured at the input terminals of the equipment under test. \nb. Power Input Frequency -  \n1. \nIn the case of equipment designed for operation from an AC source of essentially constant frequency (e.g., 400 Hz); the input frequency shall be adjusted to design frequency plus or minus 2%. \n2.",
    "2. \nIn the case of equipment designed for operation from an AC source of variable frequency (e.g., 300 to 1,000 Hz), unless otherwise specified, tests shall be conducted with the input frequency adjusted to within 5% of a selected frequency and within the range for which the equipment is designed. \nc. Adjustment of Equipment - The circuits of the equipment under test shall be",
    "c. Adjustment of Equipment - The circuits of the equipment under test shall be \nproperly aligned and otherwise adjusted in accordance with the manufacturer's recommended practices prior to application of the specified tests. \nd. Test Equipment - All equipment used in the performance of the tests should be",
    "d. Test Equipment - All equipment used in the performance of the tests should be \nidentified by make, model and serial number where appropriate, and its latest calibration date. When appropriate, all test equipment calibration standards should be traceable to national and/or international standards. \ne. Test Instrument Precautions - Due precautions shall be taken during the test to \nprevent the introduction of errors resulting from the connection of voltmeters,",
    "prevent the introduction of errors resulting from the connection of voltmeters, \noscilloscopes and other test instruments across the input and output impedances of the equipment under test. \nf. Ambient Conditions - Unless otherwise specified, all tests shall be made within \nthe following ambient conditions: \n \n1. \nTemperature: +15 to +35 degrees C (+59 to +95 degrees F). \n2. \nRelative Humidity: Not greater than 85%. \n3. \nAmbient Pressure: 84 to 107 kPa (equivalent to +5,000 to -1,500 ft)",
    "3. \nAmbient Pressure: 84 to 107 kPa (equivalent to +5,000 to -1,500 ft) \n(+1,525 to -460m). \nWhen tests are conducted at ambient conditions which differ from the above values, allowances shall be made and the differences recorded.",
    "g. Connected Loads - Unless otherwise specified, all tests shall be performed with \nthe equipment connected to loads having the impedance values for which it is \ndesigned. \n\n## 2.4.2 Required Test Equipment\n\nThe following is a list of equipment that may be used to test the HTAWS: \n\na. Data sources as required to exercise all HTAWS capabilities. \nb. Simulated position source to \"fly\" the accident scenarios as outlined in this \ndocument. \n\n## 2.4.3 Detailed Test Procedures",
    "## 2.4.3 Detailed Test Procedures\n\nThe test procedures set forth below constitute a satisfactory method of determining required performance. Although specific test procedures are cited, it is recognized that other methods may be preferred. Such alternate methods may be used if the manufacturer can show that they provide at least equivalent information. Therefore, the procedures cited herein should be used as one criterion in evaluating the acceptability of the alternate procedures.",
    "## 2.4.3.1 Display 2.4.3.1.1 Terrain And Obstacle Data Depiction\n\nVerify compliance with the following requirements:",
    "a. The HTAWS shall be capable of showing terrain and obstacle data in color on a \ncockpit display. [2.2.1.1.a] \nb. The terrain and obstacle data shall be depicted relative to the aircraft's horizontal \nand vertical position. [2.2.1.1.b] \nc. Variations in terrain and obstacle elevation depicted relative to the aircraft's \naltitude shall be visually distinct. [2.2.1.1.c] \nd. The terrain and obstacle data depicted shall be oriented to heading, track, or north \nup. [2.2.1.1.d]",
    "up. [2.2.1.1.d] \ne. In a system without a heading input, in a region of flight where track cannot be \ndetermined, the display shall be oriented north up or be blank. [2.2.1.1.e] \nf. The display orientation shall be indicated clearly to the flight crew. [2.2.1.1.f] \ng. If the terrain or obstacle data is presented on a shared display, the terrain and \nobstacle mode and terrain and obstacle information shall be easily distinguishable from weather and other features. [2.2.1.1.g]",
    "h. If additional terrain and obstacle view modes are provided, they shall not present \ninformation that is inconsistent or incompatible with the features described above. Color, range scale and textual information shall be consistent with the \nother view modes. When transitioning between view modes, the range scale shall remain the same for each view mode. [2.2.1.1.h]",
    "## 2.4.3.1.2 Auto Display Functions\n\nVerify compliance with the following requirement: \n\na. If Auto Display Functions are supported, the Auto Display Functions shall not \nimpair the pilot's use of essential flight or navigational information.  The \nHTAWS shall provide a mechanism for the pilot to return to the original display \nmode. [2.2.1.2] \n\n## 2.4.3.2 Alerts\n\nVerify compliance with the following requirements:",
    "## 2.4.3.2 Alerts\n\nVerify compliance with the following requirements: \n\na. The HTAWS shall provide aural and visual terrain and obstacle alerts. [2.2.2]  \n\n## 2.4.3.2.1 Aural Terrain And Obstacle Alert\n\nVerify compliance with the following requirements:",
    "a. A HTAWS aural alert shall be issued when a terrain or obstacle alert condition \ncomes into effect. [2.2.2.1a] \nb. The HTAWS terrain and obstacle aural warning alert shall be periodic while the \nalert condition is in effect. [2.2.2.1.b] \nc. If the acknowledge function is supported, it shall not suppress terrain or obstacle \naural warning alerts. [2.2.2.1.c] \nd. The HTAWS aural alert shall be removed when the alert condition is no longer in \neffect. [2.2.2.1.d]",
    "effect. [2.2.2.1.d] \ne. The HTAWS aural alert volume level shall be configurable to accommodate \nvarying flight noise levels. [2.2.2.1.e] \nf. The aural alerts shall be clear, concise, and unambiguous. [2.2.2.1.f]",
    "## 2.4.3.2.2 Visual Terrain And Obstacle Alert Verify Compliance With The Following Requirements:\n\na. A HTAWS visual alert shall be issued when a terrain or obstacle alert condition \ncomes into effect. [2.2.2.2.a]",
    "b. The HTAWS shall provide continuous visual indications while caution and \nwarning alert conditions are in effect. [2.2.2.2.b] \nc. The HTAWS visual alert shall be removed when the alert condition is no longer \nin effect. [2.2.2.2.c] \nd. Terrain or obstacles that generate alerts shall be displayed in a manner consistent \nwith the caution and warning alert levels and be distinguishable from nonhazardous terrain or obstacles. The display feature shall be color coded as",
    "depicted in Table 2-1. [2.2.2.2.d] \ne. The colors and textures used for terrain and obstacle threats shall be consistent \nwith other FAA and RTCA guidance (such as FAR 27/29.1322 and TSO C113) \nas well as intuitive and indicative of the immediacy of the threat. [2.2.2.2.e] \nf. The selected colors shall complement the discrete visual and aural alerts that are \npresented to the flight crew. [2.2.2.2.f]",
    "## 2.4.3.2.3 Alert Prioritization\n\nVerify compliance with the following requirements: \n\na. The HTAWS shall have an internal priority alerting scheme for each of the \nfunctions. The priority scheme shall ensure that a more critical alert override the presentation of any alert of lesser priority. [2.2.2.3.a] \n\n## 2.4.3.2.4 Alert Envelope\n\nVerify compliance with the following requirements:",
    "a. For level flight toward terrain or an obstacle at or above the aircraft's altitude, the \nHTAWS shall provide a caution alert at least 20 seconds and a warning alert at least 10 seconds before the projected impact while the aircraft is operating within the speed ranges defined by the HTAWS manufacturer. [2.2.2.4.a] \nb. For descending flight with a descent rate of more than 300 fpm over terrain or an \nobstacle, the HTAWS shall provide a warning alert at least by the height above",
    "obstacle, the HTAWS shall provide a warning alert at least by the height above \nterrain or obstacle specified in Column E of Table 2-3 while the aircraft is \noperating within the speed ranges defined by the HTAWS manufacturer. [2.2.2.4.b] \nc. The HTAWS shall not provide terrain or obstacle alerts during level flight when",
    "c. The HTAWS shall not provide terrain or obstacle alerts during level flight when \nthe aircraft is at more than 400 feet above the highest terrain or obstacle within a defined corridor. The corridor is defined as the larger of 0.6 NM or 30 seconds of forward speed left and right of the flight path projected for 60 seconds ahead of the aircraft. [2.2.2.4.c] \nd. If a \"Reduced Protection Mode\" is provided, the mode shall only be available by \nmanual flight crew selection. [2.2.2.4.f]",
    "manual flight crew selection. [2.2.2.4.f] \ne. If a \"Reduced Protection Mode\" is provided, a visual indication to the flight crew \nshall be provided while operating in the Reduce Protection Mode. [2.2.2.4.g]",
    "## 2.4.3.2.5 Known Accident Cases",
    "a. For each of the known accident cases defined in Table A-5-1, the HTAWS shall \nmeet requirements in Sections 2.2.2.4.a and 2.2.2.4.b. \nb. The HTAWS shall not provide any alerts during normal level flight within a \ndefined corridor. The corridor is defined as the larger of 0.6 NM or 30 seconds of forward speed left and right of the flight path projected for 60 seconds ahead of \nthe aircraft. For each of the accident cases defined in Table A-5-1, verify that no",
    "the aircraft. For each of the accident cases defined in Table A-5-1, verify that no \ncaution or warning alerts are issued when flown at an altitude 400 feet above the \nhighest elevation identified in the corridor. [2.2.2.4.c]",
    "## 2.4.3.3 Horizontal And Vertical Position Source\n\nVerify compliance with the following requirements: \n\na. The HTAWS shall use a horizontal position source and a vertical position source \nthat provides the required level of accuracy for its intended function. [2.2.3.a] \nb. The HTAWS functions that require a position source for operation shall be \nautomatically disabled when the source has degraded to a point where its \naccuracy can no longer support its intended function. [2.2.3.b]",
    "## 2.4.3.4 Terrain And Obstacle Databases\n\nVerify compliance with the following requirements:",
    "a. The manufacturer shall present the development and methodology used to \nvalidate and verify the terrain and obstacle information. RTCA/DO-200A/ EUROCAE ED 76, Standards for Processing Aeronautical Data, shall be used as \na guideline. [2.2.4.a] \nb. The manufacturer shall demonstrate that the accuracy and resolution of the \nterrain and obstacle databases is suitable for the intended operation. The highest resolution database should be used where necessary and available. [2.2.4.b]",
    "c. The HTAWS shall be capable of accepting updated databases. [2.2.4.c] \nd. User entered data points and databases shall not corrupt the manufacturer \nprovided databases. [2.2.4.d] \ne. The horizontal datum used for the databases shall be compatible with the datum \nused for the horizontal position source. [2.2.4.f] \nf. The vertical datum used for the databases shall be compatible with the datum \nused for the vertical position source. [2.2.4.g]",
    "## 2.4.3.5 System Status Indications\n\nVerify compliance with the following requirements:",
    "a. An inhibited, failed, or inoperative HTAWS shall be indicated to the flight crew \nin a manner consistent with the flight deck design philosophy. [2.2.6.a] \nb. The HTAWS shall be capable of providing the status and version information to \nthe flight crew for at least the following items: [2.2.6.b] \n1. \nTerrain Database \n2. \nObstacle Database \n3. \nSoftware \nc. The HTAWS shall have a self-test function to verify system operation and",
    "3. \nSoftware \nc. The HTAWS shall have a self-test function to verify system operation and \nintegrity. It shall monitor the equipment itself, input power, input signals, and aural and visual outputs. Failure of the system to successfully pass the self-test shall be annunciated in accordance with Section 2.2.6.a. [2.2.6.c] \n \nThis Page Intentionally Left Blank",
    "## 3 Installed Equipment Performance",
    "This section describes the minimum acceptable level of performance for the equipment when installed in the aircraft.  For the most part, installed performance requirements are the same as those contained in Section 2, which were evaluated through bench and environmental tests.  However, certain requirements may be affected by the physical installation and can only be verified after installation.  Installation and installed performance requirements of the HTAWS as well as test procedures for",
    "Installation and installed performance requirements of the HTAWS as well as test procedures for evaluating that performance on the ground and in the air are specified below. The installed equipment shall meet the requirements of Sections 2.1 and 2.2 in addition to, or as modified by, the requirements stated below.",
    "## 3.1 Equipment Installation\n\nThis section contains general requirements that may influence the installation, physical location, and integration of the HTAWS equipment in the aircraft. While it must be determined that each requirement listed in this section has been complied with, many of these requirements do not lend themselves to detailed test procedures.  Thus, the requirements in this section do not have particular test procedures specified in the test procedure subsection.",
    "## 3.1.1 Accessibility\n\nControls and monitors provided for in-flight operations shall be readily accessible from the pilot's normal seated position. The appropriate operator/crew member(s) shall have an unobstructed view of displayed data when in the normal seated position. \n\n## 3.1.2 Aircraft Environment\n\nEquipment shall be compatible with the environmental condition present in the specific location in the aircraft where the equipment is installed. \n\n## 3.1.3 Display Visibility",
    "## 3.1.3 Display Visibility\n\nDisplay intensity shall be suitable for data interpretation under all cockpit ambient light conditions ranging from total darkness to reflected sunlight.  \nNote:  Visors, glare-shields or filters may be an acceptable means of obtaining day or night visibility. \n\n## 3.1.4 Failure Protection",
    "## 3.1.4 Failure Protection\n\na. Any probable failure of the HTAWS shall not degrade the normal operation of \nother equipment or systems connected to it beyond degradation due to the loss of \nthe HTAWS itself.  \nb. The failure of interfaced equipment or systems shall not degrade normal \noperation of the HTAWS equipment beyond degradation due to the loss of data from the interfaced equipment. \n\n## 3.1.5 Interference Effects",
    "## 3.1.5 Interference Effects\n\nThe equipment shall not be the source of harmful conducted or radiated interference nor be adversely affected by conducted or radiated interference from other equipment or systems installed in the aircraft.  \n\n## 3.1.6 Function And Documentation",
    "## 3.1.6 Function And Documentation\n\na. The equipment shall be installed in accordance with its intended function(s). b. Equipment manufacturers shall document the intended function(s) of the \nHTAWS, within the installation instructions and operating manual. The operating \nmanual shall describe the aural, textual and graphical information which is presented to the fight crew. \nc. The RFMS shall contain the following statements: \nThe HTAWS shall NOT be used for navigation purposes.",
    "The HTAWS is an alerting system. The system does NOT guarantee \nsuccessful recovery from a conflict due to factors such as pilot \nresponse, aircraft performance and database limitations. No \nstandardized recovery technique is defined as recovery maneuvers \nmay vary. \n\n## 3.2 Installed Equipment Performance Requirements\n\nThis section contains operational and performance requirements that may influence the installation, physical location, and integration of the HTAWS equipment in the aircraft.",
    "## 3.2.1 Display Readability\n\nThe display shall be readable under normal conditions of flight. \n\nNote: \nNormal conditions of flight include turbulence and maneuvers, in addition to the illumination conditions.  \n\n## 3.2.2 Audio Level\n\nThe aural alert level shall be sufficient for anticipated flight noise level. \n\n## 3.2.3 Equipment Operation",
    "## 3.2.3 Equipment Operation\n\na. Operation of the equipment shall not be adversely affected by aircraft \nmaneuvering encountered in normal flight operations. \nb. Operation of the equipment shall not interfere with the usability of other flight \ndeck displays. \n\n## 3.3 Conditions Of Test\n\nThe following subparagraphs define conditions under which tests specified in Section 3.4 shall be conducted. \n\n## 3.3.1 Power Input",
    "## 3.3.1 Power Input\n\nUnless otherwise specified, tests shall be conducted with the equipment powered by the aircraft's electrical power system. \n\n## 3.3.2 Associated Equipment Or Systems\n\nUnless otherwise specified, all aircraft electrically operated equipment and systems shall be turned on before conducting interference tests.  \n\n## 3.3.3 Environment\n\nDuring tests, the equipment shall not be subjected to environmental conditions that exceed those specified by the equipment manufacturer.",
    "## 3.3.4 Adjustment Of Equipment\n\nCircuits of the equipment under test shall be properly aligned and otherwise adjusted in accordance with the manufacturer's recommended practices prior to application of the specified tests. \n\n## 3.3.5 Warm-Up Period\n\nUnless otherwise specified, tests shall be conducted after a warm-up (stabilization) period of not more than fifteen (15) minutes. \n\n## 3.4 Test Procedures For Installed Equipment Performance",
    "The following test procedures provide one means of determining installed equipment performance.  Although in some instances specific test procedures are cited, it is recognized that other methods may be preferred by the installing activity.  These alternate procedures may be used if they provide at least equivalent information.  In such cases, the procedures cited herein should be used as one criterion in evaluating the acceptability of the alternate procedures.  The equipment shall be tested",
    "in evaluating the acceptability of the alternate procedures.  The equipment shall be tested to demonstrate compliance with the minimum requirements stated in Sections 2.2, 3.1, and 3.2. In order to meet this requirement, test results supplied by the equipment manufacturer or other proof of conformity may be accepted in lieu of tests performed by the installing activity.",
    "## 3.4.1 Ground Test Procedures 3.4.1.1 Conformity Inspection\n\nVisually inspect the installed equipment to determine the use of acceptable workmanship and engineering practices. Verify that proper mechanical and electrical connections have been made and that the equipment has been located and installed in accordance with the manufacturer's recommendations. \n\n## 3.4.1.2 Display Luminance",
    "## 3.4.1.2 Display Luminance\n\nExclude all external light from the flight deck, turn on all avionics and verify compliance with the following requirement:  \n\na. Display luminance shall not interfere with the usability of other flight deck \ndisplays nor produce unacceptable glare against the windscreen or other reflective surface. [3.1.3] \n\n## 3.4.1.3 Audio Level",
    "## 3.4.1.3 Audio Level\n\nStart the engine(s), turn on all avionics and bring up RPM to operational levels, and verify compliance with the following requirement:  \n\na. HTAWS audio outputs shall be audible at operational RPM. [3.2.2] \n\n## 3.4.1.4 Equipment Function\n\nVary all controls of the equipment through their full range to determine that the equipment is operating according to the manufacturer's instruction and that each control performs its intended function(s).",
    "## 3.4.1.5 Interference Effects",
    "With the equipment energized, operate each of the other electrically operated aircraft equipment and systems to determine that significant conducted or radiated interference does not exist. Evaluate all reasonable combinations of control settings and operating modes. Operate communication and navigation equipment on the low, high and at least one, but preferably four, mid-band frequencies. Make note of system or modes of operation that should also be evaluated during flight. If appropriate,",
    "note of system or modes of operation that should also be evaluated during flight. If appropriate, repeat tests using emergency power with the aircraft's batteries alone and the inverters operating.",
    "## 3.4.1.6 Power Supply Fluctuations\n\nUnder normal aircraft conditions, cycle the aircraft engine(s) through all normal power settings and verify proper operation of the equipment as specified by the equipment manufacturer. \n\n## 3.4.1.7 Equipment Accessibility\n\nDetermine that all equipment controls and displayed data are readily accessible and easily interpreted. \n\n## 3.4.2 Flight Test Procedures",
    "## 3.4.2 Flight Test Procedures\n\nA flight test will be conducted to verify satisfactory operation and usability of the installed equipment in flight.  The evaluation should take place during all phases of flight.",
    "The test procedures set forth below constitute a satisfactory method of determining required performance.  Although specific test procedures are cited, it is recognized that other methods may be preferred.  Such alternate methods may be used if the manufacturer can show that they provide at least equivalent information.  Therefore, the procedures cited herein should be used as one criterion in evaluating the acceptability of the alternate procedures.   \n\n## 3.4.2.1 Displayed Data Readability",
    "## 3.4.2.1 Displayed Data Readability\n\nDisplay luminance shall not interfere with the usability of other flight deck displays nor produce unacceptable glare against the windscreen or other reflective surface. [3.1.3] \n\n## 3.4.2.2 Audio Level\n\nHTAWS audio outputs shall be audible at operational RPM. [3.2.2] \n\n## 3.4.2.3 Interference Effects",
    "HTAWS audio outputs shall be audible at operational RPM. [3.2.2] \n\n## 3.4.2.3 Interference Effects\n\nFor aircraft equipment and systems that can be checked only in flight, determine that operationally significant conducted or radiated interference does not exist. Evaluate all reasonable combinations of control settings and operating modes. Operate communications and navigation equipment on the low, high and at least one, but preferably four, mid-band frequencies.",
    "## 3.4.2.4 Equipment Accessibility\n\nDetermine that all equipment controls and displayed data are readily accessible and easily interpreted. \n\n## 3.4.2.5 Htaws Functionality Test",
    "a. Flight tests of the HTAWS functionality should be conducted in an area where \nthe terrain and/or obstacle elevations for the test runs are verifiable. \nb. Flight test runs are recommended to be level flight at approximately the peak \nelevation of the terrain and/or obstacle. After caution and warning messages, the flight path should be adjusted to pass safely above the terrain and/or obstacle of \ninterest. The test runs shall verify that: \n1.",
    "interest. The test runs shall verify that: \n1. \nAll alerts (caution and warnings) are given at an appropriate point in the \nrun. \n2. \nAll pop-up, auto-range, or other display features are working correctly. \n3. \nThe display depicts the terrain and/or obstacle(s) accurately. \n4. \nInhibit functions operate properly. \nc. Flight test runs are recommended to trigger an alert in descending flight over flat \nterrain. After caution and warning messages, the flight path should be adjusted to",
    "terrain. After caution and warning messages, the flight path should be adjusted to \npass safely above the terrain. The test runs shall verify that all alerts (caution and warnings) are given at an appropriate point in the run.",
    "## 4 Equipment Operational Performance Characteristics 4.1 Required Operational Performance Requirements\n\nTo ensure that operations can be conducted safely and reliably in the expected operational environment, there are specific minimum acceptable performance requirements that shall be met. The following paragraphs identify these requirements. \n\n## 4.1.1 Power Inputs\n\nPrior to flight, verify that the equipment is receiving primary input power necessary for proper operation.",
    "## 4.1.2 Equipment Operating Modes\n\nThe equipment shall operate in each of its operating modes. \n\n## 4.2 Test Procedures For Operational Performance Requirements\n\nOperation equipment tests may be conducted as part of normal pre-flight tests. For those test which can only be run in flight, procedures should be developed to perform these test as early during the flight as possible to verify that the equipment is performing its intended function(s). \n\n## 4.2.1 Power Inputs",
    "## 4.2.1 Power Inputs\n\nWith the aircraft's electrical power generating system operating, energize the equipment and verify that electrical power is available to the equipment. \n\n## 4.2.2 Equipment Operating Modes\n\nVerify that the equipment performs its intended functions(s) for each of the operating modes available to the operator. \n\nThis Page Intentionally Left Blank \n\n## Rtca Special Committee 212 Helicopter Terrain Awareness And Warning System (Htaws)",
    "Co-Chairmen \n \nIshihara, Yasuo*** \nHoneywell International Inc. \nWebb, Bruce*** \nAmerican Eurocopter LLC \n \n \nSecretary \n \nWebb, Bruce*** \nAmerican Eurocopter LLC \n \n \nMembers \n \nArnod, Jean-Luc \nThales Avionics, Inc. \nBenich, Christopher \nHoneywell International Inc. \nBeringer, Dennis*** \nFederal Aviation Administration (FAA) \nBogner, Sven*** \nEuroAvionics Navigationssysteme GmbH & Co. KG  \nBolick, Jeff*** \nFederal Aviation Administration (FAA) \nBrodegard, William \nChelton Flight Systems",
    "Bolick, Jeff*** \nFederal Aviation Administration (FAA) \nBrodegard, William \nChelton Flight Systems \nBuehler, Larry*** \nFederal Aviation Administration (FAA), AFS-250 \nCampbell, Gary*** \nNational EMS Pilots Association (NEMSPA) \nEMS Air Services of New York, Inc \nCohn, Randall \nVectr Systems \nConner, Kevin*** \nHoneywell International Inc. \nCooper, Vincent \nBell Helicopter Textron, Inc. \nCorolla, Holly \nARINC \nDavenport, Clark*** \nFederal Aviation Administration (FAA) \nDigovich, Peter",
    "Corolla, Holly \nARINC \nDavenport, Clark*** \nFederal Aviation Administration (FAA) \nDigovich, Peter \nDVBEAM Services Company, LLC \nEpstein, Henry*** \nSikorsky Aircraft Corporation \nFalkov, Edward \nFederal State Unitarian Enterprise/State Research Institute of \nAviation Systems \nFlathers, Bill \nSparrow-Tech Inc. \nFleming, John \nHoneywell International Inc. \nFlotte, Laurent*** \nThales Avionics, Inc. \nFoster, Laurie \nU.S. Navy \nGaubert, Michel \nAmerican Eurocopter LLC \nGill, David",
    "Foster, Laurie \nU.S. Navy \nGaubert, Michel \nAmerican Eurocopter LLC \nGill, David \nCivil Aviation Authority of New Zealand \nGoddard, David*** \nGarmin International Inc. \nGodfrey, Anne*** \nFederal Aviation Administration (FAA), ASW-170 \nGreen, James*** \nAvidyne Corporation \nGroeninger, Michael*** \nEuroAvionics Navigationssysteme GmbH & Co. KG  \nGromova, Elena \nState Research Institute of Aviation Systems (GosNIIAS) \nHackworth, Carla \nFederal Aviation Administration (FAA) \nHart, Jake***",
    "Hackworth, Carla \nFederal Aviation Administration (FAA) \nHart, Jake*** \nChelton Flight Systems \nHeffernan, Ellen \nHelicopter Association International \nHenry, Colin*** \nOmniFlight \nAssociation of Air Medical Services \nHolmes, Craig \nFederal Aviation Administration (FAA), AFS-820 \nJohnson, Steve \nHoneywell International Inc. \n| Kaplicki, Christian                 | Aviation Communication & Surveillance Systems, LLC    |",
    "| Kaplicki, Christian                 | Aviation Communication & Surveillance Systems, LLC    |\n|-------------------------------------|-------------------------------------------------------|\n| (ACSS)                              |                                                       |\n| Kilbourne, Steve***                 | Honeywell International Inc.                          |\n| Kirby, Jeffrey                      | DCS Corporation                                       |",
    "| Kirby, Jeffrey                      | DCS Corporation                                       |\n| Leurs, Angela                       | EuroAvionics Navigationssysteme GmbH & Co. KG         |\n| Lewis, R.                           | Brandywine Flight Systems, Inc.                       |\n| Lyons, Jim                          | OGP                                                   |\n| Mancuso, Dawn                       | Association of Air Medical Services (AAMS)            |",
    "| Mancuso, Dawn                       | Association of Air Medical Services (AAMS)            |\n| Marty, Nicolas***                   | Thales Avionics, Inc.                                 |\n| Miwter, Jim***                      | Federal Aviation Administration (FAA)                 |\n| Morrin, Hugh                        | Transport Canada                                      |\n| Munawar, Zahid                      | Civil Aviation Authority of New Zealand               |",
    "| Munawar, Zahid                      | Civil Aviation Authority of New Zealand               |\n| Ng, Vincent                         | Lockheed Martin                                       |\n| O'Neal, Pat***                      | Federal Aviation Administration (FAA)                 |\n| Ott, Duane                          | Avidyne Corporation                                   |\n| Piala, Christophe                   | Thales Avionics, Inc.                                 |",
    "| Piala, Christophe                   | Thales Avionics, Inc.                                 |\n| Plummer, Steve                      | Federal Aviation Administration (FAA), AIR-130        |\n| Price, Rick***                      | Chelton Flight Systems                                |\n| Prior, Mark***                      | Bristow Helicopters Ltd (OGP)                         |\n| Ramdeen, Steve                      | Federal Aviation Administration (FAA), AIR-130        |",
    "| Ramdeen, Steve                      | Federal Aviation Administration (FAA), AIR-130        |\n| Rigsby, Matt                        | Federal Aviation Administration (FAA)                 |\n| Ruana, Rudolph                      | RTCA, Inc.                                            |\n| Shaffer, Charles                    | U.S. Navy                                             |\n| Sheehan, Jack***                    | Sagem Avionics, Inc.                                  |",
    "| Sheehan, Jack***                    | Sagem Avionics, Inc.                                  |\n| Smetana, Edward                     | U. S. Navy                                            |\n| Stephens, Ernie                     | Rotor & Wing Magazine                                 |\n| Summers, Harold***                  | Helicopter Association International (HAI)            |\n| Syslo, Joe                          | American Eurocopter LLC                               |",
    "| Syslo, Joe                          | American Eurocopter LLC                               |\n| Weisz, Dan                          | Sandel Avionics, Inc.                                 |\n| West, Kevin                         | Federal Aviation Administration (FAA)                 |\n| Whitley, Susan                      | U.S. Navy                                             |\n| Williams, Robert                    | Exxon Mobil Corporation                               |",
    "| Williams, Robert                    | Exxon Mobil Corporation                               |\n| York, David                         | Helicopter Association International (HAI)            |\n|                                     |                                                       |\n| *** indicates working group members |                                                       |",
    "Helicopter Accidents 1994-2004 \nThis Page Intentionally Left Blank \n\n## Appendix A Description Of Flight Paths For Selected Controlled Flight Into Terrain (Cfit) Helicopter Accidents 1994-2004 A.1 Introduction A.1.1 Purpose Of Study",
    "This report documents an investigation of the flight paths of 9 selected controlled flight into terrain (CFIT) helicopter accidents that occurred between 1994 and 2004.  The RTCA Special Committee SC-212 conducted this study.  The study was performed for the Aircraft Transportation Division (AFS-200) of the Federal Aviation Administration",
    "(FAA). The purpose of the study was to collect and present data describing the flight paths of the aircraft involved in the 9 selected CFIT accidents.  The flight path data will be used to construct CFIT accident scenarios, which will in turn be used to test the effectiveness of Helicopter Terrain Awareness and Warning System (HTAWS), developed by the aircraft avionics industry, in preventing CFIT accidents. The flight path data will also be used to test that no nuisance alert is issued when",
    "accidents. The flight path data will also be used to test that no nuisance alert is issued when the aircraft is flown at higher altitude.",
    "## A.1.2 Controlled Flight Into Terrain",
    "A CFIT accident occurs when an airworthy aircraft, experiencing no contributory systems or equipment problems, under the control of a certificated, fully qualified flight crew not suffering from any impairment, is flown into terrain (or water or obstacle) with no demonstrated prior awareness of the impending collision on the part of the crew.  Or, if the flight crew was aware of the impending collision, they were unable to prevent it.",
    "Because they involve high-speed impacts, CFIT accidents usually have disastrous consequences.  All but one of the 9 accidents described in this report involved fatalities.",
    "Of the 44 passengers and crewmembers involved in these 9 accidents, 31 (70%) were killed; 3 (7%) were seriously injured; 1 (2%) suffered minor injuries, and 9 (21%) were uninjured. Most CFIT accidents have in common a chain of events leading to what human factors experts term \"lack of situational awareness\" on the part of the flight crew.  Conditions of limited visibility (due to darkness or weather or both) are typically a major contributing factor.  Other such contributing factors include",
    "or both) are typically a major contributing factor.  Other such contributing factors include inadequate flight planning, poor pilot decision-making, poor crew resource management, lack of proper communications with air traffic control personnel, and lack of awareness of, or disregard for, applicable flight rules and procedures.",
    "## A.1.3 Contents Of This Report\n\nFollowing this introduction, this report contains two additional sections:",
    "a. Study methodology, including data sources, selection of accidents for study, and \nthe process used to develop flight path plots; \nb. Accident descriptions and flight path plots.  For each of the accidents \ninvestigated, a brief description of the aircraft's flight path over the last several \nmiles before impact is presented, together with a plot and associated spreadsheet of aircraft position, aircraft altitude, and other relevant data. \n\n## A.2 Study Methodology A.2.1 Data Sources",
    "## A.2 Study Methodology A.2.1 Data Sources\n\nPrimary data sources for development of flight path profiles for domestic accidents in this study were National Transportation Safety Board (NTSB) aircraft accident reports and supporting files.  For those accidents occurring in foreign countries, reports issued by the foreign governmental equivalent of the NTSB were obtained and reviewed.  Data in these reports relevant to this study included some of the following:",
    "a. air traffic control (ATC) voice transcripts; \nb. ATC radar plots; c. NTSB (or foreign equivalent) post-crash investigation information.  \nSectional Aeronautical Charts of scale 1:500,000 were used for domestic accidents.  For foreign accidents, best available topographical data were used. \n\n## A.2.2 Selection Of Accidents For Study",
    "## A.2.2 Selection Of Accidents For Study\n\nThe 9 accidents in this report were selected in consultation with participants of the RTCA \nSC-212.  Accidents studied ranged from relatively small (i.e., AS-350) passenger helicopters to medium (i.e., SK-76) passenger helicopters worldwide.  All accidents selected clearly met the following CFIT classification criteria:",
    "a. the helicopter was engaged in routine, cross-country flight at the time of the \naccident; \nb. the helicopter was in controlled flight at the time of impact; c. all systems on the helicopter were operating normally at the time of impact; and d. the flight crews of the accident helicopter were not impaired",
    "Of the 9 accidents studied, seven involved helicopters engaged in Emergency Medical Transport.  Six helicopters involved were operating under FAR Part 135, and the remaining three helicopters were operating under foreign regulations similar to FAR 135.",
    "Five of these accidents occurred at night and two were under IMC.",
    "Registration \nDate \nLocation \nAircraft \nType \nNumber \nFatalities Injuries \n4/22/94 \nBluefield, WV \nBH-412 \nN70AM \n4 \n0 \n5/14/97 \nLudieres, France \nAS-350B \nF-GKHP \n3 \n0 \n7/04/97 \nPuivert, France \nAS-350 \nF-GDFG \n4 \n0 \n12/20/97 \nNorth Sea \nSK-76 \nPH-KHB \n1 \n0 \n4/25/00 \nSt. Petersburg, FL \nBK-117 \nN428MB \n3 \n0 \n2/20/03 \nClyde, TX \nAS-350-B3\nN439AE \n0 \n1 \n3/23/04 \nGulf of Mexico \nSK-76A++\nN579EH \n10 \n0 \n4/20/04 \nBoonville, IN \nBH-206L-1\nN137AE \n1 \n3 \n8/21/04 \nBattle Mountain, NV \nBH-407 \nN2YN \n5",
    "0 \n4/20/04 \nBoonville, IN \nBH-206L-1\nN137AE \n1 \n3 \n8/21/04 \nBattle Mountain, NV \nBH-407 \nN2YN \n5 \n0",
    "## A.2.3 Flight Path Plotting Process",
    "To generate plots of flight paths, contents of the accident report were reviewed.  If radar of aircraft altitude and flight track were available, these were used directly.  If these were unavailable, other sources were used to generate this information, including references to navigational aids and altitude in the cockpit or ATC conversations.  In all cases, airspeed and heading (with reference to magnetic north) at impact, as well as impact point latitude and longitude coordinates, were",
    "to magnetic north) at impact, as well as impact point latitude and longitude coordinates, were obtained from post-crash investigation reports. Given the available data on aircraft position, the most likely track of the accident aircraft was plotted on a topographical map.  Elevation in feet above mean sea level (MSL) of relevant topographical features along the flight track was tabulated. The result of the above effort was a spreadsheet for each accident containing the following information:",
    "a. Latitude and longitude of the aircraft location; \nb. aircraft altitude at these specified location, measured in feet above MSL; \nAdditional notes such as probable aircraft speed and vertical speed were also provided below a spreadsheet. From each spreadsheet, a graphic chart was generated.  Both spreadsheets and charts are contained in the following section.",
    "## A.3 Cfit Accident Descriptions / Flight Path Plots A.3.1 Cfit Accident - April 22, 1994 - Bluefield, West Virginia, Usa A.3.1.1 Description Of Flight",
    "NTSB Report Number: BFO94FA071 On April 22, 1994, at 1445 eastern daylight time, a Bell 412 helicopter, N70AM, owned and operated by Air Methods Corporation of Denver, Colorado, collided with mountainous terrain during an instrument approach to Mercer County/Bluefield Airport Bluefield, West Virginia. All four occupants aboard the aircraft, the pilot, the co-pilot, and two flight nurses, received fatal injuries. The helicopter was destroyed. The flight originated in Winston Salem, North",
    "fatal injuries. The helicopter was destroyed. The flight originated in Winston Salem, North Carolina, at 1347 hours and was arriving at its destination to pick up a patient. Instrument meteorological conditions prevailed and an instrument flight plan was filed. The flight was operated under 14 CFR Part 91. The pilot, co-pilot, and two flight nurses departed North Carolina Baptist Hospital to pick up a patient at the airport in Bluefield, West Virginia. The pilot received air traffic control",
    "up a patient at the airport in Bluefield, West Virginia. The pilot received air traffic control services from a radar controller at the Indianapolis Air Route Traffic Control Center (ARTCC), and he requested vectors to ILS runway 23. The last transmission between the pilot and the controller was for the flight to maintain seven thousand feet until established on approach, and to fly heading two four zero. The flight was also cleared for the instrument landing system (ILS) approach to runway 23",
    "zero. The flight was also cleared for the instrument landing system (ILS) approach to runway 23 at Mercer County, an uncontrolled airport. The pilot was instructed to contact the specialist at the Bluefield Flight Service Station (FSS) and reportedly made \"normal\" transmissions, with no indication of a problem. The helicopter impacted a mountain located 7 1/2 miles from the departure end of runway 23 at the 3400 foot level. There were several witnesses who heard the helicopter overfly their",
    "23 at the 3400 foot level. There were several witnesses who heard the helicopter overfly their homes, but could not see it due to the fog. One of the witnesses reported that, \"I could not see anything then I heard this low noise I thought maybe it was going to land.\" Another witness stated that the helicopter was flying parallel with the mountain. \"...It sounded like it was very low. The fog was below the tree line on the mountain....I said to myself you better get it up if you plan to clear",
    "below the tree line on the mountain....I said to myself you better get it up if you plan to clear the mountain. Then I heard a tree break then an explosion.\" The accident occurred at daylight, about 37 degrees 18 minutes North latitude and 81",
    "degrees 12 minutes West longitude.",
    "## Probable Flight Path\n\n| Latitude    | Longitude    | Altitude    |\n|-------------|--------------|-------------|\n| (degrees)   | (degrees)    | (feet)      |\n| Notes       |              |             |\n| 37.249776   | -81.263709   | 4600        |\n| 37.210578   | -81.329039   | 3400        |\n\n \na. Cruise speed. \nb. Precise impact location was not available in the accident report. \n\n## A.3.2 Cfit Accident - May 14, 1997 - Ludieres, France A.3.2.1 Description Of Flight",
    "BEA Report Number: F-HP970514 During an ambulance flight carried out of night, from village of Dreil towards the hospital complex of Clermont-Ferrand, the pilot meets bad weather conditions. He contacts the controller of Clermont-Ferrand-Aulnat and requests the radar assistance. At the same time, inhabitants of the villages of Vernet and Ludires can hear a helicopter at very low height above the houses. A witness hears the noise of an explosion. A few moments later, he discovers in a field the",
    "houses. A witness hears the noise of an explosion. A few moments later, he discovers in a field the helicopter burning. The three occupants died.",
    "Wednesday May 14, 1997, a medical assistance is required at Dreil, which is at 52 km (28 Nm) of the hospital of Clermont-Ferrand - approximately 20 minutes of flight - but more than 100 km by the fastest road (48 km of secondary road and 60 km of motorway). At 2118 local time, after taking preliminary information weather information available by AEROFAX (TEMSI of 2100, winds and temperatures at FL 20, 80 and 100, METAR and TAF), the AS-350B registered F-GKHP  takes off from the hospital of",
    "at FL 20, 80 and 100, METAR and TAF), the AS-350B registered F-GKHP  takes off from the hospital of Aurillac toward the locality Dreil. At 2139, the pilot lands near the residence of the patient. At 2205, after first assistance, the helicopter takes off with three people on board (the pilot, the doctor and the patient).",
    "The weather is been overcast but without fog. At 2216, the pilot contacts the tower of control of Clermont-Ferrand/Aulnat and is announced at six minutes of the hospital (that is to say approximately 12 Nm at cruising speed), at 6.500 feet. It asks the last weather conditions. The controller indicates some rare clouds to 1 000 feet and a layer split up with 100 feet above the airport. He gives the altimeter settings (QNH 1019 hPa and QFE 979 hPa) and asks to recall finally on the hospital. The",
    "altimeter settings (QNH 1019 hPa and QFE 979 hPa) and asks to recall finally on the hospital. The pilot answers immediately: \"if I can descend then !\". Analysis shows that during this period the helicopter descends to 4.300 ft and turns around the accident area -",
    "confirmed by several witnesses - seeking for an option to step down below clouds.",
    "At 2222 pilot asks for radar assistance. He is then with 7300 feet of altitude and estimates himself at 14 Nm of the airport of Aulnat. A 2224, the controller points out the absence of radar contact and suggests to climb to 5.000 or 6.000 feet. But the pilot does not answer any more.",
    "At the same time, several inhabitants of the area of Murol and Vernet Sainte Marguerite hear a \"plane\" flying at low height. Around 2225, one of them can hear the aircraft crushing on the ground then an explosion. He gives alert immediately. \n\n## A.3.2.2 Probable Flight Path",
    "| Latitude                            | Longitude    | Altitude    |\n|-------------------------------------|--------------|-------------|\n| (degrees)                           | (degrees)    | (feet)      |\n| Notes                               |              |             |\n| Low level flight around \"Le Vernet\" |              |             |\n| 4536'14''                          | 0257'05''   | 4400        |\n| 4536'15''                          | 0256'25''   | 4400        |",
    "| 4536'15''                          | 0256'25''   | 4400        |\n| 4536'28''                          | 0256'11''   | 4400        |\n| 4536'49''                          | 0256'05''   | 4400        |\n| 4537'00''                          | 0256'20''   | 4000        |\n| 4537'02''                          | 0256'47''   | 3400        |",
    "a. Analysis reports operating engine at impact. \nb. Horizontal speed : 70 kts c. Vertical speed : -2000 ft/min \n\n## A.3.3 Cfit Accident - July 4, 1997 - Puivert, France A.3.3.1 Description Of Flight",
    "BEA Report Number: F-FG970704 During an ambulance flight carried out of night, from village of Espezel in Corbires towards the hospital complex of Carcassonne, the pilot meets bad weather conditions. Two people, one living the farm of Bordeneuve and the other the hamlet of Saint-",
    "Andrew, see the helicopter flying at very low height and hear an explosion. The helicopter is found crushed in the relief, east of the village of Puivert. July 4, 1997, at 2155, local time, the dispatcher of the hospital complex of Carcassonne initiates a medical evacuation from Espezel. At 2157, he informs the pilot of the helicopter AS-350 registered F-GDFG of the mission. According to testimonies of the personnel of the emergency services, the pilot moves quickly towards its helicopter in",
    "of the personnel of the emergency services, the pilot moves quickly towards its helicopter in company of the medical personnel without taking preliminary information weather.",
    "Takeoff if performed at 2202. The first part of the mission to Espezel lasts about fifteen minutes and proceeds normally in spite of a meteorology which is degraded quickly by the west. The helicopter lands at 2217 on the sports field. At 2251, at the end of the first aid, the helicopter takes off in direction of Carcassonne, under a covered sky and a fine rain.",
    "The return flight is first directed with the magnetic course 015 and passes over the villages of L'Escale and Puivert. After this last village, the helicopter quickly turns to right to a 130 course approximately. Around 2300, Saint Andr village witnesses, one kilometer in the south of Villefort, recognizes the particular noise of a helicopter located rather low in the direction of the village of the L'Escale, seven kilometers south. After approximately one minute of observation, the witness",
    "of the L'Escale, seven kilometers south. After approximately one minute of observation, the witness distinguishes the left side-light (red) on the side from the aircraft. One moment later, the helicopter passes behind the hill of Gauzires. The witness does not see it any more but it always hears its specific noise. At 2302, he can see a great light in the prolongation of the hill then two to three seconds later hears the noise of an explosion. He gives alarm immediately. At the same time,",
    "three seconds later hears the noise of an explosion. He gives alarm immediately. At the same time, another person, placed three hundred meters downwards and a few hundred meters more in north of the place of the accident, observes a great gleam immediately followed of a very strong noise and also gives alarm.",
    "## Probable Flight Path\n\n| Latitude    | Longitude    | Altitude    |\n|-------------|--------------|-------------|\n| (degrees)   | (degrees)    | (feet)      |\n| Notes       |              |             |\n| 4256'44''  | 202'09''    | 2100        |\n| 4256'29''  | 204'12''    | 2100        |\n| 4256'21''  | 204'23''    | 2100        |\n|             |              |             |",
    "a. Analysis reports operating engine at impact. \nb. Return flight conditions can be assumed similar to the first part of the mission, \nperformed with 110 kts average ground speed.  \n\n## A.3.4 Cfit Accident - December 20, 1997 - North Sea A.3.4.1 Description Of Flight",
    "Accident Report Number:  97-74/A-25 On December the 20th, 1997, the flight crew of the PH-KHB, a KLM ERA Sikorsky S- 76 B helicopter was scheduled for a duty time of 12 hours, starting at 06.45, in which 5 sorties of shuttle flights over the North Sea in the K5 and Pentacon field area had to be executed. Both pilots were qualified for the mission. The Captain acted as Pilot Flying (PF) during the first 3 sorties. Starting with the 4th sortie the pilots switched roles and the Co-Pilot became PF.",
    "first 3 sorties. Starting with the 4th sortie the pilots switched roles and the Co-Pilot became PF. According to company standard practice the PF occupied the right seat. The first 4 sorties were uneventful. The last sortie started from L7-Q. After take-off at 16.50 the helicopter was scheduled to return to Den Helder Airport with intermediate landings on L4-A, the Noble Ronald Hoope, the L7-A and again the L7-Q. The cloud base was 2,000 feet with cloud layers at 500 feet and patches at 400",
    "and again the L7-Q. The cloud base was 2,000 feet with cloud layers at 500 feet and patches at 400 feet. The wind was light and variable. Visibility was 3 NM, increasing. Take-off was after sunset. The night was dark, moon nor stars were visible. Start-up and take-off were uneventful and the flight crew proceeded to L4-A at 500 feet.",
    "The Co-Pilot as PF flew the approach and due to obstacles at the PF's side the PNF took over the controls and performed an uneventful landing. Following part of the Description of Flight is a reconstruction using statements and CVR",
    "replay. Times are only correct in relation to the sequence of events. At 17.01 the flight crew took off from L4-A and proceeded at 1,000 feet to the Noble Ronald Hoope, a drilling rig with a well lit vertical structure. The approach and landing were uneventful. However a replay of the CVR showed that the PF made the remark that she found the landing, her first night landing this day \"vervelend, met zo weinig wind\",",
    "(rather difficult with almost no wind). The CVR also showed that she used more than normal power changes during the last part of the final approach. After taking 6 passengers on board the flight crew took off from the Noble Ronald Hoope at 17.15 and proceeded on an easterly course to the L7-A, a production platform with no superstructure. The elevation of the helideck is 100 feet and the helicopter landing area is marked with yellow lights. The PF flew the helicopter using flight director and",
    "landing area is marked with yellow lights. The PF flew the helicopter using flight director and autopilot. Halfway between the Noble Ronald Hoope and L7-A the PF selected 500 feet on the AL 300 Command Display and started a coupled descent to 500 feet to continue the flight below the cloud base. Speed was reduced to 120 kts. Somewhere at this point the PNF adjusted the setting of his pressure altimeter so as to match the pressure altimeter reading with the read out of the radio altimeter.",
    "altimeter so as to match the pressure altimeter reading with the read out of the radio altimeter. During the initial approach the crew received deck clearance for L7-A together with a reference wind for the area of 180 from the radio operator of L7-Q. Approach and landing direction were however based on FMS",
    "wind information. Since the average wind read out was from an easterly direction a straight-in approach was planned and executed. At 17.24 approximately 2 nautical miles from L7-A the height on the radio altimeter was 200 feet with an indicated airspeed of 70 kts. Shortly hereafter the PF decoupled the flight director. At 17.26 just before decision point, normally 50 feet above the elevation of the helideck with an IAS of 30 kts, the PF",
    "initiated a go-around because she considered the helicopter too high and too fast. After the call \"go around\" the PF increased collective, continued straight ahead and started the climb. Eleven seconds after the call \"go around\" the PNF advised the PF to turn. The PF started a left climbing turn and again coupled the flight director. During the climb the PNF called: \"okee, blijf maar op deze hoogte hoor, niet hoger\" (okay, stay at this altitude, not any higher). The PF reacted by leveling off",
    "hoor, niet hoger\" (okay, stay at this altitude, not any higher). The PF reacted by leveling off and pressed the ALT HOLD button on the flight director control panel. The landing gear was not retracted during the go-around. The PF made a left hand circuit coached by the PNF who had visual contact with L7-A. At 17.27 the flight crew started the approach to L7-A for the second time. The helicopter turned to final and at that moment the PF became visual with L7-A. Once again she indicated she was",
    "turned to final and at that moment the PF became visual with L7-A. Once again she indicated she was unhappy with the situation but the PNF convinced her to continue. In this turn, at approximately half a nautical mile out the PF decoupled the flight director to be able to decelerate faster than the use of the flight director system permitted. Shortly thereafter the PF said: \"nee wordt ook maar niks want dat gaat veel te hoog en veel te snel\" (no, this is also not going to work, because we are",
    "want dat gaat veel te hoog en veel te snel\" (no, this is also not going to work, because we are much too high and much too fast). The PNF said he judged the situation normal and convinced her to continue, after which the PF lowered the collective pitch lever and at the same time raised the nose of the helicopter. The PNF called: \"the gear is down and I have 60 knots\" and four seconds later: \"100 niet lager\" (one hundred not lower).",
    "The following events where exclusively reconstructed from interviews:",
    "The PF was surprised because, at that moment, she had not the intention to descend to and below 100 feet. The PF stated that she looked at her flight instruments and read 100 feet on her pressure altimeter. In response she applied a large amount of power by raising the collective pitch lever. The PNF stated that he suddenly read 50 feet height on his radio altimeter. He also pulled collective. Both pilots stated that they did not positively feel the helicopter react to the power application",
    "Both pilots stated that they did not positively feel the helicopter react to the power application before the helicopter made impact with the water. The impact took place at 17.29 and the helicopter almost immediately rolled to the right to an inverted position.",
    "All occupants evacuated from the helicopter. After approximately 10 minutes the aircraft sank. After approximately one hour a supply vessel took the crew and passengers on board. \n\nOne passenger died some time after evacuating the aircraft. \n\n## A.3.4.2 Probable Flight Path",
    "One passenger died some time after evacuating the aircraft. \n\n## A.3.4.2 Probable Flight Path\n\n| Latitude    | Longitude    | Altitude    |\n|-------------|--------------|-------------|\n| (degrees)   | (degrees)    | (feet)      |\n| Notes       |              |             |\n| 53.60396    | 4.06519      | 400         |\n| 53.60299    | 4.07075      | 330         |\n| 53.60146    | 4.07951      | 0           |",
    "a. Approach speed (decelerated to 60 knots at 100 feet). \nb. The average rate of descent between 330 feet and impact was 1131 fpm. c. Precise impact location was not available in the accident report. \n\n## A.3.5 Cfit Accident - April 25, 2000 - St. Petersburg, Florida, Usa A.3.5.1 Description Of Flight",
    "NTSB Report Number: ATL00FA048 On April 25, 2000, at 1216 eastern daylight time, a Eurocopter BK117, N428MB, operating as Bayflite-3, collided with a radio transmission tower located on the Weedon Island State Preserve in St. Petersburg, Florida. The air medical flight, Bayflite-3, was operated by Rocky Mountain Helicopters under the provisions of Title 14 CFR Part 91",
    "positioning flight with no flight plan filed. Visual weather conditions prevailed at the time of the accident. The medical evacuation helicopter was destroyed; the commercial pilot and his passengers were fatally injured. The local flight departed Bayfront Medical Center, in St. Petersburg, Florida, at 1212, and was en route to the Bayflite operations at St. Joseph Hospital in Tampa, Florida. According to the operator, Bayflite-3 had completed a patient drop-off and was en route to the Bayflite",
    "to the operator, Bayflite-3 had completed a patient drop-off and was en route to the Bayflite operation in Tampa, Florida. The operator also stated that the flight was flying a newly established route from the Bayfront Medical Center to St. Joseph Hospital. The new routing was in response to noise complaints from neighborhoods along the previously direct route. According to an eyewitness driving on San Martin Blvd., the helicopter was flying northeast at about 500 feet above the ground. As the",
    "on San Martin Blvd., the helicopter was flying northeast at about 500 feet above the ground. As the eyewitness approached the radio transmission tower in the preserves, he noticed the helicopter as it collided with the radio transmission tower guy wire and the steel tower structure 480 feet above the ground. The helicopter continued several hundred feet northeast and crashed into a mangrove. Eyewitnesses and rescue personnel responded to the accident site within minutes of the accident.",
    "## Probable Flight Path\n\n| Latitude    | Longitude    | Altitude    |\n|-------------|--------------|-------------|\n| (degrees)   | (degrees)    | (feet)      |\n| Notes       |              |             |\n| 27.79166    | -82.63939    | 480         |\n| 27.85639    | -82.62361    | 480         |\n|             |              |             |\n\na. Cruise speed. \nb. The radio tower was constructed at latitude 27 51\" 23\" and Longitude 82 37' 25\".  \nc. The radio tower was 649 foot tall.",
    "## A.3.6 Cfit Accident - February 20, 2003 - Clyde, Tx, Usa A.3.6.1 Description Of Flight",
    "NTSB Report Number: FTW03LA112 On February 20, 2003, approximately 1600 Central Standard Time, an Aerospatiale AS-",
    "350-B3 single-engine helicopter, N439AE, sustained substantial damage when it impacted the terrain during a hard landing near Clyde, Texas. The instrument rated commercial pilot and a flight nurse were not injured, and a flight paramedic sustained minor injuries. The helicopter was owned by Enchantment Aviation, Inc., of Fairacres, New Mexico, and doing business as Southwest Air Ambulance, of Las Cruces, New Mexico. Instrument meteorological conditions (IMC) prevailed for the 14 Code of Federal",
    "Cruces, New Mexico. Instrument meteorological conditions (IMC) prevailed for the 14 Code of Federal Regulations Part 91 repositioning flight for which a company visual flight rules",
    "(VFR) flight plan was filed. The flight originated from the Abilene Regional Airport",
    "(ABI), Abilene, at 1556, and was destined to the Eastland Hospital helipad, Eastland, Texas, to pick up a patient for transfer. According to the 2,266-hour pilot, at 1540, he received an \"888 weather check page\" for a possible flight. At that time, the weather at ABI was 1,100 foot ceilings and 7 miles visibility. At 1556, the helicopter departed to the east, and the pilot followed Interstate 20. Shortly after departure while at 500 feet AGL, the weather started to deteriorate. Prior to",
    "20. Shortly after departure while at 500 feet AGL, the weather started to deteriorate. Prior to reversing direction, the pilot slowed the helicopter and started a descent. At the start of the descent, the helicopter entered IMC.",
    "The pilot stated the helicopter broke out of the clouds at 50 feet AGL. The pilot was unaware of the descent rate and attempted to slow the descent by raising the collective. Subsequently, the pilot was unable to slow the descent rate; the helicopter sustained a hard landing, and came to rest upright in the middle of the roadway on Interstate 20. The flight paramedic checked the weather prior to the flight and noticed a large area of rain on the radar to the south and east of ABI. He then",
    "to the flight and noticed a large area of rain on the radar to the south and east of ABI. He then questioned the pilot whether the flight should be attempted. The paramedic stated the weather deteriorated rapidly while en route and requested more than once for the pilot to abort the flight. Approximately 300 feet AGL, the helicopter entered complete IMC. According to an FAA inspector, who examined the helicopter at the company hangar at ABI, the helicopter sustained structural damage to the",
    "the helicopter at the company hangar at ABI, the helicopter sustained structural damage to the airframe near the crosstube saddles, and the tailboom skin was wrinkled.",
    "At 1552, the ABI automated surface observing system (ASOS), located approximately 8 miles east of the accident site, reported the wind from 040 degrees at 6 knots, 10 statute miles visibility, ceiling overcast at 1,100 feet, temperature 46 degrees Fahrenheit, dew point 43 degrees Fahrenheit, and an altimeter setting of 29.98 inches of Mercury. At 1600, the ABI ASOS, reported the wind from 040 degrees at 7 knots, 10 statute miles visibility, decreasing rain, ceiling overcast at 900 feet,",
    "040 degrees at 7 knots, 10 statute miles visibility, decreasing rain, ceiling overcast at 900 feet, temperature 46 degrees Fahrenheit, dew point 43 degrees Fahrenheit, and an altimeter setting of 29.99 inches of Mercury. At 1652, the ABI ASOS reported the wind from 040 degrees at 7 knots, 7 statute miles visibility, decreasing rain, sky broken at 700 feet and ceiling overcast at 1,100 feet, temperature 45 degrees Fahrenheit, dew point 43 degrees Fahrenheit, and altimeter setting of 29.95 inches",
    "45 degrees Fahrenheit, dew point 43 degrees Fahrenheit, and altimeter setting of 29.95 inches of Mercury.",
    "| Latitude    | Longitude    | Altitude    |\n|-------------|--------------|-------------|\n| (degrees)   | (degrees)    | (feet)      |\n| Notes       |              |             |\n| 32.42940    | -99.59086    | 2500        |\n| 32.41647    | -99.51510    | 2000        |\n|             |              |             |\n\na. Decelerating from cruise speed to maneuvering speed prior to the descent. \n\n## A.3.7 Cfit Accident - March 23, 2004 - Gulf Of Mexico, Usa A.3.7.1 Description Of Flight",
    "NTSB Report Number: DCA04MA030 On March 23, 2004, about 1918:34 central standard time, an Era Aviation Sikorsky S-",
    "76A++ helicopter, N579EH, crashed into the Gulf of Mexico about 70 nautical miles (nm) south-southeast of Scholes International Airport (GLS), Galveston, Texas. The helicopter was transporting eight oil service personnel to the Transocean, Inc., drilling ship Discoverer Spirit, which was en route to a location about 180 miles south-southeast of GLS. The captain, copilot, and eight passengers aboard the helicopter were killed, and the helicopter was destroyed by impact forces. The flight was",
    "the helicopter were killed, and the helicopter was destroyed by impact forces. The flight was operating under the provisions of 14 Code of Federal Regulations (CFR) Part 135 on a visual flight rules",
    "(VFR) flight plan. Night visual meteorological conditions (VMC) prevailed at the time of the accident. The accident helicopter had been operated out of Era Aviations flight and maintenance facility at Port Fourchon (FOU), Louisiana, as part of its contract with Union Oil Company of California for day and night aviation support operations. On March 22, 2004, two Era Aviation pilots repositioned the accident helicopter from FOU to GLS",
    "because the Discoverer Spirit was going to be operating from a location in the Gulf of Mexico that was closer to GLS. On March 22, the copilot drove his personal vehicle from FOU to GLS. On March 23, the captain drove his personal vehicle from his home to GLS. An Era Aviation captain stated that he saw the accident captain briefing the accident copilot and both pilots obtaining weather information from the Internet. The Era Aviation captain also stated that he saw the accident captain, in the",
    "from the Internet. The Era Aviation captain also stated that he saw the accident captain, in the right pilot seat; taxi the helicopter to the site where the copilot and passengers would board. The Era Aviation captain further stated that one box of cargo and the passengers' baggage was loaded on the helicopter.",
    "A dispatcher located at Era Aviations Gulf Coast headquarters was responsible for communicating by radio with the accident flight and entering information about the flight in a computerized log after each radio transmission. The dispatcher's records showed that the helicopter departed GLS at 1845 on an estimated 45-minute flight to an en route refueling stop at High Island A-557. The records also showed that the helicopter had 2 hours of fuel on board at the time of departure. The cockpit voice",
    "showed that the helicopter had 2 hours of fuel on board at the time of departure. The cockpit voice recorder (CVR) recording began at 1847:42. The recording was mostly unintelligible, but conversationaltone voices were discernible during parts of the recording. Radar data from the Airport Surveillance Radar-9 (ASR-9) at the George Bush Intercontinental Airport in Houston, Texas, showed that the helicopter flew on a southsoutheasterly course after takeoff and climbed to 1,800 feet mean sea level",
    "flew on a southsoutheasterly course after takeoff and climbed to 1,800 feet mean sea level (MSL). The radar data also showed that the helicopter remained at 1,800 feet MSL until about",
    "1858:10 and then started to descend at a rate of about 300 feet per minute (fpm). A radar return that was received about 1900:21 showed that the helicopter was at an altitude of \n1,100 feet MSL and that its rate of descent was about 250 fpm. No radar returns were received after that time because the helicopter was no longer within the range of radar coverage. At that point, the helicopter was about 35 NM south-southeast of GLS.",
    "According to company procedures, the flight crew was responsible for providing the dispatcher with a position report every 15 minutes. During its 1914 position report, the flight crew told the dispatcher that the helicopter had enough fuel on board (1.6 hours) to continue directly to the Discoverer Spirit. Also, the flight crew asked the dispatcher to provide updated coordinates to the Discoverer Spirit. The dispatcher received no further communications from the flight crew. About 918:25, the",
    "Spirit. The dispatcher received no further communications from the flight crew. About 918:25, the CVR recorded the sound of decreasing background noise. The CVR stopped recording about 1918:34. The dispatcher's records showed that, at 1923, she tried to make radio contact with the flight crew to provide updated coordinates to the Discoverer Spirit but received no response from the crew. The records also showed that, at 1931, 1934, 1946, and 2008, the dispatcher continued to try to make radio",
    "also showed that, at 1931, 1934, 1946, and 2008, the dispatcher continued to try to make radio contact with the helicopter. The 1931 entry indicated that the dispatcher would call the Discoverer Spirit to see if someone aboard the ship could make radio contact with the helicopter, and the 1934 entry indicated that someone aboard the ship was trying to contact the helicopter. During a post accident interview, the dispatcher stated that, in her communications with the flight crew, everything",
    "interview, the dispatcher stated that, in her communications with the flight crew, everything sounded normal with no strange background noises. Also, the dispatcher received no emergency or distress calls from the helicopter. Seven vessels (from the U.S. Coast Guard and Union Oil) and nine aircraft (from the Coast Guard; Era Aviation; Petroleum Helicopters, Inc. [PHI]; and Evergreen Helicopters) were activated for search and rescue operations. Pilots aboard these aircraft observed debris",
    "were activated for search and rescue operations. Pilots aboard these aircraft observed debris floating near the area that was believed to be the location of the helicopter after its last communication with the dispatcher. The helicopter wreckage was located about 70 NM south-southeast of GLS and 10 NM northwest of High Island A-557 at a depth of about 186 feet.",
    "| Latitude    | Longitude    | Altitude    |\n|-------------|--------------|-------------|\n| (degrees)   | (degrees)    | (feet)      |\n| Note        |              |             |\n| 28.232568   | -94.535568   | 430         |\n| 28.166265   | -94.535429   | 0           |\n\n \nA.3.7.3 \nAdditional Notes \na. Cruise speed. \nb. Approximately 250 fpm shallow descent. c. Precise impact location was not available in the accident report.",
    "## A.3.8 Cfit Accident - April 20, 2004 - Boonville, In, Usa A.3.8.1 Description Of Flight",
    "NTSB Report Number: CHI04FA107 On April 20, 2004, at 2343 central daylight time, a Bell 206L-1, N137AE, operated by Air Evac Life Team as Air Evac 17, collided with the terrain during a medivac flight. The patient was fatally injured. The pilot, paramedic, and nurse, were seriously injured. The helicopter was substantially damaged. The 14 CFR Part 135 flight was operating in visual meteorological conditions and was receiving company flight following at the time of the accident. The helicopter",
    "conditions and was receiving company flight following at the time of the accident. The helicopter last departed the St. Joseph's Hospital Heliport (II47), in Huntingburg, Indiana, with an intended destination of Deaconess Hospital (16IN) in Evansville, Indiana. Air Evac 17 was based at the Davies County Airport (DCY), Washington, Indiana. At 2151, the crew was notified of a patient who needed to be transported from II47 to16IN.",
    "Air Evac 17 departed DCY about 2204 en route to II47. Air Evac 17 landed in II47 around 2223 and departed around 2325 en route to 16IN with the patient on board. The last radio contact that Air Evac dispatch had with the flight was at 2327 when Air Evac 17 reported they had departed II47 with 4 people and 450 pounds of fuel on board.",
    "The destination helipad, 16IN, is located within the Class C airspace surrounding the Evansville Regional Airport (EVV), Evansville, Indiana. The hours of operation of the air traffic control tower at EVV were between 0600 and 2300. The audio recording equipment was inadvertently left on after the tower closed. A recording of the approach frequency communications revealed the pilot of N137AE made 12 radio transmissions during the time period 2328 - 2339. The first four transmissions were",
    "made 12 radio transmissions during the time period 2328 - 2339. The first four transmissions were attempts to contact the approach control. The fifth transmission was a partial transmission. This was followed by six more transmissions attempting to contact approach. The last transmission was partially unintelligible. Following the accident, the flight crew paramedic used a cellular phone and called dispatch to inform them that they had crashed. A recording of the call was made available to the",
    "dispatch to inform them that they had crashed. A recording of the call was made available to the NTSB. The beginning of the recording is time stamped 2344. The paramedic stated he did not know their location and the last location he was aware of was being 8 minutes from their destination. He stated they were in a field and he could see a flashing white light on a tower that was a couple miles away. During the cellular call, the paramedic stated he did not know what happened, but the helicopter",
    "During the cellular call, the paramedic stated he did not know what happened, but the helicopter was on its side. He later stated they just hit the ground. The paramedic informed the dispatcher that the pilot was trapped in the wreckage; the nurse was out of the wreckage by the tail of the helicopter, the patient was by the nose of the helicopter and that they were all injured. Despite his injuries which included a broken jaw, the paramedic continued talking with dispatch, the pilot, and the",
    "which included a broken jaw, the paramedic continued talking with dispatch, the pilot, and the nurse. The paramedic asked the pilot what happened and the pilot responded that they lost altitude.",
    "During the time that the paramedic was on the cell phone with the dispatcher, other Air Evac employees were making telephone calls getting helicopters and local authorities out to search for N137AE. At 0055, the paramedic informed the dispatcher that he could see an aircraft light that was heading toward him. At 0112, the paramedic stated that he was able to see flashing lights on an emergency vehicle in the distance. The paramedic removed a blue pen light from the shoulder of the nurse and",
    "vehicle in the distance. The paramedic removed a blue pen light from the shoulder of the nurse and used the light to signal the helicopters that were flying overhead searching. At 0117, they were located by another Air Evac helicopter. One witness, who was at his residence located approximately 300 yards north of the accident site, reported that around 2330 he heard a helicopter fly overhead. He reported the helicopter sounded very loud and that the sound gradually faded away in the distance as",
    "the helicopter sounded very loud and that the sound gradually faded away in the distance as if it was flying away. He stated that about a half hour later he heard another helicopter flying from west to east. He stated this one was not as loud as the first. He stated that shortly after hearing the second helicopter, he heard others in the area as if they were searching for something. He was not aware of the accident when he heard the helicopters. During an interview, the flight nurse stated he",
    "of the accident when he heard the helicopters. During an interview, the flight nurse stated he remembered being about 10 minutes away from 16IN and the next thing he remembered is being on the ground outside the helicopter. He stated he does not recall any problems prior to the helicopter impacting the ground. In a post-accident interview, the paramedic stated that he remembered picking up the patient in Huntingburg and caring for the patient during the flight. He stated the next thing he",
    "patient in Huntingburg and caring for the patient during the flight. He stated the next thing he remembered is impacting the ground, getting out of the helicopter, and making the call to dispatch to get help. He stated that he does not remember the pilot indicating that there were any problems prior to impacting the ground. He stated that he recalled it being windy at the time of the accident. In a post-accident interview, the pilot stated he recalled picking up the patient in Huntingburg and",
    "a post-accident interview, the pilot stated he recalled picking up the patient in Huntingburg and the next thing he remembered is the helicopter tumbling on the ground. He stated he remembered being trapped inside the wreckage.",
    "The emergency medical technicians (EMT) who treated the pilot at the accident site reported that the pilot stated \"Boy I screwed up.\" An EMT asked him what happened and the pilot reported, \"I started making my turn and we started tumbling.\"",
    "## A.3.8.2 Probable Flight Path\n\n| Indicated    | True      |\n|--------------|-----------|\n| Latitude     | Longitude |\n| Altitude     | Altitude  |\n| (degrees)    | (degrees) |\n| (feet)       | (feet)    |\n| 38.17023     | -87.25503 |\n| 38.12952     | -87.32135 |\n\na. Cruise speed. \nb. Altimeter mis-set (The indicated altitude was approximately 310 feet higher than \nthe actual altitude of the helicopter). \nc. Possibly a shallow descent.",
    "## A.3.9 Cfit Accident - August 21, 2004 - Battle Mountain, Nevada, Usa A.3.9.1 Description Of Flight",
    "NTSB Report Number: SEA04MA167 On August 21, 2004, approximately 2358 Pacific daylight time, a Bell 407 helicopter, N2YN, operating as an air ambulance flight, impacted mountainous terrain in cruise flight and was destroyed about 27 nautical miles (NM) southwest of Battle Mountain, Nevada. The airline transport pilot, the two medical crewmembers, the infant patient being transported and the patient's mother were fatally injured. The helicopter was operated by Jeflyn Aviation, Inc., of Boise,",
    "mother were fatally injured. The helicopter was operated by Jeflyn Aviation, Inc., of Boise, Idaho, dba Access Air. The purpose of the Title 14 CFR Part 135 flight was to transport the infant patient from Battle Mountain Hospital to Washoe Medical Center in Reno, Nevada. Dark night visual meteorological conditions prevailed for the 2338 departure from Battle Mountain Hospital. A company flight plan was filed. According to Access Air personnel, the pilot reported for duty approximately 1930 at",
    "was filed. According to Access Air personnel, the pilot reported for duty approximately 1930 at the company base located on the Elko Regional Airport in Elko, Nevada. At 2221, through Elko's Central Dispatch Authority (Elko Dispatch), Battle Mountain Hospital requested Access Air to transfer an 11-day-old infant patient to Reno. According to Elko Dispatch records, the helicopter departed Elko en route to Battle Mountain at 2237. The helicopter landed on the pad at Battle Mountain Hospital",
    "en route to Battle Mountain at 2237. The helicopter landed on the pad at Battle Mountain Hospital approximately 2300.",
    "According to the grandmother of the infant patient, the nurse and paramedic went into the hospital and the pilot stayed with the helicopter. The nurse and paramedic spoke with her daughter, the infant's mother, and the grandmother overheard one of them say to her, \"it is going to be a little bit rocky up there.\" The grandmother watched them board the helicopter and reported that her daughter was seated on a stretcher with an orange box behind her holding her infant in her arms. She also",
    "was seated on a stretcher with an orange box behind her holding her infant in her arms. She also reported that the helicopter crew gave her daughter a headset to wear and told her that she could talk unless they asked her to be quiet. The grandmother watched the helicopter depart and stated that there were no unusual or strong winds at the time. At 2338, the pilot reported his departure from Battle Mountain Hospital to Lander County dispatch and stated that his estimated time en route to Reno",
    "Mountain Hospital to Lander County dispatch and stated that his estimated time en route to Reno was 1 hour 20 minutes. (Battle Mountain is located in Lander County.) There were no further radio communications from the helicopter. The USAF 84th Radar Evaluation Squadron provided radar data which shows about 4 minutes of the helicopter's flight, beginning at 2344:51. The last radar return was at 2348:40, approximately 17 NM northeast of the accident site. The data shows the helicopter flying a",
    "2348:40, approximately 17 NM northeast of the accident site. The data shows the helicopter flying a magnetic course of about 232 degrees. The radar data are consistent with the helicopter flying a route commonly used by the operator, direct from Battle Mountain Hospital to Derby Field Airport, Lovelock, Nevada, then direct Washoe Medical Center in Reno. The helicopter did not arrive at Washoe Medical Center, a search was initiated, and the wreckage of the helicopter was located on the morning",
    "Center, a search was initiated, and the wreckage of the helicopter was located on the morning of August 22, 2004. The accident site was along the direct course line from Battle Mountain Hospital to Derby Field Airport in Lovelock. The helicopter impacted rugged mountainous terrain on the eastern slope of the Tobin Range in Pershing County at a Global Positioning System (GPS)",
    "location of 40 degrees 27.147 minutes North, 117 degrees 29.517 minutes West, and an elevation of approximately 8,600 feet.",
    "## A.3.9.2 Probable Flight Path\n\n| Latitude    | Longitude    | Altitude    |\n|-------------|--------------|-------------|\n| (degrees)   | (degrees)    | (feet)      |\n| Notes       |              |             |\n| 40.478329   | -117.41205   | 8600        |\n| 40.45245    | -117.49195   | 8600        |\n\na. Cruise speed. \n\n## A.4 References",
    "a. Phillips, Robert, Investigation of Controlled Flight Into Terrain (Cambridge, MA \n: Volpe National Transportation Systems Center), Project Memorandum # DOT-\nTSC-FA9D1-99-01 \nb. AAR # BFO94FA071, Bluefield, WV (Washington, DC : NTSB), April 22, 1994 \nc. AAR # F-HP970514, Ludieres, France (France : BEA), May 14, 1997 \nd. AAR # F-FG970704, Puivert, France (France : BEA), July 4, 1997 \ne. AAR # 97-74/A-25, North Sea (Netherland : Dutch Transport Safety Board), \nDecember 20, 1997",
    "e. AAR # 97-74/A-25, North Sea (Netherland : Dutch Transport Safety Board), \nDecember 20, 1997 \nf. AAR # ATL00FA048, St. Petersburg, FL (Washington, DC : NTSB), April 25, \n2000 \ng. AAR # FTW03LA112, Clyde, TX (Washington, DC : NTSB), February 20, 2003 \nh. AAR # DCA04MA030, Gulf of Mexico, USA (Washington, DC : NTSB), March \n23, 2004 \ni. \nAAR # CHI04FA107, Boonville, IN (Washington, DC : NTSB), April 20, 2004 \nj. \nAAR # SEA04MA167, Battle Mountain, NV (Washington, DC : NTSB), August \n21, 2004",
    "j. \nAAR # SEA04MA167, Battle Mountain, NV (Washington, DC : NTSB), August \n21, 2004"
  ]
}