{
  "source": "RTCA DO-228 Chg 1.md",
  "chunks": [
    "RTCA, Inc. \n\n1140 Connecticut Avenue, NW, Suite 1020 \nWashington, D.C. \n\nChange No. 1 \n \n-to- \n \nRTCA DO-228 \nMinimum Operational Performance Standards for Global Navigation Satellite System (GNSS) Airborne Antenna Equipment \n 2000, RTCA, Inc. \n\nRTCA Paper No. 322-99/PMC-074 January 11, 2000 \nCopies of this document may be obtained from RTCA Inc.",
    "1828 L Street, NW\nSuite 805\nWashington, DC 20036-4001 USA\nTelephone: 202-833-9339\nFacsimile: 202-833-9434\nInternet: www.rtca.org This document constitutes Change No. 1 to RTCA DO-228, Minimum Operational Performance Standards for Global Navigation Satellite System (GNSS) Airborne Antenna Equipment.  The changes derive from updated information provided by RTCA Special Committee 159. \n\n \n\n## 1. General Changes\n\n Change all references to RTCA DO-160C to RTCA DO-160D. \n\n2. \n\nSpecific Changes",
    "Change all references to RTCA DO-160C to RTCA DO-160D. \n\n2. \n\nSpecific Changes \n\n \na. \nPage 6, paragraph 2.2.1.1, GPS Operating Frequency - Replace with the following: \n \nThe antenna shall operate over the minimum frequency range of 1575.42 MHz ± \n10MHz. The gain shall not vary more than 3 dB over the frequency range. b.",
    "Page 7, paragraph 2.2.1.5, Axial Ratio - Replace with the following: \nThe axial ratio shall not exceed 3.0 dB for all operating frequencies as measured at the boresight of the antenna. \n\n \nc. \nPage 9, paragraph 2.2.2.5, Burnout Protection - Replace with the following: \nThe preamplifier shall withstand a CW input carrier of +20 dBm without damage. Under these conditions, the output of the preamplifier shall be limited to +20 dBm.",
    "Note: The burnout protection of +20 dBm may not guarantee compatibility with all aircraft or all operations. Some contemporary commercial airborne installations require +30 dBm with the output limited to +20 dBm. \n\n \n\nd. \nPage 10, Add paragraph 2.2.3, Differential Group Delay -  \nThe differential group delay of the antenna, or antenna with an integrated preamplifier shall not exceed 50 nanoseconds. The differential group delay is defined as:",
    "$$|\\,{\\frac{\\mathrm{d}\\phi}{\\mathrm{d}\\omega}}(\\mathrm{f_{c}})\\,\\cdot\\,{\\frac{\\mathrm{d}\\phi}{\\mathrm{d}\\omega}}\\,(\\mathrm{f_{3d B}})|$$\nwhere: \nfc is the pre-correlation band pass filter center frequency f3dB are the 3dB cut off points of the filter \nφ is the phase response of pre-correlation band pass filter ω is the frequency \n\ne. \nPage 10, paragraph 2.2.2.6, Include the following data with the Replacement Figure 2-3 (provided below):",
    "Frequency (f in \nMHz) \nRejection \n(dB) \n1315 ≤ f < 1495 \n50 dB \n1495 ≤ f < 1565 \nLinearly \ndecreasing \nfrom 50 to 0 \ndB \n1565 ≤ f ≤ 1585 \n0 dB \n1585 < f ≤ 1625 \nLinearly \nincreasing \nfrom 0 to 50 \ndB \n1625 < f ≤ 2000 \n50 dB \n\nf. \nPage 10, paragraph 2.2.2.6, Replace existing Figure 2-3 with the following:"
  ]
}