{
  "source": "RTCA DO-210D Chg 3.md",
  "chunks": [
    "RTCA, Inc. \n\n1828 L Street, NW, Suite 805 \nWashington, DC 20036 USA \n \nChange No. 3 \n \n-to- \n \nRTCA/DO-210D \nMINIMUM OPERATIONAL PERFORMANCE STANDARDS FOR \nGEOSYNCHRONOUS ORBIT AERONAUTICAL MOBILE SATELLITE \nSERVICES (AMSS) AVIONICS ©2006 RTCA, Inc. September 19, 2006 \nCopies of this document may be obtained from \n \nRTCA, Inc.",
    "1828 L Street, NW, Suite 805 \nWashington, DC 20036 USA \n \nTelephone:  202-833-9339 \nFax:  202-833-9434 \nInternet:  www.rtca.org \n \nPlease call RTCA for price and ordering information.",
    "1. \nPage 7, replace Section 1.3 Operational Applications in its entirety with the following text.  \nRetain sections 1.3.1, 1.3.2, 1.3.3 and related subsections without change. \n1.3 \nOperational Applications \n \nMany applications for AMSS are potentially available; however, cost or other factors may \nlimit users' access to all such applications (e.g., voice as well as data). While applications for",
    "limit users' access to all such applications (e.g., voice as well as data). While applications for \nservice categories will evolve with time, this document defines standards to support minimum implementations of all currently foreseen applications for ATS and AOC. Safety services operating with channel types other than those specified in this document are \nexpected to be specified by DO-262 and DO-270. \nSince the original publication of this document in 1995, satellite communication technology",
    "Since the original publication of this document in 1995, satellite communication technology \nhas advanced to the point where a number of services use channel types other than those specified in this document.  This document specifically does not apply to new channel types \nexcept for the situations in which those channel types share the transmitter capabilities of the \"classic\" aeronautical channels specified in this document (i.e., P, R, T and C channels).  In",
    "the condition where transmitter facilities are shared between new channel types and classic \naeronautical channels, the emissions requirements of this document apply to both sets of channel types. \n \n2. \nPage 19, replace the 3rd and 4th paragraphs of Section 2.2.2 with the following text: \n \nThe Transceiver Subsystem is defined to include the transmitter and receiver.  It includes a radio frequency interface at the antenna port, where it connects to the interconnecting cable,",
    "and baseband interfaces with other on-board avionics equipment.  If a diplexer/LNA is used, \nthe transmit filter portion of the diplexer is considered to be part of the transmitter, while the \nreceive filter portion of the diplexer and the LNA are considered to be parts of the receiver. The receiver and transmitter are further defined in Sections 2.2.4.1 and 2.2.4.2, with their respective requirements stated in those sections and their subsections. \n \n3.",
    "3. \nPage 35, replace Section 2.2.4.2.5 in its entirety with the following text including the two \nsub-sections: \n2.2.4.2.5 \nHarmonics, Discrete Spurious and Noise Density \n \nTransceivers shall meet the Harmonics, Discrete Spurious and Noise Density requirements in either Section 2.2.4.2.5.1 or 2.2.4.2.5.2. \n2.2.4.2.5.1 \nHarmonics, Discrete Spurious and Noise Density for Equipment Utilizing \nIntermodulation Frequency Control per Section 2.2.4.2.6.1",
    "Intermodulation Frequency Control per Section 2.2.4.2.6.1 \n \nFor transceivers that meet the requirements in Section 2.2.4.2.6.1 regarding \nfrequency selection to control the generation of fifth-order intermodulation products, while transmitting a single modulated signal at the maximum-rated average output power at any frequency per Section 2.2.4.2.10, the composite harmonic, discrete spurious and noise density (including phase noise) at the transmitter output shall not \nexceed the following:",
    "Composite Harmonic, Discrete Spurious and Noise Density Levels \n \nFrequency (MHz) \n \nPower Density \n  \n \n0.01 to 1525 \n \n \n-135 dBc/4 kHz \n  \n \n1525 to 1559 \n \n \n-203 dBc/4 kHz \n  \n \n1559 to 1585 \n \n \n-155 dBc/MHz \n  \n \n1585 to 1605 \n \n \n-143 dBc/MHz \n  \n \n1605 to 1610 \n \n \n-117 dBc/MHz \n  \n \n1610 to 1610.6  \n \n-95 dBc/MHz \n  \n \n1610.6 to 1613.8 \n \n-80 dBW/MHz7 \n  \n \n1613.8 to 1614  \n \n-95 dBc/MHz \n  \n \n1614 to 1626.5  \n \n-70 dBc/4 kHz \n  \n \n1626.5 to 1660  \n \n-70 dBc/4 kHz2,3,4,6",
    "1614 to 1626.5  \n \n-70 dBc/4 kHz \n  \n \n1626.5 to 1660  \n \n-70 dBc/4 kHz2,3,4,6 \n  \n \n1660 to 1660.5  \n \n-49.5 dBW/20 kHz2,4,6,7",
    "1660.5 to 1670  \n \n-49.5 dBW/20 kHz4,7 \n  \n \n1670 to 1735 \n \n \n-60 dBc/4 kHz \n  \n \n1735 to 12000  \n \n-105 dBc/4 kHz \n  \n \n12000 to 18000  \n \n-70 dBc/4 kHz \n \nTABLE NOTES: \n \n1. \n[Deleted.] \n \n2. \nWithin the transmit band, excluding the frequency band within ±35 kHz  of \n \nthe carrier. \n \n3. \nThe -70 dBc/4kHz spectrum level in this table is equivalent to \n \n-70-10 log10(4000/SR) dBe (relative to the maximum envelope) under the \n \ndefinitions in Section 2.2.4.2.16. \n \n4.",
    "definitions in Section 2.2.4.2.16. \n \n4. \nFor wide band spurious the limit is -39.5 dBW/MHz. \n \n5. \n[Deleted.] \n \n6. \nThe upper limit for the excess power for any narrow-band spurious \n \nemission (excluding intermodulation products) within a 30 kHz \n \nmeasurement bandwidth shall be 10 dB above the power limit in this \n \ntable. \n \n7. \nNote that the power density is expressed in terms of absolute power \n \n(dBW) in some instances, and in terms of relative to carrier power (dBc)  in",
    "(dBW) in some instances, and in terms of relative to carrier power (dBc)  in \n \nother instances. \n \nNOTES: \n \n1. \nThe band 1559 to 1610 MHz is allocated to the Aeronautical \n \nRadionavigation Service (ARNS) and Radionavigation Satellite Service \n \n(RNSS), and is currently utilized by GPS, GLONASS and related \n \naugmentation systems, along with guard bands at the edges. Future \n \nsystems developing in these services (e.g., other ARNS/RNSS systems,",
    "|                                                                                        | augmentation systems) may require the establishment of more stringent    |\n|----------------------------------------------------------------------------------------|--------------------------------------------------------------------------|\n|                                                                                        | protection levels.                                                       |",
    "|                                                                                        |                                                                          |\n| 2.                                                                                     | [Deleted.]                                                               |\n|                                                                                        |                                                                          |",
    "| 3.                                                                                     | [Deleted.]                                                               |\n|                                                                                        |                                                                          |\n| 2.2.4.2.5.2                                                                            | Harmonics, Discrete Spurious and Noise Density for Equipment without     |",
    "| Intermodulation Frequency Control per Section 2.2.4.2.6.1                              |                                                                          |\n|                                                                                        |                                                                          |\n| Transceivers that do not implement the requirements in Section 2.2.4.2.6.1 regarding   |                                                                          |",
    "| frequency selection to control the generation of fifth-order intermodulation products  |                                                                          |\n| shall meet the following composite harmonic, discrete spurious and noise density       |                                                                          |\n| requirements.                                                                          |                                                                          |",
    "|                                                                                        |                                                                          |\n| While transmitting a single modulated signal at the maximum-rated average output       |                                                                          |\n| power at any frequency per Section 2.2.4.2.10, the composite harmonic, discrete        |                                                                          |",
    "| spurious and noise density (including phase noise) at the transmitter output shall not |                                                                          |\n| exceed the following:                                                                  |                                                                          |\n|                                                                                        |                                                                          |",
    "| Composite Harmonic, Discrete Spurious and Noise Density Levels                         |                                                                          |\n|                                                                                        |                                                                          |\n|                                                                                        |                                                                          |",
    "|                                                                                        | Power Density                                                            |\n|                                                                                        |                                                                          |\n|                                                                                        |                                                                          |",
    "|                                                                                        |                                                                          |\n|                                                                                        |                                                                          |\n|                                                                                        |                                                                          |",
    "|                                                                                        |                                                                          |\n|                                                                                        |                                                                          |\n| 7                                                                                      |                                                                          |",
    "|                                                                                        |                                                                          |\n|                                                                                        |                                                                          |\n|                                                                                        |                                                                          |",
    "|                                                                                        |                                                                          |\n|                                                                                        |                                                                          |\n|                                                                                        |                                                                          |",
    "| 2,3,4,6                                                                                |                                                                          |\n|                                                                                        |                                                                          |\n| 2,4,6,7                                                                                |                                                                          |",
    "|                                                                                        |                                                                          |\n| 1660.5 to 1670                                                                         |                                                                          |\n| 4,7                                                                                    |                                                                          |",
    "|                                                                                        |                                                                          |\n|                                                                                        |                                                                          |\n|                                                                                        |                                                                          |",
    "|                                                                                        |                                                                          |\n|                                                                                        |                                                                          |\n| NOTE: All Notes and Table Notes contained in  2.2.4.2.5.1 apply to this section as     |                                                                          |",
    "| well.                                                                                  |                                                                          |\n|                                                                                        |                                                                          |\n|                                                                                        |                                                                          |",
    "4. \n\nPage 36, replace Section 2.2.4.2.6 in its entirety with the following text including the three sub-sections: \n2.2.4.2.6 \nIntermodulation Products \n \nTransceivers shall meet the Intermodulation Products requirements in either Section \n2.2.4.2.6.1 and Section 2.2.4.2.6.2, or else in Section 2.2.4.2.6.3.",
    "2.2.4.2.6.1  \nFrequency Control Limiting Fifth-Order Intermodulation Products Transceivers that implement frequency control algorithms for the control of fifthorder intermodulation products shall base those algorithms on the following values for the lowest frequency, fLIM, at which fifth-order intermodulation products may occur, as appropriate for the intended installation and operation of the transceiver.",
    "Transceiver installation / operation Value for fLIM \n \n \nTransceivers used on aircraft equipped with GLONASS 1605 MHz",
    "Transceivers used on aircraft not equipped with GLONASS 1585 MHz Transceivers that implement frequency control algorithms for the control of fifthorder intermodulation products, when operating with one or more active Classic Aero H, H+, I, or L channels, or Non-Classic Channels of any type, shall not transmit on a newly-assigned channel frequency that would produce a fifth-order intermodulation product at a frequency at or below fLIM , as defined in this section.",
    "2.2.4.2.6.2",
    "Intermodulation Products for Equipment Utilizing Intermodulation Frequency Control per Section 2.2.4.2.6.1 Transceivers that have multi-carrier capability and that meet the requirements of Section 2.2.4.2.6.1 regarding frequency selection control shall meet the following requirement.  When transmitting two equal amplitude unmodulated carriers with a total combined power level up to the Maximum Allowable Multi-carrier Average Output Power of the transmitter, the power level of each",
    "Maximum Allowable Multi-carrier Average Output Power of the transmitter, the power level of each intermodulation product shall not exceed the following:",
    "Maximum Intermodulation Product Levels \nFrequency (MHz) \nIM Level \nBelow 1525 \n-115 dBc \n1525 to 1559 \n-155 dBc \n1559 to 1585 \n-135 dBc \n1585 to 1605 \n-118 dBc \n1605 to 1610 \n-86 dBc \n1610 to 1614 \n-64 dBc \n1614 to 1697.5 \n-24 dBc \n1697.5 to 1716 \n-30 dBc \n1716 to 1735 \n-35 dBc \n1735 to 18000 \n-85 dBc TABLE NOTE: 1. \n[Deleted.] \nNOTES: \n \n0. \nThe requirements in Section 2.2.4.2.6.1 ensure that neither 3rd nor 5th \n \norder intermodulation products can occur below fLIM. 1.",
    "order intermodulation products can occur below fLIM. 1. \nThe Ground Earth Station (GES) should not assign to an AES any \n \ncombination of frequencies which would cause the AES to inhibit \n \ntransmission. 2. \nThe band 1559 to 1610 MHz is allocated to the Aeronautical \n \nRadionavigation Service (ARNS) and Radionavigation Satellite Service \n \n(RNSS) and is currently utilized by the GPS, GLONASS and related \n \naugmentation systems, along with guard bands at the edges.  Future",
    "augmentation systems, along with guard bands at the edges.  Future \n \nsystems developing in these services (e.g., other ARNS/RNSS systems, \n \naugmentation systems) may require the establishment of more stringent \n \nprotection levels. \n \n3. \n[Deleted.] \n \n4. \n[Deleted.] \n \n \n2.2.4.2.6.3 \nIntermodulation Products for Equipment without Intermodulation Frequency \nControl per Section 2.2.4.2.6.1 Transceivers that have multi-carrier capability and that do not meet the requirements",
    "of Section 2.2.4.2.6.1 regarding frequency selection control shall meet the following \nrequirement.",
    "When transmitting two equal amplitude unmodulated carriers with a total combined \npower level up to the Maximum Allowable Multi-carrier Average Output Power of \nthe transmitter, the power level of each intermodulation product shall not exceed the following: \n \nMaximum Intermodulation Product Levels \n \nFrequency (MHz) \nIM Level \nBelow 1525 \n-110 dBc \n1525 to 1559 \n-144 dBc \n1559 to 1585 \n-135 dBc \n1585 to 1605 \n-119 dBc \n1605 to 1610 \n-86 dBc \n1610 to 1614 \n-64 dBc \n1614 to 1620 \n-44 dBc",
    "1585 to 1605 \n-119 dBc \n1605 to 1610 \n-86 dBc \n1610 to 1614 \n-64 dBc \n1614 to 1620 \n-44 dBc \n1620 to 1625.5 \n-34 dBc \n1625.5 to 1728.5 \n-24 dBc \n1728.5 to 1735 \n-30 dBc \n1735 to 1762.5 \n-80 dBc \n1762.5 to 18000 \n-85 dBc \n \nNOTE: Notes 1 through 4 of Section 2.2.4.2.6.2 apply to this section. \n5. \nPage 142, in Section 2.4.4.3.6, replace the existing words:  \"Measurement Procedure\" with",
    "5. \nPage 142, in Section 2.4.4.3.6, replace the existing words:  \"Measurement Procedure\" with \n\"Measurement Procedure for Section 2.2.4.2.6.2\". Replace the sentence \"This test applies only to multichannel transceivers.\" with the sentence \"This test applies only to multichannel transceivers that utilize frequency control per Section",
    "2.2.4.2.6.1.\". In the existing \"Step 5\" replace \"Repeat steps 1 through 5\" with \"Repeat steps 1 through 4\". In the existing \"Step 6\" replace \"Repeat steps 1 through 4\" with \"Repeat steps 1 through 5\". Following the existing \"Step 8\" add the following: \nMeasurement Procedure for Section 2.2.4.2.6.3 This test applies only to multichannel transceivers without frequency control per Section 2.2.4.2.6.1. \nStep 1. After connecting the equipment as shown in Figure 2-29, command the transceiver to",
    "Step 1. After connecting the equipment as shown in Figure 2-29, command the transceiver to \noutput a single unmodulated carrier at maximum allowable multi-carrier average power level at the Mid-Band test frequency. \n \nStep 2. Reduce the power output of the channel unit by 3 dB at the transmitter output as \nmeasured by the power meter.",
    "Step 3. Turn off this carrier and select another channel unit at a frequency separated from the \nfirst frequency at approximately 1 MHz.  Adjust the new channel unit output level to \nbe the same as with the first channel. \n \nStep 4. Turn on the first channel unit again so that both units are operating.  Use the \nspectrum analyzer to measure the intermodulation products resulting from the two signals with the measured single carrier power level as a reference.",
    "Step 5. Repeat Steps 1 through 4 for reduced commanded output levels in 5 dB steps to 15 \ndB below maximum allowable output. \n \nStep 6. Repeat Steps 1 through 5 for channel frequency separations of 100 kHz and 10 kHz \nand at the transmit test frequencies specified in Section 2.4.4.1, Item i, at all three \nfrequency separations. \n \nStep 7. Repeat Steps 1 through 5 with one carrier tuned to the highest frequency at which the",
    "Step 7. Repeat Steps 1 through 5 with one carrier tuned to the highest frequency at which the \ntransceiver is capable of operating and the other carrier tuned to the lowest frequency at which the transceiver is capable of operating."
  ]
}