{
  "source": "RTCA DO-144A 2008.md",
  "chunks": [
    "RTCA, Inc. \n\n1828 L Street, NW, Suite 805 \nWashington, DC  20036-5133 USA \n\n# Minimum Operational Performance Standards (Mops) For Air Traffic Control Radar Beacon System (Atcrbs) Airborne Equipment\n\nRTCA DO-144A  \nSupersedes RTCA DO-144 \n                                              Prepared by: SC-209 \nOctober 2, 2008 \n                                                © 2008 RTCA, Inc. \n\nCopies of this document may be obtained from RTCA, Inc.",
    "Copies of this document may be obtained from RTCA, Inc. \n\nTelephone: 202-833-9339 \nFacsimile: 202-833-9434 \nInternet: www.rtca.org Please visit the RTCA Online Store for document pricing and ordering information. \n\n## Foreword",
    "These Minimum Operational Performance Standards (MOPS) were prepared by RTCA Special Committee 209 (SC-209) and approved by the RTCA Program Management Committee (PMC) on October 2, 2008.  This document represents the consolidated performance requirements from two sources; RTCA/DO-144, \"Minimum Operational Characteristics for Airborne ATC Transponder Systems,\" dated March 12, 1970, plus Change 1 to DO-144, posted as RTCA Paper No. 232-70/EC-643, dated November 5, 1970, and the performance",
    "1 to DO-144, posted as RTCA Paper No. 232-70/EC-643, dated November 5, 1970, and the performance standards referred to in paragraph (a)(1) of Federal Aviation Administration (FAA) Technical Standard Order (TSO) -C74c, dated February 20, 1973. RTCA, Incorporated is a not-for-profit corporation formed to advance the art and science of aviation and aviation electronic systems for the benefit of the public.  The organization functions as a Federal Advisory Committee and develops consensus-based",
    "public.  The organization functions as a Federal Advisory Committee and develops consensus-based recommendations on contemporary aviation issues. RTCA's objectives include, but are not limited to:",
    "Coalescing aviation system user and provider technical requirements in a manner that helps government and industry meet their mutual objectives and responsibilities; \n \n \nAnalyzing and recommending solutions to the system technical issues that aviation faces as it continues to pursue increased safety, system capacity and efficiency;",
    "Developing consensus on the application of pertinent technology to fulfill user and provider requirements, including development of Minimum Operational Performance Standards (MOPS) for electronic systems and equipment that support aviation; and",
    "Assisting in developing the appropriate technical material upon which positions for the International Civil Aviation Organization (ICAO) and the International Telecommunication Union (ITU) and other appropriate international organizations can be based.",
    "The recommendations of RTCA are often used as the basis for government and private sector decisions as well as the foundation for new FAA Technical Standard Orders. Since RTCA is not an official agency of the United States Government, its recommendations may not be regarded as statements of official government policy unless so enunciated by the United States Government organization or agency having statutory jurisdiction over any matters to which the recommendations relate.",
    "This Page Intentionally Left Blank. \n\n \n\n## 1 Purpose And Scope 1.1 Introduction",
    "This document sets forth Minimum Operational Performance Standards (MOPS) for Air Traffic Control Radar Beacon System (ATCRBS) airborne equipment.  Incorporated within these standards are system characteristics that will be useful to users of the system as well as designers, manufacturers and installers.  These performance standards represent a consolidation of performance requirements from two sources; RTCA/DO- 144, \"*Minimum Operational Characteristics for Airborne ATC Transponder Systems,\"*",
    "RTCA/DO- 144, \"*Minimum Operational Characteristics for Airborne ATC Transponder Systems,\"* dated March 12, 1970, plus Change 1 to DO-144, posted as RTCA Paper No. 232-70/EC- 643, dated November 5, 1970, and the performance standards referred to in paragraph (a)(1) of Federal Aviation Administration (FAA) Technical Standard Order (TSO)-C74c, dated February 20, 1973. Compliance with these MOPS is required to achieve at least that minimum performance, on which control and separation of aircraft",
    "required to achieve at least that minimum performance, on which control and separation of aircraft is based, and to insure against derogation of service to other users of aviation navigation and communication services.  These MOPS are applicable to all users of airborne ATC transponder systems who are required by regulation to participate in the ATC system, or who voluntarily choose to do so.",
    "Note: The use of \"**shall**\" in the body of this document indicates a requirement.  The \nuse of \"**should**\" indicates a characteristic that is highly recommended, but is not \nrequired.",
    "It is recognized that any regulatory application of these standards is the responsibility of appropriate government agencies. Because the measured values of equipment performance characteristics may be a function of the measurement method, standard test conditions and methods of test are recommended in this document. This document considers an equipment configuration consisting of:  transponder, control panel, antenna and interconnecting cables.  It should not be inferred that all ATCRBS",
    "control panel, antenna and interconnecting cables.  It should not be inferred that all ATCRBS airborne equipment will necessarily include all of the foregoing components as separate units; this will depend on the design configuration chosen by the manufacturer. If the equipment implementation includes a computer software package, the guidelines contained in the most current issue of RTCA/DO-178, Software Considerations in Airborne Systems and Equipment Certification, should be considered.",
    "## 1.1.1 International Standards\n\nThe performance standards of this document also reflect current International Civil Aviation Organization (ICAO) Annex 10, Volume IV, Amendment 82, Chapter 3 requirements for airborne systems having only Mode A and Mode C capabilities. \n\n## 1.1.2 Preparation Of Minimum Operational Performance Standards For Airborne Systems",
    "The Federal Aviation Administration is the responsible agency for certain aviation standards.  However, FAA's regulatory effort is vastly improved by intelligent utilization of government/industry working arrangements, by which a variety and wealth of talent may be brought to bear on the development of a particular minimum requirement. Therefore, to implement the concepts that have been outlined, RTCA established Special Committee 209 to update the Minimum Operational Performance Standards for",
    "RTCA established Special Committee 209 to update the Minimum Operational Performance Standards for Airborne Transponder System Elements (both ATCRBS and Mode S), together with a method of demonstration of compliance.  However, as pointed out in these concepts, concise statements of system characteristics are a prerequisite to meaningful minimum operational characteristics for airborne systems.  Accordingly, RTCA SC-209 was directed to consider such system characteristics that exist and to",
    "Accordingly, RTCA SC-209 was directed to consider such system characteristics that exist and to include them in its reports.  If none exist, best assumptions were to be formulated by RTCA SC-209 and included in the reports.",
    "## 1.2 The Atcrbs Secondary Surveillance Radar (Ssr) Environment",
    "Although the trend towards equipage of ATCRBS/Mode Select (S) capable transponders is increasing, a large number of aircraft are still equipped with ATCRBS-only capable transponders.  Since Mode S transponders are required on aircraft with TCAS, Mode S transponders are installed on a large segment of the aircraft population.  However, General Aviation aircraft continue to represent the largest percentage of the aircraft in the airspace and ATCRBS transponders are still the dominant equipage for",
    "of the aircraft in the airspace and ATCRBS transponders are still the dominant equipage for these aircraft. The primary purpose of the ATCRBS transponder is to support ATC secondary surveillance radar (SSR) requirements. The ATCRBS SSR environment consists of the airborne ATCRBS transponders, ground interrogator-receiver, processing equipment, and an antenna system.  The antenna may or may not be associated with, or slaved to, a primary surveillance radar.  In operation, an interrogation",
    "not be associated with, or slaved to, a primary surveillance radar.  In operation, an interrogation pulse-pair transmitted from the interrogator-transmitter unit, via an antenna assembly, triggers each airborne transponder located in the direction of the main beam, causing a multiple pulse reply group to be transmitted from each transponder.  These replies are received by the ground receiver and, after processing, are displayed to the controller.  Measurement of the round-trip transit time",
    "and, after processing, are displayed to the controller.  Measurement of the round-trip transit time determines the range (rho) to the replying aircraft while the mean direction of the main beam of the interrogator antenna, during the reply, determines the azimuth (theta).  Based on the time spacing of the interrogation pulse-pair transmitted, the airborne transponder provides a multiple-pulse reply that represents either an individualized identity code (Mode A reply) or the aircraft's current",
    "that represents either an individualized identity code (Mode A reply) or the aircraft's current pressure altitude",
    "(Mode C reply). The ATCRBS transponder also replies to airborne Mode A and Mode C interrogators, thereby making its presence known to aircraft that are equipped with Traffic Advisory and Collision Avoidance System (TCAS) or Airborne Collision Avoidance System (ACAS). Additional information on ground and airborne interrogator characteristics is contained in §2.1.10.",
    "## 1.3 Assumptions\n\nThis document defines the basic surveillance and link characteristics of ATCRBS transponders.  Adherence to the requirements of this document will meet the needs of the airspace for surveillance of aircraft so equipped.  There is no upgrade path for the ATCRBS system going forward as surveillance needs of the future may rely on different technologies. \n\n## 1.4 Equipage Classes",
    "## 1.4 Equipage Classes\n\nClass A equipment is intended for installation in aircraft which operate at altitudes above 15,000 feet.  Additional information on Class A equipment is contained in §2.2.3.2.1. Class B equipment is intended for installation in aircraft which operate at altitudes not exceeding 15,000 feet.  Additional information on Class B equipment is contained in §2.2.3.2.2.   \n\n## 1.5 Test Procedures",
    "The specified test procedures and associated limits are intended as one means of demonstrating compliance with the minimum acceptable performance parameters. Although specific test procedures are cited, it is recognized that other methods may be preferred by the test organization.  These alternate methods may be used if they provide at least equivalent information.  In such cases, the procedures cited should be used as one criterion in evaluating the acceptability of the alternate procedures.",
    "cited should be used as one criterion in evaluating the acceptability of the alternate procedures. The order of tests suggests that the equipment be subjected to a succession of different tests as it moves from design and design qualification into operational use.  For example, the equipment should have demonstrated compliance with the requirements of Section §2.0 as a precondition to satisfactory completion of the installed system tests of Section §3.0. Three types of test procedures are",
    "completion of the installed system tests of Section §3.0. Three types of test procedures are included which should be used at different stages in the equipment approval cycle. These are discussed in the following paragraphs.",
    "## 1.5.1 Environmental Tests",
    "Environmental tests are specified in Subsection §2.3.  The procedures and their associated limit requirements are intended to provide a means of determining the electrical and mechanical performance of the equipment under environmental conditions expected to be encountered in actual operations.  Equipment manufacturers may use test results as design guidance in preparation of installation instructions and, in certain cases, for obtaining formal approval of equipment design and manufacture.",
    "--`,``,````,`,`,``,``,````,`````-`-`,,`,,`,`,,`---\n\n## 1.5.2 Detailed Test Procedures",
    "## 1.5.2 Detailed Test Procedures\n\nDetailed test procedures are specified in Subsection §2.4.  These tests are conducted at the equipment level and are intended to provide a laboratory means of demonstrating compliance with the requirements of Subsections §2.1 and §2.2. Equipment manufacturers may use test results as design guidance, for monitoring manufacturing compliance and, in certain cases, for obtaining formal approval of equipment design and manufacture.",
    "## 1.5.3 Installed System Tests",
    "The installed system test procedures and their associated requirements are specified in Section §3.0.  Although bench and environmental test procedures are not included in the installed system tests, their successful completion is a precondition to completion of the installed tests.  In certain instances, however, installed system tests may be used in lieu of bench test simulation of such factors as power supply characteristics, interference from or to other equipment installed on the aircraft,",
    "as power supply characteristics, interference from or to other equipment installed on the aircraft, etc.  Installed tests are normally performed under two conditions:",
    "a. with the aircraft on the ground and using simulated or operational system inputs, \nand/or \nb. with the aircraft in flight using operational system signals appropriate to the \nequipment under test. \nTest results may be used to demonstrate functional performance in the intended operational environment. \n\nIn addition, the ground test procedures may be used as an optional check of equipment performance following corrective maintenance. \n\n## 1.6 Definition Of Terms",
    "ATCRBS - Air Traffic Control Radar Beacon System. Desensitization - Temporary reduction of transponder sensitivity after receipt of a signal. This helps to reduce echo (multipath) effects. Interrogation - A ground or airborne signal propagated toward an ATCRBS transponder to elicit a Mode A or Mode C response. Mode A Interrogation - A signal to elicit an ATCRBS transponder reply for identity (4096 code) and surveillance. Mode C Interrogation - A signal to elicit an ATCRBS transponder reply for",
    "code) and surveillance. Mode C Interrogation - A signal to elicit an ATCRBS transponder reply for automatic pressure-altitude transmission and surveillance Multipath - The propagation phenomenon that results in signals reaching the receiving antenna by two or more paths, generally with a time or phase difference between the two.",
    "National Airspace System (NAS) - The common system of facilities, equipment, regulations, procedures and personnel providing services and standard procedures for the safe and efficient movement of civil and military aircraft within the jurisdiction of the United States.",
    "PAM - Pulse Amplitude Modulation. The modulation technique utilized in both the interrogation and reply signals. Reply - A signal propagated from the transponder. Side Lobe Suppression (SLS) Transmission - A transmission intended to prevent responses from transponders not in the main beam of the interrogating antenna. Special Position Identification (SPI) - A special pulse used in ATCRBS located 4.35 microseconds following the last framing pulse. When used in Mode S, SPI appears as a code in",
    "4.35 microseconds following the last framing pulse. When used in Mode S, SPI appears as a code in the flight status (FS) field and in the surveillance status subfield (SSS).",
    "This Page Intentionally Left Blank. \n\n## 2 Atcrbs Transponder Equipment Performance Requirements And Test Procedures 2.1 General Requirements 2.1.1 Airworthiness\n\nIn the design and manufacture of the equipment, the manufacturer **shall** provide for installation so as not to impair the airworthiness of the aircraft. \n\n## 2.1.2 General Performance",
    "## 2.1.2 General Performance\n\nThe equipment **shall** perform its intended function(s), as defined by the manufacturer, and its proper use **shall not** create a hazard to other users of the National Airspace System. \n\n## 2.1.3 Federal Communications Commission Rules\n\nAll equipment **shall** comply with the applicable rules of the Federal Communication Commission. \n\n## 2.1.4 Fire Protection",
    "## 2.1.4 Fire Protection\n\nAll materials used **shall** be self-extinguishing except for small parts (such as knobs, fasteners, seals, grommets and small electrical parts) that would not contribute significantly to the propagation of a fire. \n\nNote: One means of showing compliance is contained in Federal Aviation Regulations \n(FAR), Part 25, Appendix F. \n\n## 2.1.5 Operation Of Controls",
    "The equipment **shall** be designed so that controls intended for use during flight cannot be operated in any position, combination or sequence that would result in a condition detrimental to the reliability of the equipment or operation of the aircraft.  In addition, the operation of controls, intended for use during flight, should be designed and evaluated to ensure that they are logical and tolerant to human error. In particular, where transponder functions are integrated with other system",
    "to human error. In particular, where transponder functions are integrated with other system controls (e.g., ADS-B, etc.), the equipment manufacturer should ensure that unintentional transponder mode switching (i.e., an operational state to \"STANDBY\" or \"OFF\") is minimized.",
    "## 2.1.6 Accessibility Of Controls\n\nControls that do not require adjustment during flight **shall not** be readily accessible to flight personnel.   \n\n## 2.1.7 Flight Crew Control Functions\n\nThe following functions **shall** be provided.",
    "a. Means of selecting each of the ATCRBS 4096 (Mode A) reply codes, and of \nindicating the code selected. \nb. Means of selecting the condition in which all transponder functions, other than \ntransmission on the reply frequency and associated self-testing, are operational (i.e., \nthe Standby condition).  Return to normal operation from this condition **shall** be \npossible within five seconds",
    "possible within five seconds \nc. Means of selecting ATCRBS Mode A and Mode C combined. d. Means of initiating the IDENT (SPI) feature. \ne. Means of inhibiting the transmission of the altitude information, while retaining the \nATCRBS framing pulses in ATCRBS Mode C replies.",
    "## 2.1.8 Optional Functions/Interfaces",
    "With the movement toward an Automatic Dependent Surveillance - Broadcast (ADS-B) environment, there are various functions/outputs from the ATCRBS transponder that are in common with ADS-B parameter requirements.  For example, the \"squawk\" or 4096 code, pressure altitude, and an IDENT capability are features used by both ADS-B and ATCRBS in supporting ATC surveillance needs.  Equipment manufacturers should consider the development of an output interface to support these and other ADS-B broadcast",
    "should consider the development of an output interface to support these and other ADS-B broadcast requirements (e.g., Flight ID) in their future transponder designs.",
    "## 2.1.9 Effects Of Test\n\nThe equipment **shall** be designed so that the application of specified test procedures shall not be detrimental to equipment performance following the application of the tests, except as specifically allowed.   \n\n## 2.1.10 Interrogation Characteristics",
    "## 2.1.10 Interrogation Characteristics\n\nThe following subsections describe the signal in space as it can be expected to appear at the transponder's antenna.  Because signals can be corrupted in transmission, tolerances for interrogator performance are more restrictive and should not be derived from this document.  The modulation technique utilized in the interrogation signal is known as pulse amplitude modulation (PAM).   \n\n## 2.1.10.1 Interrogation Carrier Frequency",
    "## 2.1.10.1 Interrogation Carrier Frequency\n\nThe carrier frequency of received interrogations is: \n\na. 1030 ±0.20 MHz from ATCRBS interrogators. b. 1030 ±0.01 MHz from Mode S interrogators. \n\n## 2.1.10.2 Measurement Convention\n\nThe following definitions are in reference to Figure 2-1. Pulse Amplitude - the peak voltage amplitude (A) of the pulse envelope.",
    "Pulse Rise Time - the time between 0.1A and 0.9A on the leading edge of the pulse envelope. Pulse Decay Time - the time between 0.9A and 0.1A on the trailing edge of the pulse envelope. Pulse Duration - the time interval between 0.5A points on leading and trailing edges of the pulse envelope. Pulse Interval - the time interval between the 0.5A point on the leading edge of the first pulse and the 0.5A point on the leading edge of the second pulse.",
    "## Figure 2-1: Pulse Envelope Conventions 2.1.10.3 Received Pam Signals\n\nThe following signals are valid PAM interrogations:",
    "ATCRBS Mode A (to elicit transponder replies for identity and surveillance) \n \nATCRBS Mode C (to elicit transponder replies for automatic pressure-altitude \ntransmission and surveillance) \n \nATCRBS Mode A/C/S All-Call (to elicit replies for surveillance of Mode A/C \ntransponders and for the acquisition of Mode S transponders) \n \nATCRBS Mode A/C-Only All-Call (to elicit replies for surveillance of Mode A/C \ntransponders.  Mode S transponders do not reply)",
    "transponders.  Mode S transponders do not reply) \n All of these interrogations use two or more of the four pulses shown in §2.1.10.3.2.  The pulses are labeled P1, P2, P3 and P4.",
    "## 2.1.10.3.1 Pulse Shapes\n\nThe pulse shapes for PAM interrogations are summarized in Table 2-1 (all values are in microseconds).",
    "| Pulse      | Pulse    | Duration    | Rise Time    | Decay Time    |\n|------------|----------|-------------|--------------|---------------|\n| Designator | Duration | Tolerance   | Min/Max      | Min/Max       |\n| P          |          |             |              |               |\n| 1          |          |             |              |               |\n| ,          |          |             |              |               |\n| P          |          |             |              |               |",
    "| P          |          |             |              |               |\n| 2          |          |             |              |               |\n| ,          |          |             |              |               |\n| P          |          |             |              |               |\n| 3          |          |             |              |               |\n|            |          |             |              |               |\n| 0.8        | ±0.1     | 0.05/0.1    | 0.05/0.2     |               |",
    "| 0.8        | ±0.1     | 0.05/0.1    | 0.05/0.2     |               |\n| P          |          |             |              |               |\n| 4          |          |             |              |               |\n| (short)    |          |             |              |               |\n| 0.8        | ±0.1     | 0.05/0.1    | 0.05/0.2     |               |\n| P          |          |             |              |               |\n| 4          |          |             |              |               |",
    "| 4          |          |             |              |               |\n| (long)     |          |             |              |               |\n| 1.6        | ±0.1     | 0.05/0.1    | 0.05/0.2     |               |\n|            |          |             |              |               |",
    "## 2.1.10.3.2 Pulse Patterns\n\nThe pulse patterns of the PAM interrogations are defined in Table 2-2 (all values are in microseconds).  The general format of the PAM interrogations is shown in Figure 2-2.",
    "Spacing \nInterrogation Type \nP1 - P2 \nP1 - P3 \nP3 - P4 \nP4 \nATCRBS Mode A \n2 ±0.15 \n8 ±0.2 \n      - \nNone \nATCRBS Mode C \n2 ±0.15 \n21 ±0.2 \n      - \nNone \n2 ±0.15 \n8 ±0.2 \n2 ±0.05 \nLong \nATCRBS Mode A/Mode S All-Call \n2 ±0.15 \n21 ±0.2 \n2 ±0.05 \nLong \nATCRBS Mode C/Mode S \nAll-Call \n2 ±0.15 \n8 ±0.2 \n2 ±0.05 \nShort \nATCRBS Mode A-Only All-Call \n2 ±0.15 \n21 ±0.2 \n2 ±0.05 \nShort \nATCRBS Mode C-Only All-Call \n\n \n\n## 2.1.10.3.3 Relative Pulse Amplitudes",
    "## 2.1.10.3.3 Relative Pulse Amplitudes\n\nP2 amplitudes will vary from P1. P3 amplitudes are P1 ±1 dB. \n\n \n\n## 2.1.10.4 Suppression",
    "P2 amplitudes will vary from P1. P3 amplitudes are P1 ±1 dB. \n\n \n\n## 2.1.10.4 Suppression\n\nThis characteristic is used to prevent replies to interrogations received via the side lobes of the interrogator antenna, and to prevent Mode A/C transponders from replying to Mode S interrogations.  Suppression is in effect when the received amplitude of P2 is equal to or in excess of the received amplitude of P1 and spaced 2 \n±0.15 microseconds (see §2.2.5.3).",
    "## 2.2 Equipment Performance - Standard Conditions 2.2.1 Definition Of Standard Conditions\n\nThe signal levels specified in this subsection exist at the antenna end of a transponder-toantenna transmission line of loss equal to the maximum for which the transponder is designed. \n\nNote:  The transponder will usually be installed with less than the designed maximum \ntransmission line loss.  Nevertheless, the standard conditions of this document are based on the maximum design value.",
    "## 2.2.2 Receiver Characteristics 2.2.2.1 Interrogation Tolerances\n\nParagraph §2.1.10 and its subparagraphs define tolerances allowed from the nominal interrogation values.  The transponder **shall** be tolerant to all such deviations within the ranges specified in paragraph §2.1.10.   \n\n## 2.2.2.2 Transponder Receiver Operating Frequency And Bandwidth",
    "## 2.2.2.2 Transponder Receiver Operating Frequency And Bandwidth\n\na. The receiver nominal center frequency **shall** be 1030 MHz. \nb. With an input signal level 3 dB above the minimum triggering level, the receiver \nbandwidth **shall** be such that the receiver accepts pulses as outlined in §2.1.10 with \nan interrogation center frequency drift of ± 0.2 MHz. \nc. The skirt bandwidth **shall** be such that the sensitivity of the receiver is at least 60 dB \ndown at ±25 MHz and beyond.",
    "## 2.2.2.3 Receiver Sensitivity And Dynamic Range Given An Interrogation That Requires A Reply, The Minimum Triggering Level (Mtl) Is Defined As The Minimum Input Power Level That Results In A 90 Percent Reply Ratio If The Interrogation Signal Has All Nominal Pulse Spacings And Widths And If The Replies Are The Correct Replies Assigned To The Interrogation Format.",
    "a. The minimum triggering level (MTL) of the transponder **shall** be such that replies \nare generated to 90 percent of the interrogation signals when: (1) \nThe two pulses P1 and P3 constituting an interrogation are of equal amplitude and P2 is not detected; and  \n(2) \nThe amplitude of these signals received at the antenna end of the transmission line of the transponder is nominally 71 dB below 1 milliwatt with limits between 69 and 77 dB below 1 milliwatt.",
    "Note: For this MTL requirement, a nominal 3 dB transmission line loss and an antenna performance equivalent to that of a simple quarter wave antenna are assumed.  In the event these assumed conditions do not apply, the MTL of the installed transponder system must be comparable to that of the assumed system.",
    "b. The variation of the minimum triggering level between modes shall not exceed 1 dB \nfor nominal pulse spacings and pulse widths. \nc. The reply characteristics **shall** apply over a received signal amplitude range between \nminimum triggering level and -21 dBm. \nd. The reply ratio **shall** not be more than 10 percent for interrogations at signal levels \nbelow -81 dBm. \ne. The conditions of \"a\" through \"d\" apply when a P4 pulse is present, either long or",
    "e. The conditions of \"a\" through \"d\" apply when a P4 pulse is present, either long or \nshort, regardless of amplitude of the P4 pulse.",
    "## 2.2.3 Transmitter Characteristics 2.2.3.1 Reply Transmission Frequency\n\nThe center frequency of the reply transmission **shall** be 1090 ±3 MHz. \n\n## 2.2.3.2 Transponder Class And Power Output 2.2.3.2.1 Class A Equipment\n\nFor this class of equipment, the peak pulse power available at the antenna end of the transmission line of the transponder **shall** be at least 21 dB and not more than 27 dB \nabove 1 watt at any reply rate up to 1,200 per second for a 15-pulse coded reply.",
    "## 2.2.3.2.2 Class B Equipment\n\nFor this class of equipment, the peak pulse power-available at the antenna end of the transmission line of the transponder **shall** be at least 18.5 dB and not more than 27 dB \nabove 1 watt at any reply rate up to 1,000 per second for a 15-pulse coded reply. \n\nNote: For the power output requirement specified in §2.2.3.2.1 and §2.2.3.2.2, a",
    "Note: For the power output requirement specified in §2.2.3.2.1 and §2.2.3.2.2, a \n\nnominal 3 dB transmission line loss and an antenna performance equivalent to that of a simple quarter-wave antenna are assumed.  In the event these assumed conditions do not apply, the peak pulse power of the installed transponder system must be comparable to that of the assumed system.   \n\n## 2.2.3.3 Unwanted Output Power",
    "## 2.2.3.3 Unwanted Output Power\n\nWhen the transponder transmitter is in the inactive state, the RF output power at 1090 ±3 \nMHz at the terminals of the antenna shall not exceed -50 dBm.  The inactive state is defined to include the entire period between ATCRBS transmissions less 10- microsecond transition periods, if necessary, preceding and following the extremes of the transmission. \n\n## 2.2.3.4 Reply Rate Capability",
    "## 2.2.3.4 Reply Rate Capability\n\na. For Class A equipment (see §1.4), the transponder **shall** be capable of at least 1,200 \nreplies per second for a 15-pulse coded reply.   \nb. For Class B equipment (see §1.4),  the transponder **shall** be capable of at least 1,000 \nreplies per second for a 15-pulse coded reply.   \n\n## 2.2.3.5 Sensitivity Reduction Reply Rate Control",
    "## 2.2.3.5 Sensitivity Reduction Reply Rate Control\n\nA sensitivity-reduction reply rate limit **shall** be incorporated in the transponder for ATCRBS replies.  The limit **shall** be capable of being adjusted between 500 continuous ATCRBS Mode A and Mode C replies per second and the maximum continuous rate of which the transponder is capable, or 2000 replies per second, whichever is less, without regard to the number of pulses in each reply.",
    "Note: The reply rate limit control should be set at 1,200 replies per second, or the \nmaximum value below 1,200 replies per second of which the transponder is capable. (See §2.2.3.4).   \n \n\n## 2.2.4 Reply Pulse Characteristics (Signals In Space)\n\nThe following subsections describe the reply pulse characteristics.  The general format of the reply pulse is shown in Figure 2-3. \n\n \n\n## 2.2.4.1 Framing Pulses",
    "## 2.2.4.1 Framing Pulses\n\nThe reply function **shall** employ a signal comprising two framing pulses spaced 20.3 \nmicroseconds, as the most elementary code.  \n\n## 2.2.4.2 Information Pulses\n\nInformation pulses **shall** be spaced in increments of 1.45 microseconds from the first framing pulse.  The designation and position of these information pulses **shall** be as shown in Table 2-3.",
    "Pulse \nPosition \n(microseconds) \nF1 \n0.00 \nC1 \n1.45 \nA1 \n2.90 \nC2 \n4.35 \nA2 \n5.80 \nC4 \n7.25 \nA4 \n8.70 \nX \n10.15 \nB1 \n11.60 \nD1 \n13.05 \nB2 \n14.50 \nD2 \n15.95 \nB4 \n17.40 \nD4 \n18.85 \nF2 \n20.30 \n\n \n\n## 2.2.4.3 Special Position Identification (Spi) Pulses",
    "In addition to the information pulses provided, a Special Position Identification (SPI) \nPulse, which may be transmitted with the information pulses, **shall** occur at a pulse interval of 4.35 microseconds following the last framing pulse.",
    "The SPI pulse **shall** be initiated by an IDENT switch (see §2.1.7.d).  Upon activation of the IDENT switch, the SPI pulse **shall** be transmitted for a period of between 15 and 30 seconds and must be capable of being reinitiated at any time.  The SPI pulse shall not be included when transmitting Mode C replies.",
    "## 2.2.4.4 Reply Pulse Shape",
    "All reply pulses **shall** have a pulse duration of 0.45 ±0.10 microsecond, a pulse rise time between 0.05 and 0.1 microsecond, and a pulse decay time between 0.05 and 0.2 microsecond.  The pulse amplitude variation of one pulse with respect to any other pulse in a reply group **shall not** exceed 1 dB.  (See §2.1.10.2)",
    "Note: The intent of the lower limit of rise and decay times (0.05 microseconds) is to reduce sideband radiation.  Equipment will meet this requirement if the sideband radiation is no greater than that which theoretically would be produced by a trapezoidal wave having 0.05 microsecond rise and decay times and a 0.35 microsecond pulse duration.",
    "## 2.2.4.5 Reply Pulse Spacing Tolerances",
    "The pulse interval tolerance for each pulse (including the last framing pulse) with respect to the first framing pulse of the reply group **shall** be ±0.10 microsecond.  The pulse interval tolerance of the Special Position Identification Pulse with respect to the last framing pulse of the reply group **shall** be ±0.10 microseconds.  The pulse interval tolerance of any pulse in the reply group with respect to any other pulse (except the first framing pulse) **shall** not exceed ±0.15",
    "group with respect to any other pulse (except the first framing pulse) **shall** not exceed ±0.15 microseconds.",
    "## 2.2.4.6 Reply Delay And Jitter",
    "The time delay between the arrival at the transponder of the leading edge of P3, and the transmission of the leading edge of the first pulse of the reply **shall** be 3 ±0.5 \nmicroseconds.  The total jitter of the reply pulse code group with respect to P3 **shall not**",
    "microseconds.  The total jitter of the reply pulse code group with respect to P3 **shall not** \nexceed ±0.1 microseconds.  Delay variations between modes on which the transponder is capable of replying **shall not** exceed 0.2 microseconds.  These requirements apply for receiver input levels between 3 and 50 dB above minimum triggering level.",
    "## 2.2.5 Decoding Performance\n\nUnless otherwise specified, the following pulse decoder characteristics **shall** apply over the RF input signal level range from MTL +3 dB to MTL +50 dB and interrogation signal characteristics per §2.1.10.3.   \n\n## 2.2.5.1 Pulse Level Tolerances\n\nWhen selected to reply to a particular interrogation mode (See §2.1.10.3.2), the transponder **shall** reply (not less than 90 percent efficiency) under each of the following conditions:",
    "a. The received amplitude of P3 is in excess of a level 1 dB below the received \namplitude of P1 but no greater than 3 dB above the received amplitude of P1.  \nb. The received amplitude of a proper interrogation is more than 10 dB above the \nreceived amplitude of random pulses where the latter are not recognized by the \ntransponder as P1, P2, or P3.   \nc. The conditions of \"a\" and \"b,\" apply when a P4 pulse is present, either long or short, \nregardless of amplitude of the P4 pulse.",
    "## 2.2.5.2 Pulse Position Tolerances\n\nThe transponder **shall** accept interrogations as valid if the spacing between P1 and P3 is within plus or minus 0.20 microseconds of the nominal spacing. \n\nThe transponder shall not reply to more than 10 percent of the interrogations under each of the following conditions:",
    "a. To interrogations when the interval between pulses P1 and P3 differs from that \ndefined in §2.1.10.3.2 for the mode selected in the transponder by more than ±1 microsecond.   \nb. Upon receipt of any single pulse which has no amplitude variations approximating a \nnormal interrogation condition.   \n\n## 2.2.5.3 Suppression",
    "## 2.2.5.3 Suppression\n\nUpon receipt of an interrogation complying with the interrogation modes defined in \n§2.1.10.3, selected manually or automatically, the transponder **shall** be suppressed (not less than 99 percent efficiency) when the received amplitude of P2 is equal to or in excess of the received amplitude of P1 and spaced 2 ±0.15 microseconds.   \n\n## Notes:",
    "1. It is not the intent of this paragraph to require the detection of P3 as a prerequisite \nfor initiation of suppression action. \n2. After reception of a valid P3 pulse the transponder should not initiate suppression \nbased on the reception of a P4 pulse. \na. The transponder suppression **shall** be for a period of 35 ±10 microseconds. b. The suppression **shall** be capable of being reinitiated for the full duration within two \nmicroseconds after the end of any suppression period.",
    "microseconds after the end of any suppression period. \nc. The transponder **shall not** initiate suppression if the level of P1 exceeds the level of \nP2 by 9 dB or more. \nd. The transponder **shall not** initiate suppression if no pulse is received at the position \n2.0 ±0.7 microseconds following P1. \ne. The transponder **shall not** initiate suppression if the duration of P2 is less than 0.3 \nmicroseconds.",
    "## 2.2.5.4 Pulse Duration Discrimination",
    "a. For all signal levels from MTL to -45 dBm, the transponder **shall** reply to no more \nthan 10 percent of ATCRBS, ATCRBS-Only All-Call or ATCRBS/Mode S All-Call interrogations if the duration of either the P1 or the P3 pulse is less than 0.3 microseconds.   \nb. With the exception of single pulses with amplitude variations approximating an \ninterrogation, any single pulse of duration more than 1.5 microseconds shall not",
    "interrogation, any single pulse of duration more than 1.5 microseconds shall not \ncause the transponder to initiate reply or suppression action over the signal amplitude range of minimum triggering level to 50 dB above minimum triggering level.",
    "## 2.2.5.5 Compatibility With Tcas Atcrbs Surveillance\n\nWith P1 at MTL and S1 at MTL -6 dB, the transponder **shall** reply to ATCRBS \ninterrogations at least 90 % of the time. \n\nWith P1 at MTL and S1 at MTL -3 dB, the transponder **shall** reply to ATCRBS \ninterrogations at least 70 % of the time.",
    "With P1 at MTL and S1 at MTL, the transponder **shall** reply to no more than 10% of ATCRBS interrogations.   \nNote: S1 is equal to P1 in duration with the leading edge of S1 being 2.0 microseconds ahead of the leading edge of P1.  Amplitude of S1 is varied relative to P1 as indicated above. \n\n## 2.2.6 Desensitization And Recovery Characteristics 2.2.6.1 Dead Time",
    "## 2.2.6 Desensitization And Recovery Characteristics 2.2.6.1 Dead Time\n\nAfter reception of a valid interrogation, the transponder shall not reply to any other interrogation at least for the duration of the reply pulse train.  This dead time **shall** end no later than 125 microseconds after the transmission of the last reply pulse of the group. \n\n## 2.2.6.2 Echo Suppression And Recovery",
    "## 2.2.6.2 Echo Suppression And Recovery\n\nThe transponder **shall** contain an echo suppression facility designed to permit normal operation in the presence of echoes of signals-in-space.  The provision of this facility shall be compatible with the requirements for suppression of side lobes given in §2.2.5.3.   \n\n## 2.2.6.2.1 Desensitization",
    "Upon receipt of any pulse more than 0.7 microseconds in duration, the receiver **shall** be desensitized by an amount that is within at least 9 dB of the amplitude of the desensitizing pulse, but **shall** at no time exceed the amplitude of the desensitizing pulse, with the exception of possible overshoot during the first microsecond following the desensitizing pulse.  Single pulses of duration less than 0.7 microseconds are not required to cause the specified desensitization, and **shall not**",
    "than 0.7 microseconds are not required to cause the specified desensitization, and **shall not** cause desensitization of duration greater than that permitted herein or by §2.2.6.2.2.",
    "## 2.2.6.2.2 Recovery\n\nFollowing desensitization, the receiver **shall** recover sensitivity (within 3 dB of MTL) \nwithin 15 microseconds after reception of a desensitizing pulse having a signal strength up to 50 dB above MTL.  Recovery **shall** be nominally linear at an average rate not exceeding 4.0 dB per microsecond.   \n\n## 2.2.7 Undesired Replies 2.2.7.1 Random Triggering And Suppression Rate",
    "## 2.2.7 Undesired Replies 2.2.7.1 Random Triggering And Suppression Rate\n\nIn the absence of valid interrogation signals, the random triggering rate (squitter) of the transponder **shall not** exceed 30 replies and/or suppressions per second as integrated over an interval equivalent to at least 300 random triggers, or 30 seconds, whichever is less.",
    "Note: When demonstrating compliance to these requirements, the equipment \nmanufacturer should consider possible interference (triggering) caused by equipment typically found in the aircraft of intended installation (e.g., VHF communication, DME, Radio Altimeter, etc.), operating at their maximum interference levels. \n\n## 2.2.7.2 Random Triggering In The Presence Of Cw",
    "## 2.2.7.2 Random Triggering In The Presence Of Cw\n\nThe total random triggering on all Mode A and/or Mode C replies **shall not** exceed 10 \nreplies or suppressions per second, averaged over a period of 30 seconds, when operated in the presence of non-coherent CW interference at a frequency of 1030 ±0.2 MHz and a signal level of –60 dBm, or less. \n\n## 2.2.8 Transponder Self Test And Monitor 2.2.8.1 Manual Self-Test",
    "## 2.2.8 Transponder Self Test And Monitor 2.2.8.1 Manual Self-Test\n\na. When a manual self-test device is provided, it **shall** be limited to intermittent use by \na spring-loaded return-to-off switch, or equivalent. \nb. The test interrogation rate shall not exceed 450 per second. c. The lowest RF level at the input to the antenna required to accomplish the test **shall** \nbe used.  The maximum RF level at the input to the antenna **shall not** exceed 40 dB \nbelow 1 milliwatt.",
    "## 2.2.8.2 Automatic Self-Test",
    "a. When an automatic self-test device is provided, it **shall** be limited to use only in the \nabsence of a valid interrogation.  (A minimum period of 15 seconds will be sufficient to establish the absence of ground interrogations).  \nb. The maximum test time for the automatic self-test **shall not** exceed 0.1 second in any \ngiven l5-second interval.",
    "given l5-second interval. \nc. The test interrogation rate **shall not** exceed 450 per second. d. The lowest RF level at the input to the antenna required to accomplish the test **shall** \nbe used.  The maximum RF level at the input to the antenna **shall not** exceed 40 dB \nbelow 1 milliwatt.",
    "## 2.2.9 Response To Mutual Suppression Pulses\n\nThe equipment **shall** accept and respond to suppression pulses from other electronic equipment in the aircraft (to disable it while the other equipment is transmitting), the equipment **shall** regain normal sensitivity within 3 dB, not later than 15 microseconds after the end of the applied suppression pulse.   \n\n## 2.2.10 Data Handling And Interfaces 2.2.10.1 Code Nomenclature",
    "## 2.2.10 Data Handling And Interfaces 2.2.10.1 Code Nomenclature\n\nThe code designations **shall** consist of four digits, each of which lies between 0 and 7 \ninclusive, and is determined by the sum of the pulse subscripts given in Table 2-3, employed as shown in Table 2-4: \n\n| Digit    | Pulse Group    |\n|----------|----------------|\n| First    | A              |\n| Second   | B              |\n| Third    | C              |\n| Fourth   | D              |",
    "Examples: \nCode 3615 would consist of information pulses A1, A2 (1 + 2 = 3), B2, B4 (2 + 4 = 6),  \nC1 (1 = 1), D1, D4 (1 + 4 = 5).   \nCode 3600 would consist of information pulses A1, A2, B2 and B4 Code 2057 would consist of information pulses A2, C1, C4, D1, D2 and D4 \nCode 0301 would consist of information pulses B1, B2 and D1 \n \n\n## 2.2.10.2 Identification\n\nThe 4096 codes specified in §2.2.10.1 **shall** be manually selectable for reply to interrogations on Mode A.",
    "## 2.2.10.3 Pressure Altitude Transmissions",
    "a. Independently of the other modes and codes manually selected, the transponder **shall** \nautomatically reply to Mode C interrogations. \nb. The reply to Mode C interrogations **shall** consist of the two framing pulses together \nwith the information pulses specified in §2.2.4.2. \nc. The transponders **shall** be provided with means to remove the information pulses,",
    "c. The transponders **shall** be provided with means to remove the information pulses, \nbut to retain the framing pulses when the provision of subparagraph \"f\" below is not complied with, in reply to Mode C interrogation. \nNote: The information pulses should be capable of being removed either in response to a failure detection system or manually at the request of the controlling agency.",
    "d. The information pulses **shall** be automatically selected by an analog-to-digital \nconverter connected to a pressure-altitude data source in the aircraft referenced to the standard pressure setting of 29.92 inches of mercury.  \ne. Pressure altitude **shall** be reported in 100-foot increments by selection of pulses as",
    "e. Pressure altitude **shall** be reported in 100-foot increments by selection of pulses as \nshown in the tables in Appendix A.  If the transponder is capable of accepting altitude sources with better than 100-foot resolution, the pressure altitudeinformation **shall** be reported in the closest 100-foot increment as specified in \nAppendix A.   \nf. The digitizer code selected **shall** correspond to within ±125 feet, on a 95 percent",
    "f. The digitizer code selected **shall** correspond to within ±125 feet, on a 95 percent \nprobability basis with the pressure altitude information (referenced to the standard pressure setting of 29.92 inches of mercury) used on board the aircraft to adhere to the assigned flight profile.",
    "## 2.2.11 Antenna 2.2.11.1 Frequency\n\nThe antenna **shall** be designed to receive and transmit vertically polarized signals in the frequency range of 1030 to 1090 MHz. \n\n## 2.2.11.2 Impedance And Vswr\n\nThe VSWR produced by the antenna when terminated in a 50-ohm transmission line **shall** \nnot exceed 1.5:1 over the 1030 to 1090 MHz frequency band. \n\n## 2.2.11.3 Polarization\n\nThe antenna **shall** be vertically polarized. \n\n## 2.2.11.4 Radiation Pattern",
    "The antenna **shall** be vertically polarized. \n\n## 2.2.11.4 Radiation Pattern\n\nThe transponder antenna system when installed on an aircraft **shall** have a radiation pattern that is essentially omni-directional in the horizontal plane and should have a vertical beam-width sufficient to provide system operation during normal maneuvers of the aircraft. \n\n## 2.2.12 Power Interruption",
    "## 2.2.12 Power Interruption\n\nThe transponder equipment **shall** regain operational capability to within its operational limits within two seconds after the restoration of power following a momentary power interruption. \n\nNote: The transponder equipment is not required to continue operation during \nmomentary power interruptions. \n \n\n## 2.2.13 Diversity",
    "Diversity transponders may be implemented for the purpose of improving surveillance performance.  Such systems **shall** employ two antennas, one mounted on the top and the other on the bottom of the aircraft.  Appropriate switching and signal processing channels to select the best antenna on the basis of the characteristics of the received interrogation signals **shall** also be provided.  Such diversity systems, in their installed configuration, shall not result in degraded performance",
    "Such diversity systems, in their installed configuration, shall not result in degraded performance relative to that which would have been produced by a single system having a bottom-mounted antenna.",
    "## 2.2.13.1 Diversity Antenna Selection And Selection Threshold",
    "a. \nDiversity Antenna Selection \nAntenna selection **shall** be automatic.  The transponder **shall** select one of the two antennas on the basis of the relative strengths of the detected interrogation signals, provided that both channels simultaneously receive a valid identical interrogation or pulse pair.  Antenna selection and switching may occur after the receipt of the P3 pulse of a P1 - P3 pulse pair, indicating an ATCRBS or ATCRBS/Mode S All-Call interrogation.",
    "The selected antenna **shall** be used, if necessary, to transmit a reply. \n\nb. \nSelection Threshold \nThe transponder **shall** nominally select the antenna connected to the RF port having the stronger signal.  To allow for unbalance in the characteristics of the two channels, a transition zone ±3 dB wide is permitted, in which either antenna may be selected. \n\n## 2.2.13.2 Received Signal Delay Tolerance",
    "If an interrogation is received at either antenna 0.125 microsecond or less in advance of reception at the other antenna, the interrogations **shall** be considered simultaneous and the reply antenna selection criteria **shall** be applied.  If an interrogation is received at either antenna 0.375 microsecond or more in advance of reception at the other antenna, the antenna selected for the reply **shall** be the one which received the earlier interrogation.  If the relative time of receipt is",
    "**shall** be the one which received the earlier interrogation.  If the relative time of receipt is between 0.125 and 0.375 microsecond, the transponder **shall** select the reply antenna based on either the simultaneous interrogation criteria or the earlier time of arrival.",
    "## 2.2.13.3 Diversity Transmission Channel Isolation\n\nThe peak RF power transmitted from the selected antenna **shall** exceed the power transmitted from the non-selected antenna by at least 20 dB. \n\n \n\n## 2.2.13.4 Reply Delay Of Diversity Transponders",
    "## 2.2.13.4 Reply Delay Of Diversity Transponders\n\nThe total difference in mean reply delay between the two antenna channels (including the transponder-to-antenna cables) **shall** not exceed 0.08 microsecond for interrogations of equal amplitude.  This requirement is applicable to interrogation signal strengths between MTL +3 dB and MTL +50 dB.",
    "Note: This requirement limits apparent jitter caused by diversity operation and by cable delay differences.  The jitter requirements on each individual channel remain as specified for non-diversity transponders.  Control of apparent jitter caused by antenna location is specified in §3.1.6. \n\n## 2.3 Equipment Performance - Environmental Conditions",
    "The environmental tests and performance requirements described in this subsection provide a laboratory means of determining the overall performance characteristics of the equipment under conditions representative of those that may be encountered in actual aeronautical operations. Some of the environmental tests contained in this subsection need not be performed unless the manufacturer wishes to qualify the equipment for that particular environmental condition.  These tests are identified by the",
    "the equipment for that particular environmental condition.  These tests are identified by the phrase \"When Required.\"  If the manufacturer wishes to qualify the equipment to these additional environmental conditions, then these \"when required\" tests **shall** be performed.",
    "The test procedures applicable to a determination of equipment performance under environmental test conditions are contained in the most recent version of the RTCA Document entitled \"Environmental Conditions and Test Procedures for Airborne Equipment,\" which at the time of publication of these MOPS was in revision \"F,\" and is herein after referenced in these MOPS as RTCA/DO-160(). Some of the performance requirements in §2.1 and §2.2 are not tested by the test procedures herein.  Moreover, not",
    "requirements in §2.1 and §2.2 are not tested by the test procedures herein.  Moreover, not all tests are required to be performed at each of the environmental conditions in RTCA/DO-160().  Judgment and experience have indicated that these particular performance parameters are not susceptible to certain environmental conditions and that the level of performance specified in §2.1 and §2.2 will not be measurably degraded by exposure to these environmental conditions. Additional tests may have to",
    "be measurably degraded by exposure to these environmental conditions. Additional tests may have to be performed in order to determine performance of particular design requirements that are not specified in this document.  It is the responsibility of the manufacturer to determine appropriate tests for these functions. Specific transponder performance tests have been included in this section for use in conjunction with the environmental procedures of DO-160().  These tests have been judiciously",
    "in conjunction with the environmental procedures of DO-160().  These tests have been judiciously chosen as a subset of the transponder performance tests of §2.4.  Normally, a MOPS document does not provide specific equipment performance tests to be used in conjunction with the environmental procedures of DO-160().  However, there is a sufficiently large number of transponder performance tests in §2.4 that it would be impractical to repeat all of those tests in conjunction with all of the",
    "in §2.4 that it would be impractical to repeat all of those tests in conjunction with all of the appropriate environmental procedures.",
    "## 2.3.1 Environmental Test Conditions",
    "Table 2-5 lists all of the environmental conditions and test procedures (hereafter referred to as environmental procedures) that are documented in DO-160().  Table 2-6 lists the subset of transponder performance tests from section §2.4 that are intended to be run subject to the various environmental procedures of DO-160().  In order to simplify the process of relating the environmental procedures to the transponder performance tests, Table 2-5 divides the environmental procedures into groups.",
    "to the transponder performance tests, Table 2-5 divides the environmental procedures into groups.  All of the procedures in a given group are carried out in conjunction with the same set of transponder performance tests.  Using this approach, the environmental procedures fall into six groups.  The",
    "--`,``,````,`,`,``,``,````,`````-`-`,,`,,`,`,,`---",
    "environmental procedures that apply to all of the sets of transponder performance tests fall into group 1.  Group 2 procedures apply to 8 of the sets of transponder performance tests.  Groups 3, 4, and 5 apply to 4, 3 and 3 of the sets of transponder performance tests, respectively.  (Group 6, which applies to none of the transponder performance tests, includes only environmental procedures that are intended to determine the effect of the transponder on rack mounting hardware, compass needles,",
    "are intended to determine the effect of the transponder on rack mounting hardware, compass needles, explosive gasses, and other RF hardware.) Table 2-6 indicates which of the groups of environmental procedures is related to each set of transponder performance tests.  Each transponder performance test **shall** be validated under all of the environmental procedures in the groups required for that test as indicated in Table 2-6.",
    "ENVIRONMENTAL CONDITION \nDO-160() \nParagraph \nGROUPS \nREMARKS \n4a \nTemperature \n§4.5 \n1 \n \n4b \nAltitude \n§4.6.1 \n4 \n \n4c \nDecompression & Overpressure \n§4.6.2 - §4.6.3 \n4 \nWhen required \n5 \nTemperature Variation \n§5.0 \n3 \n \n6 \nHumidity \n§6.0 \n2 \n \n7a \nOperational Shock \n§7.2 \n2 \nWhen required \n7b \nCrash Safety \n§7.3 \n6 \nSee Note \n8 \nVibration \n§8.0 \n3 & 1 \n3 during: 1 after \n9 \nExplosion \n§9.0 \n6 \nSee Note \n10 \nWaterproofness \n§10.0 \n2 \nWhen required \n11 \nFluids Susceptibility \n§11.0 \n2",
    "6 \nSee Note \n10 \nWaterproofness \n§10.0 \n2 \nWhen required \n11 \nFluids Susceptibility \n§11.0 \n2 \nWhen required \n12 \nSand and Dust \n§12.0 \n2 \nWhen required \n13 \nFungus Resistance \n§13.0 \n2 \nWhen required \n14 \nSalt Spray \n§14.0 \n2 \nWhen required \n15 \nMagnetic Effect \n§15.0 \n6 \nSee Note \nPower Input \nMomentary Interruptions \n16 \n§16.0 \n5 \n3 & 2 \n3 during: 2 after \nAll Others \n17 \nVoltage Spike \n§17.0 \n2 \n \n18 \nAudio Freq. Conducted Susceptibility \n§18.0 \n1 \n \n19 \nInduced Signal Susceptibility",
    "2 \n \n18 \nAudio Freq. Conducted Susceptibility \n§18.0 \n1 \n \n19 \nInduced Signal Susceptibility \n§19.0 \n1 \n \n20 \nRF Susceptibility \n§20.0 \n1 \n \n21 \nEmission of RF Energy \n§21.1 \n6 \nSee Note \n22 \nLightning Induced Transient \nSusceptibility \n§22.0 \nnone \nProcedure not yet \ndefined \n \nNote: Tests in Group 6 determine the effects of the transponder on other equipment",
    "defined \n \nNote: Tests in Group 6 determine the effects of the transponder on other equipment \n(mounts, compass needles, explosive gasses, and other RF equipment) and therefore do not involve the transponder performance requirements of this document.   \n|                                                   | Test                          | REQUIRED ENVIRONMENT    |\n|---------------------------------------------------|-------------------------------|-------------------------|",
    "| Procedure                                         | TEST GROUPS                   | DESCRIPTION             |\n|                                                   |                               |                         |\n| (See Table 2-5)                                   | Paragraph                     |                         |\n|                                                   |                               |                         |",
    "|                                                   |                               |                         |\n| 1                                                 | 2                             | 3                       |\n| §2.4.2.2 (1)                                      |                               |                         |\n| Transponder Receiver Operating                    |                               |                         |",
    "| Frequency                                         |                               |                         |\n| X                                                 | X                             | X                       |\n| §2.4.2.3 (1), (5)                                 |                               |                         |\n| Receiver Sensitivity and Dynamic                  |                               |                         |",
    "| Range                                             |                               |                         |\n| X                                                 | X                             | X                       |\n| §2.4.3.1                                          | Reply Transmission Frequency  | X                       |\n| §2.4.3.2                                          | Transponder Power Output      | X                       |",
    "| §2.4.3.4                                          | Reply Rate Capability         | X                       |\n| §2.4.4.1                                          | Framing Pulses                | X                       |\n| §2.4.4.2                                          | Information Pulses            | X                       |\n| §2.4.4.4                                          | Reply Pulse Shape             | X                       |",
    "| §2.4.4.6 (1)                                      | Reply Delay and Jitter        | X                       |\n| §2.4.5.2 (1)                                      | Pulse Position Tolerance      | X                       |\n| §2.4.5.3 (1), (2), (5)                            | Side Lobe Suppression         | X                       |\n| §2.4.5.4 (1)                                      | Pulse Duration Discrimination | X                       |",
    "| §2.4.6.1                                          | Dead Time                     | X                       |\n| §2.4.6.2.1                                        | Desensitization               | X                       |\n| §2.4.6.2.2                                        | X                             |                         |\n| Recovery                                          |                               |                         |",
    "| Note: It is sufficient for environmental tests to |                               |                         |\n| just verify that sensitivity has recovered to     |                               |                         |\n| within 3 dB of MTL after 15 microseconds.  It     |                               |                         |\n| is not necessary to measure the gradual           |                               |                         |",
    "| recovery rate.                                    |                               |                         |\n|                                                   |                               |                         |\n| §2.4.7.1                                          | Random Triggering             | X                       |\n| §2.4.8.1 (1)                                      | Manual Self Test              | X                       |",
    "| §2.4.10.2                                         | Identification                | X                       |\n| §2.4.10.3                                         | Pressure Altitude             | X                       |\n| §2.4.12                                           | Power Interruption            | X                       |\n| §2.4.13                                           | Diversity                     | X                       |",
    "Note: It is sufficient to test with standard Mode A and Mode C as required for the environmental tests.  It is not necessary to include interrogation types that include a P4 pulse as may be required for some detailed test procedures.   \n\n## 2.4 Equipment Test Procedures",
    "## 2.4 Equipment Test Procedures\n\nCompliance with the Minimum Operational Performance Standards contained in Section §2.2 may be demonstrated by a combination of bench tests of the individual system components (or certification thereof by either the manufacturer or the installer) and flight tests of the entire installed system.  A suggested procedure which will minimize the need for extensive evaluation in the field is as follows in the paragraphs below.",
    "## 2.4.1 Definitions Of Terms And Conditions Of Test (§2.2.1)\n\nThe following are definitions of terms and the conditions under which the tests described in this subsection should be conducted.",
    "a. Power Input Voltage - Unless otherwise specified, all tests **shall** be conducted with \nthe power input voltage adjusted to design voltage, plus or minus 2%.  The input \nvoltage **shall** be measured at the input terminals of the equipment under test. \nb. Power Input Frequency \n1) In the case of equipment designed for operation from an AC source of essentially \nconstant frequency (e.g., 400 Hz), the input frequency **shall** be adjusted to design \nfrequency, plus or minus 2%.",
    "frequency, plus or minus 2%. \n2) In the case of equipment designed for operation form an AC source of variable \nfrequency (e.g., 300 to 1,000 Hz), unless otherwise specified, tests **shall** be \nconducted with the input frequency adjusted to within 5% of a selected frequency and within the range for which the equipment is designed. \nc. Adjustment of Equipment - The circuits of the equipment under test **shall** be",
    "c. Adjustment of Equipment - The circuits of the equipment under test **shall** be \nproperly aligned and otherwise adjusted in accordance with the manufacturer's recommended practices prior to application of the specified tests. \nd. Test Equipment - All equipment used in the performance of the tests should be",
    "d. Test Equipment - All equipment used in the performance of the tests should be \nidentified by make, model and serial number where appropriate, and its latest calibration date.  When appropriate, all test equipment calibration standards should be traceable to national and/or international standards. \ne. Test Instrument Precautions - Adequate precautions **shall** be taken during the test to",
    "e. Test Instrument Precautions - Adequate precautions **shall** be taken during the test to \nprevent the introduction of errors resulting from the connection of voltmeters, oscilloscopes and other test instruments across the input and output impedances of the equipment under test. \nf. Ambient Conditions - Unless otherwise specified, all tests **shall** be made within the \nfollowing ambient conditions:",
    "following ambient conditions: \n1) Temperature: +15 to +35 degrees C (+59 to +95 degrees F). 2) Relative Humidity: Not greater than 85%. 3) Ambient Pressure: 84 to 1-7 kPa (equivalent to +5,000 to –1,500 ft) (+1,525 to  \n–460m). \ng. Connected Loads - Unless otherwise specified, all tests **shall** be performed with the \nequipment connected to loads having the impedance values for which it is designed.",
    "## H. Standard Interrogation Test Signals\n\nThe nominal interrogation characteristics **shall** be as specified in subparagraph \n§2.1.10.3. \n\nThe signal measurement convention **shall** be as specified in paragraph §2.1.10.2. \n\n## General Characteristics",
    "1) Radio Frequency: The carrier frequency of the signal generator for ATCRBS and \nATCRBS/Mode S All-Call interrogation **shall** be 1030 ±0.1 MHz. \n \n2) CW Output: The CW output between pulses **shall** be at least 50 dB below the \npeak level of the pulse. \n3) Pulse Rise and Fall Time: Rise and fall times **shall** be as specified in §2.1.10.3.",
    "3) Pulse Rise and Fall Time: Rise and fall times **shall** be as specified in §2.1.10.3. \nNote: Unless otherwise indicated, interval measurements are measured between half voltage points of the respective pulses as detected by a linear detector.",
    "4) Pulse Top Ripple: The instantaneous amplitude of the pulses **shall** not fall more \nthan l dB below the maximum value between the 90 percent voltage amplitude point on the leading and trailing edge of the pulse. 5) Signal Level: Unless otherwise noted in the measurement procedure, the signal \nlevel **shall** be -60 ±3 dBm. \n6) Interrogation Repetition Rate: Unless otherwise noted in the measurement \nprocedure, interrogation rates **shall** be 450 ±25 Hz.",
    "## 2.4.2 Verification Of Receiver Characteristics (§2.2.2) 2.4.2.1 Verification Of Interrogation Tolerances (§2.2.2.1) Purpose/Introduction:\n\nParagraph §2.1.10 and its subparagraphs define a number of deviations allowed in the interrogation values.  The transponder **shall** be tolerant to all such deviations within the ranges specified in §2.1.10.   \n\nThe transponder's acceptance of the tolerances specified in §2.1.10 is tested in various test procedures throughout §2.4.",
    "## 2.4.2.2 Verification Of Transponder Receiver Operating Frequency And Bandwidth (§2.2.2.2)\n\nPurpose/Introduction:",
    "a. The receiver nominal center frequency **shall** be 1030 MHz. \nb. With an input signal level 3 dB above the minimum triggering level, the receiver \nbandwidth **shall** be such that the receiver accepts pulses as outlined in §2.1.10 with \nan interrogation center frequency drift of ± 0.2 MHz.   \nc. The skirt bandwidth **shall** be such that the sensitivity of the receiver is at least 60 dB \ndown at ±25 MHz and beyond.   \n(1)",
    "down at ±25 MHz and beyond.   \n(1) \nInterrogate the transponder at 500 interrogations per second with a Mode A interrogation signal.  Vary the RF signal frequency over the range 1029.8 to 1030.2 MHz Determine the variation in RF signal level required to produce 90 percent transponder reply efficiency.  Also determine the required maximum RF signal level. \n(2)",
    "(2) \nInterrogate the transponder at 500 interrogations per second with a Mode A interrogation signal.  Determine the interrogation signal level (MTL) which results in a transponder reply rate of 450.  Set the interrogation frequency to 1055 and 1005 MHz and verify that the transponder sensitivity is at least 60 dB below the MTL level measured at nominal frequency in both cases.",
    "## 2.4.2.3 Verification Of Receiver Sensitivity And Dynamic Range (§2.2.2.3) Purpose/Introduction:",
    "a. The minimum triggering level (MTL) of the transponder **shall** be such that replies \nare generated to 90 percent of the interrogation signals when: \n(1) \nThe two pulses P1 and P3 constituting an interrogation are of equal amplitude and P2 is not detected; and  \n(2) \nThe amplitude of these signals received at the antenna end of the transmission line of the transponder is nominally 71 dB below 1 milliwatt with limits between 69 and 77 dB below 1 milliwatt.",
    "Note: For this MTL requirement, a nominal 3 dB transmission line loss and an antenna performance equivalent to that of a simple quarter wave antenna are assumed.  In the event these assumed conditions do not apply, the MTL of the installed transponder system must be comparable to that of the assumed system.",
    "b. The variation of the minimum triggering level between modes shall not exceed 1 dB \nfor nominal pulse spacings and pulse widths. \nc. The reply characteristics **shall** apply over a received signal amplitude range between \nminimum triggering level and 50 dB above minimum triggering level. \nd. The reply ratio **shall** not be more than 10 percent for interrogations at signal levels \nbelow -81 dBm. \ne. The conditions of \"a\" through \"d\" apply when a P4 pulse is present, either long or",
    "e. The conditions of \"a\" through \"d\" apply when a P4 pulse is present, either long or \nshort, regardless of amplitude of the P4 pulse. \n(1) \nInterrogate the transponder with a standard Mode A interrogation at a repetition \nrate of 500 interrogations per second.  Adjust P1 and P3 equal in amplitude (no \nP2 pulse) and apply a signal level known to be below minimum triggering level.",
    "P2 pulse) and apply a signal level known to be below minimum triggering level.  \nIncrease the signal generator output level until the transponder reply rate is 450 replies per second.  This is the transponder minimum triggering level (MTL). The installed system MTL (including transmission line loss) should be between 69 and 77 dB below 1 milliwatt.",
    "| EXAMPLE:    | Transponder MTL        | -74 dBm    |\n|-------------|------------------------|------------|\n|             | Transmission Line Loss | 3 dB       |\n|             | System MTL             | -71 dBm    |\n|             |                        |            |",
    "(2) \nRepeat step (1) above using a standard Mode C interrogation.  The variation in MTL between steps (1) and (2) should not exceed 1 dB. \n(3) \nRepeat steps (1) and (2) above and include both a narrow and wide P4 pulse at the nominal position, equal in amplitude to P1 and P3. \n(4)",
    "(4) \nInterrogate the transponder with a standard Mode A interrogation at a repetition rate of 500 interrogations per second.  Adjust the RF signal level between MTL +3 dB and -21 dBm in 5 dB increments and determine the reply ratio.  Repeat \nwith both a narrow and wide P4 pulse at the nominal position, equal in amplitude \nto P1 and P3.  \n(5) \nRepeat step (4) with a Mode C interrogation. \n(6)",
    "to P1 and P3.  \n(5) \nRepeat step (4) with a Mode C interrogation. \n(6) \nInterrogate the transponder with a standard Mode A interrogation at an RF level of -81 dBm.  Determine reply ratio and verify that the reply ratio is 10 percent or less. \n--`,``,````,`,`,``,``,````,`````-`-`,,`,,`,`,,`---",
    "## 2.4.3 Verification Of Transmitter Characteristics (§2.2.3) 2.4.3.1 Verification Of Reply Transmission Frequency (§2.2.3.1) Purpose/Introduction:\n\nThe center frequency of the reply transmission **shall** be 1090 ±3 MHz. \n\nMeasurement Procedures: Set transponder Mode A code to 7777.  Interrogate the transponder with a Mode A interrogation and verify that the reply frequency is 1090 ±3 MHz.",
    "## 2.4.3.2 Verification Of Transponder Power Output (§2.2.3.2) 2.4.3.2.1 Verification Of Transponder Power Output For Class A Equipment (§2.2.3.2.1) Purpose/Introduction:",
    "For this class of equipment, the peak pulse power available at the antenna end of the transmission line of the transponder **shall** be at least 21 dB and not more than 27 dB",
    "above 1 watt at any reply rate up to 1,200 per second for a 15-pulse coded reply. Measurement Procedures: Transponder power output may be determined with a dummy load and power meter which are suitable for use at 1090 MHz. Set the transponder for a 15-pulse reply (code = 7777 + SPI).  Interrogate the transponder with a standard Mode A interrogation and measure the single pulse having the least RF power output.  While varying the interrogation rate from 100 interrogations per second to the",
    "RF power output.  While varying the interrogation rate from 100 interrogations per second to the maximum interrogation rate specified for the transponder, determine that the power output meets the requirements of §2.2.3.2.1.",
    "## 2.4.3.2.2 Verification Of Transponder Power Output For Class B Equipment (§2.2.3.2.2) Purpose/Introduction:",
    "For this class of equipment, the peak pulse power-available at the antenna end of the transmission line of the transponder **shall** be at least 18.5 dB and not more than 27 dB",
    "above 1 watt at any reply rate up to 1,000 per second for a 15-pulse coded reply. Measurement Procedures: Transponder power output may be determined with a dummy load and power meter which are suitable for use at 1090 MHz. Set the transponder for a 15-pulse reply (code = 7777 + SPI).  Interrogate the transponder with a standard Mode A interrogation and measure the single pulse having the least RF power output.  While varying the interrogation rate from 100 interrogations per second to the",
    "RF power output.  While varying the interrogation rate from 100 interrogations per second to the maximum interrogation rate specified for the transponder, determine that the power output meets the requirements of §2.2.3.2.2.",
    "## 2.4.3.3 Verification Of Unwanted Output Power (§2.2.3.3)\n\nPurpose/Introduction: When the transponder transmitter is in the inactive state, the RF output power at 1090 ±3 \nMHz at the terminals of the antenna shall not exceed -50 dBm.  The inactive state is defined to include the entire period between ATCRBS and/or Mode S transmissions less 10-microsecond transition periods, if necessary, preceding and following the extremes of the transmission.",
    "Measurement Procedures: With no interrogations, measure the RF output power and verify that it does not exceed -50 dBm.   \n\n## 2.4.3.4 Verification Of Reply Rate Capability (§2.2.3.4)\n\nPurpose/Introduction:",
    "a. For Class A equipment (see §1.4), the transponder **shall** be capable of at least 1,200 \nreplies per second for a 15-pulse coded reply. \nb. For Class B equipment (see §1.4), the transponder **shall** be capable of at least 1,000 \nreplies per second for a 15-pulse coded reply.",
    "replies per second for a 15-pulse coded reply. \nMeasurement Procedures: Set the transponder for a 15-pulse ATCRBS reply.  For Class A equipment, interrogate the transponder with a Mode A signal at a constant rate of 1,200 interrogations per second.  For Class B equipment, interrogate the transponder with a Mode A signal at a constant rate of 1,000 interrogations per second.  Verify that the reply efficiency is not less than 90%.",
    "## 2.4.3.5 Verification Of Sensitivity Reduction Reply Rate Control (§2.2.3.5) Purpose/Introduction:",
    "A sensitivity-reduction reply rate limit **shall** be incorporated in the transponder for ATCRBS replies.  The limit **shall** be capable of being adjusted between 500 continuous ATCRBS Mode A and Mode C replies per second and the maximum continuous rate of which the transponder is capable, or 2000 replies per second, whichever is less, without regard to the number of pulses in each reply. Measurement Procedure: Set the transponder's Mode C code to 0000 and its Mode A code to any value other",
    "Procedure: Set the transponder's Mode C code to 0000 and its Mode A code to any value other than 0000.  Interrogate the transponder with the sum of:",
    "a) a Mode C interrogation 20 dB above MTL at a continuous rate equal to the reply rate \nlimit determined in Step 1, and \nb.) a second unsynchronized Mode A interrogation 3 dB above MTL at a continuous \nrate equal to 50% of the reply rate limit determined in Step 1.   \nVerify that the transponder replies to at least 90% of the interrogations at the signal level \n20 dB above MTL and that it does not reply to more than 10% of the interrogations at the signal level 3 dB above MTL.",
    "## 2.4.4 Verification Of Reply Pulse Characteristics (Signals In Space) (§2.2.4)\n\nThe reply transmission characteristics can be determined with a demodulating probe and a wide band oscilloscope comparing the reply pulse group waveform against an accurate timing waveform such as from a crystal oscillator. \n\n## 2.4.4.1 Verification Of Framing Pulses (§2.2.4.1) Purpose/Introduction:",
    "## 2.4.4.1 Verification Of Framing Pulses (§2.2.4.1) Purpose/Introduction:\n\nThe reply function **shall** employ a signal comprising two framing pulses spaced 20.3 \nmicroseconds, as the most elementary code. Measurement Procedures: With the transponder interrogated on Mode A and replying on Code 0000, the time interval between the 0.5 amplitude points on the leading edges of the two framing pulses should be within 20.3 ±0.10 microseconds.",
    "## 2.4.4.2 Verification Of Information Pulses (§2.2.4.2) Purpose/Introduction:\n\nInformation pulses **shall** be spaced in increments of 1.45 microseconds from the first framing pulse.  The designation and position of these information pulses **shall** be as shown in Table 2-3.",
    "Measurement Procedures: With the transponder replying on Code 7777, the time interval between the 0.5 amplitude points on the leading edge of each pulse, including the last framing pulse, with respect to the first framing pulse should be equal to that listed in §2.2.4.2 with a tolerance of ±0.1 microsecond.  Also, the time interval from any pulse, in the reply group, with respect to any other pulse, except the first framing pulse, should not exceed ±0.15 microsecond.",
    "## 2.4.4.3 Verification Of Special Position Identification (Spi) Pulse (§2.2.4.3) Purpose/Introduction:\n\nIn addition to the information pulses provided, a Special Position Identification (SPI) \nPulse, which may be transmitted with the information pulses, **shall** occur at a pulse interval of 4.35 microseconds following the last framing pulse.",
    "The SPI pulse **shall** be initiated by an IDENT switch (see §2.1.7.d).  Upon activation of the IDENT switch, the SPI pulse **shall** be transmitted for a period of between 15 and 30 seconds and must be capable of being reinitiated at any time.  The SPI pulse shall not be included when transmitting Mode C replies.",
    "(1) \nWith the transponder replying with the SPI pulse, the time interval between the 0.5 amplitude points on the leading edge of the second framing pulse and the SPI pulse should be 4.35 ±0.10 microseconds. \n(2) \nInterrogate the transponder with a Mode A interrogation signal.  With the transponder operating, manually initiate the SPI pulse and verify that the transmission time of the SPI pulse is between 15 and 30 seconds, and that it can be re-initiated immediately. \n(3)",
    "(3) \nWhile interrogating the transponder with a Mode C interrogation, manually activate the SPI pulse and verify that there is no SPI pulse in the reply.",
    "## 2.4.4.4 Verification Of Reply Pulse Shape (§2.2.4.4) Purpose/Introduction:\n\nAll reply pulses **shall** have pulse duration of 0.45 ±0.10 microseconds, a pulse rise time between 0.05 and 0.1 microseconds, and a pulse decay time between 0.05 and 0.2 microseconds.  The pulse amplitude variation of one pulse with respect to any other pulse in a reply group **shall not** exceed 1 dB.",
    "With the transponder replying with Code 7777 and the SPI pulse activated, verify the following reply pulse characteristics: The duration of each reply pulse, as measured between the 0.5 amplitude points on the leading and trailing edge, should be between 0.35 and 0.55 microseconds. The rise time of each reply pulse, as measured between the 0.1 amplitude and 0.9 amplitude points on the leading edge should be between 0.05 and 0.10 microseconds. The decay time of each reply pulse, as measured",
    "edge should be between 0.05 and 0.10 microseconds. The decay time of each reply pulse, as measured between the 0.9 amplitude and 0.1 amplitude points on the trailing edge should be between 0.05 and 0.20 microseconds. The amplitude variation of anyone pulse as measured with respect to any other pulse in a reply group should not exceed 1 dB.",
    "Note: The fundamental requirements of sideband radiation can be met either as described above or by determining that the actual sideband radiation is no greater than that which theoretically would be produced by a trapezoidal wave having 0.05 microsecond rise and decay times and a 0.35 microsecond pulse duration. \n\n## 2.4.4.5 Verification Of Reply Pulse Interval Tolerances (§2.2.4.5) Purpose/Introduction:",
    "The pulse interval tolerance for each pulse (including the last framing pulse) with respect to the first framing pulse of the reply group **shall** be ±0.10 microseconds.  The pulse interval tolerance of the Special Position Identification Pulse with respect to the last framing pulse of the reply group **shall** be ±0.10 microseconds.  The pulse interval tolerance of any pulse in the reply group with respect to any other pulse (except the first framing pulse) shall not exceed ±0.15",
    "reply group with respect to any other pulse (except the first framing pulse) shall not exceed ±0.15 microseconds.",
    "These requirements are tested in test procedures §2.4.4.1, §2.4.4.2 and §2.4.4.3. \n\n## 2.4.4.6 Verification Of Reply Delay And Jitter (§2.2.4.6) Purpose/Introduction:",
    "The time delay between the arrival at the transponder of the leading edge of P3, and the transmission of the leading edge of the first pulse of the reply **shall** be 3 ±0.5 \nmicroseconds.  The total jitter of the reply pulse code group with respect to P3 **shall not**",
    "microseconds.  The total jitter of the reply pulse code group with respect to P3 **shall not** \nexceed ±0.1 microsecond.  Delay variations between modes on which the transponder is capable of replying **shall not** exceed 0.2 microseconds.  These requirements apply for receiver input levels between 3 and 50 dB above minimum triggering level.",
    "(1) \nInterrogate the transponder with a Mode A signal.  Measure the time interval \nbetween the 50% voltage point of the leading edge of P3 and the 50% voltage \npoint of the leading edge of the first framing pulse at the antenna terminal.  Vary the interrogation RF level from 3 to 50 dB above MTL.  Verify that the delay is within the limits of 3 ±0.5 microseconds.  Verify that the jitter from the leading \nedge of P3 to the leading edge of the first framing pulse does not exceed ±0.1",
    "edge of P3 to the leading edge of the first framing pulse does not exceed ±0.1 \nmicrosecond. \n(2) \nRepeat step (1) using a Mode A-Only All-Call interrogation. \n(3) \nRepeat steps (1) and (2) for Mode C interrogation types.  Verify that the delay variation between all modes does not exceed 0.2 microseconds.",
    "## 2.4.5 Verification Of Decoding Performance (§2.2.5) 2.4.5.1 Verification Of Pulse Level Tolerances (§2.2.5.1) Purpose/Introduction:\n\nWhen selected to reply to a particular interrogation mode (See §2.1.10.3.2), the transponder **shall** reply (not less than 90 percent efficiency) under each of the following conditions:",
    "a. The received amplitude of P3 is in excess of a level 1 dB below the received \namplitude of P1 but no greater than 3 dB above the received amplitude of P1.  \nb. The received amplitude of a proper interrogation is more than 10 dB above the \nreceived amplitude of random pulses where the latter are not recognized by the \ntransponder as P1, P2, or P3.  \nc. The conditions of \"a\" and \"b\" apply when a P4 pulse is present, either long or short, \nregardless of amplitude of the P4 pulse.",
    "regardless of amplitude of the P4 pulse. \nMeasurement Procedures: Interrogate the transponder with a Mode A signal at a repetition rate of 500 interrogations per second and with a level 3 dB above the receiver minimum triggering level.",
    "(1) \nUsing the nominal pulse interval between P1 and P3 for Mode A, vary the amplitude of P3 between 1 dB below and 3 dB above the amplitude of P1.  Note \nthe lowest reply rate obtained.  Repeat this step for Mode C. \n(2) \nRepeat step (1) for P1 amplitudes of 10, 25, and 50 dB above the minimum \ntriggering level. \n(3) \nCombine the interrogation signal with a non-synchronous 0.8 microsecond \npulses at 5000 Hz and at an RF level 10 db below that of P1 and P3 and repeat step (1) above.",
    "pulses at 5000 Hz and at an RF level 10 db below that of P1 and P3 and repeat step (1) above. \nThe reply rates obtained in each case above should be at least 450 replies per second.",
    "## 2.4.5.2 Verification Of Pulse Position Tolerance (§2.2.5.2) Purpose/Introduction:\n\nThe transponder **shall** accept interrogations as valid if the spacing between P1 and P3 is within ±0.2 microsecond of the nominal spacing. \n\nThe transponder shall not reply to more than 10 percent of the interrogations under each of the following conditions:",
    "a. To interrogations when the interval between pulses P1 and P3 differs from that \ndefined in §2.1.10.3.2 for the mode selected in the transponder by more than ±1 \nmicrosecond. \nb. receipt of any single pulse which has no amplitude variations approximating a \nnormal interrogation condition. \n(1)  \nInterrogate the transponder with interrogation pulse signals for Mode A and C, at a repetition rate of 500 interrogations per second and with a signal level 3 dB",
    "above the receiver minimum triggering level.  In the absence of P2 pulses, slowly \nadjust the interval between P1 and P3 from 7.8 microseconds to 8.2 \nmicroseconds and from 20.8 microseconds to 21.2 microseconds, respectively, and note the reply rate in each case. \n(2)  \nAdjust the interval between P1 and P3 to 7.0, 9.0, 20.0 and 22.0 microseconds, \nrespectively.  Note the reply rate in each case.  The reply rate should be no more than 50 replies per second. \n(3)",
    "(3)  \nRepeat steps (1) and (2) for amplitudes of 10, 25, and 50 dB above the minimum triggering level. \nNote:  The requirement in §2.2.5.2.b is tested in test procedure §2.4.5.4, Step (2).",
    "## 2.4.5.3 Verification Of Suppression (§2.2.5.3) Purpose/Introduction:\n\nUpon receipt of an interrogation complying with the interrogation modes defined in \n§2.1.10.3 selected manually or automatically, the transponder **shall** be suppressed (not less than 99% efficiency) when the received amplitude of P2 is equal to or in excess of the received amplitude of P1 and spaced 2 ±0.15 microseconds.   \n\n## Notes:",
    "1. It is not the intent of this paragraph to require the detection of P3 as a prerequisite \nfor initiation of suppression action. \n2. After reception of a valid P3 pulse the transponder should not initiate suppression \nbased on the reception of a P4 pulse. \na. The transponder suppression **shall** be for a period of 35 ±10 microseconds. b. The suppression **shall** be capable of being reinitiated for the full duration within two \nmicroseconds after the end of any suppression period.",
    "microseconds after the end of any suppression period. \nc. The transponder **shall not** initiate suppression if the level of P1 exceeds the level of \nP2 by 9 dB or more. \nd. The transponder **shall not** initiate suppression if no pulse is received at the position \n2.0 ±0.7 microseconds following P1. \ne. The transponder **shall not** initiate suppression if the duration of P2 is less than 0.3 \nmicroseconds.",
    "microseconds. \nInterrogate the transponder with Mode A interrogation at a repetition rate of 500 interrogations per second and at a signal level of 3 dB above receiver MTL.",
    "(1) \nAdjust P2 equal in amplitude to P1 while varying spacing from 1.85 to 2.15 \nmicroseconds and note the reply rate.  Repeat with P2 adjusted to 10 dB greater than P1 and note the reply rate.  Both rates should be no greater than 5 replies per \nsecond. \n(2) \nIncrease the signal level of P1 and P3 20 dB, with P3 equal in amplitude to P1",
    "second. \n(2) \nIncrease the signal level of P1 and P3 20 dB, with P3 equal in amplitude to P1 \nand with P2 set to an amplitude 9 dB below that of P1 and P3.  Vary the interval of P2 from 1.85 to 2.15 microseconds with respect to P1 and verify 90% or more \nreply rate.   \n(3)",
    "reply rate.   \n(3) \nWith the signal level of P1 and P3 set as in step (2), set the level of P2 equal in amplitude to P1 and P3.  Set the spacing of P2 at 1.3 and 2.7 microseconds respectively with respect to P1 and verify 90% or more reply rate. \n(4) \nWith the signal level of P1, P2 and P3 as in step (3), set the width of the P2 pulse to 0.3 microseconds.  With the P2 pulse in the nominal position, and verify 90% \nor more reply rate.   \n(5)",
    "or more reply rate.   \n(5) \nDisable P3 and readjust P2 equal in amplitude to P1 and at nominal spacing.  \nUsing a second signal source (set to at least 3 dB above the receiver MTL) with the interrogation rate synchronized with the first but delayed more than 50 microseconds, interrogate the transponder on Mode A.  Gradually shorten the delay until no replies are received from the second interrogation source.  Verify",
    "that the interval between P2 of the first signal source and P1 of the second signal \nsource is between 25 and 45 microseconds.   \n(6) \nIncrease the delay time of the second interrogation source by 2 microseconds from that at which no replies were received in step (1) above.  There should be at \nleast 450 replies per second from the second interrogation source.  Insert a P2 \ninto the second interrogation source equal in amplitude to P1.  Verify that the",
    "into the second interrogation source equal in amplitude to P1.  Verify that the \nreply rate from the second interrogation source does not exceed 5 replies per second.",
    "## 2.4.5.4 Verification Of Pulse Duration Discrimination (§2.2.5.4)\n\nPurpose/Introduction:",
    "a. For all signal levels from MTL to -45 dBm, the transponder **shall** reply to no more \nthan 10 percent of ATCRBS, ATCRBS-Only All-Call or ATCRBS/Mode S All-Call \ninterrogations if the duration of either the P1 or the P3 pulse is less than 0.3 microseconds.  . \nb. With the exception of single pulses with amplitude variations approximating an \ninterrogation, any single pulse of duration more than 1.5 microseconds shall not",
    "interrogation, any single pulse of duration more than 1.5 microseconds shall not \ncause the transponder to initiate reply or suppression action over the signal amplitude range of minimum triggering level to 50 dB above minimum triggering level. \n(1) \nInterrogate the transponder with Mode A interrogations at a repetition rate of \n500 interrogations per second.  Adjust P1 and P3 (no P2 pulse) to a width of 0.3",
    "500 interrogations per second.  Adjust P1 and P3 (no P2 pulse) to a width of 0.3 \nmicroseconds and set the RF level to minimum triggering level.  The reply efficiency should not exceed 10%.  Repeat for signal levels between MTL and - 45 dBm in 5 dB steps. \n(2)",
    "(2) \nInterrogate the transponder with a single input pulse at 1030 MHz.  Vary the pulse width of the interrogation signal from 1.5 to 22 microseconds at input signal levels of 3, 10, 25, and 50 dB above MTL.  At each input signal, verify that the transponder does not reply to, and/or is not suppressed by, the interrogation signal. \nNote:  Pulse duration discrimination for the P2 pulse is tested in §2.4.5.3 (4).",
    "## 2.4.5.5 Verification Of Compatibility With Tcas Atcrbs Surveillance (§2.2.5.5) Purpose/Introduction:\n\nWith P1 at MTL and S1 at MTL -6 dB, the transponder **shall** reply to ATCRBS \ninterrogations at least 90 % of the time. \n\nWith P1 at MTL and S1 at MTL -3 dB, the transponder **shall** reply to ATCRBS \ninterrogations at least 70 % of the time. \n\nWith P1 at MTL and S1 at MTL, the transponder **shall** reply to no more than 10% of ATCRBS interrogations.",
    "a. Interrogate the transponder with a Mode A interrogation, having P1 at MTL.  Inject \nan S1 pulse ahead of a P1 pulse at MTL -6 dB.  Verify at least 90% reply rate \nefficiency. \n--`,``,````,`,`,``,``,````,`````-`-`,,`,,`,`,,`---",
    "b. Continue the interrogation as in part \"a\" above.  Set the level of S1 to MTL \n-3 dB and verify at least 70% reply rate efficiency. \nc. Continue the interrogation as in part \"a\" above.  Set the level of S1 to MTL and \nverify reply rate efficiency of not more than 10%.   \n\n## 2.4.6 Verification Of Desensitization And Recovery Characteristics (§2.2.6) 2.4.6.1 Verification Of Dead Time (§2.2.6.1) Purpose/Introduction:",
    "After reception of a valid interrogation, the transponder shall not reply to any other interrogation at least for the duration of the reply pulse train.  This dead time **shall** end no later than 125 microseconds after the transmission of the last reply pulse of the group. Measurement Procedures: \nIn the absence of P2 pulses, interrogate the transponder on Mode A at a repetition rate of",
    "500 interrogations per second and at a signal level at least 3 dB above the receiver minimum triggering level.  Using a second signal source (set to a comparable output level) with the interrogation rate synchronized with the first but delayed more than 150 microseconds, interrogate the transponder on Mode C.  Gradually shorten the delay until the replies to the Mode C interrogations disappear.  Note the interval between the last pulse of the Mode A reply and the first framing pulse of the Mode",
    "the interval between the last pulse of the Mode A reply and the first framing pulse of the Mode C reply.  The interval should be between 0 and 125 microseconds.",
    "## 2.4.6.2 Verification Of Echo Suppression And Recovery (§2.2.6.2) 2.4.6.2.1 Verification Of Desensitization (§2.2.6.2.1) Purpose/Introduction:",
    "Upon receipt of any pulse more than 0.7 microseconds in duration, the receiver **shall** be desensitized by an amount that is within at least 9 dB of the amplitude of the desensitizing pulse, but **shall** at no time exceed the amplitude of the desensitizing pulse, with the exception of possible overshoot during the first microsecond following the desensitizing pulse.  Single pulses of duration less than 0.7 microseconds are not required to cause the specified desensitization, and **shall not**",
    "than 0.7 microseconds are not required to cause the specified desensitization, and **shall not** cause desensitization of duration greater than that permitted herein or by §2.2.6.2.2.",
    "Interrogate the transponder with Mode A interrogation pulse signals at a repetition rate of 500 interrogations per second.  Precede P1 by 2.8 microseconds with a single 0.8 \nmicrosecond wide pulse at a signal level of 50 dB above the receiver minimum triggering level.  Adjust P1 and P3 equal in amplitude and increase the output to a level causing a reply rate of 450 replies per second.  This level should be between 34 and 43 dB above the receiver minimum triggering level.",
    "## 2.4.6.2.2 Verification Of Recovery (§2.2.6.2.2)\n\nPurpose/Introduction: \nFollowing desensitization, the receiver **shall** recover sensitivity (within 3 dB of MTL) \nwithin 15 microseconds after reception of a desensitizing pulse having a signal strength up to 50 dB above MTL.  Recovery **shall** be nominally linear at an average rate not exceeding 4.0 dB per microsecond.",
    "Measurement Procedures: Note the signal levels required to just maintain 450 replies per second as the interval between the 0.8 microsecond pulse and P1 is gradually increased.  Also note that the average rate does not exceed 4.0 dB per microsecond as the signal level and interval is changed to just maintain the 450 pulses per second reply rate.  At an interval of 15 microseconds, verify that the sensitivity returns to at least MTL +3 dB.",
    "Note: An interval corresponding to a normal Mode A interrogation and a side lobe \ninterrogation is excluded. \n\n## 2.4.7 Verification Of Undesired Replies (§2.2.7) 2.4.7.1 Verification Of Random Triggering And Suppression Rate (§2.2.7.1)",
    "Purpose/Introduction: In the absence of valid interrogation signals, the random triggering rate (squitter) of the transponder **shall not** exceed 30 replies and/or suppressions per second as integrated over an interval equivalent to at least 300 random triggers, or 30 seconds, whichever is less. Measurement Procedures: Non-Interference Environment Set up test equipment to count reply transmissions from the transponder.  While not interrogating the transponder, count the number of replies for a",
    "from the transponder.  While not interrogating the transponder, count the number of replies for a minimum of one minute.",
    "## 2.4.7.2 Verification Of Random Triggering In The Presence Of Cw (§2.2.7.2)\n\nPurpose/Introduction: \nThe total random triggering on all Mode A and/or Mode C replies **shall not** exceed 10 \nreplies or suppressions per second, averaged over a period of 30 seconds, when operated in the presence of non-coherent CW interference at a frequency of 1030 ±0.2 MHz and a signal level of –60 dBm, or less.",
    "Measurement Procedure: \nRandom Trigger Rate Repeat the procedure provided in §2.4.7.1 while injecting non-coherent CW interference at a frequency of 1030 ±0.2 MHz at a signal level of -60 dBm. Count the number of replies for a minimum of one minute and verify that the reply rate does not exceed the specified limits. \n\n## 2.4.8 Verification Of Transponder Self-Test And Monitor (§2.2.8) 2.4.8.1 Verification Of Manual Self-Test (§2.2.8.1)\n\nPurpose/Introduction:",
    "Purpose/Introduction: \n\na. When a manual self-test device is provided, it **shall** be limited to intermittent use by \na spring loaded return-to-off switch, or equivalent. \nb. The test interrogation rate **shall** not exceed 450 per second. c. The lowest RF level at the input to the antenna required to accomplish the test **shall** \nbe used.  The maximum RF level at the input to the antenna **shall not** exceed 40 dB \nbelow 1 milliwatt. \nMeasurement Procedures:",
    "(l) \nSelf-Test Interrogation/Reply Rate \n \nWith equipment connected to the transponder for the purpose of detecting and counting reply rate, activate the self-test function (if provided) of the transponder under test and determine the reply rate to the self-test interrogation.",
    "(2) \nSelf-Test Interrogation Level \n \nWith equipment connected to the transponder for the purpose of measuring transmit power, activate the self-test function (if provided) of the transponder under test and determine that the transmit power is within the required limits. \n\n \n\n## 2.4.8.2 Verification Of Automatic Self-Test (§2.2.8.2)\n\nPurpose/Introduction:",
    "a. \nWhen an automatic self-test device is provided, it **shall** be limited to use only in \nthe absence of a valid interrogation.  (A minimum period of 15 seconds will be sufficient to establish the absence of ground interrogations).  \nb. \nThe maximum test time for the automatic self-test **shall** not exceed 0.1 second in \nany given 15-second interval. \nc. \nThe test interrogation rate **shall** not exceed 450 per second. \nd.",
    "c. \nThe test interrogation rate **shall** not exceed 450 per second. \nd. \nThe lowest RF level at the input to the antenna required to accomplish the test \nshall be used.  The maximum RF level at the input to the antenna **shall not** \nexceed 40 dB below 1 milliwatt. \n(1)",
    "exceed 40 dB below 1 milliwatt. \n(1) \nInterrogate the transponder at a nominal interrogation rate of 100 interrogations per second.  Stop the interrogations and, using a timing device (such as an oscilloscope) and a suitable RF detector at the transponder output, verify that no test transmissions occur for a period of 15 seconds after the interrogations cease.  \n(2)",
    "(2) \nWith no external interrogations, observe the output of the RF detector and verify that the automatic self-test transmissions do not occur for more than 0.1 second in any given 15 second interval. \n(3) \nThe test interrogation rate may be measured on the bench using a suitable detector and counter.  The interrogation rate averaged over a five second interval should not exceed 450 interrogations per second.  \n(4)",
    "(4) \nThe test signal level may be measured at the antenna end of the transmission line in the actual aircraft, or on the bench using a length of transmission line equal to that in the airplane.  One way to measure the level is to adjust a second test transponder to just trigger at the prescribed radiation limit.  Connect this test transponder to the transmission line and determine if it is triggered when the self-testing device of the first transponder is operated.",
    "Note: Due to the close proximity of the units and because of the high signal \nlevel, the transmitter of the first transponder should be disabled.  A calibrated attenuator should be placed in the transmission line between the transponders to prevent receiver damage.",
    "## 2.4.9 Verification Of Response To Mutual Suppression Pulses (§2.2.9) Purpose/Introduction:\n\nThe equipment **shall** accept and respond to suppression pulses from other electronic equipment in the aircraft (to disable it while the other equipment is transmitting), the equipment **shall** regain normal sensitivity within 3 dB, not later than 15 microseconds after the end of the applied suppression pulse.",
    "Interrogate the transponder with a Mode A interrogation at an RF level of 3 dB above minimum triggering level.  Inject a suppression pulse into the transponder with a pulse width of 35 microseconds.  Position the leading edge of the suppression pulse at the 50% \namplitude point so that it precedes the leading edge of P1 by 2.0 microseconds.  Verify that no reply is generated by the transponder.",
    "Delay the interrogation so the leading edge of P1 occurs 15 microseconds after the end of the suppression pulse.  Verify that the transponder replies to the interrogation. \n\n## 2.4.10 Verification Of Data Handling And Interfaces (§2.2.10) 2.4.10.1 Verification Of Code Nomenclature (§2.2.10.1) Purpose/Introduction:",
    "The code designations **shall** consist of four digits, each of which lies between 0 and 7 \ninclusive, and is determined by the sum of the pulse subscripts given in Table 2-3, employed as shown in Table 2-4. \n\nThese requirements are tested in the test procedure in §2.4.10.2. \n\n## 2.4.10.2 Verification Of Identification (§2.2.10.2) Purpose/Introduction:\n\nThe 4096 codes specified in §2.1.10.1 **shall** be manually selectable for reply to interrogations on Mode A.",
    "Interrogate the transponder with a standard ATCRBS Mode A interrogation.  Set identification codes which should result in the setting of each of the identification reply bits one at a time.  Verify proper positioning of these bits in the reply.   \n\n## 2.4.10.3 Verification Of Pressure Altitude Transmissions (§2.2.10.3) Purpose/Introduction:",
    "a. \nIndependently of the other modes and codes manually selected, the transponder \nshall automatically reply to Mode C interrogations. \nb. \nThe reply to Mode C interrogations **shall** consist of the two framing pulses \ntogether with the information pulses specified in §2.2.4.2. \nc. \nThe transponders **shall** be provided with means to remove the information",
    "c. \nThe transponders **shall** be provided with means to remove the information \npulses, but to retain the framing pulses when the provision of subparagraph \"f\" below is not complied with, in reply to Mode C interrogation. \nNote: The information pulses should be capable of being removed either in response to a failure detection system or manually at the request of the controlling agency.",
    "d. \nThe information pulses **shall** be automatically selected by an analog-to-digital \nconverter connected to a pressure-altitude data source in the aircraft referenced to the standard pressure setting of 29.92 inches of mercury.  \ne. \nPressure altitude **shall** be reported in 100-foot increments by selection of pulses \nas shown in Appendix A.  If the transponder is capable of accepting altitude \nsources with 25-foot or better resolution, the pressure altitude-information **shall**",
    "sources with 25-foot or better resolution, the pressure altitude-information **shall** \nbe reported in the closest 100-foot increment as specified in Appendix A. \nf. \nThe digitizer code selected **shall** correspond to within ±125 feet, on a 95 percent \nprobability basis with the pressure altitude information (referenced to the standard pressure setting of 29.92 inches of mercury) used on board the aircraft to adhere to the assigned flight profile. \n(a)",
    "(a) \nTransponder response to Mode C interrogations may be monitored with a demodulator probe and an oscilloscope.  A Mode C reply without the digitizer connected to the transponder should consist of the two framing pulses F1 and F2.   \n(b) \nThe altitude reporting switch in the \"off\" position should prevent the transmission of digitizer information pulses but not the transmission of the framing pulses. \n(c)",
    "(c) \nIf a digitizer is connected to the transponder, the information pulses will appear in accordance with the pattern represented in Appendix A.",
    "## 2.4.11 Verification Of Antennas (§2.2.11)\n\nNo test procedures are provided herein to verify the requirements of §2.2.11. Appropriate test procedures are the responsibility of the manufacturer.   \n\n## 2.4.12 Verification Of Power Interruption (§2.2.12) Purpose/Introduction:\n\nThe transponder equipment **shall** regain operational capability to within its operational limits within two seconds after the restoration of power following a momentary power interruption.",
    "Note: The transponder equipment is not required to continue operation during momentary power interruptions. \n\nApply a momentary power interruption to the transponder.  Interrogate the transponder with a standard Mode A interrogation at a power level equal to 3 dB above the minimum triggering level.  Verify that the transponder is able to reply with at least 90% reply efficiency two seconds after power is restored. \n\n## 2.4.13 Verification Of Diversity (§2.2.13) Purpose/Introduction:",
    "Diversity transponders may be implemented for the purpose of improving surveillance performance.  Such systems **shall** employ two antennas, one mounted on the top and the other on the bottom of the aircraft.  Appropriate switching and signal processing channels to select the best antenna on the basis of the characteristics of the received interrogation signals **shall** also be provided.  Such diversity systems, in their installed configuration, **shall** not result in degraded performance",
    "diversity systems, in their installed configuration, **shall** not result in degraded performance relative to that which would have been produced by a single system having a bottom-mounted antenna.",
    "## Diversity Antenna Selection And Selection Threshold",
    "a. \nDiversity Antenna Selection \nAntenna selection **shall** be automatic.  The transponder **shall** select one of the two antennas on the basis of the relative strengths of the detected interrogation signals, provided that both channels simultaneously receive a valid identical interrogation or pulse pair.  Antenna selection and switching may occur after the receipt of the P3 pulse of a P1 - P3 pulse pair, indicating an ATCRBS or ATCRBS/Mode S All-Call interrogation.",
    "The selected antenna **shall** be used, if necessary, to transmit a reply. \n\nb. \nSelection Threshold \nThe transponder **shall** nominally select the antenna connected to the RF port having the stronger signal.  To allow for unbalance in the characteristics of the two channels, a transition zone ±3 dB wide is permitted, in which either antenna may be selected. \n\n## Received Signal Delay Tolerance",
    "If an interrogation is received at either antenna 0.125 microsecond or less in advance of reception at the other antenna, the interrogations **shall** be considered simultaneous and the reply antenna selection criteria **shall** be applied.  If an interrogation is received at either antenna 0.375 microsecond or more in advance of reception at the other antenna, the antenna selected for the reply **shall** be the one which received the earlier interrogation.  If the relative time of receipt is",
    "**shall** be the one which received the earlier interrogation.  If the relative time of receipt is between 0.125 and 0.375 microsecond, the transponder **shall** select the reply antenna based on either the simultaneous interrogation criteria or the earlier time of arrival.",
    "## Diversity Transmission Channel Isolation\n\nThe peak RF power transmitted from the selected antenna **shall** exceed the power transmitted from the non-selected antenna by at least 20 dB.   \n\n## Reply Delay Of Diversity Transponders",
    "## Reply Delay Of Diversity Transponders\n\nThe total difference in mean reply delay between the two antenna channels (including the transponder-to-antenna cables) **shall** not exceed 0.08 microsecond for interrogations of equal amplitude.  This requirement is applicable to interrogation signal strengths between MTL +3 dB and MTL +50 dB.",
    "Note: This requirement limits apparent jitter caused by diversity operation and by cable delay differences.  The jitter requirements on each individual channel remain as specified for non-diversity transponders.  Control of apparent jitter caused by antenna location is specified in §3.1.6. \n\n## Equipment Required:",
    "## Equipment Required:\n\nTwo means of generating identical ATCRBS interrogations that can be delayed from each other from 125 to 375 nanoseconds. These two generators must also have independent control of power level.",
    "Means of determining the antenna terminal that generates the reply.  \n \nMeans of determining the reply power level on both antennas simultaneously. Means of determining reply delay for each channel and between channels.  \n \nNote: Because the specifications for diversity operations are symmetrical in all \nrespects, channels are arbitrarily designated A and B. \n \n(1) \nSingle Channel Test (See §2.2.13.3 and §2.2.13.4)",
    "(1) \nSingle Channel Test (See §2.2.13.3 and §2.2.13.4)  \n \nWhen measuring channel A and B parameters take care that any cables used for measurements are of equal length and equal loss. Interrogate channel A only, while monitoring channel A and B. At signal level MTL +3 dB use the following types of interrogations and record the listed observations:",
    "ATCRBS Mode A.  \n \n \nATCRBS Mode C. For signal levels of -50 dBm and -21 dBm use an ATCRBS Mode C and record the listed observations. Observe: \nCorrect reply ratio.",
    "|                      |                                                                   | Correct reply channel.                             |\n|----------------------|-------------------------------------------------------------------|----------------------------------------------------|\n|                      |                                                                   | Power level of replies from channel A (§2.2.13.3). |",
    "|                      |                                                                   | Power level of replies from channel B (§2.2.13.3). |\n|                      |                                                                   |                                                    |\n| Record:              | Reply delay for each interrogation signal type and for the signal |                                                    |",
    "| levels as specified. |                                                                   |                                                    |",
    "Repeat the above test reversing channels. Compare records of reply delays for conformance with §2.2.13.4. \n(2) \nSelection Test (See §2.2.13.1)  \n \nSynchronize the interrogations to channels A and B so that they are 0.125",
    "+0.00/-0.04 microseconds apart where channel A is first. Use an ATCRBS Mode C at a power level on channel A of MTL and a power level on channel B of MTL +3 dB. Observe that 90 percent of the replies are on channel B. Use an ATCRBS Mode C at a power level on channel A of MTL +3 dB and a power level on channel B of MTL. Observe that 90 percent of the replies are on channel A. Synchronize the interrogations to channels A and B so that they are 0.125 +0.00/-0.04 microseconds apart where channel B",
    "to channels A and B so that they are 0.125 +0.00/-0.04 microseconds apart where channel B is first. Use an ATCRBS Mode C at a power level on channel A of MTL and a power level on channel B of MTL +3 dB. Observe that 90 percent of the replies are on channel B. Use an ATCRBS Mode C at a power level on channel A of MTL +3 dB and a power level on channel B of MTL. Observe that 90 percent of the replies are on channel A.",
    "(3) \nDelay-Selection Test (See §2.2.13.2)  \nSynchronize the interrogations to channels A and B so that they are 0.375 +.040/-0.00 microseconds apart where channel A is first. Use an ATCRBS Mode C at a power level on channel A of MTL +3 and a power level on channel B of -50 dBm.",
    "Observe that 90 percent of the replies are on channel A. Synchronize the interrogations to channels A and B so that they are 0.375 +0.040/-0.00 microseconds apart where channel B is first. Use an ATCRBS Mode C at a power level on channel A of -50 dBm and a power level on channel B of MTL +3. Observe that 90 percent of the replies are on channel B.  \n \n\n## 3 Installed Equipment Performance",
    "This section states the minimum acceptable level of performance for the equipment when installed in the aircraft.  For the most part, installed performance requirements are the same as those contained in Section 2, which were verified through bench and environmental test.  However, certain requirements may be affected by the physical installation (e.g., antenna patterns, receiver sensitivity, etc.) and can only be verified after installation.  The installed performance limits stated below take",
    "and can only be verified after installation.  The installed performance limits stated below take in consideration these situations.",
    "## 3.1 Equipment Installation",
    "The airborne ATC transponder system should have been installed in the aircraft by the use of acceptable workmanship and engineering practices in an airworthy manner, and in accordance with the equipment manufacturer's recommendations as set forth in his equipment installation manual or other appropriate publication.  To assure that the airborne ATC transponder system has been properly and safely installed in the aircraft, make a thorough visual inspection thereof and conduct a gross over-all",
    "installed in the aircraft, make a thorough visual inspection thereof and conduct a gross over-all operational/functional check of the system on the ground prior to flight.",
    "## 3.1.1 Equipment Accessibility\n\nEquipment controls and display(s) installed for in-flight operation **shall** be readily accessible from the normal seated position.  The appropriate operator/crew members(s) \nshall have an unobstructed view of the display(s) when in the normal sitting position. \n\n \n\n## 3.1.2 Inadvertent Turn Off\n\nAppropriate controls **shall** be provided with adequate protection against inadvertent turn off.   \n\n \n\n## 3.1.3 Displays",
    "## 3.1.3 Displays\n\nAll installed system displays **shall** be readily visible and readable from the crew member's normal position in all ambient lighting conditions for which system use is required. \n\nNote: Visors, glareshields or filters may be an acceptable means of obtaining daylight \nvisibility. \n \n\n## 3.1.4 Aircraft Power Source",
    "## 3.1.4 Aircraft Power Source\n\nThe voltage and voltage tolerance characteristics of the equipment **shall** be compatible with the aircraft power source of appropriate category as specified in RTCA/DO-160(). \n\n## 3.1.5 Transmission Line(S)\n\nThe transmission line(s) connecting antenna(s) and transponder(s) **shall** have impedance, power handling and loss characteristics in accordance with the equipment manufacturer's specifications. \n\n## 3.1.6 Antenna Location",
    "## 3.1.6 Antenna Location\n\na. \nSingle Antenna \nThe antenna **shall** be installed on the bottom of the aircraft as close to the longitudinal axis of the aircraft as possible. \n\nb.  \nDiversity Transponder Installation \nThe top and bottom antennas **shall** be mounted as near as possible to the center line of the fuselage.  Antennas **shall** be located so as to minimize obstruction to their fields in the horizontal plane.",
    "Recommendation: The horizontal distance between the top and bottom antennas should \nnot be greater than 7.6 meters.  \nNote: This recommendation is intended to support the operation of any diversity transponder (including cables) with any diversity antenna installation and still satisfy the requirement of §3.1.6 c.",
    "c. \nReply Delay of Diversity Transponders.",
    "The total two-way transmission difference in mean reply delay between the two antenna channels (including the differential delay caused by transponder-toantenna cables and the horizontal distance along the aircraft centerline between the two antennas) **shall** not exceed 0.130 microseconds for interrogations of equal amplitude.  This requirement **shall** hold for interrogation signal strengths between MTL +3 dB and -21 dBm.  The jitter requirements on each individual channel **shall** remain",
    "between MTL +3 dB and -21 dBm.  The jitter requirements on each individual channel **shall** remain as specified for non-diversity transponders (see §2.2.4.6).",
    "Note: This requirement limits the total apparent jitter caused by antenna switching and by cable and antenna location delay differences.",
    "## 3.1.7 Mutual Suppression\n\nIf other equipment is installed in the aircraft operating at or near 1030 and 1090 MHz, such as DME, the need for mutual suppression **shall** be determined.  When mutual suppression is used, the requirements of §2.2.9 **shall** be met. \n\n## 3.2 Conditions Of Test\n\nThe conditions of test stated in the following subparagraphs are applicable to the equipment tests specified in Subsection §3.3.  Ground tests may be used for all tests specified.",
    "## 3.2.1 Power Input\n\nTests may be conducted using either the aircraft's electrical power distribution system or an appropriate external power supply. \n\n \n\n## 3.2.2 Interference Effects",
    "With the equipment energized from the aircraft's electrical power generating system, individually operate each of the other electrically operated aircraft equipment and systems to determine that no significant conducted or radiated interference exists. Evaluate all reasonable combinations of control settings and operating modes.  Operate communication and navigation equipment on at least the low, high and one mid-band frequencies.  If appropriate, repeat tests using emergency power source(s).",
    "## 3.2.3 Environment\n\nDuring the tests, the equipment shall not be subjected to environmental conditions that exceed those in RTCA/DO-160() as specified by the equipment manufacturer. \n\n \n\n## 3.2.4 Adjustment Of Equipment\n\nCircuits of the equipment under test **shall** be properly aligned and otherwise adjusted in accordance with the manufacturer's recommended practices prior to application of the specified tests. \n\n \n\n## 3.2.5 Warm-Up Period",
    "## 3.2.5 Warm-Up Period\n\nUnless otherwise specified, all tests **shall** be conducted after a warm-up period of not more than 15 minutes. \n\n \n\n## 3.2.6 Radiation Pattern\n\nThe antenna **shall** have a radiation pattern that is essentially omni-directional in the horizontal plane and have sufficient vertical beamwidth to assure proper equipment operation during normal aircraft maneuvers. \n\n \n--`,``,````,`,`,``,``,````,`````-`-`,,`,,`,`,,`---",
    "--`,``,````,`,`,``,``,````,`````-`-`,,`,,`,`,,`---\n\n## 3.3 Test Procedures For Installed Equipment Performance",
    "The test procedures set forth below are considered satisfactory in determining required installed equipment performance.  Testing requirements are stated, in a manner that will make maximum use of bench test data while limiting flight tests to those requirements which cannot be tested conveniently by other means.  Although suggested test procedures are cited, it is recognized that other methods may be preferred by the installing activity.  These alternate procedures may be used if the",
    "methods may be preferred by the installing activity.  These alternate procedures may be used if the installing activity can show that they provide at least equivalent information.  In such cases, the procedures cited herein should be used as one criterion in evaluating the acceptability of the alternate procedures. Installed equipment performance tests confirm surveillance functions. Current U.S. operating regulations require tests similar to those described herein be performed bi-annually to",
    "operating regulations require tests similar to those described herein be performed bi-annually to ensure against deterioration of performance.  Since equipment installation requires initial performance of these tests, they are included herein.",
    "## 3.3.1 Conformity Inspection\n\nVisually inspect the installed equipment to determine the use of acceptable workmanship and engineering practices.  Verify that all mechanical and electrical connections have been made properly and that the equipment has been installed and located in accordance with the manufacturer's recommendations. \n\n \n\n## 3.3.2 Bench Tests",
    "## 3.3.2 Bench Tests\n\nThe equipment **shall** have been tested and certified by the equipment manufacturer to demonstrate compliance with the minimum requirements stated in §2.4. The transponder tests required below may be conducted using portable test equipment. \n\n \n\n## 3.3.3 Reply Frequency\n\nInterrogate the installed transponder and verify that the reply frequency of the system is 1090 ±3 MHz. \n\n## 3.3.4 Framing Pulse Spacing",
    "## 3.3.4 Framing Pulse Spacing\n\nVerify that the time interval between the leading edges of the two framing pulses is 20.3 ±0.10 microseconds. \n\n \n\n## 3.3.5 Reply Codes\n\na. \nVerify that all Mode A reply pulses listed below in Table 3-1 are present.",
    "a. \nVerify that all Mode A reply pulses listed below in Table 3-1 are present.  \n\nTable 3-1: Mode A Reply Pulses \nPulse \nPosition (microseconds) \n4096 code for this pulse only \nF1 \n0.00 \n \nC1 \n1.45 \n0010 \nA1 \n2.90 \n1000 \nC2 \n4.35 \n0020 \nA2 \n5.80 \n2000 \nC4 \n7.25 \n0040 \nA4 \n8.70 \n4000 \nB1 \n11.60 \n0100 \nD1 \n13.05 \n0001 \nB2 \n14.50 \n0200 \nD2 \n15.95 \n0002 \nB4 \n17.40 \n0400 \nD4 \n18.85 \n0004 \nF2 \n20.30 \n \nSPI \n24.65",
    "b. \nInterrogate the transponder a sufficient number of times to verify that the correct 4096 code is transmitted.  Use more than one 4096 code. \n\n## 3.3.6 Pressure Altitude Transmissions",
    "## 3.3.6 Pressure Altitude Transmissions\n\na. \nVerify that the transponder response to Mode C interrogations consists only of framing pulses F1 and F2.  If complete altitude reporting capability is provided, the altitude digitizer may not be connected to the transponder at the time of the test. \nb. \nVerify that the transponder response to Mode C interrogations consists of only framing pulses F1 and F2 with the altitude switch in the \"OFF\" position. \n\n## 3.3.7 Altitude Reporting Test",
    "a. \nA sufficient number of test points **shall** be checked to ensure that the altitude \nreporting equipment and transponder perform their intended function through \ntheir entire range while ascending or descending.  Tests of each altitude code segment of the encoder (2300, 2500, 3800, 4300, 4800, 6800, 14,800 and 30,800 if available) are sufficient to ensure proper operation of each altitude code segment of the encoder. \nb.",
    "b. \nVerify that the correspondence value of the altimeter system is 125 feet or less.",
    "## 3.3.8 Reply Pulse Width\n\nVerify that the duration of the F1 and F2 pulses between the 0.5 amplitude points on the leading and trailing edge is 0.45, ±0.10 microsecond with the transponder replying on Mode A, code 0001, and code 7477. \n\n## 3.3.9 Receiver Sensitivity",
    "a. Verify that for ATCRBS interrogations the receiver sensitivity of the system at the \nantenna end of the transmission line is is nominally 71 dB below 1 milliwatt with limits between 69 and 77 dB below 1 milliwatt. \nb. The minimum triggering level (MTL) of the transponder **shall** be such that replies \nare generated to 90 percent of the interrogation signals when: (1) \nThe two pulses P1 and P3 constituting an interrogation are of equal amplitude and P2 is not detected; and  \n(2)",
    "(2) \nThe amplitude of these signals received at the antenna end of the transmission line of the transponder is nominally 71 dB below 1 milliwatt with limits between 69 and 77 dB below 1 milliwatt.",
    "Note: For this MTL requirement, a nominal 3 dB transmission line loss and an antenna performance equivalent to that of a simple quarter wave antenna are assumed.  In the event these assumed conditions do not apply, the MTL of the installed transponder system must be comparable to that of the assumed system.",
    "c. The variation of the minimum triggering level between modes **shall** not exceed 1 dB \nfor nominal pulse spacings and pulse widths. \nd. The reply characteristics **shall** apply over a received signal amplitude range between \nminimum triggering level and 50 dB above minimum triggering level. \ne. The suppression characteristics **shall** apply over a received, .signal amplitude range \nbetween 3 dB above minimum triggering level and 50 dB above minimum triggering level.",
    "## 3.3.10 Transmitter Power Output\n\na. \nVerify that transponders operating at altitudes above 15,000 feet have a peak pulse power at the antenna end of the transmission line of at least +21 dBW and \nnot more than +27 dBW. \nb. \nVerify that transponders intended for operation at altitudes not above 15,000 feet have a peak pulse power at the antenna end of the transmission line of at least +18.5 dBW and not more than +27 dBW. \n\n## 3.3.11 Diversity Antenna Installations",
    "## 3.3.11 Diversity Antenna Installations\n\nVerify that the antennas on the aircraft are no more than 7.6 meter (25 feet) apart in the horizontal plane.  The cables **shall** be essentially of equal electrical length. \n\n## 3.4 Flight Test Procedures",
    "The following test procedures provide one means of determining installed equipment performance.  Although specific test procedures are cited, it is recognized that other methods may be preferred by the installing activity.  These alternate procedures may be used if they provide at least equivalent information.  In such cases, the procedures cited herein should be used as one criterion in evaluating the acceptability of the alternate procedures.  The equipment **shall** be tested to determine",
    "the acceptability of the alternate procedures.  The equipment **shall** be tested to determine compliance with the minimum requirements stated in §2.2.  In order to meet this requirement, test results supplied by the equipment manufacturer or other proof of conformity may be accepted in lieu of bench tests performed by the installing activity. This guidance material offers examples of flight test procedures for demonstration of selected performance functions.  Flight demonstration of installed",
    "procedures for demonstration of selected performance functions.  Flight demonstration of installed performance may be required by the aircraft operator or by airworthiness inspection agencies. A schedule must be arranged with the area air traffic control facility so that a controller is available to observe the transponder reply and communicate with the test aircraft to confirm performance of the transponder. Select a test area such that line-of-sight signal propagation is assured.  Test",
    "of the transponder. Select a test area such that line-of-sight signal propagation is assured.  Test maneuvers may include standard rate turns through 360 degrees, climbs and descents so that ATC can confirm valid return through normal flight attitudes.  Verification of Ident codes selected and reported altitude response to Mode C should be checked.",
    "## 3.4.1 Ground Pre-Flight Tests\n\nThe following transponder characteristic should be determined and the performance level noted:",
    "(1) \nRandom triggering of the transponder should not exceed 30 replies per second as integrated over an interval equivalent to at least 300 random triggers, or 30",
    "seconds, whichever is less.  This should be determined with all possible interfering equipments operating in their normal manner on operational channels of maximum interference, but with the absence of bona fide transponder interrogations.  This test can be performed by using an RF detector sufficiently coupled to the antenna to count the rate of non-interrogated replies.",
    "(2) \nReceiver/Transmitter system characteristics should be assured by determining the attenuation constant of the installed coaxial transmission line and the characteristics of the antenna.  Measure the length of transmission line and refer to suitable handbooks regarding the type of coaxial cable or the transponder \nmanufacturer's equipment manual to determine the amount, of attenuation in \ndecibels.  Inspect the antenna system and carefully observe that the antenna is",
    "decibels.  Inspect the antenna system and carefully observe that the antenna is \ninstalled in accordance with the manufacturer's recommendations, and that there \nare no protrusions from the aircraft which will affect the efficiency of the antenna.  The following examples are given to empirically determine the system compliance: \nEXAMPLE #1: Effective radiated power =ERP \nERP = PT - L + GA \nWhere: \nPT \n= \nPower in dBW at the antenna terminal of the transponder.  (Refer to §2.3.2.1.14)",
    "L \n= \nTransmission Line Loss \n \nGA \n= \nAntenna gain above isotropic \n Assume the following:",
    "a) The measured transmitter power at the transponder antenna terminal is \n100 watts (+20 dBW).  The measured receiver sensitivity is -71 dBm. \nb) 10 feet of RG-8/U = 0.9 dB. c) Antenna gain is unity with respect to isotropic which results in 0 dB. \nThen: \nTransmitted ERP = 20 - 0.9 + 0 = 19.1 dBW Effective Receiver Sensitivity  = -71 + 0.9 - 0 = -70.1 dBm This example would allow the system to operate in aircraft for altitudes not exceeding 15,000 feet. \n\n## Example #2:\n\nAssume the following:",
    "## Example #2:\n\nAssume the following: \n\na) The measured transmitter power at the trans- ponder terminal is 29 \ndBW.  \nb) 33 feet of RG-8/U = 3 dB  \nc) Antenna gain is unity with respect to isotropic which results in 0 dB. \nThen: \nTransmitter ERP = 29 - 3 + 0 = 26 dBW Effective Receiver Sensitivity = -74 + 3 - 0 = -71 dBm This example would allow the system to operate in aircraft intended to operate at all altitudes.",
    "(3) \nAutomatic altitude reporting performance should be checked as follows with aircraft on the ground: (a) \nSet the altimeter normally used to maintain flight altitude to 29.92 inches of mercury (1013.2 millibars). \n(b) \nSelect 10 or more evenly-spaced altitude test points between zero (sea level) and the maximum operating altitude of the aircraft.  Test each of these test points for increasing altitude and for decreasing altitude. \n(c)",
    "(c) \nApply pressure to the static system.  If separate static systems serve altimeter and digitizer, apply identical pressures simultaneously to each. Approach each test point slowly, decreasing pressure for increasing altitude, and vice versa, until a transition to the test point value occurs in \nthe digital output.  Record the pilot's altimeter reading at the instant of \ntransition in the digitizer. \n(d)",
    "transition in the digitizer. \n(d) \nThe installation is acceptable if the altimeter normally used to maintain flight altitude corresponds with the output of the digitizer within 125 feet at each test point and within ±62 feet at not less than 70 percent of the test points.  \n(4) \nThe performance characteristics of any equipment(s) functioning external to the \ntransponder system **shall** be evaluated to determine that the algebraic cumulative",
    "transponder system **shall** be evaluated to determine that the algebraic cumulative \neffective dead time does not exceed the specified limits.",
    "## 3.4.2 Operational Flight Tests",
    "(1) \nPerform the flight test using an ATC facility and procedures.  The flight should be conducted from the airport to approximately 25 miles from the ground facility.  Put the aircraft through those maneuvers normally associated with takeoff, climb, holding procedures, descent and final approach.  Determine in the course of these maneuvers that the transponder performs its intended function and is suitable for use in the ATC system. \n--`,``,````,`,`,``,``,````,`````-`-`,,`,,`,`,,`---",
    "(2) \nIf the system includes altitude reporting and while performing (1) above, request \nATC to monitor the altitude being reported by the transponder and compare with the altimeter being used to maintain flight altitude. \n(3) \nRequest ATC to verify proper performance while operating on several different \ncodes.  Do not use codes 7700 or 7600, unless requested by ATC.",
    "codes.  Do not use codes 7700 or 7600, unless requested by ATC. \nNote: It should be recognized that some aircraft attitudes with respect to the ground station will cause momentary loss of contact.",
    "--`,``,````,`,`,``,``,````,`````-`-`,,`,,`,`,,`---\n\n## 4 Equipment Operational Performance Characteristics 4.1 Required Operational Performance Requirements\n\nTo ensure the operator that operations can be conducted safely and reliably in the expected operational environment, there are specific minimum acceptable performance requirements that **shall** be met.  The following paragraphs identify these requirements. \n\n## 4.1.1 Power Inputs",
    "## 4.1.1 Power Inputs\n\nPrior to flight, verify that the equipment is receiving primary input power necessary for proper conditions. \n\n## 4.1.2 Equipment Operating Modes\n\nThe equipment **shall** operate in each of its operating modes. \n\n## 4.1.3 Continue With Other Operational Requirements As Necessary 4.2 Test Procedures For Operational Performance Requirements",
    "Operation equipment tests may be conducted as part of normal pre-flight tests.  For those tests that can only be run in flight, procedures should be developed to perform these tests as early during the flight as possible to verify that the equipment is performing its intended function(s). \n\n## 4.2.1 Power Input\n\nWith the aircraft's electrical power generating system operating, energize the equipment and verify that electrical power is available to the equipment.",
    "## 4.2.2 Equipment Operating Modes\n\nVerify that the equipment performs its intended function(s) for each of the operating modes available to the operator. \n\n# Membership Rtca Special Committee 209 Minimum Operational Performance Standards For Air Traffic Control Radar Beacon System (Atcrbs) Airborne Equipment\n\nCo-Chairs Thomas Pagano Federal Aviation Administration  \nRobert Saffell Rockwell Collins, Inc.",
    "Co-Chairs Thomas Pagano Federal Aviation Administration  \nRobert Saffell Rockwell Collins, Inc. \n\n \nSecretary Gary Furr Engility Corporation Members: Joe Adelmann U. S. Air Force Dominic Anello DoD AIMS Program Office Mark Annee U. S. Navy Yves Audineau Rockwell Collins, Inc.",
    "Raymond Bayh BAE Systems John Berglund U. S. Navy Woody Bode Freestate Electronics David Bowen  \nEUROCAE \nWilliam Brodegard Avidyne Corp Mark Cato Air Line Pilots Association Robert Clarke Alion Science and Technology Thomas Conklin U. S. Air Force Andy Davis Trig Avionics Limited John Doughty Garmin Ltd. \n\nRobert Duffer Federal Aviation Administration Richard Eckert ITT \nDouglas Edsall U. S. Army John Fisher Jacobs Engineering Bill Flathers Sparrow-Tech Inc.",
    "Robert Grappel MIT Lincoln Lab Martin Gray Trig Avionics Limited Douglas Guetter Consultant Kevin Hallworth EASA \nRon Harris Freestate Electronics Antoine Herve DGAC, France Victor Hunsicker DoD AIMS Program Office Keegan Hurley Aviation Management Associates, Inc.",
    "Richard Jennings Federal Aviation Administration David Kerr Engility Corporation Andrew Leone Federal Aviation Administration Angela Leurs EuroAvionics Navigation System GmbH \nBrent Locher L-3 Communications Marty Lockner NARCO Avionics Roland Mallwitz DFS Deutshe Flugsicherung GmbH \nRobert Manning DCS Corporation Peter Markus Federal Aviation Administration  \nScott Moore Northern Airborne Technology Ltd. \n\nHarold Moses RTCA, Inc. \n\nTom Mulkerin Mulkerin Associates Inc.",
    "Harold Moses RTCA, Inc. \n\nTom Mulkerin Mulkerin Associates Inc. \n\nPeter Muraca Federal Aviation Administration Philippe Murat L-3 Communications, ACSS \nMiles Muramuto U. S. Air Force Jack Oehme U. S. Air Force Richard Olson Federal Aviation Administration Showkat Osman Honeywell International, Inc.",
    "Terry Pearsall Federal Aviation Administration Michael Penner Avidyne Corporation William Petruzel Federal Aviation Administration Eric Potier Eurocontrol Blane Rasch U. S. Air Force Jeffrey Robinson U. S. Air Force Andrew Rose Llanbury Consulting Christopher Rose U. S. Air Force Van Ruggles Garmin International Dean Ryan Avidyne Corporation Stuart Searight Federal Aviation Administration Gu Shimin CARERI",
    "Peter Skaves Federal Aviation Administration Charles Sloane Federal Aviation Administration Todd Smith U. S. Air Force Trevor Smith NATS Ltd.",
    "Boris Stallings U.S. Navy William Thedford Consultant, U.S. Air Force Don Walker Honeywell John Van Dongen Federal Aviation Administration Nolan Van Foeken Garmin Ltd. \n\nDon Walker  \nHoneywell International, Inc. \n\nLeo Wapelhorst Engility Corporation Paul Washleshy DoD AIMS Program Office Jeff Weeldreyer L-3 Communications, ACSS \nPhillip Woodall Raytheon Corporation Steve Yeager Raytheon Corporation Phillip Yu Avidyne Corporation \n--`,``,````,`,`,``,``,````,`````-`-`,,`,,`,`,,`---",
    "## Appendix A Ssr Automatic Pressure Altitude Transmission Code (Pulse Position Assignment)\n\n The following Table is reproduced from ICAO Annex 10, Volume IV, Appendix to Chapter 3. \n\nPULSE POSITIONS \n(0 or 1 in a pulse position denotes \nRANGE \nabsence or presence of a pulse, respectively) \nIncrements \n(Feet) \nD2 \nD4 \nA1 \nA2 \nA4 \nB1 \nB2 \nB4 \nC1 \nC2 \nC4",
    "-1 000 \n to  \n-950 \n \n0 \n0 \n0 \n0 \n0 \n0 \n0 \n0 \n0 \n1 \n0 \n-950 \n to  \n-850 \n \n0 \n0 \n0 \n0 \n0 \n0 \n0 \n0 \n1 \n1 \n0 \n-850 \n to  \n-750 \n \n0 \n0 \n0 \n0 \n0 \n0 \n0 \n0 \n1 \n0 \n0 \n-750 \n to  \n-650 \n \n0 \n0 \n0 \n0 \n0 \n0 \n0 \n1 \n1 \n0 \n0 \n-650 \n to  \n-550 \n \n0 \n0 \n0 \n0 \n0 \n0 \n0 \n1 \n1 \n1 \n0 \n-550 \n to  \n-450 \n \n0 \n0 \n0 \n0 \n0 \n0 \n0 \n1 \n0 \n1 \n0 \n-450 \n to  \n-350 \n \n0 \n0 \n0 \n0 \n0 \n0 \n0 \n1 \n0 \n1 \n1 \n-350 \n to  \n-250 \n \n0 \n0 \n0 \n0 \n0 \n0 \n0 \n1 \n0 \n0 \n1 \n-250 \n to  \n-150 \n \n0 \n0 \n0 \n0 \n0 \n0 \n1 \n1 \n0 \n0 \n1 \n-150 \n to  \n-50",
    "0 \n0 \n0 \n0 \n0 \n1 \n0 \n0 \n1 \n-250 \n to  \n-150 \n \n0 \n0 \n0 \n0 \n0 \n0 \n1 \n1 \n0 \n0 \n1 \n-150 \n to  \n-50 \n \n0 \n0 \n0 \n0 \n0 \n0 \n1 \n1 \n0 \n1 \n1 \n-50 \n to  \n50 \n \n0 \n0 \n0 \n0 \n0 \n0 \n1 \n1 \n0 \n1 \n0 \n50 \n to  \n150 \n \n0 \n0 \n0 \n0 \n0 \n0 \n1 \n1 \n1 \n1 \n0 \n150 \n to  \n250 \n \n0 \n0 \n0 \n0 \n0 \n0 \n1 \n1 \n1 \n0 \n0 \n250 \n to  \n350 \n \n0 \n0 \n0 \n0 \n0 \n0 \n1 \n0 \n1 \n0 \n0 \n350 \n to  \n450 \n \n0 \n0 \n0 \n0 \n0 \n0 \n1 \n0 \n1 \n1 \n0 \n450 \n to  \n550 \n \n0 \n0 \n0 \n0 \n0 \n0 \n1 \n0 \n0 \n1 \n0 \n550 \n to  \n650 \n \n0 \n0 \n0 \n0 \n0 \n0 \n1 \n0 \n0 \n1 \n1 \n650 \n to",
    "0 \n0 \n0 \n0 \n0 \n0 \n1 \n0 \n0 \n1 \n0 \n550 \n to  \n650 \n \n0 \n0 \n0 \n0 \n0 \n0 \n1 \n0 \n0 \n1 \n1 \n650 \n to  \n750 \n \n0 \n0 \n0 \n0 \n0 \n0 \n1 \n0 \n0 \n0 \n1 \n750 \n to  \n850 \n \n0 \n0 \n0 \n0 \n0 \n1 \n1 \n0 \n0 \n0 \n1 \n850 \n to  \n950 \n \n0 \n0 \n0 \n0 \n0 \n1 \n1 \n0 \n0 \n1 \n1 \n950 \n to  \n1 050 \n \n0 \n0 \n0 \n0 \n0 \n1 \n1 \n0 \n0 \n1 \n0 \n1 050 \n to  \n1 150 \n \n0 \n0 \n0 \n0 \n0 \n1 \n1 \n0 \n1 \n1 \n0 \n1 150 \n to  \n1 250 \n \n0 \n0 \n0 \n0 \n0 \n1 \n1 \n0 \n1 \n0 \n0 \n1 250 \n to  \n1 350 \n \n0 \n0 \n0 \n0 \n0 \n1 \n1 \n1 \n1 \n0 \n0 \n1 350 \n to  \n1 450 \n \n0 \n0 \n0 \n0 \n0 \n1 \n1",
    "1 250 \n to  \n1 350 \n \n0 \n0 \n0 \n0 \n0 \n1 \n1 \n1 \n1 \n0 \n0 \n1 350 \n to  \n1 450 \n \n0 \n0 \n0 \n0 \n0 \n1 \n1 \n1 \n1 \n1 \n0 \n1 450 \n to  \n1 550 \n \n0 \n0 \n0 \n0 \n0 \n1 \n1 \n1 \n0 \n1 \n0 \n1 550 \n to  \n1 650 \n \n0 \n0 \n0 \n0 \n0 \n1 \n1 \n1 \n0 \n1 \n1 \n1 650 \n to  \n1 750 \n \n0 \n0 \n0 \n0 \n0 \n1 \n1 \n1 \n0 \n0 \n1 \n1 750 \n to  \n1 850 \n \n0 \n0 \n0 \n0 \n0 \n1 \n0 \n1 \n0 \n0 \n1 \n1 850 \n to  \n1 950 \n \n0 \n0 \n0 \n0 \n0 \n1 \n0 \n1 \n0 \n1 \n1 \n1 950 \n to  \n2 050 \n \n0 \n0 \n0 \n0 \n0 \n1 \n0 \n1 \n0 \n1 \n0 \n2 050 \n to  \n2 150 \n \n0 \n0 \n0 \n0 \n0 \n1 \n0 \n1 \n1 \n1 \n0",
    "2 050 \n \n0 \n0 \n0 \n0 \n0 \n1 \n0 \n1 \n0 \n1 \n0 \n2 050 \n to  \n2 150 \n \n0 \n0 \n0 \n0 \n0 \n1 \n0 \n1 \n1 \n1 \n0 \n2 150 \n to  \n2 250 \n \n0 \n0 \n0 \n0 \n0 \n1 \n0 \n1 \n1 \n0 \n0 \n2 250 \n to  \n2 350 \n \n0 \n0 \n0 \n0 \n0 \n1 \n0 \n0 \n1 \n0 \n0 \n2 350 \n to  \n2 450 \n \n0 \n0 \n0 \n0 \n0 \n1 \n0 \n0 \n1 \n1 \n0 \n2 450 \n to  \n2 550 \n \n0 \n0 \n0 \n0 \n0 \n1 \n0 \n0 \n0 \n1 \n0 \n2 550 \n to  \n2 650 \n \n0 \n0 \n0 \n0 \n0 \n1 \n0 \n0 \n0 \n1 \n1 \n2 650 \n to  \n2 750 \n \n0 \n0 \n0 \n0 \n0 \n1 \n0 \n0 \n0 \n0 \n1 \nPULSE POSITIONS \n(0 or 1 in a pulse position denotes \nRANGE",
    "0 \n0 \n0 \n0 \n0 \n1 \n0 \n0 \n0 \n0 \n1 \nPULSE POSITIONS \n(0 or 1 in a pulse position denotes \nRANGE \nabsence or presence of a pulse, respectively) \nIncrements \n(Feet) \nD2 \nD4 \nA1 \nA2 \nA4 \nB1 \nB2 \nB4 \nC1 \nC2 \nC4",
    "2 750 \n to  \n2 850 \n \n0 \n0 \n0 \n0 \n1 \n1 \n0 \n0 \n0 \n0 \n1 \n2 850 \n to  \n2 950 \n \n0 \n0 \n0 \n0 \n1 \n1 \n0 \n0 \n0 \n1 \n1 \n2 950 \n to  \n3 050 \n \n0 \n0 \n0 \n0 \n1 \n1 \n0 \n0 \n0 \n1 \n0 \n3 050 \n to  \n3 150 \n \n0 \n0 \n0 \n0 \n1 \n1 \n0 \n0 \n1 \n1 \n0 \n3 150 \n to  \n3 250 \n \n0 \n0 \n0 \n0 \n1 \n1 \n0 \n0 \n1 \n0 \n0 \n3 250 \n to  \n3 350 \n \n0 \n0 \n0 \n0 \n1 \n1 \n0 \n1 \n1 \n0 \n0 \n3 350 \n to  \n3 450 \n \n0 \n0 \n0 \n0 \n1 \n1 \n0 \n1 \n1 \n1 \n0 \n3 450 \n to  \n3 550 \n \n0 \n0 \n0 \n0 \n1 \n1 \n0 \n1 \n0 \n1 \n0 \n3 550 \n to  \n3 650 \n \n0 \n0 \n0 \n0 \n1 \n1 \n0 \n1 \n0 \n1 \n1",
    "3 550 \n \n0 \n0 \n0 \n0 \n1 \n1 \n0 \n1 \n0 \n1 \n0 \n3 550 \n to  \n3 650 \n \n0 \n0 \n0 \n0 \n1 \n1 \n0 \n1 \n0 \n1 \n1 \n3 650 \n to  \n3 750 \n \n0 \n0 \n0 \n0 \n1 \n1 \n0 \n1 \n0 \n0 \n1 \n3 750 \n to  \n3 850 \n \n0 \n0 \n0 \n0 \n1 \n1 \n1 \n1 \n0 \n0 \n1 \n3 850 \n to  \n3 950 \n \n0 \n0 \n0 \n0 \n1 \n1 \n1 \n1 \n0 \n1 \n1 \n3 950 \n to  \n4 050 \n \n0 \n0 \n0 \n0 \n1 \n1 \n1 \n1 \n0 \n1 \n0 \n4 050 \n to  \n4 150 \n \n0 \n0 \n0 \n0 \n1 \n1 \n1 \n1 \n1 \n1 \n0 \n4 150 \n to  \n4 250 \n \n0 \n0 \n0 \n0 \n1 \n1 \n1 \n1 \n1 \n0 \n0 \n4 250 \n to  \n4 350 \n \n0 \n0 \n0 \n0 \n1 \n1 \n1 \n0 \n1 \n0 \n0 \n4 350 \n to",
    "0 \n0 \n0 \n1 \n1 \n1 \n1 \n1 \n0 \n0 \n4 250 \n to  \n4 350 \n \n0 \n0 \n0 \n0 \n1 \n1 \n1 \n0 \n1 \n0 \n0 \n4 350 \n to  \n4 450 \n \n0 \n0 \n0 \n0 \n1 \n1 \n1 \n0 \n1 \n1 \n0 \n4 450 \n to  \n4 550 \n \n0 \n0 \n0 \n0 \n1 \n1 \n1 \n0 \n0 \n1 \n0 \n4 550 \n to  \n4 650 \n \n0 \n0 \n0 \n0 \n1 \n1 \n1 \n0 \n0 \n1 \n1 \n4 650 \n to  \n4 750 \n \n0 \n0 \n0 \n0 \n1 \n1 \n1 \n0 \n0 \n0 \n1 \n4 750 \n to  \n4 850 \n \n0 \n0 \n0 \n0 \n1 \n0 \n1 \n0 \n0 \n0 \n1 \n4 850 \n to  \n4 950 \n \n0 \n0 \n0 \n0 \n1 \n0 \n1 \n0 \n0 \n1 \n1 \n4 950 \n to  \n5 050 \n \n0 \n0 \n0 \n0 \n1 \n0 \n1 \n0 \n0 \n1 \n0 \n5 050 \n to  \n5 150 \n \n0 \n0",
    "1 \n0 \n0 \n1 \n1 \n4 950 \n to  \n5 050 \n \n0 \n0 \n0 \n0 \n1 \n0 \n1 \n0 \n0 \n1 \n0 \n5 050 \n to  \n5 150 \n \n0 \n0 \n0 \n0 \n1 \n0 \n1 \n0 \n1 \n1 \n0 \n5 150 \n to  \n5 250 \n \n0 \n0 \n0 \n0 \n1 \n0 \n1 \n0 \n1 \n0 \n0 \n5 250 \n to  \n5 350 \n \n0 \n0 \n0 \n0 \n1 \n0 \n1 \n1 \n1 \n0 \n0 \n5 350 \n to  \n5 450 \n \n0 \n0 \n0 \n0 \n1 \n0 \n1 \n1 \n1 \n1 \n0 \n5 450 \n to  \n5 550 \n \n0 \n0 \n0 \n0 \n1 \n0 \n1 \n1 \n0 \n1 \n0 \n5 550 \n to  \n5 650 \n \n0 \n0 \n0 \n0 \n1 \n0 \n1 \n1 \n0 \n1 \n1 \n5 650 \n to  \n5 750 \n \n0 \n0 \n0 \n0 \n1 \n0 \n1 \n1 \n0 \n0 \n1 \n5 750 \n to  \n5 850 \n \n0 \n0 \n0 \n0 \n1 \n0 \n0",
    "5 650 \n to  \n5 750 \n \n0 \n0 \n0 \n0 \n1 \n0 \n1 \n1 \n0 \n0 \n1 \n5 750 \n to  \n5 850 \n \n0 \n0 \n0 \n0 \n1 \n0 \n0 \n1 \n0 \n0 \n1 \n5 850 \n to  \n5 950 \n \n0 \n0 \n0 \n0 \n1 \n0 \n0 \n1 \n0 \n1 \n1 \n5 950 \n to  \n6 050 \n \n0 \n0 \n0 \n0 \n1 \n0 \n0 \n1 \n0 \n1 \n0 \n6 050 \n to  \n6 150 \n \n0 \n0 \n0 \n0 \n1 \n0 \n0 \n1 \n1 \n1 \n0 \n6 150 \n to  \n6 250 \n \n0 \n0 \n0 \n0 \n1 \n0 \n0 \n1 \n1 \n0 \n0 \n6 250 \n to  \n6 350 \n \n0 \n0 \n0 \n0 \n1 \n0 \n0 \n0 \n1 \n0 \n0 \n6 350 \n to  \n6 450 \n \n0 \n0 \n0 \n0 \n1 \n0 \n0 \n0 \n1 \n1 \n0 \n6 450 \n to  \n6 550 \n \n0 \n0 \n0 \n0 \n1 \n0 \n0 \n0 \n0 \n1 \n0",
    "6 450 \n \n0 \n0 \n0 \n0 \n1 \n0 \n0 \n0 \n1 \n1 \n0 \n6 450 \n to  \n6 550 \n \n0 \n0 \n0 \n0 \n1 \n0 \n0 \n0 \n0 \n1 \n0 \n6 550 \n to  \n6 650 \n \n0 \n0 \n0 \n0 \n1 \n0 \n0 \n0 \n0 \n1 \n1 \n6 650 \n to  \n6 750 \n \n0 \n0 \n0 \n0 \n1 \n0 \n0 \n0 \n0 \n0 \n1 \n6 750 \n to  \n6 850 \n \n0 \n0 \n0 \n1 \n1 \n0 \n0 \n0 \n0 \n0 \n1 \n6 850 \n to  \n6 950 \n \n0 \n0 \n0 \n1 \n1 \n0 \n0 \n0 \n0 \n1 \n1 \n6 950 \n to  \n7 050 \n \n0 \n0 \n0 \n1 \n1 \n0 \n0 \n0 \n0 \n1 \n0 \n7 050 \n to  \n7 150 \n \n0 \n0 \n0 \n1 \n1 \n0 \n0 \n0 \n1 \n1 \n0 \n7 150 \n to  \n7 250 \n \n0 \n0 \n0 \n1 \n1 \n0 \n0 \n0 \n1 \n0 \n0 \n7 250 \n to",
    "0 \n0 \n1 \n1 \n0 \n0 \n0 \n1 \n1 \n0 \n7 150 \n to  \n7 250 \n \n0 \n0 \n0 \n1 \n1 \n0 \n0 \n0 \n1 \n0 \n0 \n7 250 \n to  \n7 350 \n \n0 \n0 \n0 \n1 \n1 \n0 \n0 \n1 \n1 \n0 \n0 \n7 350 \n to  \n7 450 \n \n0 \n0 \n0 \n1 \n1 \n0 \n0 \n1 \n1 \n1 \n0 \n7 450 \n to  \n7 550 \n \n0 \n0 \n0 \n1 \n1 \n0 \n0 \n1 \n0 \n1 \n0 \n7 550 \n to  \n7 650 \n \n0 \n0 \n0 \n1 \n1 \n0 \n0 \n1 \n0 \n1 \n1 \n7 650 \n to  \n7 750 \n \n0 \n0 \n0 \n1 \n1 \n0 \n0 \n1 \n0 \n0 \n1 \nPULSE POSITIONS \n(0 or 1 in a pulse position denotes \nRANGE \nabsence or presence of a pulse, respectively) \nIncrements \n(Feet) \nD2 \nD4 \nA1",
    "RANGE \nabsence or presence of a pulse, respectively) \nIncrements \n(Feet) \nD2 \nD4 \nA1 \nA2 \nA4 \nB1 \nB2 \nB4 \nC1 \nC2 \nC4",
    "7 750 \n to  \n7 850 \n \n0 \n0 \n0 \n1 \n1 \n0 \n1 \n1 \n0 \n0 \n1 \n7 850 \n to  \n7 950 \n \n0 \n0 \n0 \n1 \n1 \n0 \n1 \n1 \n0 \n1 \n1 \n7 950 \n to  \n8 050 \n \n0 \n0 \n0 \n1 \n1 \n0 \n1 \n1 \n0 \n1 \n0 \n8 050 \n to  \n8 150 \n \n0 \n0 \n0 \n1 \n1 \n0 \n1 \n1 \n1 \n1 \n0 \n8 150 \n to  \n8 250 \n \n0 \n0 \n0 \n1 \n1 \n0 \n1 \n1 \n1 \n0 \n0 \n8 250 \n to  \n8 350 \n \n0 \n0 \n0 \n1 \n1 \n0 \n1 \n0 \n1 \n0 \n0 \n8 350 \n to  \n8 450 \n \n0 \n0 \n0 \n1 \n1 \n0 \n1 \n0 \n1 \n1 \n0 \n8 450 \n to  \n8 550 \n \n0 \n0 \n0 \n1 \n1 \n0 \n1 \n0 \n0 \n1 \n0 \n8 550 \n to  \n8 650 \n \n0 \n0 \n0 \n1 \n1 \n0 \n1 \n0 \n0 \n1 \n1",
    "8 550 \n \n0 \n0 \n0 \n1 \n1 \n0 \n1 \n0 \n0 \n1 \n0 \n8 550 \n to  \n8 650 \n \n0 \n0 \n0 \n1 \n1 \n0 \n1 \n0 \n0 \n1 \n1 \n8 650 \n to  \n8 750 \n \n0 \n0 \n0 \n1 \n1 \n0 \n1 \n0 \n0 \n0 \n1 \n8 750 \n to  \n8 850 \n \n0 \n0 \n0 \n1 \n1 \n1 \n1 \n0 \n0 \n0 \n1 \n8 850 \n to  \n8 950 \n \n0 \n0 \n0 \n1 \n1 \n1 \n1 \n0 \n0 \n1 \n1 \n8 950 \n to  \n9 050 \n \n0 \n0 \n0 \n1 \n1 \n1 \n1 \n0 \n0 \n1 \n0 \n9 050 \n to  \n9 150 \n \n0 \n0 \n0 \n1 \n1 \n1 \n1 \n0 \n1 \n1 \n0 \n9 150 \n to  \n9 250 \n \n0 \n0 \n0 \n1 \n1 \n1 \n1 \n0 \n1 \n0 \n0 \n9 250 \n to  \n9 350 \n \n0 \n0 \n0 \n1 \n1 \n1 \n1 \n1 \n1 \n0 \n0 \n9 350 \n to",
    "0 \n0 \n1 \n1 \n1 \n1 \n0 \n1 \n0 \n0 \n9 250 \n to  \n9 350 \n \n0 \n0 \n0 \n1 \n1 \n1 \n1 \n1 \n1 \n0 \n0 \n9 350 \n to  \n9 450 \n \n0 \n0 \n0 \n1 \n1 \n1 \n1 \n1 \n1 \n1 \n0 \n9 450 \n to  \n9 550 \n \n0 \n0 \n0 \n1 \n1 \n1 \n1 \n1 \n0 \n1 \n0 \n9 550 \n to  \n9 650 \n \n0 \n0 \n0 \n1 \n1 \n1 \n1 \n1 \n0 \n1 \n1 \n9 650 \n to  \n9 750 \n \n0 \n0 \n0 \n1 \n1 \n1 \n1 \n1 \n0 \n0 \n1 \n9 750 \n to  \n9 850 \n \n0 \n0 \n0 \n1 \n1 \n1 \n0 \n1 \n0 \n0 \n1 \n9 850 \n to  \n9 950 \n \n0 \n0 \n0 \n1 \n1 \n1 \n0 \n1 \n0 \n1 \n1 \n9 950 \n to  10 050 \n \n0 \n0 \n0 \n1 \n1 \n1 \n0 \n1 \n0 \n1 \n0 \n10 050  to  10 150 \n \n0 \n0",
    "0 \n1 \n0 \n1 \n1 \n9 950 \n to  10 050 \n \n0 \n0 \n0 \n1 \n1 \n1 \n0 \n1 \n0 \n1 \n0 \n10 050  to  10 150 \n \n0 \n0 \n0 \n1 \n1 \n1 \n0 \n1 \n1 \n1 \n0 \n10 150  to  10 250 \n \n0 \n0 \n0 \n1 \n1 \n1 \n0 \n1 \n1 \n0 \n0 \n10 250  to  10 350 \n \n0 \n0 \n0 \n1 \n1 \n1 \n0 \n0 \n1 \n0 \n0 \n10 350  to  10 450 \n \n0 \n0 \n0 \n1 \n1 \n1 \n0 \n0 \n1 \n1 \n0 \n10 450  to  10 550 \n \n0 \n0 \n0 \n1 \n1 \n1 \n0 \n0 \n0 \n1 \n0 \n10 550  to  10 650 \n \n0 \n0 \n0 \n1 \n1 \n1 \n0 \n0 \n0 \n1 \n1 \n10 650  to  10 750 \n \n0 \n0 \n0 \n1 \n1 \n1 \n0 \n0 \n0 \n0 \n1 \n10 750  to  10 850 \n \n0 \n0 \n0 \n1 \n0 \n1 \n0",
    "10 650  to  10 750 \n \n0 \n0 \n0 \n1 \n1 \n1 \n0 \n0 \n0 \n0 \n1 \n10 750  to  10 850 \n \n0 \n0 \n0 \n1 \n0 \n1 \n0 \n0 \n0 \n0 \n1 \n10 850  to  10 950 \n \n0 \n0 \n0 \n1 \n0 \n1 \n0 \n0 \n0 \n1 \n1 \n10 950  to  11 050 \n \n0 \n0 \n0 \n1 \n0 \n1 \n0 \n0 \n0 \n1 \n0 \n11 050  to  11 150 \n \n0 \n0 \n0 \n1 \n0 \n1 \n0 \n0 \n1 \n1 \n0 \n11 150  to  11 250 \n \n0 \n0 \n0 \n1 \n0 \n1 \n0 \n0 \n1 \n0 \n0 \n11 250  to  11 350 \n \n0 \n0 \n0 \n1 \n0 \n1 \n0 \n1 \n1 \n0 \n0 \n11 350  to  11 450 \n \n0 \n0 \n0 \n1 \n0 \n1 \n0 \n1 \n1 \n1 \n0 \n11 450  to  11 550 \n \n0 \n0 \n0 \n1 \n0 \n1 \n0 \n1 \n0 \n1 \n0",
    "0 \n0 \n0 \n1 \n0 \n1 \n0 \n1 \n1 \n1 \n0 \n11 450  to  11 550 \n \n0 \n0 \n0 \n1 \n0 \n1 \n0 \n1 \n0 \n1 \n0 \n11 550  to  11 650 \n \n0 \n0 \n0 \n1 \n0 \n1 \n0 \n1 \n0 \n1 \n1 \n11 650  to  11 750 \n \n0 \n0 \n0 \n1 \n0 \n1 \n0 \n1 \n0 \n0 \n1 \n11 750  to  11 850 \n \n0 \n0 \n0 \n1 \n0 \n1 \n1 \n1 \n0 \n0 \n1 \n11 850  to  11 950 \n \n0 \n0 \n0 \n1 \n0 \n1 \n1 \n1 \n0 \n1 \n1 \n11 950  to  12 050 \n \n0 \n0 \n0 \n1 \n0 \n1 \n1 \n1 \n0 \n1 \n0 \n12 050  to  12 150 \n \n0 \n0 \n0 \n1 \n0 \n1 \n1 \n1 \n1 \n1 \n0 \n12 150  to  12 250 \n \n0 \n0 \n0 \n1 \n0 \n1 \n1 \n1 \n1 \n0 \n0 \n12 250  to  12 350 \n \n0",
    "1 \n1 \n1 \n1 \n1 \n0 \n12 150  to  12 250 \n \n0 \n0 \n0 \n1 \n0 \n1 \n1 \n1 \n1 \n0 \n0 \n12 250  to  12 350 \n \n0 \n0 \n0 \n1 \n0 \n1 \n1 \n0 \n1 \n0 \n0 \n12 350  to  12 450 \n \n0 \n0 \n0 \n1 \n0 \n1 \n1 \n0 \n1 \n1 \n0 \n12 450  to  12 550 \n \n0 \n0 \n0 \n1 \n0 \n1 \n1 \n0 \n0 \n1 \n0 \n12 550  to  12 650 \n \n0 \n0 \n0 \n1 \n0 \n1 \n1 \n0 \n0 \n1 \n1 \n12 650  to  12 750 \n \n0 \n0 \n0 \n1 \n0 \n1 \n1 \n0 \n0 \n0 \n1 \nPULSE POSITIONS \n(0 or 1 in a pulse position denotes \nRANGE \nabsence or presence of a pulse, respectively) \nIncrements \n(Feet) \nD2 \nD4 \nA1 \nA2 \nA4 \nB1",
    "RANGE \nabsence or presence of a pulse, respectively) \nIncrements \n(Feet) \nD2 \nD4 \nA1 \nA2 \nA4 \nB1 \nB2 \nB4 \nC1 \nC2 \nC4",
    "12 750  to  12 850 \n \n0 \n0 \n0 \n1 \n0 \n0 \n1 \n0 \n0 \n0 \n1 \n12 850  to  12 950 \n \n0 \n0 \n0 \n1 \n0 \n0 \n1 \n0 \n0 \n1 \n1 \n12 950  to  13 050 \n \n0 \n0 \n0 \n1 \n0 \n0 \n1 \n0 \n0 \n1 \n0 \n13 050  to  13 150 \n \n0 \n0 \n0 \n1 \n0 \n0 \n1 \n0 \n1 \n1 \n0 \n13 150  to  13 250 \n \n0 \n0 \n0 \n1 \n0 \n0 \n1 \n0 \n1 \n0 \n0 \n13 250  to  13 350 \n \n0 \n0 \n0 \n1 \n0 \n0 \n1 \n1 \n1 \n0 \n0 \n13 350  to  13 450 \n \n0 \n0 \n0 \n1 \n0 \n0 \n1 \n1 \n1 \n1 \n0 \n13 450  to  13 550 \n \n0 \n0 \n0 \n1 \n0 \n0 \n1 \n1 \n0 \n1 \n0 \n13 550  to  13 650 \n \n0 \n0 \n0 \n1 \n0 \n0 \n1 \n1 \n0 \n1 \n1",
    "0 \n0 \n0 \n1 \n0 \n0 \n1 \n1 \n0 \n1 \n0 \n13 550  to  13 650 \n \n0 \n0 \n0 \n1 \n0 \n0 \n1 \n1 \n0 \n1 \n1 \n13 650  to  13 750 \n \n0 \n0 \n0 \n1 \n0 \n0 \n1 \n1 \n0 \n0 \n1 \n13 750  to  13 850 \n \n0 \n0 \n0 \n1 \n0 \n0 \n0 \n1 \n0 \n0 \n1 \n13 850  to  13 950 \n \n0 \n0 \n0 \n1 \n0 \n0 \n0 \n1 \n0 \n1 \n1 \n13 950  to  14 050 \n \n0 \n0 \n0 \n1 \n0 \n0 \n0 \n1 \n0 \n1 \n0 \n14 050  to  14 150 \n \n0 \n0 \n0 \n1 \n0 \n0 \n0 \n1 \n1 \n1 \n0 \n14 150  to  14 250 \n \n0 \n0 \n0 \n1 \n0 \n0 \n0 \n1 \n1 \n0 \n0 \n14 250  to  14 350 \n \n0 \n0 \n0 \n1 \n0 \n0 \n0 \n0 \n1 \n0 \n0 \n14 350  to  14 450 \n \n0",
    "0 \n0 \n1 \n1 \n0 \n0 \n14 250  to  14 350 \n \n0 \n0 \n0 \n1 \n0 \n0 \n0 \n0 \n1 \n0 \n0 \n14 350  to  14 450 \n \n0 \n0 \n0 \n1 \n0 \n0 \n0 \n0 \n1 \n1 \n0 \n14 450  to  14 550 \n \n0 \n0 \n0 \n1 \n0 \n0 \n0 \n0 \n0 \n1 \n0 \n14 550  to  14 650 \n \n0 \n0 \n0 \n1 \n0 \n0 \n0 \n0 \n0 \n1 \n1 \n14 650  to  14 750 \n \n0 \n0 \n0 \n1 \n0 \n0 \n0 \n0 \n0 \n0 \n1 \n14 750  to  14 850 \n \n0 \n0 \n1 \n1 \n0 \n0 \n0 \n0 \n0 \n0 \n1 \n14 850  to  14 950 \n \n0 \n0 \n1 \n1 \n0 \n0 \n0 \n0 \n0 \n1 \n1 \n14 950  to  15 050 \n \n0 \n0 \n1 \n1 \n0 \n0 \n0 \n0 \n0 \n1 \n0 \n15 050  to  15 150 \n \n0 \n0 \n1 \n1 \n0 \n0",
    "1 \n14 950  to  15 050 \n \n0 \n0 \n1 \n1 \n0 \n0 \n0 \n0 \n0 \n1 \n0 \n15 050  to  15 150 \n \n0 \n0 \n1 \n1 \n0 \n0 \n0 \n0 \n1 \n1 \n0 \n15 150  to  15 250 \n \n0 \n0 \n1 \n1 \n0 \n0 \n0 \n0 \n1 \n0 \n0 \n15 250  to  15 350 \n \n0 \n0 \n1 \n1 \n0 \n0 \n0 \n1 \n1 \n0 \n0 \n15 350  to  15 450 \n \n0 \n0 \n1 \n1 \n0 \n0 \n0 \n1 \n1 \n1 \n0 \n15 450  to  15 550 \n \n0 \n0 \n1 \n1 \n0 \n0 \n0 \n1 \n0 \n1 \n0 \n15 550  to  15 650 \n \n0 \n0 \n1 \n1 \n0 \n0 \n0 \n1 \n0 \n1 \n1 \n15 650  to  15 750 \n \n0 \n0 \n1 \n1 \n0 \n0 \n0 \n1 \n0 \n0 \n1 \n15 750  to  15 850 \n \n0 \n0 \n1 \n1 \n0 \n0 \n1 \n1 \n0 \n0 \n1",
    "0 \n0 \n1 \n1 \n0 \n0 \n0 \n1 \n0 \n0 \n1 \n15 750  to  15 850 \n \n0 \n0 \n1 \n1 \n0 \n0 \n1 \n1 \n0 \n0 \n1 \n15 850  to  15 950 \n \n0 \n0 \n1 \n1 \n0 \n0 \n1 \n1 \n0 \n1 \n1 \n15 950  to  16 050 \n \n0 \n0 \n1 \n1 \n0 \n0 \n1 \n1 \n0 \n1 \n0 \n16 050  to  16 150 \n \n0 \n0 \n1 \n1 \n0 \n0 \n1 \n1 \n1 \n1 \n0 \n16 150  to  16 250 \n \n0 \n0 \n1 \n1 \n0 \n0 \n1 \n1 \n1 \n0 \n0 \n16 250  to  16 350 \n \n0 \n0 \n1 \n1 \n0 \n0 \n1 \n0 \n1 \n0 \n0 \n16 350  to  16 450 \n \n0 \n0 \n1 \n1 \n0 \n0 \n1 \n0 \n1 \n1 \n0 \n16 450  to  16 550 \n \n0 \n0 \n1 \n1 \n0 \n0 \n1 \n0 \n0 \n1 \n0 \n16 550  to  16 650 \n \n0",
    "0 \n1 \n0 \n1 \n1 \n0 \n16 450  to  16 550 \n \n0 \n0 \n1 \n1 \n0 \n0 \n1 \n0 \n0 \n1 \n0 \n16 550  to  16 650 \n \n0 \n0 \n1 \n1 \n0 \n0 \n1 \n0 \n0 \n1 \n1 \n16 650  to  16 750 \n \n0 \n0 \n1 \n1 \n0 \n0 \n1 \n0 \n0 \n0 \n1 \n16 750  to  16 850 \n \n0 \n0 \n1 \n1 \n0 \n1 \n1 \n0 \n0 \n0 \n1 \n16 850  to  16 950 \n \n0 \n0 \n1 \n1 \n0 \n1 \n1 \n0 \n0 \n1 \n1 \n16 950  to  17 050 \n \n0 \n0 \n1 \n1 \n0 \n1 \n1 \n0 \n0 \n1 \n0 \n17 050  to  17 150 \n \n0 \n0 \n1 \n1 \n0 \n1 \n1 \n0 \n1 \n1 \n0 \n17 150  to  17 250 \n \n0 \n0 \n1 \n1 \n0 \n1 \n1 \n0 \n1 \n0 \n0 \n17 250  to  17 350 \n \n0 \n0 \n1 \n1 \n0 \n1",
    "0 \n17 150  to  17 250 \n \n0 \n0 \n1 \n1 \n0 \n1 \n1 \n0 \n1 \n0 \n0 \n17 250  to  17 350 \n \n0 \n0 \n1 \n1 \n0 \n1 \n1 \n1 \n1 \n0 \n0 \n17 350  to  17 450 \n \n0 \n0 \n1 \n1 \n0 \n1 \n1 \n1 \n1 \n1 \n0 \n17 450  to  17 550 \n \n0 \n0 \n1 \n1 \n0 \n1 \n1 \n1 \n0 \n1 \n0 \n17 550  to  17 650 \n \n0 \n0 \n1 \n1 \n0 \n1 \n1 \n1 \n0 \n1 \n1 \n17 650  to  17 750 \n \n0 \n0 \n1 \n1 \n0 \n1 \n1 \n1 \n0 \n0 \n1 \nPULSE POSITIONS \n(0 or 1 in a pulse position denotes \nRANGE \nabsence or presence of a pulse, respectively) \nIncrements \n(Feet) \nD2 \nD4 \nA1 \nA2 \nA4 \nB1 \nB2 \nB4 \nC1",
    "Increments \n(Feet) \nD2 \nD4 \nA1 \nA2 \nA4 \nB1 \nB2 \nB4 \nC1 \nC2 \nC4",
    "17 750  to  17 850 \n \n0 \n0 \n1 \n1 \n0 \n1 \n0 \n1 \n0 \n0 \n1 \n17 850  to  17 950 \n \n0 \n0 \n1 \n1 \n0 \n1 \n0 \n1 \n0 \n1 \n1 \n17 950  to  18 050 \n \n0 \n0 \n1 \n1 \n0 \n1 \n0 \n1 \n0 \n1 \n0 \n18 050  to  18 150 \n \n0 \n0 \n1 \n1 \n0 \n1 \n0 \n1 \n1 \n1 \n0 \n18 150  to  18 250 \n \n0 \n0 \n1 \n1 \n0 \n1 \n0 \n1 \n1 \n0 \n0 \n18 250  to  18 350 \n \n0 \n0 \n1 \n1 \n0 \n1 \n0 \n0 \n1 \n0 \n0 \n18 350  to  18 450 \n \n0 \n0 \n1 \n1 \n0 \n1 \n0 \n0 \n1 \n1 \n0 \n18 450  to  18 550 \n \n0 \n0 \n1 \n1 \n0 \n1 \n0 \n0 \n0 \n1 \n0 \n18 550  to  18 650 \n \n0 \n0 \n1 \n1 \n0 \n1 \n0 \n0 \n0 \n1 \n1",
    "0 \n0 \n1 \n1 \n0 \n1 \n0 \n0 \n0 \n1 \n0 \n18 550  to  18 650 \n \n0 \n0 \n1 \n1 \n0 \n1 \n0 \n0 \n0 \n1 \n1 \n18 650  to  18 750 \n \n0 \n0 \n1 \n1 \n0 \n1 \n0 \n0 \n0 \n0 \n1 \n18 750  to  18 850 \n \n0 \n0 \n1 \n1 \n1 \n1 \n0 \n0 \n0 \n0 \n1 \n18 850  to  18 950 \n \n0 \n0 \n1 \n1 \n1 \n1 \n0 \n0 \n0 \n1 \n1 \n18 950  to  19 050 \n \n0 \n0 \n1 \n1 \n1 \n1 \n0 \n0 \n0 \n1 \n0 \n19 050  to  19 150 \n \n0 \n0 \n1 \n1 \n1 \n1 \n0 \n0 \n1 \n1 \n0 \n19 150  to  19 250 \n \n0 \n0 \n1 \n1 \n1 \n1 \n0 \n0 \n1 \n0 \n0 \n19 250  to  19 350 \n \n0 \n0 \n1 \n1 \n1 \n1 \n0 \n1 \n1 \n0 \n0 \n19 350  to  19 450 \n \n0",
    "1 \n0 \n0 \n1 \n0 \n0 \n19 250  to  19 350 \n \n0 \n0 \n1 \n1 \n1 \n1 \n0 \n1 \n1 \n0 \n0 \n19 350  to  19 450 \n \n0 \n0 \n1 \n1 \n1 \n1 \n0 \n1 \n1 \n1 \n0 \n19 450  to  19 550 \n \n0 \n0 \n1 \n1 \n1 \n1 \n0 \n1 \n0 \n1 \n0 \n19 550  to  19 650 \n \n0 \n0 \n1 \n1 \n1 \n1 \n0 \n1 \n0 \n1 \n1 \n19 650  to  19 750 \n \n0 \n0 \n1 \n1 \n1 \n1 \n0 \n1 \n0 \n0 \n1 \n19 750  to  19 850 \n \n0 \n0 \n1 \n1 \n1 \n1 \n1 \n1 \n0 \n0 \n1 \n19 850  to  19 950 \n \n0 \n0 \n1 \n1 \n1 \n1 \n1 \n1 \n0 \n1 \n1 \n19 950  to  20 050 \n \n0 \n0 \n1 \n1 \n1 \n1 \n1 \n1 \n0 \n1 \n0 \n20 050  to  20 150 \n \n0 \n0 \n1 \n1 \n1 \n1",
    "1 \n19 950  to  20 050 \n \n0 \n0 \n1 \n1 \n1 \n1 \n1 \n1 \n0 \n1 \n0 \n20 050  to  20 150 \n \n0 \n0 \n1 \n1 \n1 \n1 \n1 \n1 \n1 \n1 \n0 \n20 150  to  20 250 \n \n0 \n0 \n1 \n1 \n1 \n1 \n1 \n1 \n1 \n0 \n0 \n20 250  to  20 350 \n \n0 \n0 \n1 \n1 \n1 \n1 \n1 \n0 \n1 \n0 \n0 \n20 350  to  20 450 \n \n0 \n0 \n1 \n1 \n1 \n1 \n1 \n0 \n1 \n1 \n0 \n20 450  to  20 550 \n \n0 \n0 \n1 \n1 \n1 \n1 \n1 \n0 \n0 \n1 \n0 \n20 550  to  20 650 \n \n0 \n0 \n1 \n1 \n1 \n1 \n1 \n0 \n0 \n1 \n1 \n20 650  to  20 750 \n \n0 \n0 \n1 \n1 \n1 \n1 \n1 \n0 \n0 \n0 \n1 \n20 750  to  20 850 \n \n0 \n0 \n1 \n1 \n1 \n0 \n1 \n0 \n0 \n0 \n1",
    "0 \n0 \n1 \n1 \n1 \n1 \n1 \n0 \n0 \n0 \n1 \n20 750  to  20 850 \n \n0 \n0 \n1 \n1 \n1 \n0 \n1 \n0 \n0 \n0 \n1 \n20 850  to  20 950 \n \n0 \n0 \n1 \n1 \n1 \n0 \n1 \n0 \n0 \n1 \n1 \n20 950  to  21 050 \n \n0 \n0 \n1 \n1 \n1 \n0 \n1 \n0 \n0 \n1 \n0 \n21 050  to  21 150 \n \n0 \n0 \n1 \n1 \n1 \n0 \n1 \n0 \n1 \n1 \n0 \n21 150  to  21 250 \n \n0 \n0 \n1 \n1 \n1 \n0 \n1 \n0 \n1 \n0 \n0 \n21 250  to  21 350 \n \n0 \n0 \n1 \n1 \n1 \n0 \n1 \n1 \n1 \n0 \n0 \n21 350  to  21 450 \n \n0 \n0 \n1 \n1 \n1 \n0 \n1 \n1 \n1 \n1 \n0 \n21 450  to  21 550 \n \n0 \n0 \n1 \n1 \n1 \n0 \n1 \n1 \n0 \n1 \n0 \n21 550  to  21 650 \n \n0",
    "0 \n1 \n1 \n1 \n1 \n0 \n21 450  to  21 550 \n \n0 \n0 \n1 \n1 \n1 \n0 \n1 \n1 \n0 \n1 \n0 \n21 550  to  21 650 \n \n0 \n0 \n1 \n1 \n1 \n0 \n1 \n1 \n0 \n1 \n1 \n21 650  to  21 750 \n \n0 \n0 \n1 \n1 \n1 \n0 \n1 \n1 \n0 \n0 \n1 \n21 750  to  21 850 \n \n0 \n0 \n1 \n1 \n1 \n0 \n0 \n1 \n0 \n0 \n1 \n21 850  to  21 950 \n \n0 \n0 \n1 \n1 \n1 \n0 \n0 \n1 \n0 \n1 \n1 \n21 950  to  22 050 \n \n0 \n0 \n1 \n1 \n1 \n0 \n0 \n1 \n0 \n1 \n0 \n22 050  to  22 150 \n \n0 \n0 \n1 \n1 \n1 \n0 \n0 \n1 \n1 \n1 \n0 \n22 150  to  22 250 \n \n0 \n0 \n1 \n1 \n1 \n0 \n0 \n1 \n1 \n0 \n0 \n22 250  to  22 350 \n \n0 \n0 \n1 \n1 \n1 \n0",
    "0 \n22 150  to  22 250 \n \n0 \n0 \n1 \n1 \n1 \n0 \n0 \n1 \n1 \n0 \n0 \n22 250  to  22 350 \n \n0 \n0 \n1 \n1 \n1 \n0 \n0 \n0 \n1 \n0 \n0 \n22 350  to  22 450 \n \n0 \n0 \n1 \n1 \n1 \n0 \n0 \n0 \n1 \n1 \n0 \n22 450  to  22 550 \n \n0 \n0 \n1 \n1 \n1 \n0 \n0 \n0 \n0 \n1 \n0 \n22 550  to  22 650 \n \n0 \n0 \n1 \n1 \n1 \n0 \n0 \n0 \n0 \n1 \n1 \n22 650  to  22  750  \n0 \n0 \n1 \n1 \n1 \n0 \n0 \n0 \n0 \n0 \n1 \nPULSE POSITIONS \n(0 or 1 in a pulse position denotes \nRANGE \nabsence or presence of a pulse, respectively) \nIncrements \n(Feet) \nD2 \nD4 \nA1 \nA2 \nA4 \nB1 \nB2 \nB4 \nC1",
    "Increments \n(Feet) \nD2 \nD4 \nA1 \nA2 \nA4 \nB1 \nB2 \nB4 \nC1 \nC2 \nC4",
    "22 750  to  22 850 \n \n0 \n0 \n1 \n0 \n1 \n0 \n0 \n0 \n0 \n0 \n1 \n22 850  to  22 950 \n \n0 \n0 \n1 \n0 \n1 \n0 \n0 \n0 \n0 \n1 \n1 \n22 950  to  23 050 \n \n0 \n0 \n1 \n0 \n1 \n0 \n0 \n0 \n0 \n1 \n0 \n23 050  to  23 150 \n \n0 \n0 \n1 \n0 \n1 \n0 \n0 \n0 \n1 \n1 \n0 \n23 150  to  23 250 \n \n0 \n0 \n1 \n0 \n1 \n0 \n0 \n0 \n1 \n0 \n0 \n23 250  to  23 350 \n \n0 \n0 \n1 \n0 \n1 \n0 \n0 \n1 \n1 \n0 \n0 \n23 350  to  23 450 \n \n0 \n0 \n1 \n0 \n1 \n0 \n0 \n1 \n1 \n1 \n0 \n23 450  to  23 550 \n \n0 \n0 \n1 \n0 \n1 \n0 \n0 \n1 \n0 \n1 \n0 \n23 550  to  23 650 \n \n0 \n0 \n1 \n0 \n1 \n0 \n0 \n1 \n0 \n1 \n1",
    "0 \n0 \n1 \n0 \n1 \n0 \n0 \n1 \n0 \n1 \n0 \n23 550  to  23 650 \n \n0 \n0 \n1 \n0 \n1 \n0 \n0 \n1 \n0 \n1 \n1 \n23 650  to  23 750 \n \n0 \n0 \n1 \n0 \n1 \n0 \n0 \n1 \n0 \n0 \n1 \n23 750  to  23 850 \n \n0 \n0 \n1 \n0 \n1 \n0 \n1 \n1 \n0 \n0 \n1 \n23 850  to  23 950 \n \n0 \n0 \n1 \n0 \n1 \n0 \n1 \n1 \n0 \n1 \n1 \n23 950  to  24 050 \n \n0 \n0 \n1 \n0 \n1 \n0 \n1 \n1 \n0 \n1 \n0 \n24 050  to  24 150 \n \n0 \n0 \n1 \n0 \n1 \n0 \n1 \n1 \n1 \n1 \n0 \n24 150  to  24 250 \n \n0 \n0 \n1 \n0 \n1 \n0 \n1 \n1 \n1 \n0 \n0 \n24 250  to  24 350 \n \n0 \n0 \n1 \n0 \n1 \n0 \n1 \n0 \n1 \n0 \n0 \n24 350  to  24 450 \n \n0",
    "0 \n1 \n1 \n1 \n0 \n0 \n24 250  to  24 350 \n \n0 \n0 \n1 \n0 \n1 \n0 \n1 \n0 \n1 \n0 \n0 \n24 350  to  24 450 \n \n0 \n0 \n1 \n0 \n1 \n0 \n1 \n0 \n1 \n1 \n0 \n24 450  to  24 550 \n \n0 \n0 \n1 \n0 \n1 \n0 \n1 \n0 \n0 \n1 \n0 \n24 550  to  24 650 \n \n0 \n0 \n1 \n0 \n1 \n0 \n1 \n0 \n0 \n1 \n1 \n24 650  to  24 750 \n \n0 \n0 \n1 \n0 \n1 \n0 \n1 \n0 \n0 \n0 \n1 \n24 750  to  24 850 \n \n0 \n0 \n1 \n0 \n1 \n1 \n1 \n0 \n0 \n0 \n1 \n24 850  to  24 950 \n \n0 \n0 \n1 \n0 \n1 \n1 \n1 \n0 \n0 \n1 \n1 \n24 950  to  25 050 \n \n0 \n0 \n1 \n0 \n1 \n1 \n1 \n0 \n0 \n1 \n0 \n25 050  to  25 150 \n \n0 \n0 \n1 \n0 \n1 \n1",
    "1 \n24 950  to  25 050 \n \n0 \n0 \n1 \n0 \n1 \n1 \n1 \n0 \n0 \n1 \n0 \n25 050  to  25 150 \n \n0 \n0 \n1 \n0 \n1 \n1 \n1 \n0 \n1 \n1 \n0 \n25 150  to  25 250 \n \n0 \n0 \n1 \n0 \n1 \n1 \n1 \n0 \n1 \n0 \n0 \n25 250  to  25 350 \n \n0 \n0 \n1 \n0 \n1 \n1 \n1 \n1 \n1 \n0 \n0 \n25 350  to  25 450 \n \n0 \n0 \n1 \n0 \n1 \n1 \n1 \n1 \n1 \n1 \n0 \n25 450  to  25 550 \n \n0 \n0 \n1 \n0 \n1 \n1 \n1 \n1 \n0 \n1 \n0 \n25 550  to  25 650 \n \n0 \n0 \n1 \n0 \n1 \n1 \n1 \n1 \n0 \n1 \n1 \n25 650  to  25 750 \n \n0 \n0 \n1 \n0 \n1 \n1 \n1 \n1 \n0 \n0 \n1 \n25 750  to  25 850 \n \n0 \n0 \n1 \n0 \n1 \n1 \n0 \n1 \n0 \n0 \n1",
    "0 \n0 \n1 \n0 \n1 \n1 \n1 \n1 \n0 \n0 \n1 \n25 750  to  25 850 \n \n0 \n0 \n1 \n0 \n1 \n1 \n0 \n1 \n0 \n0 \n1 \n25 850  to  25 950 \n \n0 \n0 \n1 \n0 \n1 \n1 \n0 \n1 \n0 \n1 \n1 \n25 950  to  26 050 \n \n0 \n0 \n1 \n0 \n1 \n1 \n0 \n1 \n0 \n1 \n0 \n26 050  to  26 150 \n \n0 \n0 \n1 \n0 \n1 \n1 \n0 \n1 \n1 \n1 \n0 \n26 150  to  26 250 \n \n0 \n0 \n1 \n0 \n1 \n1 \n0 \n1 \n1 \n0 \n0 \n26 250  to  26 350 \n \n0 \n0 \n1 \n0 \n1 \n1 \n0 \n0 \n1 \n0 \n0 \n26 350  to  26 450 \n \n0 \n0 \n1 \n0 \n1 \n1 \n0 \n0 \n1 \n1 \n0 \n26 450  to  26 550 \n \n0 \n0 \n1 \n0 \n1 \n1 \n0 \n0 \n0 \n1 \n0 \n26 550  to  26 650 \n \n0",
    "1 \n0 \n0 \n1 \n1 \n0 \n26 450  to  26 550 \n \n0 \n0 \n1 \n0 \n1 \n1 \n0 \n0 \n0 \n1 \n0 \n26 550  to  26 650 \n \n0 \n0 \n1 \n0 \n1 \n1 \n0 \n0 \n0 \n1 \n1 \n26 650  to  26 750 \n \n0 \n0 \n1 \n0 \n1 \n1 \n0 \n0 \n0 \n0 \n1 \n26 750  to  26 850 \n \n0 \n0 \n1 \n0 \n0 \n1 \n0 \n0 \n0 \n0 \n1 \n26 850  to  26 950 \n \n0 \n0 \n1 \n0 \n0 \n1 \n0 \n0 \n0 \n1 \n1 \n26 950  to  27 050 \n \n0 \n0 \n1 \n0 \n0 \n1 \n0 \n0 \n0 \n1 \n0 \n27 050  to  27 150 \n \n0 \n0 \n1 \n0 \n0 \n1 \n0 \n0 \n1 \n1 \n0 \n27 150  to  27 250 \n \n0 \n0 \n1 \n0 \n0 \n1 \n0 \n0 \n1 \n0 \n0 \n27 250  to  27 350 \n \n0 \n0 \n1 \n0 \n0 \n1",
    "0 \n27 150  to  27 250 \n \n0 \n0 \n1 \n0 \n0 \n1 \n0 \n0 \n1 \n0 \n0 \n27 250  to  27 350 \n \n0 \n0 \n1 \n0 \n0 \n1 \n0 \n1 \n1 \n0 \n0 \n27 350  to  27 450 \n \n0 \n0 \n1 \n0 \n0 \n1 \n0 \n1 \n1 \n1 \n0 \n27 450  to  27 550 \n \n0 \n0 \n1 \n0 \n0 \n1 \n0 \n1 \n0 \n1 \n0 \n27 550  to  27 650 \n \n0 \n0 \n1 \n0 \n0 \n1 \n0 \n1 \n0 \n1 \n1 \n27 650  to  27 750 \n \n0 \n0 \n1 \n0 \n0 \n1 \n0 \n1 \n0 \n0 \n1 \nPULSE POSITIONS \n(0 or 1 in a pulse position denotes \nRANGE \nabsence or presence of a pulse, respectively) \nIncrements \n(Feet) \nD2 \nD4 \nA1 \nA2 \nA4 \nB1 \nB2 \nB4 \nC1",
    "Increments \n(Feet) \nD2 \nD4 \nA1 \nA2 \nA4 \nB1 \nB2 \nB4 \nC1 \nC2 \nC4",
    "27 750  to  27 850 \n \n0 \n0 \n1 \n0 \n0 \n1 \n1 \n1 \n0 \n0 \n1 \n27 850  to  27 950 \n \n0 \n0 \n1 \n0 \n0 \n1 \n1 \n1 \n0 \n1 \n1 \n27 950  to  28 050 \n \n0 \n0 \n1 \n0 \n0 \n1 \n1 \n1 \n0 \n1 \n0 \n28 050  to  28 150 \n \n0 \n0 \n1 \n0 \n0 \n1 \n1 \n1 \n1 \n1 \n0 \n28 150  to  28 250 \n \n0 \n0 \n1 \n0 \n0 \n1 \n1 \n1 \n1 \n0 \n0 \n28 250  to  28 350 \n \n0 \n0 \n1 \n0 \n0 \n1 \n1 \n0 \n1 \n0 \n0 \n28 350  to  28 450 \n \n0 \n0 \n1 \n0 \n0 \n1 \n1 \n0 \n1 \n1 \n0 \n28 450  to  28 550 \n \n0 \n0 \n1 \n0 \n0 \n1 \n1 \n0 \n0 \n1 \n0 \n28 550  to  28 650 \n \n0 \n0 \n1 \n0 \n0 \n1 \n1 \n0 \n0 \n1 \n1",
    "0 \n0 \n1 \n0 \n0 \n1 \n1 \n0 \n0 \n1 \n0 \n28 550  to  28 650 \n \n0 \n0 \n1 \n0 \n0 \n1 \n1 \n0 \n0 \n1 \n1 \n28 650  to  28 750 \n \n0 \n0 \n1 \n0 \n0 \n1 \n1 \n0 \n0 \n0 \n1 \n28 750  to  28 850 \n \n0 \n0 \n1 \n0 \n0 \n0 \n1 \n0 \n0 \n0 \n1 \n28 850  to  28 950 \n \n0 \n0 \n1 \n0 \n0 \n0 \n1 \n0 \n0 \n1 \n1 \n28 950  to  29 050 \n \n0 \n0 \n1 \n0 \n0 \n0 \n1 \n0 \n0 \n1 \n0 \n29 050  to  29 150 \n \n0 \n0 \n1 \n0 \n0 \n0 \n1 \n0 \n1 \n1 \n0 \n29 150  to  29 250 \n \n0 \n0 \n1 \n0 \n0 \n0 \n1 \n0 \n1 \n0 \n0 \n29 250  to  29 350 \n \n0 \n0 \n1 \n0 \n0 \n0 \n1 \n1 \n1 \n0 \n0 \n29 350  to  29 450 \n \n0",
    "0 \n1 \n0 \n1 \n0 \n0 \n29 250  to  29 350 \n \n0 \n0 \n1 \n0 \n0 \n0 \n1 \n1 \n1 \n0 \n0 \n29 350  to  29 450 \n \n0 \n0 \n1 \n0 \n0 \n0 \n1 \n1 \n1 \n1 \n0 \n29 450  to  29 550 \n \n0 \n0 \n1 \n0 \n0 \n0 \n1 \n1 \n0 \n1 \n0 \n29 550  to  29 650 \n \n0 \n0 \n1 \n0 \n0 \n0 \n1 \n1 \n0 \n1 \n1 \n29 650  to  29 750 \n \n0 \n0 \n1 \n0 \n0 \n0 \n1 \n1 \n0 \n0 \n1 \n29 750  to  29 850 \n \n0 \n0 \n1 \n0 \n0 \n0 \n0 \n1 \n0 \n0 \n1 \n29 850  to  29 950 \n \n0 \n0 \n1 \n0 \n0 \n0 \n0 \n1 \n0 \n1 \n1 \n29 950  to  30 050 \n \n0 \n0 \n1 \n0 \n0 \n0 \n0 \n1 \n0 \n1 \n0 \n30 050  to  30 150 \n \n0 \n0 \n1 \n0 \n0 \n0",
    "1 \n29 950  to  30 050 \n \n0 \n0 \n1 \n0 \n0 \n0 \n0 \n1 \n0 \n1 \n0 \n30 050  to  30 150 \n \n0 \n0 \n1 \n0 \n0 \n0 \n0 \n1 \n1 \n1 \n0 \n30 150  to  30 250 \n \n0 \n0 \n1 \n0 \n0 \n0 \n0 \n1 \n1 \n0 \n0 \n30 250  to  30 350 \n \n0 \n0 \n1 \n0 \n0 \n0 \n0 \n0 \n1 \n0 \n0 \n30 350  to  30 450 \n \n0 \n0 \n1 \n0 \n0 \n0 \n0 \n0 \n1 \n1 \n0 \n30 450  to  30 550 \n \n0 \n0 \n1 \n0 \n0 \n0 \n0 \n0 \n0 \n1 \n0 \n30 550  to  30 650 \n \n0 \n0 \n1 \n0 \n0 \n0 \n0 \n0 \n0 \n1 \n1 \n30 650  to  30 750 \n \n0 \n0 \n1 \n0 \n0 \n0 \n0 \n0 \n0 \n0 \n1 \n30 750  to  30 850 \n \n0 \n1 \n1 \n0 \n0 \n0 \n0 \n0 \n0 \n0 \n1",
    "0 \n0 \n1 \n0 \n0 \n0 \n0 \n0 \n0 \n0 \n1 \n30 750  to  30 850 \n \n0 \n1 \n1 \n0 \n0 \n0 \n0 \n0 \n0 \n0 \n1 \n30 850  to  30 950 \n \n0 \n1 \n1 \n0 \n0 \n0 \n0 \n0 \n0 \n1 \n1 \n30 950  to  31 050 \n \n0 \n1 \n1 \n0 \n0 \n0 \n0 \n0 \n0 \n1 \n0 \n31 050  to  31 150 \n \n0 \n1 \n1 \n0 \n0 \n0 \n0 \n0 \n1 \n1 \n0 \n31 150  to  31 250 \n \n0 \n1 \n1 \n0 \n0 \n0 \n0 \n0 \n1 \n0 \n0 \n31 250  to  31 350 \n \n0 \n1 \n1 \n0 \n0 \n0 \n0 \n1 \n1 \n0 \n0 \n31 350  to  31 450 \n \n0 \n1 \n1 \n0 \n0 \n0 \n0 \n1 \n1 \n1 \n0 \n31 450  to  31 550 \n \n0 \n1 \n1 \n0 \n0 \n0 \n0 \n1 \n0 \n1 \n0 \n31 550  to  31 650 \n \n0",
    "0 \n0 \n1 \n1 \n1 \n0 \n31 450  to  31 550 \n \n0 \n1 \n1 \n0 \n0 \n0 \n0 \n1 \n0 \n1 \n0 \n31 550  to  31 650 \n \n0 \n1 \n1 \n0 \n0 \n0 \n0 \n1 \n0 \n1 \n1 \n31 650  to  31 750 \n \n0 \n1 \n1 \n0 \n0 \n0 \n0 \n1 \n0 \n0 \n1 \n31 750  to  31 850 \n \n0 \n1 \n1 \n0 \n0 \n0 \n1 \n1 \n0 \n0 \n1 \n31 850  to  31 950 \n \n0 \n1 \n1 \n0 \n0 \n0 \n1 \n1 \n0 \n1 \n1 \n31 950  to  32 050 \n \n0 \n1 \n1 \n0 \n0 \n0 \n1 \n1 \n0 \n1 \n0 \n32 050  to  32 150 \n \n0 \n1 \n1 \n0 \n0 \n0 \n1 \n1 \n1 \n1 \n0 \n32 150  to  32 250 \n \n0 \n1 \n1 \n0 \n0 \n0 \n1 \n1 \n1 \n0 \n0 \n32 250  to  32 350 \n \n0 \n1 \n1 \n0 \n0 \n0",
    "0 \n32 150  to  32 250 \n \n0 \n1 \n1 \n0 \n0 \n0 \n1 \n1 \n1 \n0 \n0 \n32 250  to  32 350 \n \n0 \n1 \n1 \n0 \n0 \n0 \n1 \n0 \n1 \n0 \n0 \n32 350  to  32 450 \n \n0 \n1 \n1 \n0 \n0 \n0 \n1 \n0 \n1 \n1 \n0 \n32 450  to  32 550 \n \n0 \n1 \n1 \n0 \n0 \n0 \n1 \n0 \n0 \n1 \n0 \n32 550  to  32 650 \n \n0 \n1 \n1 \n0 \n0 \n0 \n1 \n0 \n0 \n1 \n1 \n32 650  to  32 750 \n \n0 \n1 \n1 \n0 \n0 \n0 \n1 \n0 \n0 \n0 \n1 \nPULSE POSITIONS \n(0 or 1 in a pulse position denotes \nRANGE \nabsence or presence of a pulse, respectively) \nIncrements \n(Feet) \nD2 \nD4 \nA1 \nA2 \nA4 \nB1 \nB2 \nB4 \nC1",
    "Increments \n(Feet) \nD2 \nD4 \nA1 \nA2 \nA4 \nB1 \nB2 \nB4 \nC1 \nC2 \nC4",
    "32 750  to  32 850 \n \n0 \n1 \n1 \n0 \n0 \n1 \n1 \n0 \n0 \n0 \n1 \n32 850  to  32 950 \n \n0 \n1 \n1 \n0 \n0 \n1 \n1 \n0 \n0 \n1 \n1 \n32 950  to  33 050 \n \n0 \n1 \n1 \n0 \n0 \n1 \n1 \n0 \n0 \n1 \n0 \n33 050  to  33 150 \n \n0 \n1 \n1 \n0 \n0 \n1 \n1 \n0 \n1 \n1 \n0 \n33 150  to  33 250 \n \n0 \n1 \n1 \n0 \n0 \n1 \n1 \n0 \n1 \n0 \n0 \n33 250  to  33 350 \n \n0 \n1 \n1 \n0 \n0 \n1 \n1 \n1 \n1 \n0 \n0 \n33 350  to  33 450 \n \n0 \n1 \n1 \n0 \n0 \n1 \n1 \n1 \n1 \n1 \n0 \n33 450  to  33 550 \n \n0 \n1 \n1 \n0 \n0 \n1 \n1 \n1 \n0 \n1 \n0 \n33 550  to  33 650 \n \n0 \n1 \n1 \n0 \n0 \n1 \n1 \n1 \n0 \n1 \n1",
    "0 \n1 \n1 \n0 \n0 \n1 \n1 \n1 \n0 \n1 \n0 \n33 550  to  33 650 \n \n0 \n1 \n1 \n0 \n0 \n1 \n1 \n1 \n0 \n1 \n1 \n33 650  to  33 750 \n \n0 \n1 \n1 \n0 \n0 \n1 \n1 \n1 \n0 \n0 \n1 \n33 750  to  33 850 \n \n0 \n1 \n1 \n0 \n0 \n1 \n0 \n1 \n0 \n0 \n1 \n33 850  to  33 950 \n \n0 \n1 \n1 \n0 \n0 \n1 \n0 \n1 \n0 \n1 \n1 \n33 950  to  34 050 \n \n0 \n1 \n1 \n0 \n0 \n1 \n0 \n1 \n0 \n1 \n0 \n34 050  to  34 150 \n \n0 \n1 \n1 \n0 \n0 \n1 \n0 \n1 \n1 \n1 \n0 \n34 150  to  34 250 \n \n0 \n1 \n1 \n0 \n0 \n1 \n0 \n1 \n1 \n0 \n0 \n34 250  to  34 350 \n \n0 \n1 \n1 \n0 \n0 \n1 \n0 \n0 \n1 \n0 \n0 \n34 350  to  34 450 \n \n0",
    "1 \n0 \n1 \n1 \n0 \n0 \n34 250  to  34 350 \n \n0 \n1 \n1 \n0 \n0 \n1 \n0 \n0 \n1 \n0 \n0 \n34 350  to  34 450 \n \n0 \n1 \n1 \n0 \n0 \n1 \n0 \n0 \n1 \n1 \n0 \n34 450  to  34 550 \n \n0 \n1 \n1 \n0 \n0 \n1 \n0 \n0 \n0 \n1 \n0 \n34 550  to  34 650 \n \n0 \n1 \n1 \n0 \n0 \n1 \n0 \n0 \n0 \n1 \n1 \n34 650  to  34 750 \n \n0 \n1 \n1 \n0 \n0 \n1 \n0 \n0 \n0 \n0 \n1 \n34 750  to  34 850 \n \n0 \n1 \n1 \n0 \n1 \n1 \n0 \n0 \n0 \n0 \n1 \n34 850  to  34 950 \n \n0 \n1 \n1 \n0 \n1 \n1 \n0 \n0 \n0 \n1 \n1 \n34 950  to  35 050 \n \n0 \n1 \n1 \n0 \n1 \n1 \n0 \n0 \n0 \n1 \n0 \n35 050  to  35 150 \n \n0 \n1 \n1 \n0 \n1 \n1",
    "1 \n34 950  to  35 050 \n \n0 \n1 \n1 \n0 \n1 \n1 \n0 \n0 \n0 \n1 \n0 \n35 050  to  35 150 \n \n0 \n1 \n1 \n0 \n1 \n1 \n0 \n0 \n1 \n1 \n0 \n35 150  to  35 250 \n \n0 \n1 \n1 \n0 \n1 \n1 \n0 \n0 \n1 \n0 \n0 \n35 250  to  35 350 \n \n0 \n1 \n1 \n0 \n1 \n1 \n0 \n1 \n1 \n0 \n0 \n35 350  to  35 450 \n \n0 \n1 \n1 \n0 \n1 \n1 \n0 \n1 \n1 \n1 \n0 \n35 450  to  35 550 \n \n0 \n1 \n1 \n0 \n1 \n1 \n0 \n1 \n0 \n1 \n0 \n35 550  to  35 650 \n \n0 \n1 \n1 \n0 \n1 \n1 \n0 \n1 \n0 \n1 \n1 \n35 650  to  35 750 \n \n0 \n1 \n1 \n0 \n1 \n1 \n0 \n1 \n0 \n0 \n1 \n35 750  to  35 850 \n \n0 \n1 \n1 \n0 \n1 \n1 \n1 \n1 \n0 \n0 \n1",
    "0 \n1 \n1 \n0 \n1 \n1 \n0 \n1 \n0 \n0 \n1 \n35 750  to  35 850 \n \n0 \n1 \n1 \n0 \n1 \n1 \n1 \n1 \n0 \n0 \n1 \n35 850  to  35 950 \n \n0 \n1 \n1 \n0 \n1 \n1 \n1 \n1 \n0 \n1 \n1 \n35 950  to  36 050 \n \n0 \n1 \n1 \n0 \n1 \n1 \n1 \n1 \n0 \n1 \n0 \n36 050  to  36 150 \n \n0 \n1 \n1 \n0 \n1 \n1 \n1 \n1 \n1 \n1 \n0 \n36 150  to  36 250 \n \n0 \n1 \n1 \n0 \n1 \n1 \n1 \n1 \n1 \n0 \n0 \n36 250  to  36 350 \n \n0 \n1 \n1 \n0 \n1 \n1 \n1 \n0 \n1 \n0 \n0 \n36 350  to  36 450 \n \n0 \n1 \n1 \n0 \n1 \n1 \n1 \n0 \n1 \n1 \n0 \n36 450  to  36 550 \n \n0 \n1 \n1 \n0 \n1 \n1 \n1 \n0 \n0 \n1 \n0 \n36 550  to  36 650 \n \n0",
    "1 \n1 \n0 \n1 \n1 \n0 \n36 450  to  36 550 \n \n0 \n1 \n1 \n0 \n1 \n1 \n1 \n0 \n0 \n1 \n0 \n36 550  to  36 650 \n \n0 \n1 \n1 \n0 \n1 \n1 \n1 \n0 \n0 \n1 \n1 \n36 650  to  36 750 \n \n0 \n1 \n1 \n0 \n1 \n1 \n1 \n0 \n0 \n0 \n1 \n36 750  to  36 850 \n \n0 \n1 \n1 \n0 \n1 \n0 \n1 \n0 \n0 \n0 \n1 \n36 850  to  36 950 \n \n0 \n1 \n1 \n0 \n1 \n0 \n1 \n0 \n0 \n1 \n1 \n36 950  to  37 050 \n \n0 \n1 \n1 \n0 \n1 \n0 \n1 \n0 \n0 \n1 \n0 \n37 050  to  37 150 \n \n0 \n1 \n1 \n0 \n1 \n0 \n1 \n0 \n1 \n1 \n0 \n37 150  to  37 250 \n \n0 \n1 \n1 \n0 \n1 \n0 \n1 \n0 \n1 \n0 \n0 \n37 250  to  37 350 \n \n0 \n1 \n1 \n0 \n1 \n0",
    "0 \n37 150  to  37 250 \n \n0 \n1 \n1 \n0 \n1 \n0 \n1 \n0 \n1 \n0 \n0 \n37 250  to  37 350 \n \n0 \n1 \n1 \n0 \n1 \n0 \n1 \n1 \n1 \n0 \n0 \n37 350  to  37 450 \n \n0 \n1 \n1 \n0 \n1 \n0 \n1 \n1 \n1 \n1 \n0 \n37 450  to  37 550 \n \n0 \n1 \n1 \n0 \n1 \n0 \n1 \n1 \n0 \n1 \n0 \n37 550  to  37 650 \n \n0 \n1 \n1 \n0 \n1 \n0 \n1 \n1 \n0 \n1 \n1 \n37 650  to  37 750 \n \n0 \n1 \n1 \n0 \n1 \n0 \n1 \n1 \n0 \n0 \n1 \nPULSE POSITIONS \n(0 or 1 in a pulse position denotes \nRANGE \nabsence or presence of a pulse, respectively) \nIncrements \n(Feet) \nD2 \nD4 \nA1 \nA2 \nA4 \nB1 \nB2 \nB4 \nC1",
    "Increments \n(Feet) \nD2 \nD4 \nA1 \nA2 \nA4 \nB1 \nB2 \nB4 \nC1 \nC2 \nC4",
    "37 750  to  37 850 \n \n0 \n1 \n1 \n0 \n1 \n0 \n0 \n1 \n0 \n0 \n1 \n37 850  to  37 950 \n \n0 \n1 \n1 \n0 \n1 \n0 \n0 \n1 \n0 \n1 \n1 \n37 950  to  38 050 \n \n0 \n1 \n1 \n0 \n1 \n0 \n0 \n1 \n0 \n1 \n0 \n38 050  to  38 150 \n \n0 \n1 \n1 \n0 \n1 \n0 \n0 \n1 \n1 \n1 \n0 \n38 150  to  38 250 \n \n0 \n1 \n1 \n0 \n1 \n0 \n0 \n1 \n1 \n0 \n0 \n38 250  to  38 350 \n \n0 \n1 \n1 \n0 \n1 \n0 \n0 \n0 \n1 \n0 \n0 \n38 350  to  38 450 \n \n0 \n1 \n1 \n0 \n1 \n0 \n0 \n0 \n1 \n1 \n0 \n38 450  to  38 550 \n \n0 \n1 \n1 \n0 \n1 \n0 \n0 \n0 \n0 \n1 \n0 \n38 550  to  38 650 \n \n0 \n1 \n1 \n0 \n1 \n0 \n0 \n0 \n0 \n1 \n1",
    "0 \n1 \n1 \n0 \n1 \n0 \n0 \n0 \n0 \n1 \n0 \n38 550  to  38 650 \n \n0 \n1 \n1 \n0 \n1 \n0 \n0 \n0 \n0 \n1 \n1 \n38 650  to  38 750 \n \n0 \n1 \n1 \n0 \n1 \n0 \n0 \n0 \n0 \n0 \n1 \n38 750  to  38 850 \n \n0 \n1 \n1 \n1 \n1 \n0 \n0 \n0 \n0 \n0 \n1 \n38 850  to  38 950 \n \n0 \n1 \n1 \n1 \n1 \n0 \n0 \n0 \n0 \n1 \n1 \n38 950  to  39 050 \n \n0 \n1 \n1 \n1 \n1 \n0 \n0 \n0 \n0 \n1 \n0 \n39 050  to  39 150 \n \n0 \n1 \n1 \n1 \n1 \n0 \n0 \n0 \n1 \n1 \n0 \n39 150  to  39 250 \n \n0 \n1 \n1 \n1 \n1 \n0 \n0 \n0 \n1 \n0 \n0 \n39 250  to  39 350 \n \n0 \n1 \n1 \n1 \n1 \n0 \n0 \n1 \n1 \n0 \n0 \n39 350  to  39 450 \n \n0",
    "0 \n0 \n0 \n1 \n0 \n0 \n39 250  to  39 350 \n \n0 \n1 \n1 \n1 \n1 \n0 \n0 \n1 \n1 \n0 \n0 \n39 350  to  39 450 \n \n0 \n1 \n1 \n1 \n1 \n0 \n0 \n1 \n1 \n1 \n0 \n39 450  to  39 550 \n \n0 \n1 \n1 \n1 \n1 \n0 \n0 \n1 \n0 \n1 \n0 \n39 550  to  39 650 \n \n0 \n1 \n1 \n1 \n1 \n0 \n0 \n1 \n0 \n1 \n1 \n39 650  to  39 750 \n \n0 \n1 \n1 \n1 \n1 \n0 \n0 \n1 \n0 \n0 \n1 \n39 750  to  39 850 \n \n0 \n1 \n1 \n1 \n1 \n0 \n1 \n1 \n0 \n0 \n1 \n39 850  to  39 950 \n \n0 \n1 \n1 \n1 \n1 \n0 \n1 \n1 \n0 \n1 \n1 \n39 950  to  40 050 \n \n0 \n1 \n1 \n1 \n1 \n0 \n1 \n1 \n0 \n1 \n0 \n40 050  to  40 150 \n \n0 \n1 \n1 \n1 \n1 \n0",
    "1 \n39 950  to  40 050 \n \n0 \n1 \n1 \n1 \n1 \n0 \n1 \n1 \n0 \n1 \n0 \n40 050  to  40 150 \n \n0 \n1 \n1 \n1 \n1 \n0 \n1 \n1 \n1 \n1 \n0 \n40 150  to  40 250 \n \n0 \n1 \n1 \n1 \n1 \n0 \n1 \n1 \n1 \n0 \n0 \n40 250  to  40 350 \n \n0 \n1 \n1 \n1 \n1 \n0 \n1 \n0 \n1 \n0 \n0 \n40 350  to  40 450 \n \n0 \n1 \n1 \n1 \n1 \n0 \n1 \n0 \n1 \n1 \n0 \n40 450  to  40 550 \n \n0 \n1 \n1 \n1 \n1 \n0 \n1 \n0 \n0 \n1 \n0 \n40 550  to  40 650 \n \n0 \n1 \n1 \n1 \n1 \n0 \n1 \n0 \n0 \n1 \n1 \n40 650  to  40 750 \n \n0 \n1 \n1 \n1 \n1 \n0 \n1 \n0 \n0 \n0 \n1 \n40 750  to  40 850 \n \n0 \n1 \n1 \n1 \n1 \n1 \n1 \n0 \n0 \n0 \n1",
    "0 \n1 \n1 \n1 \n1 \n0 \n1 \n0 \n0 \n0 \n1 \n40 750  to  40 850 \n \n0 \n1 \n1 \n1 \n1 \n1 \n1 \n0 \n0 \n0 \n1 \n40 850  to  40 950 \n \n0 \n1 \n1 \n1 \n1 \n1 \n1 \n0 \n0 \n1 \n1 \n40 950  to  41 050 \n \n0 \n1 \n1 \n1 \n1 \n1 \n1 \n0 \n0 \n1 \n0 \n41 050  to  41 150 \n \n0 \n1 \n1 \n1 \n1 \n1 \n1 \n0 \n1 \n1 \n0 \n41 150  to  41 250 \n \n0 \n1 \n1 \n1 \n1 \n1 \n1 \n0 \n1 \n0 \n0 \n41 250  to  41 350 \n \n0 \n1 \n1 \n1 \n1 \n1 \n1 \n1 \n1 \n0 \n0 \n41 350  to  41 450 \n \n0 \n1 \n1 \n1 \n1 \n1 \n1 \n1 \n1 \n1 \n0 \n41 450  to  41 550 \n \n0 \n1 \n1 \n1 \n1 \n1 \n1 \n1 \n0 \n1 \n0 \n41 550  to  41 650 \n \n0",
    "1 \n1 \n1 \n1 \n1 \n0 \n41 450  to  41 550 \n \n0 \n1 \n1 \n1 \n1 \n1 \n1 \n1 \n0 \n1 \n0 \n41 550  to  41 650 \n \n0 \n1 \n1 \n1 \n1 \n1 \n1 \n1 \n0 \n1 \n1 \n41 650  to  41 750 \n \n0 \n1 \n1 \n1 \n1 \n1 \n1 \n1 \n0 \n0 \n1 \n41 750  to  41 850 \n \n0 \n1 \n1 \n1 \n1 \n1 \n0 \n1 \n0 \n0 \n1 \n41 850  to  41 950 \n \n0 \n1 \n1 \n1 \n1 \n1 \n0 \n1 \n0 \n1 \n1 \n41 950  to  42 050 \n \n0 \n1 \n1 \n1 \n1 \n1 \n0 \n1 \n0 \n1 \n0 \n42 050  to  42 150 \n \n0 \n1 \n1 \n1 \n1 \n1 \n0 \n1 \n1 \n1 \n0 \n42 150  to  42 250 \n \n0 \n1 \n1 \n1 \n1 \n1 \n0 \n1 \n1 \n0 \n0 \n42 250  to  42 350 \n \n0 \n1 \n1 \n1 \n1 \n1",
    "0 \n42 150  to  42 250 \n \n0 \n1 \n1 \n1 \n1 \n1 \n0 \n1 \n1 \n0 \n0 \n42 250  to  42 350 \n \n0 \n1 \n1 \n1 \n1 \n1 \n0 \n0 \n1 \n0 \n0 \n42 350  to  42 450 \n \n0 \n1 \n1 \n1 \n1 \n1 \n0 \n0 \n1 \n1 \n0 \n42 450  to  42 550 \n \n0 \n1 \n1 \n1 \n1 \n1 \n0 \n0 \n0 \n1 \n0 \n42 550  to  42 650 \n \n0 \n1 \n1 \n1 \n1 \n1 \n0 \n0 \n0 \n1 \n1 \n42 650  to  42 750 \n \n0 \n1 \n1 \n1 \n1 \n1 \n0 \n0 \n0 \n0 \n1 \nPULSE POSITIONS \n(0 or 1 in a pulse position denotes \nRANGE \nabsence or presence of a pulse, respectively) \nIncrements \n(Feet) \nD2 \nD4 \nA1 \nA2 \nA4 \nB1 \nB2 \nB4 \nC1",
    "Increments \n(Feet) \nD2 \nD4 \nA1 \nA2 \nA4 \nB1 \nB2 \nB4 \nC1 \nC2 \nC4",
    "42 750  to  42 850 \n \n0 \n1 \n1 \n1 \n0 \n1 \n0 \n0 \n0 \n0 \n1 \n42 850  to  42 950 \n \n0 \n1 \n1 \n1 \n0 \n1 \n0 \n0 \n0 \n1 \n1 \n42 950  to  43 050 \n \n0 \n1 \n1 \n1 \n0 \n1 \n0 \n0 \n0 \n1 \n0 \n43 050  to  43 150 \n \n0 \n1 \n1 \n1 \n0 \n1 \n0 \n0 \n1 \n1 \n0 \n43 150  to  43 250 \n \n0 \n1 \n1 \n1 \n0 \n1 \n0 \n0 \n1 \n0 \n0 \n43 250  to  43 350 \n \n0 \n1 \n1 \n1 \n0 \n1 \n0 \n1 \n1 \n0 \n0 \n43 350  to  43 450 \n \n0 \n1 \n1 \n1 \n0 \n1 \n0 \n1 \n1 \n1 \n0 \n43 450  to  43 550 \n \n0 \n1 \n1 \n1 \n0 \n1 \n0 \n1 \n0 \n1 \n0 \n43 550  to  43 650 \n \n0 \n1 \n1 \n1 \n0 \n1 \n0 \n1 \n0 \n1 \n1",
    "0 \n1 \n1 \n1 \n0 \n1 \n0 \n1 \n0 \n1 \n0 \n43 550  to  43 650 \n \n0 \n1 \n1 \n1 \n0 \n1 \n0 \n1 \n0 \n1 \n1 \n43 650  to  43 750 \n \n0 \n1 \n1 \n1 \n0 \n1 \n0 \n1 \n0 \n0 \n1 \n43 750  to  43 850 \n \n0 \n1 \n1 \n1 \n0 \n1 \n1 \n1 \n0 \n0 \n1 \n43 850  to  43 950 \n \n0 \n1 \n1 \n1 \n0 \n1 \n1 \n1 \n0 \n1 \n1 \n43 950  to  44 050 \n \n0 \n1 \n1 \n1 \n0 \n1 \n1 \n1 \n0 \n1 \n0 \n44 050  to  44 150 \n \n0 \n1 \n1 \n1 \n0 \n1 \n1 \n1 \n1 \n1 \n0 \n44 150  to  44 250 \n \n0 \n1 \n1 \n1 \n0 \n1 \n1 \n1 \n1 \n0 \n0 \n44 250  to  44 350 \n \n0 \n1 \n1 \n1 \n0 \n1 \n1 \n0 \n1 \n0 \n0 \n44 350  to  44 450 \n \n0",
    "1 \n1 \n1 \n1 \n0 \n0 \n44 250  to  44 350 \n \n0 \n1 \n1 \n1 \n0 \n1 \n1 \n0 \n1 \n0 \n0 \n44 350  to  44 450 \n \n0 \n1 \n1 \n1 \n0 \n1 \n1 \n0 \n1 \n1 \n0 \n44 450  to  44 550 \n \n0 \n1 \n1 \n1 \n0 \n1 \n1 \n0 \n0 \n1 \n0 \n44 550  to  44 650 \n \n0 \n1 \n1 \n1 \n0 \n1 \n1 \n0 \n0 \n1 \n1 \n44 650  to  44 750 \n \n0 \n1 \n1 \n1 \n0 \n1 \n1 \n0 \n0 \n0 \n1 \n44 750  to  44 850 \n \n0 \n1 \n1 \n1 \n0 \n0 \n1 \n0 \n0 \n0 \n1 \n44 850  to  44 950 \n \n0 \n1 \n1 \n1 \n0 \n0 \n1 \n0 \n0 \n1 \n1 \n44 950  to  45 050 \n \n0 \n1 \n1 \n1 \n0 \n0 \n1 \n0 \n0 \n1 \n0 \n45 050  to  45 150 \n \n0 \n1 \n1 \n1 \n0 \n0",
    "1 \n44 950  to  45 050 \n \n0 \n1 \n1 \n1 \n0 \n0 \n1 \n0 \n0 \n1 \n0 \n45 050  to  45 150 \n \n0 \n1 \n1 \n1 \n0 \n0 \n1 \n0 \n1 \n1 \n0 \n45 150  to  45 250 \n \n0 \n1 \n1 \n1 \n0 \n0 \n1 \n0 \n1 \n0 \n0 \n45 250  to  45 350 \n \n0 \n1 \n1 \n1 \n0 \n0 \n1 \n1 \n1 \n0 \n0 \n45 350  to  45 450 \n \n0 \n1 \n1 \n1 \n0 \n0 \n1 \n1 \n1 \n1 \n0 \n45 450  to  45 550 \n \n0 \n1 \n1 \n1 \n0 \n0 \n1 \n1 \n0 \n1 \n0 \n45 550  to  45 650 \n \n0 \n1 \n1 \n1 \n0 \n0 \n1 \n1 \n0 \n1 \n1 \n45 650  to  45 750 \n \n0 \n1 \n1 \n1 \n0 \n0 \n1 \n1 \n0 \n0 \n1 \n45 750  to  45 850 \n \n0 \n1 \n1 \n1 \n0 \n0 \n0 \n1 \n0 \n0 \n1",
    "0 \n1 \n1 \n1 \n0 \n0 \n1 \n1 \n0 \n0 \n1 \n45 750  to  45 850 \n \n0 \n1 \n1 \n1 \n0 \n0 \n0 \n1 \n0 \n0 \n1 \n45 850  to  45 950 \n \n0 \n1 \n1 \n1 \n0 \n0 \n0 \n1 \n0 \n1 \n1 \n45 950  to  46 050 \n \n0 \n1 \n1 \n1 \n0 \n0 \n0 \n1 \n0 \n1 \n0 \n46 050  to  46 150 \n \n0 \n1 \n1 \n1 \n0 \n0 \n0 \n1 \n1 \n1 \n0 \n46 150  to  46 250 \n \n0 \n1 \n1 \n1 \n0 \n0 \n0 \n1 \n1 \n0 \n0 \n46 250  to  46 350 \n \n0 \n1 \n1 \n1 \n0 \n0 \n0 \n0 \n1 \n0 \n0 \n46 350  to  46 450 \n \n0 \n1 \n1 \n1 \n0 \n0 \n0 \n0 \n1 \n1 \n0 \n46 450  to  46 550 \n \n0 \n1 \n1 \n1 \n0 \n0 \n0 \n0 \n0 \n1 \n0 \n46 550  to  46 650 \n \n0",
    "0 \n0 \n0 \n1 \n1 \n0 \n46 450  to  46 550 \n \n0 \n1 \n1 \n1 \n0 \n0 \n0 \n0 \n0 \n1 \n0 \n46 550  to  46 650 \n \n0 \n1 \n1 \n1 \n0 \n0 \n0 \n0 \n0 \n1 \n1 \n46 650  to  46 750 \n \n0 \n1 \n1 \n1 \n0 \n0 \n0 \n0 \n0 \n0 \n1 \n46 750  to  46 850 \n \n0 \n1 \n0 \n1 \n0 \n0 \n0 \n0 \n0 \n0 \n1 \n46 850  to  46 950 \n \n0 \n1 \n0 \n1 \n0 \n0 \n0 \n0 \n0 \n1 \n1 \n46 950  to  47 050 \n \n0 \n1 \n0 \n1 \n0 \n0 \n0 \n0 \n0 \n1 \n0 \n47 050  to  47 150 \n \n0 \n1 \n0 \n1 \n0 \n0 \n0 \n0 \n1 \n1 \n0 \n47 150  to  47 250 \n \n0 \n1 \n0 \n1 \n0 \n0 \n0 \n0 \n1 \n0 \n0 \n47 250  to  47 350 \n \n0 \n1 \n0 \n1 \n0 \n0",
    "0 \n47 150  to  47 250 \n \n0 \n1 \n0 \n1 \n0 \n0 \n0 \n0 \n1 \n0 \n0 \n47 250  to  47 350 \n \n0 \n1 \n0 \n1 \n0 \n0 \n0 \n1 \n1 \n0 \n0 \n47 350  to  47 450 \n \n0 \n1 \n0 \n1 \n0 \n0 \n0 \n1 \n1 \n1 \n0 \n47 450  to  47 550 \n \n0 \n1 \n0 \n1 \n0 \n0 \n0 \n1 \n0 \n1 \n0 \n47 550  to  47 650 \n \n0 \n1 \n0 \n1 \n0 \n0 \n0 \n1 \n0 \n1 \n1 \n47 650  to  47 750 \n \n0 \n1 \n0 \n1 \n0 \n0 \n0 \n1 \n0 \n0 \n1",
    "--`,``,````,`,`,``,``,````,`````-`-`,,`,,`,`,,`---\n\nPULSE POSITIONS \n(0 or 1 in a pulse position denotes \nRANGE \nabsence or presence of a pulse, respectively) \nIncrements \n(Feet) \nD2 \nD4 \nA1 \nA2 \nA4 \nB1 \nB2 \nB4 \nC1 \nC2 \nC4",
    "47 750  to  47 850 \n \n0 \n1 \n0 \n1 \n0 \n0 \n1 \n1 \n0 \n0 \n1 \n47 850  to  47 950 \n \n0 \n1 \n0 \n1 \n0 \n0 \n1 \n1 \n0 \n1 \n1 \n47 950  to  48 050 \n \n0 \n1 \n0 \n1 \n0 \n0 \n1 \n1 \n0 \n1 \n0 \n48 050  to  48 150 \n \n0 \n1 \n0 \n1 \n0 \n0 \n1 \n1 \n1 \n1 \n0 \n48 150  to  48 250 \n \n0 \n1 \n0 \n1 \n0 \n0 \n1 \n1 \n1 \n0 \n0 \n48 250  to  48 350 \n \n0 \n1 \n0 \n1 \n0 \n0 \n1 \n0 \n1 \n0 \n0 \n48 350  to  48 450 \n \n0 \n1 \n0 \n1 \n0 \n0 \n1 \n0 \n1 \n1 \n0 \n48 450  to  48 550 \n \n0 \n1 \n0 \n1 \n0 \n0 \n1 \n0 \n0 \n1 \n0 \n48 550  to  48 650 \n \n0 \n1 \n0 \n1 \n0 \n0 \n1 \n0 \n0 \n1 \n1",
    "0 \n1 \n0 \n1 \n0 \n0 \n1 \n0 \n0 \n1 \n0 \n48 550  to  48 650 \n \n0 \n1 \n0 \n1 \n0 \n0 \n1 \n0 \n0 \n1 \n1 \n48 650  to  48 750 \n \n0 \n1 \n0 \n1 \n0 \n0 \n1 \n0 \n0 \n0 \n1 \n48 750  to  48 850 \n \n0 \n1 \n0 \n1 \n0 \n1 \n1 \n0 \n0 \n0 \n1 \n48 850  to  48 950 \n \n0 \n1 \n0 \n1 \n0 \n1 \n1 \n0 \n0 \n1 \n1 \n48 950  to  49 050 \n \n0 \n1 \n0 \n1 \n0 \n1 \n1 \n0 \n0 \n1 \n0 \n49 050  to  49 150 \n \n0 \n1 \n0 \n1 \n0 \n1 \n1 \n0 \n1 \n1 \n0 \n49 150  to  49 250 \n \n0 \n1 \n0 \n1 \n0 \n1 \n1 \n0 \n1 \n0 \n0 \n49 250  to  49 350 \n \n0 \n1 \n0 \n1 \n0 \n1 \n1 \n1 \n1 \n0 \n0 \n49 350  to  49 450 \n \n0",
    "1 \n1 \n0 \n1 \n0 \n0 \n49 250  to  49 350 \n \n0 \n1 \n0 \n1 \n0 \n1 \n1 \n1 \n1 \n0 \n0 \n49 350  to  49 450 \n \n0 \n1 \n0 \n1 \n0 \n1 \n1 \n1 \n1 \n1 \n0 \n49 450  to  49 550 \n \n0 \n1 \n0 \n1 \n0 \n1 \n1 \n1 \n0 \n1 \n0 \n49 550  to  49 650 \n \n0 \n1 \n0 \n1 \n0 \n1 \n1 \n1 \n0 \n1 \n1 \n49 650  to  49 750 \n \n0 \n1 \n0 \n1 \n0 \n1 \n1 \n1 \n0 \n0 \n1 \n49 750  to  49 850 \n \n0 \n1 \n0 \n1 \n0 \n1 \n0 \n1 \n0 \n0 \n1 \n49 850  to  49 950 \n \n0 \n1 \n0 \n1 \n0 \n1 \n0 \n1 \n0 \n1 \n1 \n49 950  to  50 050 \n \n0 \n1 \n0 \n1 \n0 \n1 \n0 \n1 \n0 \n1 \n0 \n50 050  to  50 150 \n \n0 \n1 \n0 \n1 \n0 \n1",
    "1 \n49 950  to  50 050 \n \n0 \n1 \n0 \n1 \n0 \n1 \n0 \n1 \n0 \n1 \n0 \n50 050  to  50 150 \n \n0 \n1 \n0 \n1 \n0 \n1 \n0 \n1 \n1 \n1 \n0 \n50 150  to  50 250 \n \n0 \n1 \n0 \n1 \n0 \n1 \n0 \n1 \n1 \n0 \n0 \n50 250  to  50 350 \n \n0 \n1 \n0 \n1 \n0 \n1 \n0 \n0 \n1 \n0 \n0 \n50 350  to  50 450 \n \n0 \n1 \n0 \n1 \n0 \n1 \n0 \n0 \n1 \n1 \n0 \n50 450  to  50 550 \n \n0 \n1 \n0 \n1 \n0 \n1 \n0 \n0 \n0 \n1 \n0 \n50 550  to  50 650 \n \n0 \n1 \n0 \n1 \n0 \n1 \n0 \n0 \n0 \n1 \n1 \n50 650  to  50 750 \n \n0 \n1 \n0 \n1 \n0 \n1 \n0 \n0 \n0 \n0 \n1 \n50 750  to  50 850 \n \n0 \n1 \n0 \n1 \n1 \n1 \n0 \n0 \n0 \n0 \n1",
    "0 \n1 \n0 \n1 \n0 \n1 \n0 \n0 \n0 \n0 \n1 \n50 750  to  50 850 \n \n0 \n1 \n0 \n1 \n1 \n1 \n0 \n0 \n0 \n0 \n1 \n50 850  to  50 950 \n \n0 \n1 \n0 \n1 \n1 \n1 \n0 \n0 \n0 \n1 \n1 \n50 950  to  51 050 \n \n0 \n1 \n0 \n1 \n1 \n1 \n0 \n0 \n0 \n1 \n0 \n51 050  to  51 150 \n \n0 \n1 \n0 \n1 \n1 \n1 \n0 \n0 \n1 \n1 \n0 \n51 150  to  51 250 \n \n0 \n1 \n0 \n1 \n1 \n1 \n0 \n0 \n1 \n0 \n0 \n51 250  to  51 350 \n \n0 \n1 \n0 \n1 \n1 \n1 \n0 \n1 \n1 \n0 \n0 \n51 350  to  51 450 \n \n0 \n1 \n0 \n1 \n1 \n1 \n0 \n1 \n1 \n1 \n0 \n51 450  to  51 550 \n \n0 \n1 \n0 \n1 \n1 \n1 \n0 \n1 \n0 \n1 \n0 \n51 550  to  51 650 \n \n0",
    "1 \n0 \n1 \n1 \n1 \n0 \n51 450  to  51 550 \n \n0 \n1 \n0 \n1 \n1 \n1 \n0 \n1 \n0 \n1 \n0 \n51 550  to  51 650 \n \n0 \n1 \n0 \n1 \n1 \n1 \n0 \n1 \n0 \n1 \n1 \n51 650  to  51 750 \n \n0 \n1 \n0 \n1 \n1 \n1 \n0 \n1 \n0 \n0 \n1 \n51 750  to  51 850 \n \n0 \n1 \n0 \n1 \n1 \n1 \n1 \n1 \n0 \n0 \n1 \n51 850  to  51 950 \n \n0 \n1 \n0 \n1 \n1 \n1 \n1 \n1 \n0 \n1 \n1 \n51 950  to  52 050 \n \n0 \n1 \n0 \n1 \n1 \n1 \n1 \n1 \n0 \n1 \n0 \n52 050  to  52 150 \n \n0 \n1 \n0 \n1 \n1 \n1 \n1 \n1 \n1 \n1 \n0 \n52 150  to  52 250 \n \n0 \n1 \n0 \n1 \n1 \n1 \n1 \n1 \n1 \n0 \n0 \n52 250  to  52 350 \n \n0 \n1 \n0 \n1 \n1 \n1",
    "0 \n52 150  to  52 250 \n \n0 \n1 \n0 \n1 \n1 \n1 \n1 \n1 \n1 \n0 \n0 \n52 250  to  52 350 \n \n0 \n1 \n0 \n1 \n1 \n1 \n1 \n0 \n1 \n0 \n0 \n52 350  to  52 450 \n \n0 \n1 \n0 \n1 \n1 \n1 \n1 \n0 \n1 \n1 \n0 \n52 450  to  52 550 \n \n0 \n1 \n0 \n1 \n1 \n1 \n1 \n0 \n0 \n1 \n0 \n52 550  to  52 650 \n \n0 \n1 \n0 \n1 \n1 \n1 \n1 \n0 \n0 \n1 \n1 \n52 650  to  52 750 \n \n0 \n1 \n0 \n1 \n1 \n1 \n1 \n0 \n0 \n0 \n1 \nPULSE POSITIONS \n(0 or 1 in a pulse position denotes \nRANGE \nabsence or presence of a pulse, respectively) \nIncrements \n(Feet) \nD2 \nD4 \nA1 \nA2 \nA4 \nB1 \nB2 \nB4 \nC1",
    "Increments \n(Feet) \nD2 \nD4 \nA1 \nA2 \nA4 \nB1 \nB2 \nB4 \nC1 \nC2 \nC4",
    "52 750  to  52 850 \n \n0 \n1 \n0 \n1 \n1 \n0 \n1 \n0 \n0 \n0 \n1 \n52 850  to  52 950 \n \n0 \n1 \n0 \n1 \n1 \n0 \n1 \n0 \n0 \n1 \n1 \n52 950  to  53 050 \n \n0 \n1 \n0 \n1 \n1 \n0 \n1 \n0 \n0 \n1 \n0 \n53 050  to  53 150 \n \n0 \n1 \n0 \n1 \n1 \n0 \n1 \n0 \n1 \n1 \n0 \n53 150  to  53 250 \n \n0 \n1 \n0 \n1 \n1 \n0 \n1 \n0 \n1 \n0 \n0 \n53 250  to  53 350 \n \n0 \n1 \n0 \n1 \n1 \n0 \n1 \n1 \n1 \n0 \n0 \n53 350  to  53 450 \n \n0 \n1 \n0 \n1 \n1 \n0 \n1 \n1 \n1 \n1 \n0 \n53 450  to  53 550 \n \n0 \n1 \n0 \n1 \n1 \n0 \n1 \n1 \n0 \n1 \n0 \n53 550  to  53 650 \n \n0 \n1 \n0 \n1 \n1 \n0 \n1 \n1 \n0 \n1 \n1",
    "0 \n1 \n0 \n1 \n1 \n0 \n1 \n1 \n0 \n1 \n0 \n53 550  to  53 650 \n \n0 \n1 \n0 \n1 \n1 \n0 \n1 \n1 \n0 \n1 \n1 \n53 650  to  53 750 \n \n0 \n1 \n0 \n1 \n1 \n0 \n1 \n1 \n0 \n0 \n1 \n53 750  to  53 850 \n \n0 \n1 \n0 \n1 \n1 \n0 \n0 \n1 \n0 \n0 \n1 \n53 850  to  53 950 \n \n0 \n1 \n0 \n1 \n1 \n0 \n0 \n1 \n0 \n1 \n1 \n53 950  to  54 050 \n \n0 \n1 \n0 \n1 \n1 \n0 \n0 \n1 \n0 \n1 \n0 \n54 050  to  54 150 \n \n0 \n1 \n0 \n1 \n1 \n0 \n0 \n1 \n1 \n1 \n0 \n54 150  to  54 250 \n \n0 \n1 \n0 \n1 \n1 \n0 \n0 \n1 \n1 \n0 \n0 \n54 250  to  54 350 \n \n0 \n1 \n0 \n1 \n1 \n0 \n0 \n0 \n1 \n0 \n0 \n54 350  to  54 450 \n \n0",
    "0 \n0 \n1 \n1 \n0 \n0 \n54 250  to  54 350 \n \n0 \n1 \n0 \n1 \n1 \n0 \n0 \n0 \n1 \n0 \n0 \n54 350  to  54 450 \n \n0 \n1 \n0 \n1 \n1 \n0 \n0 \n0 \n1 \n1 \n0 \n54 450  to  54 550 \n \n0 \n1 \n0 \n1 \n1 \n0 \n0 \n0 \n0 \n1 \n0 \n54 550  to  54 650 \n \n0 \n1 \n0 \n1 \n1 \n0 \n0 \n0 \n0 \n1 \n1 \n54 650  to  54 750 \n \n0 \n1 \n0 \n1 \n1 \n0 \n0 \n0 \n0 \n0 \n1 \n54 750  to  54 850 \n \n0 \n1 \n0 \n0 \n1 \n0 \n0 \n0 \n0 \n0 \n1 \n54 850  to  54 950 \n \n0 \n1 \n0 \n0 \n1 \n0 \n0 \n0 \n0 \n1 \n1 \n54 950  to  55 050 \n \n0 \n1 \n0 \n0 \n1 \n0 \n0 \n0 \n0 \n1 \n0 \n55 050  to  55 150 \n \n0 \n1 \n0 \n0 \n1 \n0",
    "1 \n54 950  to  55 050 \n \n0 \n1 \n0 \n0 \n1 \n0 \n0 \n0 \n0 \n1 \n0 \n55 050  to  55 150 \n \n0 \n1 \n0 \n0 \n1 \n0 \n0 \n0 \n1 \n1 \n0 \n55 150  to  55 250 \n \n0 \n1 \n0 \n0 \n1 \n0 \n0 \n0 \n1 \n0 \n0 \n55 250  to  55 350 \n \n0 \n1 \n0 \n0 \n1 \n0 \n0 \n1 \n1 \n0 \n0 \n55 350  to  55 450 \n \n0 \n1 \n0 \n0 \n1 \n0 \n0 \n1 \n1 \n1 \n0 \n55 450  to  55 550 \n \n0 \n1 \n0 \n0 \n1 \n0 \n0 \n1 \n0 \n1 \n0 \n55 550  to  55 650 \n \n0 \n1 \n0 \n0 \n1 \n0 \n0 \n1 \n0 \n1 \n1 \n55 650  to  55 750 \n \n0 \n1 \n0 \n0 \n1 \n0 \n0 \n1 \n0 \n0 \n1 \n55 750  to  55 850 \n \n0 \n1 \n0 \n0 \n1 \n0 \n1 \n1 \n0 \n0 \n1",
    "0 \n1 \n0 \n0 \n1 \n0 \n0 \n1 \n0 \n0 \n1 \n55 750  to  55 850 \n \n0 \n1 \n0 \n0 \n1 \n0 \n1 \n1 \n0 \n0 \n1 \n55 850  to  55 950 \n \n0 \n1 \n0 \n0 \n1 \n0 \n1 \n1 \n0 \n1 \n1 \n55 950  to  56 050 \n \n0 \n1 \n0 \n0 \n1 \n0 \n1 \n1 \n0 \n1 \n0 \n56 050  to  56 150 \n \n0 \n1 \n0 \n0 \n1 \n0 \n1 \n1 \n1 \n1 \n0 \n56 150  to  56 250 \n \n0 \n1 \n0 \n0 \n1 \n0 \n1 \n1 \n1 \n0 \n0 \n56 250  to  56 350 \n \n0 \n1 \n0 \n0 \n1 \n0 \n1 \n0 \n1 \n0 \n0 \n56 350  to  56 450 \n \n0 \n1 \n0 \n0 \n1 \n0 \n1 \n0 \n1 \n1 \n0 \n56 450  to  56 550 \n \n0 \n1 \n0 \n0 \n1 \n0 \n1 \n0 \n0 \n1 \n0 \n56 550  to  56 650 \n \n0",
    "0 \n1 \n0 \n1 \n1 \n0 \n56 450  to  56 550 \n \n0 \n1 \n0 \n0 \n1 \n0 \n1 \n0 \n0 \n1 \n0 \n56 550  to  56 650 \n \n0 \n1 \n0 \n0 \n1 \n0 \n1 \n0 \n0 \n1 \n1 \n56 650  to  56 750 \n \n0 \n1 \n0 \n0 \n1 \n0 \n1 \n0 \n0 \n0 \n1 \n56 750  to  56 850 \n \n0 \n1 \n0 \n0 \n1 \n1 \n1 \n0 \n0 \n0 \n1 \n56 850  to  56 950 \n \n0 \n1 \n0 \n0 \n1 \n1 \n1 \n0 \n0 \n1 \n1 \n56 950  to  57 050 \n \n0 \n1 \n0 \n0 \n1 \n1 \n1 \n0 \n0 \n1 \n0 \n57 050  to  57 150 \n \n0 \n1 \n0 \n0 \n1 \n1 \n1 \n0 \n1 \n1 \n0 \n57 150  to  57 250 \n \n0 \n1 \n0 \n0 \n1 \n1 \n1 \n0 \n1 \n0 \n0 \n57 250  to  57 350 \n \n0 \n1 \n0 \n0 \n1 \n1",
    "0 \n57 150  to  57 250 \n \n0 \n1 \n0 \n0 \n1 \n1 \n1 \n0 \n1 \n0 \n0 \n57 250  to  57 350 \n \n0 \n1 \n0 \n0 \n1 \n1 \n1 \n1 \n1 \n0 \n0 \n57 350  to  57 450 \n \n0 \n1 \n0 \n0 \n1 \n1 \n1 \n1 \n1 \n1 \n0 \n57 450  to  57 550 \n \n0 \n1 \n0 \n0 \n1 \n1 \n1 \n1 \n0 \n1 \n0 \n57 550  to  57 650 \n \n0 \n1 \n0 \n0 \n1 \n1 \n1 \n1 \n0 \n1 \n1 \n57 650  to  57 750 \n \n0 \n1 \n0 \n0 \n1 \n1 \n1 \n1 \n0 \n0 \n1 \nPULSE POSITIONS \n(0 or 1 in a pulse position denotes \nRANGE \nabsence or presence of a pulse, respectively) \nIncrements \n(Feet) \nD2 \nD4 \nA1 \nA2 \nA4 \nB1 \nB2 \nB4 \nC1",
    "Increments \n(Feet) \nD2 \nD4 \nA1 \nA2 \nA4 \nB1 \nB2 \nB4 \nC1 \nC2 \nC4",
    "57 750  to  57 850 \n \n0 \n1 \n0 \n0 \n1 \n1 \n0 \n1 \n0 \n0 \n1 \n57 850  to  57 950 \n \n0 \n1 \n0 \n0 \n1 \n1 \n0 \n1 \n0 \n1 \n1 \n57 950  to  58 050 \n \n0 \n1 \n0 \n0 \n1 \n1 \n0 \n1 \n0 \n1 \n0 \n58 050  to  58 150 \n \n0 \n1 \n0 \n0 \n1 \n1 \n0 \n1 \n1 \n1 \n0 \n58 150  to  58 250 \n \n0 \n1 \n0 \n0 \n1 \n1 \n0 \n1 \n1 \n0 \n0 \n58 250  to  58 350 \n \n0 \n1 \n0 \n0 \n1 \n1 \n0 \n0 \n1 \n0 \n0 \n58 350  to  58 450 \n \n0 \n1 \n0 \n0 \n1 \n1 \n0 \n0 \n1 \n1 \n0 \n58 450  to  58 550 \n \n0 \n1 \n0 \n0 \n1 \n1 \n0 \n0 \n0 \n1 \n0 \n58 550  to  58 650 \n \n0 \n1 \n0 \n0 \n1 \n1 \n0 \n0 \n0 \n1 \n1",
    "0 \n1 \n0 \n0 \n1 \n1 \n0 \n0 \n0 \n1 \n0 \n58 550  to  58 650 \n \n0 \n1 \n0 \n0 \n1 \n1 \n0 \n0 \n0 \n1 \n1 \n58 650  to  58 750 \n \n0 \n1 \n0 \n0 \n1 \n1 \n0 \n0 \n0 \n0 \n1 \n58 750  to  58 850 \n \n0 \n1 \n0 \n0 \n0 \n1 \n0 \n0 \n0 \n0 \n1 \n58 850  to  58 950 \n \n0 \n1 \n0 \n0 \n0 \n1 \n0 \n0 \n0 \n1 \n1 \n58 950  to  59 050 \n \n0 \n1 \n0 \n0 \n0 \n1 \n0 \n0 \n0 \n1 \n0 \n59 050  to  59 150 \n \n0 \n1 \n0 \n0 \n0 \n1 \n0 \n0 \n1 \n1 \n0 \n59 150  to  59 250 \n \n0 \n1 \n0 \n0 \n0 \n1 \n0 \n0 \n1 \n0 \n0 \n59 250  to  59 350 \n \n0 \n1 \n0 \n0 \n0 \n1 \n0 \n1 \n1 \n0 \n0 \n59 350  to  59 450 \n \n0",
    "1 \n0 \n0 \n1 \n0 \n0 \n59 250  to  59 350 \n \n0 \n1 \n0 \n0 \n0 \n1 \n0 \n1 \n1 \n0 \n0 \n59 350  to  59 450 \n \n0 \n1 \n0 \n0 \n0 \n1 \n0 \n1 \n1 \n1 \n0 \n59 450  to  59 550 \n \n0 \n1 \n0 \n0 \n0 \n1 \n0 \n1 \n0 \n1 \n0 \n59 550  to  59 650 \n \n0 \n1 \n0 \n0 \n0 \n1 \n0 \n1 \n0 \n1 \n1 \n59 650  to  59 750 \n \n0 \n1 \n0 \n0 \n0 \n1 \n0 \n1 \n0 \n0 \n1 \n59 750  to  59 850 \n \n0 \n1 \n0 \n0 \n0 \n1 \n1 \n1 \n0 \n0 \n1 \n59 850  to  59 950 \n \n0 \n1 \n0 \n0 \n0 \n1 \n1 \n1 \n0 \n1 \n1 \n59 950  to  60 050 \n \n0 \n1 \n0 \n0 \n0 \n1 \n1 \n1 \n0 \n1 \n0 \n60 050  to  60 150 \n \n0 \n1 \n0 \n0 \n0 \n1",
    "1 \n59 950  to  60 050 \n \n0 \n1 \n0 \n0 \n0 \n1 \n1 \n1 \n0 \n1 \n0 \n60 050  to  60 150 \n \n0 \n1 \n0 \n0 \n0 \n1 \n1 \n1 \n1 \n1 \n0 \n60 150  to  60 250 \n \n0 \n1 \n0 \n0 \n0 \n1 \n1 \n1 \n1 \n0 \n0 \n60 250  to  60 350 \n \n0 \n1 \n0 \n0 \n0 \n1 \n1 \n0 \n1 \n0 \n0 \n60 350  to  60 450 \n \n0 \n1 \n0 \n0 \n0 \n1 \n1 \n0 \n1 \n1 \n0 \n60 450  to  60 550 \n \n0 \n1 \n0 \n0 \n0 \n1 \n1 \n0 \n0 \n1 \n0 \n60 550  to  60 650 \n \n0 \n1 \n0 \n0 \n0 \n1 \n1 \n0 \n0 \n1 \n1 \n60 650  to  60 750 \n \n0 \n1 \n0 \n0 \n0 \n1 \n1 \n0 \n0 \n0 \n1 \n60 750  to  60 850 \n \n0 \n1 \n0 \n0 \n0 \n0 \n1 \n0 \n0 \n0 \n1",
    "0 \n1 \n0 \n0 \n0 \n1 \n1 \n0 \n0 \n0 \n1 \n60 750  to  60 850 \n \n0 \n1 \n0 \n0 \n0 \n0 \n1 \n0 \n0 \n0 \n1 \n60 850  to  60 950 \n \n0 \n1 \n0 \n0 \n0 \n0 \n1 \n0 \n0 \n1 \n1 \n60 950  to  61 050 \n \n0 \n1 \n0 \n0 \n0 \n0 \n1 \n0 \n0 \n1 \n0 \n61 050  to  61 150 \n \n0 \n1 \n0 \n0 \n0 \n0 \n1 \n0 \n1 \n1 \n0 \n61 150  to  61 250 \n \n0 \n1 \n0 \n0 \n0 \n0 \n1 \n0 \n1 \n0 \n0 \n61 250  to  61 350 \n \n0 \n1 \n0 \n0 \n0 \n0 \n1 \n1 \n1 \n0 \n0 \n61 350  to  61 450 \n \n0 \n1 \n0 \n0 \n0 \n0 \n1 \n1 \n1 \n1 \n0 \n61 450  to  61 550 \n \n0 \n1 \n0 \n0 \n0 \n0 \n1 \n1 \n0 \n1 \n0 \n61 550  to  61 650 \n \n0",
    "0 \n1 \n1 \n1 \n1 \n0 \n61 450  to  61 550 \n \n0 \n1 \n0 \n0 \n0 \n0 \n1 \n1 \n0 \n1 \n0 \n61 550  to  61 650 \n \n0 \n1 \n0 \n0 \n0 \n0 \n1 \n1 \n0 \n1 \n1 \n61 650  to  61 750 \n \n0 \n1 \n0 \n0 \n0 \n0 \n1 \n1 \n0 \n0 \n1 \n61 750  to  61 850 \n \n0 \n1 \n0 \n0 \n0 \n0 \n0 \n1 \n0 \n0 \n1 \n61 850  to  61 950 \n \n0 \n1 \n0 \n0 \n0 \n0 \n0 \n1 \n0 \n1 \n1 \n61 950  to  62 050 \n \n0 \n1 \n0 \n0 \n0 \n0 \n0 \n1 \n0 \n1 \n0 \n62 050  to  62 150 \n \n0 \n1 \n0 \n0 \n0 \n0 \n0 \n1 \n1 \n1 \n0 \n62 150  to  62 250 \n \n0 \n1 \n0 \n0 \n0 \n0 \n0 \n1 \n1 \n0 \n0 \n62 250  to  62 350 \n \n0 \n1 \n0 \n0 \n0 \n0",
    "0 \n62 150  to  62 250 \n \n0 \n1 \n0 \n0 \n0 \n0 \n0 \n1 \n1 \n0 \n0 \n62 250  to  62 350 \n \n0 \n1 \n0 \n0 \n0 \n0 \n0 \n0 \n1 \n0 \n0 \n62 350  to  62 450 \n \n0 \n1 \n0 \n0 \n0 \n0 \n0 \n0 \n1 \n1 \n0 \n62 450  to  62 550 \n \n0 \n1 \n0 \n0 \n0 \n0 \n0 \n0 \n0 \n1 \n0 \n62 550  to  62 650 \n \n0 \n1 \n0 \n0 \n0 \n0 \n0 \n0 \n0 \n1 \n1 \n62 650  to  62 750 \n \n0 \n1 \n0 \n0 \n0 \n0 \n0 \n0 \n0 \n0 \n1 \nPULSE POSITIONS \n(0 or 1 in a pulse position denotes \nRANGE \nabsence or presence of a pulse, respectively) \nIncrements \n(Feet) \nD2 \nD4 \nA1 \nA2 \nA4 \nB1 \nB2 \nB4 \nC1",
    "Increments \n(Feet) \nD2 \nD4 \nA1 \nA2 \nA4 \nB1 \nB2 \nB4 \nC1 \nC2 \nC4",
    "62 750  to  62 850 \n \n1 \n1 \n0 \n0 \n0 \n0 \n0 \n0 \n0 \n0 \n1 \n62 850  to  62 950 \n \n1 \n1 \n0 \n0 \n0 \n0 \n0 \n0 \n0 \n1 \n1 \n62 950  to  63 050 \n \n1 \n1 \n0 \n0 \n0 \n0 \n0 \n0 \n0 \n1 \n0 \n63 050  to  63 150 \n \n1 \n1 \n0 \n0 \n0 \n0 \n0 \n0 \n1 \n1 \n0 \n63 150  to  63 250 \n \n1 \n1 \n0 \n0 \n0 \n0 \n0 \n0 \n1 \n0 \n0 \n63 250  to  63 350 \n \n1 \n1 \n0 \n0 \n0 \n0 \n0 \n1 \n1 \n0 \n0 \n63 350  to  63 450 \n \n1 \n1 \n0 \n0 \n0 \n0 \n0 \n1 \n1 \n1 \n0 \n63 450  to  63 550 \n \n1 \n1 \n0 \n0 \n0 \n0 \n0 \n1 \n0 \n1 \n0 \n63 550  to  63 650 \n \n1 \n1 \n0 \n0 \n0 \n0 \n0 \n1 \n0 \n1 \n1",
    "1 \n1 \n0 \n0 \n0 \n0 \n0 \n1 \n0 \n1 \n0 \n63 550  to  63 650 \n \n1 \n1 \n0 \n0 \n0 \n0 \n0 \n1 \n0 \n1 \n1 \n63 650  to  63 750 \n \n1 \n1 \n0 \n0 \n0 \n0 \n0 \n1 \n0 \n0 \n1 \n63 750  to  63 850 \n \n1 \n1 \n0 \n0 \n0 \n0 \n1 \n1 \n0 \n0 \n1 \n63 850  to  63 950 \n \n1 \n1 \n0 \n0 \n0 \n0 \n1 \n1 \n0 \n1 \n1 \n63 950  to  64 050 \n \n1 \n1 \n0 \n0 \n0 \n0 \n1 \n1 \n0 \n1 \n0 \n64 050  to  64 150 \n \n1 \n1 \n0 \n0 \n0 \n0 \n1 \n1 \n1 \n1 \n0 \n64 150  to  64 250 \n \n1 \n1 \n0 \n0 \n0 \n0 \n1 \n1 \n1 \n0 \n0 \n64 250  to  64 350 \n \n1 \n1 \n0 \n0 \n0 \n0 \n1 \n0 \n1 \n0 \n0 \n64 350  to  64 450 \n \n1",
    "0 \n1 \n1 \n1 \n0 \n0 \n64 250  to  64 350 \n \n1 \n1 \n0 \n0 \n0 \n0 \n1 \n0 \n1 \n0 \n0 \n64 350  to  64 450 \n \n1 \n1 \n0 \n0 \n0 \n0 \n1 \n0 \n1 \n1 \n0 \n64 450  to  64 550 \n \n1 \n1 \n0 \n0 \n0 \n0 \n1 \n0 \n0 \n1 \n0 \n64 550  to  64 650 \n \n1 \n1 \n0 \n0 \n0 \n0 \n1 \n0 \n0 \n1 \n1 \n64 650  to  64 750 \n \n1 \n1 \n0 \n0 \n0 \n0 \n1 \n0 \n0 \n0 \n1 \n64 750  to  64 850 \n \n1 \n1 \n0 \n0 \n0 \n1 \n1 \n0 \n0 \n0 \n1 \n64 850  to  64 950 \n \n1 \n1 \n0 \n0 \n0 \n1 \n1 \n0 \n0 \n1 \n1 \n64 950  to  65 050 \n \n1 \n1 \n0 \n0 \n0 \n1 \n1 \n0 \n0 \n1 \n0 \n65 050  to  65 150 \n \n1 \n1 \n0 \n0 \n0 \n1",
    "1 \n64 950  to  65 050 \n \n1 \n1 \n0 \n0 \n0 \n1 \n1 \n0 \n0 \n1 \n0 \n65 050  to  65 150 \n \n1 \n1 \n0 \n0 \n0 \n1 \n1 \n0 \n1 \n1 \n0 \n65 150  to  65 250 \n \n1 \n1 \n0 \n0 \n0 \n1 \n1 \n0 \n1 \n0 \n0 \n65 250  to  65 350 \n \n1 \n1 \n0 \n0 \n0 \n1 \n1 \n1 \n1 \n0 \n0 \n65 350  to  65 450 \n \n1 \n1 \n0 \n0 \n0 \n1 \n1 \n1 \n1 \n1 \n0 \n65 450  to  65 550 \n \n1 \n1 \n0 \n0 \n0 \n1 \n1 \n1 \n0 \n1 \n0 \n65 550  to  65 650 \n \n1 \n1 \n0 \n0 \n0 \n1 \n1 \n1 \n0 \n1 \n1 \n65 650  to  65 750 \n \n1 \n1 \n0 \n0 \n0 \n1 \n1 \n1 \n0 \n0 \n1 \n65 750  to  65 850 \n \n1 \n1 \n0 \n0 \n0 \n1 \n0 \n1 \n0 \n0 \n1",
    "1 \n1 \n0 \n0 \n0 \n1 \n1 \n1 \n0 \n0 \n1 \n65 750  to  65 850 \n \n1 \n1 \n0 \n0 \n0 \n1 \n0 \n1 \n0 \n0 \n1 \n65 850  to  65 950 \n \n1 \n1 \n0 \n0 \n0 \n1 \n0 \n1 \n0 \n1 \n1 \n65 950  to  66 050 \n \n1 \n1 \n0 \n0 \n0 \n1 \n0 \n1 \n0 \n1 \n0 \n66 050  to  66 150 \n \n1 \n1 \n0 \n0 \n0 \n1 \n0 \n1 \n1 \n1 \n0 \n66 150  to  66 250 \n \n1 \n1 \n0 \n0 \n0 \n1 \n0 \n1 \n1 \n0 \n0 \n66 250  to  66 350 \n \n1 \n1 \n0 \n0 \n0 \n1 \n0 \n0 \n1 \n0 \n0 \n66 350  to  66 450 \n \n1 \n1 \n0 \n0 \n0 \n1 \n0 \n0 \n1 \n1 \n0 \n66 450  to  66 550 \n \n1 \n1 \n0 \n0 \n0 \n1 \n0 \n0 \n0 \n1 \n0 \n66 550  to  66 650 \n \n1",
    "1 \n0 \n0 \n1 \n1 \n0 \n66 450  to  66 550 \n \n1 \n1 \n0 \n0 \n0 \n1 \n0 \n0 \n0 \n1 \n0 \n66 550  to  66 650 \n \n1 \n1 \n0 \n0 \n0 \n1 \n0 \n0 \n0 \n1 \n1 \n66 650  to  66 750 \n \n1 \n1 \n0 \n0 \n0 \n1 \n0 \n0 \n0 \n0 \n1 \n66 750  to  66 850 \n \n1 \n1 \n0 \n0 \n1 \n1 \n0 \n0 \n0 \n0 \n1 \n66 850  to  66 950 \n \n1 \n1 \n0 \n0 \n1 \n1 \n0 \n0 \n0 \n1 \n1 \n66 950  to  67 050 \n \n1 \n1 \n0 \n0 \n1 \n1 \n0 \n0 \n0 \n1 \n0 \n67 050  to  67 150 \n \n1 \n1 \n0 \n0 \n1 \n1 \n0 \n0 \n1 \n1 \n0 \n67 150  to  67 250 \n \n1 \n1 \n0 \n0 \n1 \n1 \n0 \n0 \n1 \n0 \n0 \n67 250  to  67 350 \n \n1 \n1 \n0 \n0 \n1 \n1",
    "0 \n67 150  to  67 250 \n \n1 \n1 \n0 \n0 \n1 \n1 \n0 \n0 \n1 \n0 \n0 \n67 250  to  67 350 \n \n1 \n1 \n0 \n0 \n1 \n1 \n0 \n1 \n1 \n0 \n0 \n67 350  to  67 450 \n \n1 \n1 \n0 \n0 \n1 \n1 \n0 \n1 \n1 \n1 \n0 \n67 450  to  67 550 \n \n1 \n1 \n0 \n0 \n1 \n1 \n0 \n1 \n0 \n1 \n0 \n67 550  to  67 650 \n \n1 \n1 \n0 \n0 \n1 \n1 \n0 \n1 \n0 \n1 \n1 \n67 650  to  67 750 \n \n1 \n1 \n0 \n0 \n1 \n1 \n0 \n1 \n0 \n0 \n1 \nPULSE POSITIONS \n(0 or 1 in a pulse position denotes \nRANGE \nabsence or presence of a pulse, respectively) \nIncrements \n(Feet) \nD2 \nD4 \nA1 \nA2 \nA4 \nB1 \nB2 \nB4 \nC1",
    "Increments \n(Feet) \nD2 \nD4 \nA1 \nA2 \nA4 \nB1 \nB2 \nB4 \nC1 \nC2 \nC4",
    "67 750  to  67 850 \n \n1 \n1 \n0 \n0 \n1 \n1 \n1 \n1 \n0 \n0 \n1 \n67 850  to  67 950 \n \n1 \n1 \n0 \n0 \n1 \n1 \n1 \n1 \n0 \n1 \n1 \n67 950  to  68 050 \n \n1 \n1 \n0 \n0 \n1 \n1 \n1 \n1 \n0 \n1 \n0 \n68 050  to  68 150 \n \n1 \n1 \n0 \n0 \n1 \n1 \n1 \n1 \n1 \n1 \n0 \n68 150  to  68 250 \n \n1 \n1 \n0 \n0 \n1 \n1 \n1 \n1 \n1 \n0 \n0 \n68 250  to  68 350 \n \n1 \n1 \n0 \n0 \n1 \n1 \n1 \n0 \n1 \n0 \n0 \n68 350  to  68 450 \n \n1 \n1 \n0 \n0 \n1 \n1 \n1 \n0 \n1 \n1 \n0 \n68 450  to  68 550 \n \n1 \n1 \n0 \n0 \n1 \n1 \n1 \n0 \n0 \n1 \n0 \n68 550  to  68 650 \n \n1 \n1 \n0 \n0 \n1 \n1 \n1 \n0 \n0 \n1 \n1",
    "1 \n1 \n0 \n0 \n1 \n1 \n1 \n0 \n0 \n1 \n0 \n68 550  to  68 650 \n \n1 \n1 \n0 \n0 \n1 \n1 \n1 \n0 \n0 \n1 \n1 \n68 650  to  68 750 \n \n1 \n1 \n0 \n0 \n1 \n1 \n1 \n0 \n0 \n0 \n1 \n68 750  to  68 850 \n \n1 \n1 \n0 \n0 \n1 \n0 \n1 \n0 \n0 \n0 \n1 \n68 850  to  68 950 \n \n1 \n1 \n0 \n0 \n1 \n0 \n1 \n0 \n0 \n1 \n1 \n68 950  to  69 050 \n \n1 \n1 \n0 \n0 \n1 \n0 \n1 \n0 \n0 \n1 \n0 \n69 050  to  69 150 \n \n1 \n1 \n0 \n0 \n1 \n0 \n1 \n0 \n1 \n1 \n0 \n69 150  to  69 250 \n \n1 \n1 \n0 \n0 \n1 \n0 \n1 \n0 \n1 \n0 \n0 \n69 250  to  69 350 \n \n1 \n1 \n0 \n0 \n1 \n0 \n1 \n1 \n1 \n0 \n0 \n69 350  to  69 450 \n \n1",
    "0 \n1 \n0 \n1 \n0 \n0 \n69 250  to  69 350 \n \n1 \n1 \n0 \n0 \n1 \n0 \n1 \n1 \n1 \n0 \n0 \n69 350  to  69 450 \n \n1 \n1 \n0 \n0 \n1 \n0 \n1 \n1 \n1 \n1 \n0 \n69 450  to  69 550 \n \n1 \n1 \n0 \n0 \n1 \n0 \n1 \n1 \n0 \n1 \n0 \n69 550  to  69 650 \n \n1 \n1 \n0 \n0 \n1 \n0 \n1 \n1 \n0 \n1 \n1 \n69 650  to  69 750 \n \n1 \n1 \n0 \n0 \n1 \n0 \n1 \n1 \n0 \n0 \n1 \n69 750  to  69 850 \n \n1 \n1 \n0 \n0 \n1 \n0 \n0 \n1 \n0 \n0 \n1 \n69 850  to  69 950 \n \n1 \n1 \n0 \n0 \n1 \n0 \n0 \n1 \n0 \n1 \n1 \n69 950  to  70 050 \n \n1 \n1 \n0 \n0 \n1 \n0 \n0 \n1 \n0 \n1 \n0 \n70 050  to  70 150 \n \n1 \n1 \n0 \n0 \n1 \n0",
    "1 \n69 950  to  70 050 \n \n1 \n1 \n0 \n0 \n1 \n0 \n0 \n1 \n0 \n1 \n0 \n70 050  to  70 150 \n \n1 \n1 \n0 \n0 \n1 \n0 \n0 \n1 \n1 \n1 \n0 \n70 150  to  70 250 \n \n1 \n1 \n0 \n0 \n1 \n0 \n0 \n1 \n1 \n0 \n0 \n70 250  to  70 350 \n \n1 \n1 \n0 \n0 \n1 \n0 \n0 \n0 \n1 \n0 \n0 \n70 350  to  70 450 \n \n1 \n1 \n0 \n0 \n1 \n0 \n0 \n0 \n1 \n1 \n0 \n70 450  to  70 550 \n \n1 \n1 \n0 \n0 \n1 \n0 \n0 \n0 \n0 \n1 \n0 \n70 550  to  70 650 \n \n1 \n1 \n0 \n0 \n1 \n0 \n0 \n0 \n0 \n1 \n1 \n70 650  to  70 750 \n \n1 \n1 \n0 \n0 \n1 \n0 \n0 \n0 \n0 \n0 \n1 \n70 750  to  70 850 \n \n1 \n1 \n0 \n1 \n1 \n0 \n0 \n0 \n0 \n0 \n1",
    "1 \n1 \n0 \n0 \n1 \n0 \n0 \n0 \n0 \n0 \n1 \n70 750  to  70 850 \n \n1 \n1 \n0 \n1 \n1 \n0 \n0 \n0 \n0 \n0 \n1 \n70 850  to  70 950 \n \n1 \n1 \n0 \n1 \n1 \n0 \n0 \n0 \n0 \n1 \n1 \n70 950  to  71 050 \n \n1 \n1 \n0 \n1 \n1 \n0 \n0 \n0 \n0 \n1 \n0 \n71 050  to  71 150 \n \n1 \n1 \n0 \n1 \n1 \n0 \n0 \n0 \n1 \n1 \n0 \n71 150  to  71 250 \n \n1 \n1 \n0 \n1 \n1 \n0 \n0 \n0 \n1 \n0 \n0 \n71 250  to  71 350 \n \n1 \n1 \n0 \n1 \n1 \n0 \n0 \n1 \n1 \n0 \n0 \n71 350  to  71 450 \n \n1 \n1 \n0 \n1 \n1 \n0 \n0 \n1 \n1 \n1 \n0 \n71 450  to  71 550 \n \n1 \n1 \n0 \n1 \n1 \n0 \n0 \n1 \n0 \n1 \n0 \n71 550  to  71 650 \n \n1",
    "0 \n0 \n1 \n1 \n1 \n0 \n71 450  to  71 550 \n \n1 \n1 \n0 \n1 \n1 \n0 \n0 \n1 \n0 \n1 \n0 \n71 550  to  71 650 \n \n1 \n1 \n0 \n1 \n1 \n0 \n0 \n1 \n0 \n1 \n1 \n71 650  to  71 750 \n \n1 \n1 \n0 \n1 \n1 \n0 \n0 \n1 \n0 \n0 \n1 \n71 750  to  71 850 \n \n1 \n1 \n0 \n1 \n1 \n0 \n1 \n1 \n0 \n0 \n1 \n71 850  to  71 950 \n \n1 \n1 \n0 \n1 \n1 \n0 \n1 \n1 \n0 \n1 \n1 \n71 950  to  72 050 \n \n1 \n1 \n0 \n1 \n1 \n0 \n1 \n1 \n0 \n1 \n0 \n72 050  to  72 150 \n \n1 \n1 \n0 \n1 \n1 \n0 \n1 \n1 \n1 \n1 \n0 \n72 150  to  72 250 \n \n1 \n1 \n0 \n1 \n1 \n0 \n1 \n1 \n1 \n0 \n0 \n72 250  to  72 350 \n \n1 \n1 \n0 \n1 \n1 \n0",
    "0 \n72 150  to  72 250 \n \n1 \n1 \n0 \n1 \n1 \n0 \n1 \n1 \n1 \n0 \n0 \n72 250  to  72 350 \n \n1 \n1 \n0 \n1 \n1 \n0 \n1 \n0 \n1 \n0 \n0 \n72 350  to  72 450 \n \n1 \n1 \n0 \n1 \n1 \n0 \n1 \n0 \n1 \n1 \n0 \n72 450  to  72 550 \n \n1 \n1 \n0 \n1 \n1 \n0 \n1 \n0 \n0 \n1 \n0 \n72 550  to  72 650 \n \n1 \n1 \n0 \n1 \n1 \n0 \n1 \n0 \n0 \n1 \n1 \n72 650  to  72 750 \n \n1 \n1 \n0 \n1 \n1 \n0 \n1 \n0 \n0 \n0 \n1 \nPULSE POSITIONS \n(0 or 1 in a pulse position denotes \nRANGE \nabsence or presence of a pulse, respectively) \nIncrements \n(Feet) \nD2 \nD4 \nA1 \nA2 \nA4 \nB1 \nB2 \nB4 \nC1",
    "Increments \n(Feet) \nD2 \nD4 \nA1 \nA2 \nA4 \nB1 \nB2 \nB4 \nC1 \nC2 \nC4",
    "72 750  to  72 850 \n \n1 \n1 \n0 \n1 \n1 \n1 \n1 \n0 \n0 \n0 \n1 \n72 850  to  72 950 \n \n1 \n1 \n0 \n1 \n1 \n1 \n1 \n0 \n0 \n1 \n1 \n72 950  to  73 050 \n \n1 \n1 \n0 \n1 \n1 \n1 \n1 \n0 \n0 \n1 \n0 \n73 050  to  73 150 \n \n1 \n1 \n0 \n1 \n1 \n1 \n1 \n0 \n1 \n1 \n0 \n73 150  to  73 250 \n \n1 \n1 \n0 \n1 \n1 \n1 \n1 \n0 \n1 \n0 \n0 \n73 250  to  73 350 \n \n1 \n1 \n0 \n1 \n1 \n1 \n1 \n1 \n1 \n0 \n0 \n73 350  to  73 450 \n \n1 \n1 \n0 \n1 \n1 \n1 \n1 \n1 \n1 \n1 \n0 \n73 450  to  73 550 \n \n1 \n1 \n0 \n1 \n1 \n1 \n1 \n1 \n0 \n1 \n0 \n73 550  to  73 650 \n \n1 \n1 \n0 \n1 \n1 \n1 \n1 \n1 \n0 \n1 \n1",
    "1 \n1 \n0 \n1 \n1 \n1 \n1 \n1 \n0 \n1 \n0 \n73 550  to  73 650 \n \n1 \n1 \n0 \n1 \n1 \n1 \n1 \n1 \n0 \n1 \n1 \n73 650  to  73 750 \n \n1 \n1 \n0 \n1 \n1 \n1 \n1 \n1 \n0 \n0 \n1 \n73 750  to  73 850 \n \n1 \n1 \n0 \n1 \n1 \n1 \n0 \n1 \n0 \n0 \n1 \n73 850  to  73 950 \n \n1 \n1 \n0 \n1 \n1 \n1 \n0 \n1 \n0 \n1 \n1 \n73 950  to  74 050 \n \n1 \n1 \n0 \n1 \n1 \n1 \n0 \n1 \n0 \n1 \n0 \n74 050  to  74 150 \n \n1 \n1 \n0 \n1 \n1 \n1 \n0 \n1 \n1 \n1 \n0 \n74 150  to  74 250 \n \n1 \n1 \n0 \n1 \n1 \n1 \n0 \n1 \n1 \n0 \n0 \n74 250  to  74 350 \n \n1 \n1 \n0 \n1 \n1 \n1 \n0 \n0 \n1 \n0 \n0 \n74 350  to  74 450 \n \n1",
    "1 \n0 \n1 \n1 \n0 \n0 \n74 250  to  74 350 \n \n1 \n1 \n0 \n1 \n1 \n1 \n0 \n0 \n1 \n0 \n0 \n74 350  to  74 450 \n \n1 \n1 \n0 \n1 \n1 \n1 \n0 \n0 \n1 \n1 \n0 \n74 450  to  74 550 \n \n1 \n1 \n0 \n1 \n1 \n1 \n0 \n0 \n0 \n1 \n0 \n74 550  to  74 650 \n \n1 \n1 \n0 \n1 \n1 \n1 \n0 \n0 \n0 \n1 \n1 \n74 650  to  74 750 \n \n1 \n1 \n0 \n1 \n1 \n1 \n0 \n0 \n0 \n0 \n1 \n74 750  to  74 850 \n \n1 \n1 \n0 \n1 \n0 \n1 \n0 \n0 \n0 \n0 \n1 \n74 850  to  74 950 \n \n1 \n1 \n0 \n1 \n0 \n1 \n0 \n0 \n0 \n1 \n1 \n74 950  to  75 050 \n \n1 \n1 \n0 \n1 \n0 \n1 \n0 \n0 \n0 \n1 \n0 \n75 050  to  75 150 \n \n1 \n1 \n0 \n1 \n0 \n1",
    "1 \n74 950  to  75 050 \n \n1 \n1 \n0 \n1 \n0 \n1 \n0 \n0 \n0 \n1 \n0 \n75 050  to  75 150 \n \n1 \n1 \n0 \n1 \n0 \n1 \n0 \n0 \n1 \n1 \n0 \n75 150  to  75 250 \n \n1 \n1 \n0 \n1 \n0 \n1 \n0 \n0 \n1 \n0 \n0 \n75 250  to  75 350 \n \n1 \n1 \n0 \n1 \n0 \n1 \n0 \n1 \n1 \n0 \n0 \n75 350  to  75 450 \n \n1 \n1 \n0 \n1 \n0 \n1 \n0 \n1 \n1 \n1 \n0 \n75 450  to  75 550 \n \n1 \n1 \n0 \n1 \n0 \n1 \n0 \n1 \n0 \n1 \n0 \n75 550  to  75 650 \n \n1 \n1 \n0 \n1 \n0 \n1 \n0 \n1 \n0 \n1 \n1 \n75 650  to  75 750 \n \n1 \n1 \n0 \n1 \n0 \n1 \n0 \n1 \n0 \n0 \n1 \n75 750  to  75 850 \n \n1 \n1 \n0 \n1 \n0 \n1 \n1 \n1 \n0 \n0 \n1",
    "1 \n1 \n0 \n1 \n0 \n1 \n0 \n1 \n0 \n0 \n1 \n75 750  to  75 850 \n \n1 \n1 \n0 \n1 \n0 \n1 \n1 \n1 \n0 \n0 \n1 \n75 850  to  75 950 \n \n1 \n1 \n0 \n1 \n0 \n1 \n1 \n1 \n0 \n1 \n1 \n75 950  to  76 050 \n \n1 \n1 \n0 \n1 \n0 \n1 \n1 \n1 \n0 \n1 \n0 \n76 050  to  76 150 \n \n1 \n1 \n0 \n1 \n0 \n1 \n1 \n1 \n1 \n1 \n0 \n76 150  to  76 250 \n \n1 \n1 \n0 \n1 \n0 \n1 \n1 \n1 \n1 \n0 \n0 \n76 250  to  76 350 \n \n1 \n1 \n0 \n1 \n0 \n1 \n1 \n0 \n1 \n0 \n0 \n76 350  to  76 450 \n \n1 \n1 \n0 \n1 \n0 \n1 \n1 \n0 \n1 \n1 \n0 \n76 450  to  76 550 \n \n1 \n1 \n0 \n1 \n0 \n1 \n1 \n0 \n0 \n1 \n0 \n76 550  to  76 650 \n \n1",
    "1 \n1 \n0 \n1 \n1 \n0 \n76 450  to  76 550 \n \n1 \n1 \n0 \n1 \n0 \n1 \n1 \n0 \n0 \n1 \n0 \n76 550  to  76 650 \n \n1 \n1 \n0 \n1 \n0 \n1 \n1 \n0 \n0 \n1 \n1 \n76 650  to  76 750 \n \n1 \n1 \n0 \n1 \n0 \n1 \n1 \n0 \n0 \n0 \n1 \n76 750  to  76 850 \n \n1 \n1 \n0 \n1 \n0 \n0 \n1 \n0 \n0 \n0 \n1 \n76 850  to  76 950 \n \n1 \n1 \n0 \n1 \n0 \n0 \n1 \n0 \n0 \n1 \n1 \n76 950  to  77 050 \n \n1 \n1 \n0 \n1 \n0 \n0 \n1 \n0 \n0 \n1 \n0 \n77 050  to  77 150 \n \n1 \n1 \n0 \n1 \n0 \n0 \n1 \n0 \n1 \n1 \n0 \n77 150  to  77 250 \n \n1 \n1 \n0 \n1 \n0 \n0 \n1 \n0 \n1 \n0 \n0 \n77 250  to  77 350 \n \n1 \n1 \n0 \n1 \n0 \n0",
    "0 \n77 150  to  77 250 \n \n1 \n1 \n0 \n1 \n0 \n0 \n1 \n0 \n1 \n0 \n0 \n77 250  to  77 350 \n \n1 \n1 \n0 \n1 \n0 \n0 \n1 \n1 \n1 \n0 \n0 \n77 350  to  77 450 \n \n1 \n1 \n0 \n1 \n0 \n0 \n1 \n1 \n1 \n1 \n0 \n77 450  to  77 550 \n \n1 \n1 \n0 \n1 \n0 \n0 \n1 \n1 \n0 \n1 \n0 \n77 550  to  77 650 \n \n1 \n1 \n0 \n1 \n0 \n0 \n1 \n1 \n0 \n1 \n1 \n77 650  to  77 750 \n \n1 \n1 \n0 \n1 \n0 \n0 \n1 \n1 \n0 \n0 \n1 \nPULSE POSITIONS \n(0 or 1 in a pulse position denotes \nRANGE \nabsence or presence of a pulse, respectively) \nIncrements \n(Feet) \nD2 \nD4 \nA1 \nA2 \nA4 \nB1 \nB2 \nB4 \nC1",
    "Increments \n(Feet) \nD2 \nD4 \nA1 \nA2 \nA4 \nB1 \nB2 \nB4 \nC1 \nC2 \nC4",
    "77 750  to  77 850 \n \n1 \n1 \n0 \n1 \n0 \n0 \n0 \n1 \n0 \n0 \n1 \n77 850  to  77 950 \n \n1 \n1 \n0 \n1 \n0 \n0 \n0 \n1 \n0 \n1 \n1 \n77 950  to  78 050 \n \n1 \n1 \n0 \n1 \n0 \n0 \n0 \n1 \n0 \n1 \n0 \n78 050  to  78 150 \n \n1 \n1 \n0 \n1 \n0 \n0 \n0 \n1 \n1 \n1 \n0 \n78 150  to  78 250 \n \n1 \n1 \n0 \n1 \n0 \n0 \n0 \n1 \n1 \n0 \n0 \n78 250  to  78 350 \n \n1 \n1 \n0 \n1 \n0 \n0 \n0 \n0 \n1 \n0 \n0 \n78 350  to  78 450 \n \n1 \n1 \n0 \n1 \n0 \n0 \n0 \n0 \n1 \n1 \n0 \n78 450  to  78 550 \n \n1 \n1 \n0 \n1 \n0 \n0 \n0 \n0 \n0 \n1 \n0 \n78 550  to  78 650 \n \n1 \n1 \n0 \n1 \n0 \n0 \n0 \n0 \n0 \n1 \n1",
    "1 \n1 \n0 \n1 \n0 \n0 \n0 \n0 \n0 \n1 \n0 \n78 550  to  78 650 \n \n1 \n1 \n0 \n1 \n0 \n0 \n0 \n0 \n0 \n1 \n1 \n78 650  to  78 750 \n \n1 \n1 \n0 \n1 \n0 \n0 \n0 \n0 \n0 \n0 \n1 \n78 750  to  78 850 \n \n1 \n1 \n1 \n1 \n0 \n0 \n0 \n0 \n0 \n0 \n1 \n78 850  to  78 950 \n \n1 \n1 \n1 \n1 \n0 \n0 \n0 \n0 \n0 \n1 \n1 \n78 950  to  79 050 \n \n1 \n1 \n1 \n1 \n0 \n0 \n0 \n0 \n0 \n1 \n0 \n79 050  to  79 150 \n \n1 \n1 \n1 \n1 \n0 \n0 \n0 \n0 \n1 \n1 \n0 \n79 150  to  79 250 \n \n1 \n1 \n1 \n1 \n0 \n0 \n0 \n0 \n1 \n0 \n0 \n79 250  to  79 350 \n \n1 \n1 \n1 \n1 \n0 \n0 \n0 \n1 \n1 \n0 \n0 \n79 350  to  79 450 \n \n1",
    "0 \n0 \n0 \n1 \n0 \n0 \n79 250  to  79 350 \n \n1 \n1 \n1 \n1 \n0 \n0 \n0 \n1 \n1 \n0 \n0 \n79 350  to  79 450 \n \n1 \n1 \n1 \n1 \n0 \n0 \n0 \n1 \n1 \n1 \n0 \n79 450  to  79 550 \n \n1 \n1 \n1 \n1 \n0 \n0 \n0 \n1 \n0 \n1 \n0 \n79 550  to  79 650 \n \n1 \n1 \n1 \n1 \n0 \n0 \n0 \n1 \n0 \n1 \n1 \n79 650  to  79 750 \n \n1 \n1 \n1 \n1 \n0 \n0 \n0 \n1 \n0 \n0 \n1 \n79 750  to  79 850 \n \n1 \n1 \n1 \n1 \n0 \n0 \n1 \n1 \n0 \n0 \n1 \n79 850  to  79 950 \n \n1 \n1 \n1 \n1 \n0 \n0 \n1 \n1 \n0 \n1 \n1 \n79 950  to  80 050 \n \n1 \n1 \n1 \n1 \n0 \n0 \n1 \n1 \n0 \n1 \n0 \n80 050  to  80 150 \n \n1 \n1 \n1 \n1 \n0 \n0",
    "1 \n79 950  to  80 050 \n \n1 \n1 \n1 \n1 \n0 \n0 \n1 \n1 \n0 \n1 \n0 \n80 050  to  80 150 \n \n1 \n1 \n1 \n1 \n0 \n0 \n1 \n1 \n1 \n1 \n0 \n80 150  to  80 250 \n \n1 \n1 \n1 \n1 \n0 \n0 \n1 \n1 \n1 \n0 \n0 \n80 250  to  80 350 \n \n1 \n1 \n1 \n1 \n0 \n0 \n1 \n0 \n1 \n0 \n0 \n80 350  to  80 450 \n \n1 \n1 \n1 \n1 \n0 \n0 \n1 \n0 \n1 \n1 \n0 \n80 450  to  80 550 \n \n1 \n1 \n1 \n1 \n0 \n0 \n1 \n0 \n0 \n1 \n0 \n80 550  to  80 650 \n \n1 \n1 \n1 \n1 \n0 \n0 \n1 \n0 \n0 \n1 \n1 \n80 650  to  80 750 \n \n1 \n1 \n1 \n1 \n0 \n0 \n1 \n0 \n0 \n0 \n1 \n80 750  to  80 850 \n \n1 \n1 \n1 \n1 \n0 \n1 \n1 \n0 \n0 \n0 \n1",
    "1 \n1 \n1 \n1 \n0 \n0 \n1 \n0 \n0 \n0 \n1 \n80 750  to  80 850 \n \n1 \n1 \n1 \n1 \n0 \n1 \n1 \n0 \n0 \n0 \n1 \n80 850  to  80 950 \n \n1 \n1 \n1 \n1 \n0 \n1 \n1 \n0 \n0 \n1 \n1 \n80 950  to  81 050 \n \n1 \n1 \n1 \n1 \n0 \n1 \n1 \n0 \n0 \n1 \n0 \n81 050  to  81 150 \n \n1 \n1 \n1 \n1 \n0 \n1 \n1 \n0 \n1 \n1 \n0 \n81 150  to  81 250 \n \n1 \n1 \n1 \n1 \n0 \n1 \n1 \n0 \n1 \n0 \n0 \n81 250  to  81 350 \n \n1 \n1 \n1 \n1 \n0 \n1 \n1 \n1 \n1 \n0 \n0 \n81 350  to  81 450 \n \n1 \n1 \n1 \n1 \n0 \n1 \n1 \n1 \n1 \n1 \n0 \n81 450  to  81 550 \n \n1 \n1 \n1 \n1 \n0 \n1 \n1 \n1 \n0 \n1 \n0 \n81 550  to  81 650 \n \n1",
    "1 \n1 \n1 \n1 \n1 \n0 \n81 450  to  81 550 \n \n1 \n1 \n1 \n1 \n0 \n1 \n1 \n1 \n0 \n1 \n0 \n81 550  to  81 650 \n \n1 \n1 \n1 \n1 \n0 \n1 \n1 \n1 \n0 \n1 \n1 \n81 650  to  81 750 \n \n1 \n1 \n1 \n1 \n0 \n1 \n1 \n1 \n0 \n0 \n1 \n81 750  to  81 850 \n \n1 \n1 \n1 \n1 \n0 \n1 \n0 \n1 \n0 \n0 \n1 \n81 850  to  81 950 \n \n1 \n1 \n1 \n1 \n0 \n1 \n0 \n1 \n0 \n1 \n1 \n81 950  to  82 050 \n \n1 \n1 \n1 \n1 \n0 \n1 \n0 \n1 \n0 \n1 \n0 \n82 050  to  82 150 \n \n1 \n1 \n1 \n1 \n0 \n1 \n0 \n1 \n1 \n1 \n0 \n82 150  to  82 250 \n \n1 \n1 \n1 \n1 \n0 \n1 \n0 \n1 \n1 \n0 \n0 \n82 250  to  82 350 \n \n1 \n1 \n1 \n1 \n0 \n1",
    "0 \n82 150  to  82 250 \n \n1 \n1 \n1 \n1 \n0 \n1 \n0 \n1 \n1 \n0 \n0 \n82 250  to  82 350 \n \n1 \n1 \n1 \n1 \n0 \n1 \n0 \n0 \n1 \n0 \n0 \n82 350  to  82 450 \n \n1 \n1 \n1 \n1 \n0 \n1 \n0 \n0 \n1 \n1 \n0 \n82 450  to  82 550 \n \n1 \n1 \n1 \n1 \n0 \n1 \n0 \n0 \n0 \n1 \n0 \n82 550  to  82 650 \n \n1 \n1 \n1 \n1 \n0 \n1 \n0 \n0 \n0 \n1 \n1 \n82 650  to  82 750 \n \n1 \n1 \n1 \n1 \n0 \n1 \n0 \n0 \n0 \n0 \n1 \nPULSE POSITIONS \n(0 or 1 in a pulse position denotes \nRANGE \nabsence or presence of a pulse, respectively) \nIncrements \n(Feet) \nD2 \nD4 \nA1 \nA2 \nA4 \nB1 \nB2 \nB4 \nC1",
    "Increments \n(Feet) \nD2 \nD4 \nA1 \nA2 \nA4 \nB1 \nB2 \nB4 \nC1 \nC2 \nC4",
    "82 750  to  82 850 \n \n1 \n1 \n1 \n1 \n1 \n1 \n0 \n0 \n0 \n0 \n1 \n82 850  to  82 950 \n \n1 \n1 \n1 \n1 \n1 \n1 \n0 \n0 \n0 \n1 \n1 \n82 950  to  83 050 \n \n1 \n1 \n1 \n1 \n1 \n1 \n0 \n0 \n0 \n1 \n0 \n83 050  to  83 150 \n \n1 \n1 \n1 \n1 \n1 \n1 \n0 \n0 \n1 \n1 \n0 \n83 150  to  83 250 \n \n1 \n1 \n1 \n1 \n1 \n1 \n0 \n0 \n1 \n0 \n0 \n83 250  to  83 350 \n \n1 \n1 \n1 \n1 \n1 \n1 \n0 \n1 \n1 \n0 \n0 \n83 350  to  83 450 \n \n1 \n1 \n1 \n1 \n1 \n1 \n0 \n1 \n1 \n1 \n0 \n83 450  to  83 550 \n \n1 \n1 \n1 \n1 \n1 \n1 \n0 \n1 \n0 \n1 \n0 \n83 550  to  83 650 \n \n1 \n1 \n1 \n1 \n1 \n1 \n0 \n1 \n0 \n1 \n1",
    "1 \n1 \n1 \n1 \n1 \n1 \n0 \n1 \n0 \n1 \n0 \n83 550  to  83 650 \n \n1 \n1 \n1 \n1 \n1 \n1 \n0 \n1 \n0 \n1 \n1 \n83 650  to  83 750 \n \n1 \n1 \n1 \n1 \n1 \n1 \n0 \n1 \n0 \n0 \n1 \n83 750  to  83 850 \n \n1 \n1 \n1 \n1 \n1 \n1 \n1 \n1 \n0 \n0 \n1 \n83 850  to  83 950 \n \n1 \n1 \n1 \n1 \n1 \n1 \n1 \n1 \n0 \n1 \n1 \n83 950  to  84 050 \n \n1 \n1 \n1 \n1 \n1 \n1 \n1 \n1 \n0 \n1 \n0 \n84 050  to  84 150 \n \n1 \n1 \n1 \n1 \n1 \n1 \n1 \n1 \n1 \n1 \n0 \n84 150  to  84 250 \n \n1 \n1 \n1 \n1 \n1 \n1 \n1 \n1 \n1 \n0 \n0 \n84 250  to  84 350 \n \n1 \n1 \n1 \n1 \n1 \n1 \n1 \n0 \n1 \n0 \n0 \n84 350  to  84 450 \n \n1",
    "1 \n1 \n1 \n1 \n0 \n0 \n84 250  to  84 350 \n \n1 \n1 \n1 \n1 \n1 \n1 \n1 \n0 \n1 \n0 \n0 \n84 350  to  84 450 \n \n1 \n1 \n1 \n1 \n1 \n1 \n1 \n0 \n1 \n1 \n0 \n84 450  to  84 550 \n \n1 \n1 \n1 \n1 \n1 \n1 \n1 \n0 \n0 \n1 \n0 \n84 550  to  84 650 \n \n1 \n1 \n1 \n1 \n1 \n1 \n1 \n0 \n0 \n1 \n1 \n84 650  to  84 750 \n \n1 \n1 \n1 \n1 \n1 \n1 \n1 \n0 \n0 \n0 \n1 \n84 750  to  84 850 \n \n1 \n1 \n1 \n1 \n1 \n0 \n1 \n0 \n0 \n0 \n1 \n84 850  to  84 950 \n \n1 \n1 \n1 \n1 \n1 \n0 \n1 \n0 \n0 \n1 \n1 \n84 950  to  85 050 \n \n1 \n1 \n1 \n1 \n1 \n0 \n1 \n0 \n0 \n1 \n0 \n85 050  to  85 150 \n \n1 \n1 \n1 \n1 \n1 \n0",
    "1 \n84 950  to  85 050 \n \n1 \n1 \n1 \n1 \n1 \n0 \n1 \n0 \n0 \n1 \n0 \n85 050  to  85 150 \n \n1 \n1 \n1 \n1 \n1 \n0 \n1 \n0 \n1 \n1 \n0 \n85 150  to  85 250 \n \n1 \n1 \n1 \n1 \n1 \n0 \n1 \n0 \n1 \n0 \n0 \n85 250  to  85 350 \n \n1 \n1 \n1 \n1 \n1 \n0 \n1 \n1 \n1 \n0 \n0 \n85 350  to  85 450 \n \n1 \n1 \n1 \n1 \n1 \n0 \n1 \n1 \n1 \n1 \n0 \n85 450  to  85 550 \n \n1 \n1 \n1 \n1 \n1 \n0 \n1 \n1 \n0 \n1 \n0 \n85 550  to  85 650 \n \n1 \n1 \n1 \n1 \n1 \n0 \n1 \n1 \n0 \n1 \n1 \n85 650  to  85 750 \n \n1 \n1 \n1 \n1 \n1 \n0 \n1 \n1 \n0 \n0 \n1 \n85 750  to  85 850 \n \n1 \n1 \n1 \n1 \n1 \n0 \n0 \n1 \n0 \n0 \n1",
    "1 \n1 \n1 \n1 \n1 \n0 \n1 \n1 \n0 \n0 \n1 \n85 750  to  85 850 \n \n1 \n1 \n1 \n1 \n1 \n0 \n0 \n1 \n0 \n0 \n1 \n85 850  to  85 950 \n \n1 \n1 \n1 \n1 \n1 \n0 \n0 \n1 \n0 \n1 \n1 \n85 950  to  86 050 \n \n1 \n1 \n1 \n1 \n1 \n0 \n0 \n1 \n0 \n1 \n0 \n86 050  to  86 150 \n \n1 \n1 \n1 \n1 \n1 \n0 \n0 \n1 \n1 \n1 \n0 \n86 150  to  86 250 \n \n1 \n1 \n1 \n1 \n1 \n0 \n0 \n1 \n1 \n0 \n0 \n86 250  to  86 350 \n \n1 \n1 \n1 \n1 \n1 \n0 \n0 \n0 \n1 \n0 \n0 \n86 350  to  86 450 \n \n1 \n1 \n1 \n1 \n1 \n0 \n0 \n0 \n1 \n1 \n0 \n86 450  to  86 550 \n \n1 \n1 \n1 \n1 \n1 \n0 \n0 \n0 \n0 \n1 \n0 \n86 550  to  86 650 \n \n1",
    "0 \n0 \n0 \n1 \n1 \n0 \n86 450  to  86 550 \n \n1 \n1 \n1 \n1 \n1 \n0 \n0 \n0 \n0 \n1 \n0 \n86 550  to  86 650 \n \n1 \n1 \n1 \n1 \n1 \n0 \n0 \n0 \n0 \n1 \n1 \n86 650  to  86 750 \n \n1 \n1 \n1 \n1 \n1 \n0 \n0 \n0 \n0 \n0 \n1 \n86 750  to  86 850 \n \n1 \n1 \n1 \n0 \n1 \n0 \n0 \n0 \n0 \n0 \n1 \n86 850  to  86 950 \n \n1 \n1 \n1 \n0 \n1 \n0 \n0 \n0 \n0 \n1 \n1 \n86 950  to  87 050 \n \n1 \n1 \n1 \n0 \n1 \n0 \n0 \n0 \n0 \n1 \n0 \n87 050  to  87 150 \n \n1 \n1 \n1 \n0 \n1 \n0 \n0 \n0 \n1 \n1 \n0 \n87 150  to  87 250 \n \n1 \n1 \n1 \n0 \n1 \n0 \n0 \n0 \n1 \n0 \n0 \n87 250  to  87 350 \n \n1 \n1 \n1 \n0 \n1 \n0",
    "0 \n87 150  to  87 250 \n \n1 \n1 \n1 \n0 \n1 \n0 \n0 \n0 \n1 \n0 \n0 \n87 250  to  87 350 \n \n1 \n1 \n1 \n0 \n1 \n0 \n0 \n1 \n1 \n0 \n0 \n87 350  to  87 450 \n \n1 \n1 \n1 \n0 \n1 \n0 \n0 \n1 \n1 \n1 \n0 \n87 450  to  87 550 \n \n1 \n1 \n1 \n0 \n1 \n0 \n0 \n1 \n0 \n1 \n0 \n87 550  to  87 650 \n \n1 \n1 \n1 \n0 \n1 \n0 \n0 \n1 \n0 \n1 \n1 \n87 650  to  87 750 \n \n1 \n1 \n1 \n0 \n1 \n0 \n0 \n1 \n0 \n0 \n1 \nPULSE POSITIONS \n(0 or 1 in a pulse position denotes \nRANGE \nabsence or presence of a pulse, respectively) \nIncrements \n(Feet) \nD2 \nD4 \nA1 \nA2 \nA4 \nB1 \nB2 \nB4 \nC1",
    "Increments \n(Feet) \nD2 \nD4 \nA1 \nA2 \nA4 \nB1 \nB2 \nB4 \nC1 \nC2 \nC4",
    "87 750  to  87 850 \n \n1 \n1 \n1 \n0 \n1 \n0 \n1 \n1 \n0 \n0 \n1 \n87 850  to  87 950 \n \n1 \n1 \n1 \n0 \n1 \n0 \n1 \n1 \n0 \n1 \n1 \n87 950  to  88 050 \n \n1 \n1 \n1 \n0 \n1 \n0 \n1 \n1 \n0 \n1 \n0 \n88 050  to  88 150 \n \n1 \n1 \n1 \n0 \n1 \n0 \n1 \n1 \n1 \n1 \n0 \n88 150  to  88 250 \n \n1 \n1 \n1 \n0 \n1 \n0 \n1 \n1 \n1 \n0 \n0 \n88 250  to  88 350 \n \n1 \n1 \n1 \n0 \n1 \n0 \n1 \n0 \n1 \n0 \n0 \n88 350  to  88 450 \n \n1 \n1 \n1 \n0 \n1 \n0 \n1 \n0 \n1 \n1 \n0 \n88 450  to  88 550 \n \n1 \n1 \n1 \n0 \n1 \n0 \n1 \n0 \n0 \n1 \n0 \n88 550  to  88 650 \n \n1 \n1 \n1 \n0 \n1 \n0 \n1 \n0 \n0 \n1 \n1",
    "1 \n1 \n1 \n0 \n1 \n0 \n1 \n0 \n0 \n1 \n0 \n88 550  to  88 650 \n \n1 \n1 \n1 \n0 \n1 \n0 \n1 \n0 \n0 \n1 \n1 \n88 650  to  88 750 \n \n1 \n1 \n1 \n0 \n1 \n0 \n1 \n0 \n0 \n0 \n1 \n88 750  to  88 850 \n \n1 \n1 \n1 \n0 \n1 \n1 \n1 \n0 \n0 \n0 \n1 \n88 850  to  88 950 \n \n1 \n1 \n1 \n0 \n1 \n1 \n1 \n0 \n0 \n1 \n1 \n88 950  to  89 050 \n \n1 \n1 \n1 \n0 \n1 \n1 \n1 \n0 \n0 \n1 \n0 \n89 050  to  89 150 \n \n1 \n1 \n1 \n0 \n1 \n1 \n1 \n0 \n1 \n1 \n0 \n89 150  to  89 250 \n \n1 \n1 \n1 \n0 \n1 \n1 \n1 \n0 \n1 \n0 \n0 \n89 250  to  89 350 \n \n1 \n1 \n1 \n0 \n1 \n1 \n1 \n1 \n1 \n0 \n0 \n89 350  to  89 450 \n \n1",
    "1 \n1 \n0 \n1 \n0 \n0 \n89 250  to  89 350 \n \n1 \n1 \n1 \n0 \n1 \n1 \n1 \n1 \n1 \n0 \n0 \n89 350  to  89 450 \n \n1 \n1 \n1 \n0 \n1 \n1 \n1 \n1 \n1 \n1 \n0 \n89 450  to  89 550 \n \n1 \n1 \n1 \n0 \n1 \n1 \n1 \n1 \n0 \n1 \n0 \n89 550  to  89 650 \n \n1 \n1 \n1 \n0 \n1 \n1 \n1 \n1 \n0 \n1 \n1 \n89 650  to  89 750 \n \n1 \n1 \n1 \n0 \n1 \n1 \n1 \n1 \n0 \n0 \n1 \n89 750  to  89 850 \n \n1 \n1 \n1 \n0 \n1 \n1 \n0 \n1 \n0 \n0 \n1 \n89 850  to  89 950 \n \n1 \n1 \n1 \n0 \n1 \n1 \n0 \n1 \n0 \n1 \n1 \n89 950  to  90 050 \n \n1 \n1 \n1 \n0 \n1 \n1 \n0 \n1 \n0 \n1 \n0 \n90 050  to  90 150 \n \n1 \n1 \n1 \n0 \n1 \n1",
    "1 \n89 950  to  90 050 \n \n1 \n1 \n1 \n0 \n1 \n1 \n0 \n1 \n0 \n1 \n0 \n90 050  to  90 150 \n \n1 \n1 \n1 \n0 \n1 \n1 \n0 \n1 \n1 \n1 \n0 \n90 150  to  90 250 \n \n1 \n1 \n1 \n0 \n1 \n1 \n0 \n1 \n1 \n0 \n0 \n90 250  to  90 350 \n \n1 \n1 \n1 \n0 \n1 \n1 \n0 \n0 \n1 \n0 \n0 \n90 350  to  90 450 \n \n1 \n1 \n1 \n0 \n1 \n1 \n0 \n0 \n1 \n1 \n0 \n90 450  to  90 550 \n \n1 \n1 \n1 \n0 \n1 \n1 \n0 \n0 \n0 \n1 \n0 \n90 550  to  90 650 \n \n1 \n1 \n1 \n0 \n1 \n1 \n0 \n0 \n0 \n1 \n1 \n90 650  to  90 750 \n \n1 \n1 \n1 \n0 \n1 \n1 \n0 \n0 \n0 \n0 \n1 \n90 750  to  90 850 \n \n1 \n1 \n1 \n0 \n0 \n1 \n0 \n0 \n0 \n0 \n1",
    "1 \n1 \n1 \n0 \n1 \n1 \n0 \n0 \n0 \n0 \n1 \n90 750  to  90 850 \n \n1 \n1 \n1 \n0 \n0 \n1 \n0 \n0 \n0 \n0 \n1 \n90 850  to  90 950 \n \n1 \n1 \n1 \n0 \n0 \n1 \n0 \n0 \n0 \n1 \n1 \n90 950  to  91 050 \n \n1 \n1 \n1 \n0 \n0 \n1 \n0 \n0 \n0 \n1 \n0 \n91 050  to  91 150 \n \n1 \n1 \n1 \n0 \n0 \n1 \n0 \n0 \n1 \n1 \n0 \n91 150  to  91 250 \n \n1 \n1 \n1 \n0 \n0 \n1 \n0 \n0 \n1 \n0 \n0 \n91 250  to  91 350 \n \n1 \n1 \n1 \n0 \n0 \n1 \n0 \n1 \n1 \n0 \n0 \n91 350  to  91 450 \n \n1 \n1 \n1 \n0 \n0 \n1 \n0 \n1 \n1 \n1 \n0 \n91 450  to  91 550 \n \n1 \n1 \n1 \n0 \n0 \n1 \n0 \n1 \n0 \n1 \n0 \n91 550  to  91 650 \n \n1",
    "1 \n0 \n1 \n1 \n1 \n0 \n91 450  to  91 550 \n \n1 \n1 \n1 \n0 \n0 \n1 \n0 \n1 \n0 \n1 \n0 \n91 550  to  91 650 \n \n1 \n1 \n1 \n0 \n0 \n1 \n0 \n1 \n0 \n1 \n1 \n91 650  to  91 750 \n \n1 \n1 \n1 \n0 \n0 \n1 \n0 \n1 \n0 \n0 \n1 \n91 750  to  91 850 \n \n1 \n1 \n1 \n0 \n0 \n1 \n1 \n1 \n0 \n0 \n1 \n91 850  to  91 950 \n \n1 \n1 \n1 \n0 \n0 \n1 \n1 \n1 \n0 \n1 \n1 \n91 950  to  92 050 \n \n1 \n1 \n1 \n0 \n0 \n1 \n1 \n1 \n0 \n1 \n0 \n92 050  to  92 150 \n \n1 \n1 \n1 \n0 \n0 \n1 \n1 \n1 \n1 \n1 \n0 \n92 150  to  92 250 \n \n1 \n1 \n1 \n0 \n0 \n1 \n1 \n1 \n1 \n0 \n0 \n92 250  to  92 350 \n \n1 \n1 \n1 \n0 \n0 \n1",
    "0 \n92 150  to  92 250 \n \n1 \n1 \n1 \n0 \n0 \n1 \n1 \n1 \n1 \n0 \n0 \n92 250  to  92 350 \n \n1 \n1 \n1 \n0 \n0 \n1 \n1 \n0 \n1 \n0 \n0 \n92 350  to  92 450 \n \n1 \n1 \n1 \n0 \n0 \n1 \n1 \n0 \n1 \n1 \n0 \n92 450  to  92 550 \n \n1 \n1 \n1 \n0 \n0 \n1 \n1 \n0 \n0 \n1 \n0 \n92 550  to  92 650 \n \n1 \n1 \n1 \n0 \n0 \n1 \n1 \n0 \n0 \n1 \n1 \n92 650  to  92 750 \n \n1 \n1 \n1 \n0 \n0 \n1 \n1 \n0 \n0 \n0 \n1 \nPULSE POSITIONS \n(0 or 1 in a pulse position denotes \nRANGE \nabsence or presence of a pulse, respectively) \nIncrements \n(Feet) \nD2 \nD4 \nA1 \nA2 \nA4 \nB1 \nB2 \nB4 \nC1",
    "Increments \n(Feet) \nD2 \nD4 \nA1 \nA2 \nA4 \nB1 \nB2 \nB4 \nC1 \nC2 \nC4",
    "92 750  to  92 850 \n \n1 \n1 \n1 \n0 \n0 \n0 \n1 \n0 \n0 \n0 \n1 \n92 850  to  92 950 \n \n1 \n1 \n1 \n0 \n0 \n0 \n1 \n0 \n0 \n1 \n1 \n92 950  to  93 050 \n \n1 \n1 \n1 \n0 \n0 \n0 \n1 \n0 \n0 \n1 \n0 \n93 050  to  93 150 \n \n1 \n1 \n1 \n0 \n0 \n0 \n1 \n0 \n1 \n1 \n0 \n93 150  to  93 250 \n \n1 \n1 \n1 \n0 \n0 \n0 \n1 \n0 \n1 \n0 \n0 \n93 250  to  93 350 \n \n1 \n1 \n1 \n0 \n0 \n0 \n1 \n1 \n1 \n0 \n0 \n93 350  to  93 450 \n \n1 \n1 \n1 \n0 \n0 \n0 \n1 \n1 \n1 \n1 \n0 \n93 450  to  93 550 \n \n1 \n1 \n1 \n0 \n0 \n0 \n1 \n1 \n0 \n1 \n0 \n93 550  to  93 650 \n \n1 \n1 \n1 \n0 \n0 \n0 \n1 \n1 \n0 \n1 \n1",
    "1 \n1 \n1 \n0 \n0 \n0 \n1 \n1 \n0 \n1 \n0 \n93 550  to  93 650 \n \n1 \n1 \n1 \n0 \n0 \n0 \n1 \n1 \n0 \n1 \n1 \n93 650  to  93 750 \n \n1 \n1 \n1 \n0 \n0 \n0 \n1 \n1 \n0 \n0 \n1 \n93 750  to  93 850 \n \n1 \n1 \n1 \n0 \n0 \n0 \n0 \n1 \n0 \n0 \n1 \n93 850  to  93 950 \n \n1 \n1 \n1 \n0 \n0 \n0 \n0 \n1 \n0 \n1 \n1 \n93 950  to  94 050 \n \n1 \n1 \n1 \n0 \n0 \n0 \n0 \n1 \n0 \n1 \n0 \n94 050  to  94 150 \n \n1 \n1 \n1 \n0 \n0 \n0 \n0 \n1 \n1 \n1 \n0 \n94 150  to  94 250 \n \n1 \n1 \n1 \n0 \n0 \n0 \n0 \n1 \n1 \n0 \n0 \n94 250  to  94 350 \n \n1 \n1 \n1 \n0 \n0 \n0 \n0 \n0 \n1 \n0 \n0 \n94 350  to  94 450 \n \n1",
    "0 \n0 \n1 \n1 \n0 \n0 \n94 250  to  94 350 \n \n1 \n1 \n1 \n0 \n0 \n0 \n0 \n0 \n1 \n0 \n0 \n94 350  to  94 450 \n \n1 \n1 \n1 \n0 \n0 \n0 \n0 \n0 \n1 \n1 \n0 \n94 450  to  94 550 \n \n1 \n1 \n1 \n0 \n0 \n0 \n0 \n0 \n0 \n1 \n0 \n94 550  to  94 650 \n \n1 \n1 \n1 \n0 \n0 \n0 \n0 \n0 \n0 \n1 \n1 \n94 650  to  94 750 \n \n1 \n1 \n1 \n0 \n0 \n0 \n0 \n0 \n0 \n0 \n1 \n94 750  to  94 850 \n \n1 \n0 \n1 \n0 \n0 \n0 \n0 \n0 \n0 \n0 \n1 \n94 850  to  94 950 \n \n1 \n0 \n1 \n0 \n0 \n0 \n0 \n0 \n0 \n1 \n1 \n94 950  to  95 050 \n \n1 \n0 \n1 \n0 \n0 \n0 \n0 \n0 \n0 \n1 \n0 \n95 050  to  95 150 \n \n1 \n0 \n1 \n0 \n0 \n0",
    "1 \n94 950  to  95 050 \n \n1 \n0 \n1 \n0 \n0 \n0 \n0 \n0 \n0 \n1 \n0 \n95 050  to  95 150 \n \n1 \n0 \n1 \n0 \n0 \n0 \n0 \n0 \n1 \n1 \n0 \n95 150  to  95 250 \n \n1 \n0 \n1 \n0 \n0 \n0 \n0 \n0 \n1 \n0 \n0 \n95 250  to  95 350 \n \n1 \n0 \n1 \n0 \n0 \n0 \n0 \n1 \n1 \n0 \n0 \n95 350  to  95 450 \n \n1 \n0 \n1 \n0 \n0 \n0 \n0 \n1 \n1 \n1 \n0 \n95 450  to  95 550 \n \n1 \n0 \n1 \n0 \n0 \n0 \n0 \n1 \n0 \n1 \n0 \n95 550  to  95 650 \n \n1 \n0 \n1 \n0 \n0 \n0 \n0 \n1 \n0 \n1 \n1 \n95 650  to  95 750 \n \n1 \n0 \n1 \n0 \n0 \n0 \n0 \n1 \n0 \n0 \n1 \n95 750  to  95 850 \n \n1 \n0 \n1 \n0 \n0 \n0 \n1 \n1 \n0 \n0 \n1",
    "1 \n0 \n1 \n0 \n0 \n0 \n0 \n1 \n0 \n0 \n1 \n95 750  to  95 850 \n \n1 \n0 \n1 \n0 \n0 \n0 \n1 \n1 \n0 \n0 \n1 \n95 850  to  95 950 \n \n1 \n0 \n1 \n0 \n0 \n0 \n1 \n1 \n0 \n1 \n1 \n95 950  to  96 050 \n \n1 \n0 \n1 \n0 \n0 \n0 \n1 \n1 \n0 \n1 \n0 \n96 050  to  96 150 \n \n1 \n0 \n1 \n0 \n0 \n0 \n1 \n1 \n1 \n1 \n0 \n96 150  to  96 250 \n \n1 \n0 \n1 \n0 \n0 \n0 \n1 \n1 \n1 \n0 \n0 \n96 250  to  96 350 \n \n1 \n0 \n1 \n0 \n0 \n0 \n1 \n0 \n1 \n0 \n0 \n96 350  to  96 450 \n \n1 \n0 \n1 \n0 \n0 \n0 \n1 \n0 \n1 \n1 \n0 \n96 450  to  96 550 \n \n1 \n0 \n1 \n0 \n0 \n0 \n1 \n0 \n0 \n1 \n0 \n96 550  to  96 650 \n \n1",
    "0 \n1 \n0 \n1 \n1 \n0 \n96 450  to  96 550 \n \n1 \n0 \n1 \n0 \n0 \n0 \n1 \n0 \n0 \n1 \n0 \n96 550  to  96 650 \n \n1 \n0 \n1 \n0 \n0 \n0 \n1 \n0 \n0 \n1 \n1 \n96 650  to  96 750 \n \n1 \n0 \n1 \n0 \n0 \n0 \n1 \n0 \n0 \n0 \n1 \n96 750  to  96 850 \n \n1 \n0 \n1 \n0 \n0 \n1 \n1 \n0 \n0 \n0 \n1 \n96 850  to  96 950 \n \n1 \n0 \n1 \n0 \n0 \n1 \n1 \n0 \n0 \n1 \n1 \n96 950  to  97 050 \n \n1 \n0 \n1 \n0 \n0 \n1 \n1 \n0 \n0 \n1 \n0 \n97 050  to  97 150 \n \n1 \n0 \n1 \n0 \n0 \n1 \n1 \n0 \n1 \n1 \n0 \n97 150  to  97 250 \n \n1 \n0 \n1 \n0 \n0 \n1 \n1 \n0 \n1 \n0 \n0 \n97 250  to  97 350 \n \n1 \n0 \n1 \n0 \n0 \n1",
    "0 \n97 150  to  97 250 \n \n1 \n0 \n1 \n0 \n0 \n1 \n1 \n0 \n1 \n0 \n0 \n97 250  to  97 350 \n \n1 \n0 \n1 \n0 \n0 \n1 \n1 \n1 \n1 \n0 \n0 \n97 350  to  97 450 \n \n1 \n0 \n1 \n0 \n0 \n1 \n1 \n1 \n1 \n1 \n0 \n97 450  to  97 550 \n \n1 \n0 \n1 \n0 \n0 \n1 \n1 \n1 \n0 \n1 \n0 \n97 550  to  97 650 \n \n1 \n0 \n1 \n0 \n0 \n1 \n1 \n1 \n0 \n1 \n1 \n97 650  to  97 750 \n \n1 \n0 \n1 \n0 \n0 \n1 \n1 \n1 \n0 \n0 \n1 \nPULSE POSITIONS \n(0 or 1 in a pulse position denotes \nRANGE \nabsence or presence of a pulse, respectively) \nIncrements \n(Feet) \nD2 \nD4 \nA1 \nA2 \nA4 \nB1 \nB2 \nB4 \nC1",
    "Increments \n(Feet) \nD2 \nD4 \nA1 \nA2 \nA4 \nB1 \nB2 \nB4 \nC1 \nC2 \nC4",
    "97 750  to  97 850 \n \n1 \n0 \n1 \n0 \n0 \n1 \n0 \n1 \n0 \n0 \n1 \n97 850  to  97 950 \n \n1 \n0 \n1 \n0 \n0 \n1 \n0 \n1 \n0 \n1 \n1 \n97 950  to  98 050 \n \n1 \n0 \n1 \n0 \n0 \n1 \n0 \n1 \n0 \n1 \n0 \n98 050  to  98 150 \n \n1 \n0 \n1 \n0 \n0 \n1 \n0 \n1 \n1 \n1 \n0 \n98 150  to  98 250 \n \n1 \n0 \n1 \n0 \n0 \n1 \n0 \n1 \n1 \n0 \n0 \n98 250  to  98 350 \n \n1 \n0 \n1 \n0 \n0 \n1 \n0 \n0 \n1 \n0 \n0 \n98 350  to  98 450 \n \n1 \n0 \n1 \n0 \n0 \n1 \n0 \n0 \n1 \n1 \n0 \n98 450  to  98 550 \n \n1 \n0 \n1 \n0 \n0 \n1 \n0 \n0 \n0 \n1 \n0 \n98 550  to  98 650 \n \n1 \n0 \n1 \n0 \n0 \n1 \n0 \n0 \n0 \n1 \n1",
    "1 \n0 \n1 \n0 \n0 \n1 \n0 \n0 \n0 \n1 \n0 \n98 550  to  98 650 \n \n1 \n0 \n1 \n0 \n0 \n1 \n0 \n0 \n0 \n1 \n1 \n98 650  to  98 750 \n \n1 \n0 \n1 \n0 \n0 \n1 \n0 \n0 \n0 \n0 \n1 \n98 750  to  98 850 \n \n1 \n0 \n1 \n0 \n1 \n1 \n0 \n0 \n0 \n0 \n1 \n98 850  to  98 950 \n \n1 \n0 \n1 \n0 \n1 \n1 \n0 \n0 \n0 \n1 \n1 \n98 950  to  99 050 \n \n1 \n0 \n1 \n0 \n1 \n1 \n0 \n0 \n0 \n1 \n0 \n99 050  to  99 150 \n \n1 \n0 \n1 \n0 \n1 \n1 \n0 \n0 \n1 \n1 \n0 \n99 150  to  99 250 \n \n1 \n0 \n1 \n0 \n1 \n1 \n0 \n0 \n1 \n0 \n0 \n99 250  to  99 350 \n \n1 \n0 \n1 \n0 \n1 \n1 \n0 \n1 \n1 \n0 \n0 \n99 350  to  99 450 \n \n1",
    "1 \n0 \n0 \n1 \n0 \n0 \n99 250  to  99 350 \n \n1 \n0 \n1 \n0 \n1 \n1 \n0 \n1 \n1 \n0 \n0 \n99 350  to  99 450 \n \n1 \n0 \n1 \n0 \n1 \n1 \n0 \n1 \n1 \n1 \n0 \n99 450  to  99 550 \n \n1 \n0 \n1 \n0 \n1 \n1 \n0 \n1 \n0 \n1 \n0 \n99 550  to  99 650 \n \n1 \n0 \n1 \n0 \n1 \n1 \n0 \n1 \n0 \n1 \n1 \n99 650  to  99 750 \n \n1 \n0 \n1 \n0 \n1 \n1 \n0 \n1 \n0 \n0 \n1 \n99 750  to  99 850 \n \n1 \n0 \n1 \n0 \n1 \n1 \n1 \n1 \n0 \n0 \n1 \n99 850  to  99 950 \n \n1 \n0 \n1 \n0 \n1 \n1 \n1 \n1 \n0 \n1 \n1 \n99 950  to  100 050  \n1 \n0 \n1 \n0 \n1 \n1 \n1 \n1 \n0 \n1 \n0 \n100 050  to  100 150  \n1 \n0 \n1 \n0 \n1 \n1",
    "1 \n99 950  to  100 050  \n1 \n0 \n1 \n0 \n1 \n1 \n1 \n1 \n0 \n1 \n0 \n100 050  to  100 150  \n1 \n0 \n1 \n0 \n1 \n1 \n1 \n1 \n1 \n1 \n0 \n100 150  to  100 250  \n1 \n0 \n1 \n0 \n1 \n1 \n1 \n1 \n1 \n0 \n0 \n100 250  to  100 350  \n1 \n0 \n1 \n0 \n1 \n1 \n1 \n0 \n1 \n0 \n0 \n100 350  to  100 450  \n1 \n0 \n1 \n0 \n1 \n1 \n1 \n0 \n1 \n1 \n0 \n100 450  to  100 550  \n1 \n0 \n1 \n0 \n1 \n1 \n1 \n0 \n0 \n1 \n0 \n100 550  to  100 650  \n1 \n0 \n1 \n0 \n1 \n1 \n1 \n0 \n0 \n1 \n1 \n100 650  to  100 750  \n1 \n0 \n1 \n0 \n1 \n1 \n1 \n0 \n0 \n0 \n1 \n100 750  to  100 850  \n1 \n0 \n1 \n0 \n1 \n0 \n1 \n0 \n0",
    "1 \n0 \n1 \n0 \n1 \n1 \n1 \n0 \n0 \n0 \n1 \n100 750  to  100 850  \n1 \n0 \n1 \n0 \n1 \n0 \n1 \n0 \n0 \n0 \n1 \n100 850  to  100 950  \n1 \n0 \n1 \n0 \n1 \n0 \n1 \n0 \n0 \n1 \n1 \n100 950  to  101 050  \n1 \n0 \n1 \n0 \n1 \n0 \n1 \n0 \n0 \n1 \n0 \n101 050  to  101 150  \n1 \n0 \n1 \n0 \n1 \n0 \n1 \n0 \n1 \n1 \n0 \n101 150  to  101 250  \n1 \n0 \n1 \n0 \n1 \n0 \n1 \n0 \n1 \n0 \n0 \n101 250  to  101 350  \n1 \n0 \n1 \n0 \n1 \n0 \n1 \n1 \n1 \n0 \n0 \n101 350  to  101 450  \n1 \n0 \n1 \n0 \n1 \n0 \n1 \n1 \n1 \n1 \n0 \n101 450  to  101 550  \n1 \n0 \n1 \n0 \n1 \n0 \n1 \n1 \n0 \n1 \n0",
    "1 \n0 \n1 \n0 \n1 \n0 \n1 \n1 \n1 \n1 \n0 \n101 450  to  101 550  \n1 \n0 \n1 \n0 \n1 \n0 \n1 \n1 \n0 \n1 \n0 \n101 550  to  101 650  \n1 \n0 \n1 \n0 \n1 \n0 \n1 \n1 \n0 \n1 \n1 \n101 650  to  101 750  \n1 \n0 \n1 \n0 \n1 \n0 \n1 \n1 \n0 \n0 \n1 \n101 750  to  101 850  \n1 \n0 \n1 \n0 \n1 \n0 \n0 \n1 \n0 \n0 \n1 \n101 850  to  101 950  \n1 \n0 \n1 \n0 \n1 \n0 \n0 \n1 \n0 \n1 \n1 \n101 950  to  102 050  \n1 \n0 \n1 \n0 \n1 \n0 \n0 \n1 \n0 \n1 \n0 \n102 050  to  102 150  \n1 \n0 \n1 \n0 \n1 \n0 \n0 \n1 \n1 \n1 \n0 \n102 150  to  102 250  \n1 \n0 \n1 \n0 \n1 \n0 \n0 \n1 \n1 \n0 \n0",
    "1 \n0 \n1 \n0 \n1 \n0 \n0 \n1 \n1 \n1 \n0 \n102 150  to  102 250  \n1 \n0 \n1 \n0 \n1 \n0 \n0 \n1 \n1 \n0 \n0 \n102 250  to  102 350  \n1 \n0 \n1 \n0 \n1 \n0 \n0 \n0 \n1 \n0 \n0 \n102 350  to  102 450  \n1 \n0 \n1 \n0 \n1 \n0 \n0 \n0 \n1 \n1 \n0 \n102 450  to  102 550  \n1 \n0 \n1 \n0 \n1 \n0 \n0 \n0 \n0 \n1 \n0 \n102 550  to  102 650  \n1 \n0 \n1 \n0 \n1 \n0 \n0 \n0 \n0 \n1 \n1 \n102 650  to  102 750  \n1 \n0 \n1 \n0 \n1 \n0 \n0 \n0 \n0 \n0 \n1 \nPULSE POSITIONS \n(0 or 1 in a pulse position denotes \nRANGE \nabsence or presence of a pulse, respectively) \nIncrements \n(Feet)",
    "RANGE \nabsence or presence of a pulse, respectively) \nIncrements \n(Feet) \nD2 \nD4 \nA1 \nA2 \nA4 \nB1 \nB2 \nB4 \nC1 \nC2 \nC4",
    "102 750  to  102 850  \n1 \n0 \n1 \n1 \n1 \n0 \n0 \n0 \n0 \n0 \n1 \n102 850  to  102 950  \n1 \n0 \n1 \n1 \n1 \n0 \n0 \n0 \n0 \n1 \n1 \n102 950  to  103 050  \n1 \n0 \n1 \n1 \n1 \n0 \n0 \n0 \n0 \n1 \n0 \n103 050  to  103 150  \n1 \n0 \n1 \n1 \n1 \n0 \n0 \n0 \n1 \n1 \n0 \n103 150  to  103 250  \n1 \n0 \n1 \n1 \n1 \n0 \n0 \n0 \n1 \n0 \n0 \n103 250  to  103 350  \n1 \n0 \n1 \n1 \n1 \n0 \n0 \n1 \n1 \n0 \n0 \n103 350  to  103 450  \n1 \n0 \n1 \n1 \n1 \n0 \n0 \n1 \n1 \n1 \n0 \n103 450  to  103 550  \n1 \n0 \n1 \n1 \n1 \n0 \n0 \n1 \n0 \n1 \n0 \n103 550  to  103 650  \n1 \n0 \n1 \n1 \n1 \n0 \n0 \n1 \n0",
    "1 \n0 \n1 \n1 \n1 \n0 \n0 \n1 \n0 \n1 \n0 \n103 550  to  103 650  \n1 \n0 \n1 \n1 \n1 \n0 \n0 \n1 \n0 \n1 \n1 \n103 650  to  103 750  \n1 \n0 \n1 \n1 \n1 \n0 \n0 \n1 \n0 \n0 \n1 \n103 750  to  103 850  \n1 \n0 \n1 \n1 \n1 \n0 \n1 \n1 \n0 \n0 \n1 \n103 850  to  103 950  \n1 \n0 \n1 \n1 \n1 \n0 \n1 \n1 \n0 \n1 \n1 \n103 950  to  104 050  \n1 \n0 \n1 \n1 \n1 \n0 \n1 \n1 \n0 \n1 \n0 \n104 050  to  104 150  \n1 \n0 \n1 \n1 \n1 \n0 \n1 \n1 \n1 \n1 \n0 \n104 150  to  104 250  \n1 \n0 \n1 \n1 \n1 \n0 \n1 \n1 \n1 \n0 \n0 \n104 250  to  104 350  \n1 \n0 \n1 \n1 \n1 \n0 \n1 \n0 \n1 \n0 \n0",
    "1 \n0 \n1 \n1 \n1 \n0 \n1 \n1 \n1 \n0 \n0 \n104 250  to  104 350  \n1 \n0 \n1 \n1 \n1 \n0 \n1 \n0 \n1 \n0 \n0 \n104 350  to  104 450  \n1 \n0 \n1 \n1 \n1 \n0 \n1 \n0 \n1 \n1 \n0 \n104 450  to  104 550  \n1 \n0 \n1 \n1 \n1 \n0 \n1 \n0 \n0 \n1 \n0 \n104 550  to  104 650  \n1 \n0 \n1 \n1 \n1 \n0 \n1 \n0 \n0 \n1 \n1 \n104 650  to  104 750  \n1 \n0 \n1 \n1 \n1 \n0 \n1 \n0 \n0 \n0 \n1 \n104 750  to  104 850  \n1 \n0 \n1 \n1 \n1 \n1 \n1 \n0 \n0 \n0 \n1 \n104 850  to  104 950  \n1 \n0 \n1 \n1 \n1 \n1 \n1 \n0 \n0 \n1 \n1 \n104 950  to  105 050  \n1 \n0 \n1 \n1 \n1 \n1 \n1 \n0 \n0 \n1 \n0",
    "1 \n0 \n1 \n1 \n1 \n1 \n1 \n0 \n0 \n1 \n1 \n104 950  to  105 050  \n1 \n0 \n1 \n1 \n1 \n1 \n1 \n0 \n0 \n1 \n0 \n105 050  to  105 150  \n1 \n0 \n1 \n1 \n1 \n1 \n1 \n0 \n1 \n1 \n0 \n105 150  to  105 250  \n1 \n0 \n1 \n1 \n1 \n1 \n1 \n0 \n1 \n0 \n0 \n105 250  to  105 350  \n1 \n0 \n1 \n1 \n1 \n1 \n1 \n1 \n1 \n0 \n0 \n105 350  to  105 450  \n1 \n0 \n1 \n1 \n1 \n1 \n1 \n1 \n1 \n1 \n0 \n105 450  to  105 550  \n1 \n0 \n1 \n1 \n1 \n1 \n1 \n1 \n0 \n1 \n0 \n105 550  to  105 650  \n1 \n0 \n1 \n1 \n1 \n1 \n1 \n1 \n0 \n1 \n1 \n105 650  to  105 750  \n1 \n0 \n1 \n1 \n1 \n1 \n1 \n1 \n0 \n0 \n1",
    "1 \n0 \n1 \n1 \n1 \n1 \n1 \n1 \n0 \n1 \n1 \n105 650  to  105 750  \n1 \n0 \n1 \n1 \n1 \n1 \n1 \n1 \n0 \n0 \n1 \n105 750  to  105 850  \n1 \n0 \n1 \n1 \n1 \n1 \n0 \n1 \n0 \n0 \n1 \n105 850  to  105 950  \n1 \n0 \n1 \n1 \n1 \n1 \n0 \n1 \n0 \n1 \n1 \n105 950  to  106 050  \n1 \n0 \n1 \n1 \n1 \n1 \n0 \n1 \n0 \n1 \n0 \n106 050  to  106 150  \n1 \n0 \n1 \n1 \n1 \n1 \n0 \n1 \n1 \n1 \n0 \n106 150  to  106 250  \n1 \n0 \n1 \n1 \n1 \n1 \n0 \n1 \n1 \n0 \n0 \n106 250  to  106 350  \n1 \n0 \n1 \n1 \n1 \n1 \n0 \n0 \n1 \n0 \n0 \n106 350  to  106 450  \n1 \n0 \n1 \n1 \n1 \n1 \n0 \n0 \n1 \n1 \n0",
    "1 \n0 \n1 \n1 \n1 \n1 \n0 \n0 \n1 \n0 \n0 \n106 350  to  106 450  \n1 \n0 \n1 \n1 \n1 \n1 \n0 \n0 \n1 \n1 \n0 \n106 450  to  106 550  \n1 \n0 \n1 \n1 \n1 \n1 \n0 \n0 \n0 \n1 \n0 \n106 550  to  106 650  \n1 \n0 \n1 \n1 \n1 \n1 \n0 \n0 \n0 \n1 \n1 \n106 650  to  106 750  \n1 \n0 \n1 \n1 \n1 \n1 \n0 \n0 \n0 \n0 \n1 \n106 750  to  106 850  \n1 \n0 \n1 \n1 \n0 \n1 \n0 \n0 \n0 \n0 \n1 \n106 850  to  106 950  \n1 \n0 \n1 \n1 \n0 \n1 \n0 \n0 \n0 \n1 \n1 \n106 950  to  107 050  \n1 \n0 \n1 \n1 \n0 \n1 \n0 \n0 \n0 \n1 \n0 \n107 050  to  107 150  \n1 \n0 \n1 \n1 \n0 \n1 \n0 \n0 \n1 \n1 \n0",
    "1 \n0 \n1 \n1 \n0 \n1 \n0 \n0 \n0 \n1 \n0 \n107 050  to  107 150  \n1 \n0 \n1 \n1 \n0 \n1 \n0 \n0 \n1 \n1 \n0 \n107 150  to  107 250  \n1 \n0 \n1 \n1 \n0 \n1 \n0 \n0 \n1 \n0 \n0 \n107 250  to  107 350  \n1 \n0 \n1 \n1 \n0 \n1 \n0 \n1 \n1 \n0 \n0 \n107 350  to  107 450  \n1 \n0 \n1 \n1 \n0 \n1 \n0 \n1 \n1 \n1 \n0 \n107 450  to  107 550  \n1 \n0 \n1 \n1 \n0 \n1 \n0 \n1 \n0 \n1 \n0 \n107 550  to  107 650  \n1 \n0 \n1 \n1 \n0 \n1 \n0 \n1 \n0 \n1 \n1 \n107 650  to  107 750  \n1 \n0 \n1 \n1 \n0 \n1 \n0 \n1 \n0 \n0 \n1 \nPULSE POSITIONS \n(0 or 1 in a pulse position denotes \nRANGE",
    "1 \n0 \n1 \n1 \n0 \n1 \n0 \n1 \n0 \n0 \n1 \nPULSE POSITIONS \n(0 or 1 in a pulse position denotes \nRANGE \nabsence or presence of a pulse, respectively) \nIncrements \n(Feet) \nD2 \nD4 \nA1 \nA2 \nA4 \nB1 \nB2 \nB4 \nC1 \nC2 \nC4",
    "107 750  to  107 850  \n1 \n0 \n1 \n1 \n0 \n1 \n1 \n1 \n0 \n0 \n1 \n107 850  to  107 950  \n1 \n0 \n1 \n1 \n0 \n1 \n1 \n1 \n0 \n1 \n1 \n107 950  to  108 050  \n1 \n0 \n1 \n1 \n0 \n1 \n1 \n1 \n0 \n1 \n0 \n108 050  to  108 150  \n1 \n0 \n1 \n1 \n0 \n1 \n1 \n1 \n1 \n1 \n0 \n108 150  to  108 250  \n1 \n0 \n1 \n1 \n0 \n1 \n1 \n1 \n1 \n0 \n0 \n108 250  to  108 350  \n1 \n0 \n1 \n1 \n0 \n1 \n1 \n0 \n1 \n0 \n0 \n108 350  to  108 450  \n1 \n0 \n1 \n1 \n0 \n1 \n1 \n0 \n1 \n1 \n0 \n108 450  to  108 550  \n1 \n0 \n1 \n1 \n0 \n1 \n1 \n0 \n0 \n1 \n0 \n108 550  to  108 650  \n1 \n0 \n1 \n1 \n0 \n1 \n1 \n0 \n0",
    "1 \n0 \n1 \n1 \n0 \n1 \n1 \n0 \n0 \n1 \n0 \n108 550  to  108 650  \n1 \n0 \n1 \n1 \n0 \n1 \n1 \n0 \n0 \n1 \n1 \n108 650  to  108 750  \n1 \n0 \n1 \n1 \n0 \n1 \n1 \n0 \n0 \n0 \n1 \n108 750  to  108 850  \n1 \n0 \n1 \n1 \n0 \n0 \n1 \n0 \n0 \n0 \n1 \n108 850  to  108 950  \n1 \n0 \n1 \n1 \n0 \n0 \n1 \n0 \n0 \n1 \n1 \n108 950  to  109 050  \n1 \n0 \n1 \n1 \n0 \n0 \n1 \n0 \n0 \n1 \n0 \n109 050  to  109 150  \n1 \n0 \n1 \n1 \n0 \n0 \n1 \n0 \n1 \n1 \n0 \n109 150  to  109 250  \n1 \n0 \n1 \n1 \n0 \n0 \n1 \n0 \n1 \n0 \n0 \n109 250  to  109 350  \n1 \n0 \n1 \n1 \n0 \n0 \n1 \n1 \n1 \n0 \n0",
    "1 \n0 \n1 \n1 \n0 \n0 \n1 \n0 \n1 \n0 \n0 \n109 250  to  109 350  \n1 \n0 \n1 \n1 \n0 \n0 \n1 \n1 \n1 \n0 \n0 \n109 350  to  109 450  \n1 \n0 \n1 \n1 \n0 \n0 \n1 \n1 \n1 \n1 \n0 \n109 450  to  109 550  \n1 \n0 \n1 \n1 \n0 \n0 \n1 \n1 \n0 \n1 \n0 \n109 550  to  109 650  \n1 \n0 \n1 \n1 \n0 \n0 \n1 \n1 \n0 \n1 \n1 \n109 650  to  109 750  \n1 \n0 \n1 \n1 \n0 \n0 \n1 \n1 \n0 \n0 \n1 \n109 750  to  109 850  \n1 \n0 \n1 \n1 \n0 \n0 \n0 \n1 \n0 \n0 \n1 \n109 850  to  109 950  \n1 \n0 \n1 \n1 \n0 \n0 \n0 \n1 \n0 \n1 \n1 \n109 950  to  110 050  \n1 \n0 \n1 \n1 \n0 \n0 \n0 \n1 \n0 \n1 \n0",
    "1 \n0 \n1 \n1 \n0 \n0 \n0 \n1 \n0 \n1 \n1 \n109 950  to  110 050  \n1 \n0 \n1 \n1 \n0 \n0 \n0 \n1 \n0 \n1 \n0 \n110 050  to  110 150  \n1 \n0 \n1 \n1 \n0 \n0 \n0 \n1 \n1 \n1 \n0 \n110 150  to  110 250  \n1 \n0 \n1 \n1 \n0 \n0 \n0 \n1 \n1 \n0 \n0 \n110 250  to  110 350  \n1 \n0 \n1 \n1 \n0 \n0 \n0 \n0 \n1 \n0 \n0 \n110 350  to  110 450  \n1 \n0 \n1 \n1 \n0 \n0 \n0 \n0 \n1 \n1 \n0 \n110 450  to  110 550  \n1 \n0 \n1 \n1 \n0 \n0 \n0 \n0 \n0 \n1 \n0 \n110 550  to  110 650  \n1 \n0 \n1 \n1 \n0 \n0 \n0 \n0 \n0 \n1 \n1 \n110 650  to  110 750  \n1 \n0 \n1 \n1 \n0 \n0 \n0 \n0 \n0 \n0 \n1",
    "1 \n0 \n1 \n1 \n0 \n0 \n0 \n0 \n0 \n1 \n1 \n110 650  to  110 750  \n1 \n0 \n1 \n1 \n0 \n0 \n0 \n0 \n0 \n0 \n1 \n110 750  to  110 850  \n1 \n0 \n0 \n1 \n0 \n0 \n0 \n0 \n0 \n0 \n1 \n110 850  to  110 950  \n1 \n0 \n0 \n1 \n0 \n0 \n0 \n0 \n0 \n1 \n1 \n110 950  to  111 050  \n1 \n0 \n0 \n1 \n0 \n0 \n0 \n0 \n0 \n1 \n0 \n111 050  to  111 150  \n1 \n0 \n0 \n1 \n0 \n0 \n0 \n0 \n1 \n1 \n0 \n111 150  to  111 250  \n1 \n0 \n0 \n1 \n0 \n0 \n0 \n0 \n1 \n0 \n0 \n111 250  to  111 350  \n1 \n0 \n0 \n1 \n0 \n0 \n0 \n1 \n1 \n0 \n0 \n111 350  to  111 450  \n1 \n0 \n0 \n1 \n0 \n0 \n0 \n1 \n1 \n1 \n0",
    "1 \n0 \n0 \n1 \n0 \n0 \n0 \n1 \n1 \n0 \n0 \n111 350  to  111 450  \n1 \n0 \n0 \n1 \n0 \n0 \n0 \n1 \n1 \n1 \n0 \n111 450  to  111 550  \n1 \n0 \n0 \n1 \n0 \n0 \n0 \n1 \n0 \n1 \n0 \n111 550  to  111 650  \n1 \n0 \n0 \n1 \n0 \n0 \n0 \n1 \n0 \n1 \n1 \n111 650  to  111 750  \n1 \n0 \n0 \n1 \n0 \n0 \n0 \n1 \n0 \n0 \n1 \n111 750  to  111 850  \n1 \n0 \n0 \n1 \n0 \n0 \n1 \n1 \n0 \n0 \n1 \n111 850  to  111 950  \n1 \n0 \n0 \n1 \n0 \n0 \n1 \n1 \n0 \n1 \n1 \n111 950  to  112 050  \n1 \n0 \n0 \n1 \n0 \n0 \n1 \n1 \n0 \n1 \n0 \n112 050  to  112 150  \n1 \n0 \n0 \n1 \n0 \n0 \n1 \n1 \n1 \n1 \n0",
    "1 \n0 \n0 \n1 \n0 \n0 \n1 \n1 \n0 \n1 \n0 \n112 050  to  112 150  \n1 \n0 \n0 \n1 \n0 \n0 \n1 \n1 \n1 \n1 \n0 \n112 150  to  112 250  \n1 \n0 \n0 \n1 \n0 \n0 \n1 \n1 \n1 \n0 \n0 \n112 250  to  112 350  \n1 \n0 \n0 \n1 \n0 \n0 \n1 \n0 \n1 \n0 \n0 \n112 350  to  112 450  \n1 \n0 \n0 \n1 \n0 \n0 \n1 \n0 \n1 \n1 \n0 \n112 450  to  112 550  \n1 \n0 \n0 \n1 \n0 \n0 \n1 \n0 \n0 \n1 \n0 \n112 550  to  112 650  \n1 \n0 \n0 \n1 \n0 \n0 \n1 \n0 \n0 \n1 \n1 \n112 650  to  112 750  \n1 \n0 \n0 \n1 \n0 \n0 \n1 \n0 \n0 \n0 \n1 \nPULSE POSITIONS \n(0 or 1 in a pulse position denotes \nRANGE",
    "1 \n0 \n0 \n1 \n0 \n0 \n1 \n0 \n0 \n0 \n1 \nPULSE POSITIONS \n(0 or 1 in a pulse position denotes \nRANGE \nabsence or presence of a pulse, respectively) \nIncrements \n(Feet) \nD2 \nD4 \nA1 \nA2 \nA4 \nB1 \nB2 \nB4 \nC1 \nC2 \nC4",
    "112 750  to  112 850  \n1 \n0 \n0 \n1 \n0 \n1 \n1 \n0 \n0 \n0 \n1 \n112 850  to  112 950  \n1 \n0 \n0 \n1 \n0 \n1 \n1 \n0 \n0 \n1 \n1 \n112 950  to  113 050  \n1 \n0 \n0 \n1 \n0 \n1 \n1 \n0 \n0 \n1 \n0 \n113 050  to  113 150  \n1 \n0 \n0 \n1 \n0 \n1 \n1 \n0 \n1 \n1 \n0 \n113 150  to  113 250  \n1 \n0 \n0 \n1 \n0 \n1 \n1 \n0 \n1 \n0 \n0 \n113 250  to  113 350  \n1 \n0 \n0 \n1 \n0 \n1 \n1 \n1 \n1 \n0 \n0 \n113 350  to  113 450  \n1 \n0 \n0 \n1 \n0 \n1 \n1 \n1 \n1 \n1 \n0 \n113 450  to  113 550  \n1 \n0 \n0 \n1 \n0 \n1 \n1 \n1 \n0 \n1 \n0 \n113 550  to  113 650  \n1 \n0 \n0 \n1 \n0 \n1 \n1 \n1 \n0",
    "1 \n0 \n0 \n1 \n0 \n1 \n1 \n1 \n0 \n1 \n0 \n113 550  to  113 650  \n1 \n0 \n0 \n1 \n0 \n1 \n1 \n1 \n0 \n1 \n1 \n113 650  to  113 750  \n1 \n0 \n0 \n1 \n0 \n1 \n1 \n1 \n0 \n0 \n1 \n113 750  to  113 850  \n1 \n0 \n0 \n1 \n0 \n1 \n0 \n1 \n0 \n0 \n1 \n113 850  to  113 950  \n1 \n0 \n0 \n1 \n0 \n1 \n0 \n1 \n0 \n1 \n1 \n113 950  to  114 050  \n1 \n0 \n0 \n1 \n0 \n1 \n0 \n1 \n0 \n1 \n0 \n114 050  to  114 150  \n1 \n0 \n0 \n1 \n0 \n1 \n0 \n1 \n1 \n1 \n0 \n114 150  to  114 250  \n1 \n0 \n0 \n1 \n0 \n1 \n0 \n1 \n1 \n0 \n0 \n114 250  to  114 350  \n1 \n0 \n0 \n1 \n0 \n1 \n0 \n0 \n1 \n0 \n0",
    "1 \n0 \n0 \n1 \n0 \n1 \n0 \n1 \n1 \n0 \n0 \n114 250  to  114 350  \n1 \n0 \n0 \n1 \n0 \n1 \n0 \n0 \n1 \n0 \n0 \n114 350  to  114 450  \n1 \n0 \n0 \n1 \n0 \n1 \n0 \n0 \n1 \n1 \n0 \n114 450  to  114 550  \n1 \n0 \n0 \n1 \n0 \n1 \n0 \n0 \n0 \n1 \n0 \n114 550  to  114 650  \n1 \n0 \n0 \n1 \n0 \n1 \n0 \n0 \n0 \n1 \n1 \n114 650  to  114 750  \n1 \n0 \n0 \n1 \n0 \n1 \n0 \n0 \n0 \n0 \n1 \n114 750  to  114 850  \n1 \n0 \n0 \n1 \n1 \n1 \n0 \n0 \n0 \n0 \n1 \n114 850  to  114 950  \n1 \n0 \n0 \n1 \n1 \n1 \n0 \n0 \n0 \n1 \n1 \n114 950  to  115 050  \n1 \n0 \n0 \n1 \n1 \n1 \n0 \n0 \n0 \n1 \n0",
    "1 \n0 \n0 \n1 \n1 \n1 \n0 \n0 \n0 \n1 \n1 \n114 950  to  115 050  \n1 \n0 \n0 \n1 \n1 \n1 \n0 \n0 \n0 \n1 \n0 \n115 050  to  115 150  \n1 \n0 \n0 \n1 \n1 \n1 \n0 \n0 \n1 \n1 \n0 \n115 150  to  115 250  \n1 \n0 \n0 \n1 \n1 \n1 \n0 \n0 \n1 \n0 \n0 \n115 250  to  115 350  \n1 \n0 \n0 \n1 \n1 \n1 \n0 \n1 \n1 \n0 \n0 \n115 350  to  115 450  \n1 \n0 \n0 \n1 \n1 \n1 \n0 \n1 \n1 \n1 \n0 \n115 450  to  115 550  \n1 \n0 \n0 \n1 \n1 \n1 \n0 \n1 \n0 \n1 \n0 \n115 550  to  115 650  \n1 \n0 \n0 \n1 \n1 \n1 \n0 \n1 \n0 \n1 \n1 \n115 650  to  115 750  \n1 \n0 \n0 \n1 \n1 \n1 \n0 \n1 \n0 \n0 \n1",
    "1 \n0 \n0 \n1 \n1 \n1 \n0 \n1 \n0 \n1 \n1 \n115 650  to  115 750  \n1 \n0 \n0 \n1 \n1 \n1 \n0 \n1 \n0 \n0 \n1 \n115 750  to  115 850  \n1 \n0 \n0 \n1 \n1 \n1 \n1 \n1 \n0 \n0 \n1 \n115 850  to  115 950  \n1 \n0 \n0 \n1 \n1 \n1 \n1 \n1 \n0 \n1 \n1 \n115 950  to  116 050  \n1 \n0 \n0 \n1 \n1 \n1 \n1 \n1 \n0 \n1 \n0 \n116 050  to  116 150  \n1 \n0 \n0 \n1 \n1 \n1 \n1 \n1 \n1 \n1 \n0 \n116 150  to  116 250  \n1 \n0 \n0 \n1 \n1 \n1 \n1 \n1 \n1 \n0 \n0 \n116 250  to  116 350  \n1 \n0 \n0 \n1 \n1 \n1 \n1 \n0 \n1 \n0 \n0 \n116 350  to  116 450  \n1 \n0 \n0 \n1 \n1 \n1 \n1 \n0 \n1 \n1 \n0",
    "1 \n0 \n0 \n1 \n1 \n1 \n1 \n0 \n1 \n0 \n0 \n116 350  to  116 450  \n1 \n0 \n0 \n1 \n1 \n1 \n1 \n0 \n1 \n1 \n0 \n116 450  to  116 550  \n1 \n0 \n0 \n1 \n1 \n1 \n1 \n0 \n0 \n1 \n0 \n116 550  to  116 650  \n1 \n0 \n0 \n1 \n1 \n1 \n1 \n0 \n0 \n1 \n1 \n116 650  to  116 750  \n1 \n0 \n0 \n1 \n1 \n1 \n1 \n0 \n0 \n0 \n1 \n116 750  to  116 850  \n1 \n0 \n0 \n1 \n1 \n0 \n1 \n0 \n0 \n0 \n1 \n116 850  to  116 950  \n1 \n0 \n0 \n1 \n1 \n0 \n1 \n0 \n0 \n1 \n1 \n116 950  to  117 050  \n1 \n0 \n0 \n1 \n1 \n0 \n1 \n0 \n0 \n1 \n0 \n117 050  to  117 150  \n1 \n0 \n0 \n1 \n1 \n0 \n1 \n0 \n1 \n1 \n0",
    "1 \n0 \n0 \n1 \n1 \n0 \n1 \n0 \n0 \n1 \n0 \n117 050  to  117 150  \n1 \n0 \n0 \n1 \n1 \n0 \n1 \n0 \n1 \n1 \n0 \n117 150  to  117 250  \n1 \n0 \n0 \n1 \n1 \n0 \n1 \n0 \n1 \n0 \n0 \n117 250  to  117 350  \n1 \n0 \n0 \n1 \n1 \n0 \n1 \n1 \n1 \n0 \n0 \n117 350  to  117 450  \n1 \n0 \n0 \n1 \n1 \n0 \n1 \n1 \n1 \n1 \n0 \n117 450  to  117 550  \n1 \n0 \n0 \n1 \n1 \n0 \n1 \n1 \n0 \n1 \n0 \n117 550  to  117 650  \n1 \n0 \n0 \n1 \n1 \n0 \n1 \n1 \n0 \n1 \n1 \n117 650  to  117 750  \n1 \n0 \n0 \n1 \n1 \n0 \n1 \n1 \n0 \n0 \n1 \nPULSE POSITIONS \n(0 or 1 in a pulse position denotes \nRANGE",
    "1 \n0 \n0 \n1 \n1 \n0 \n1 \n1 \n0 \n0 \n1 \nPULSE POSITIONS \n(0 or 1 in a pulse position denotes \nRANGE \nabsence or presence of a pulse, respectively) \nIncrements \n(Feet) \nD2 \nD4 \nA1 \nA2 \nA4 \nB1 \nB2 \nB4 \nC1 \nC2 \nC4",
    "117 750  to  117 850  \n1 \n0 \n0 \n1 \n1 \n0 \n0 \n1 \n0 \n0 \n1 \n117 850  to  117 950  \n1 \n0 \n0 \n1 \n1 \n0 \n0 \n1 \n0 \n1 \n1 \n117 950  to  118 050  \n1 \n0 \n0 \n1 \n1 \n0 \n0 \n1 \n0 \n1 \n0 \n118 050  to  118 150  \n1 \n0 \n0 \n1 \n1 \n0 \n0 \n1 \n1 \n1 \n0 \n118 150  to  118 250  \n1 \n0 \n0 \n1 \n1 \n0 \n0 \n1 \n1 \n0 \n0 \n118 250  to  118 350  \n1 \n0 \n0 \n1 \n1 \n0 \n0 \n0 \n1 \n0 \n0 \n118 350  to  118 450  \n1 \n0 \n0 \n1 \n1 \n0 \n0 \n0 \n1 \n1 \n0 \n118 450  to  118 550  \n1 \n0 \n0 \n1 \n1 \n0 \n0 \n0 \n0 \n1 \n0 \n118 550  to  118 650  \n1 \n0 \n0 \n1 \n1 \n0 \n0 \n0 \n0",
    "1 \n0 \n0 \n1 \n1 \n0 \n0 \n0 \n0 \n1 \n0 \n118 550  to  118 650  \n1 \n0 \n0 \n1 \n1 \n0 \n0 \n0 \n0 \n1 \n1 \n118 650  to  118 750  \n1 \n0 \n0 \n1 \n1 \n0 \n0 \n0 \n0 \n0 \n1 \n118 750  to  118 850  \n1 \n0 \n0 \n0 \n1 \n0 \n0 \n0 \n0 \n0 \n1 \n118 850  to  118 950  \n1 \n0 \n0 \n0 \n1 \n0 \n0 \n0 \n0 \n1 \n1 \n118 950  to  119 050  \n1 \n0 \n0 \n0 \n1 \n0 \n0 \n0 \n0 \n1 \n0 \n119 050  to  119 150  \n1 \n0 \n0 \n0 \n1 \n0 \n0 \n0 \n1 \n1 \n0 \n119 150  to  119 250  \n1 \n0 \n0 \n0 \n1 \n0 \n0 \n0 \n1 \n0 \n0 \n119 250  to  119 350  \n1 \n0 \n0 \n0 \n1 \n0 \n0 \n1 \n1 \n0 \n0",
    "1 \n0 \n0 \n0 \n1 \n0 \n0 \n0 \n1 \n0 \n0 \n119 250  to  119 350  \n1 \n0 \n0 \n0 \n1 \n0 \n0 \n1 \n1 \n0 \n0 \n119 350  to  119 450  \n1 \n0 \n0 \n0 \n1 \n0 \n0 \n1 \n1 \n1 \n0 \n119 450  to  119 550  \n1 \n0 \n0 \n0 \n1 \n0 \n0 \n1 \n0 \n1 \n0 \n119 550  to  119 650  \n1 \n0 \n0 \n0 \n1 \n0 \n0 \n1 \n0 \n1 \n1 \n119 650  to  119 750  \n1 \n0 \n0 \n0 \n1 \n0 \n0 \n1 \n0 \n0 \n1 \n119 750  to  119 850  \n1 \n0 \n0 \n0 \n1 \n0 \n1 \n1 \n0 \n0 \n1 \n119 850  to  119 950  \n1 \n0 \n0 \n0 \n1 \n0 \n1 \n1 \n0 \n1 \n1 \n119 950  to  120 050  \n1 \n0 \n0 \n0 \n1 \n0 \n1 \n1 \n0 \n1 \n0",
    "1 \n0 \n0 \n0 \n1 \n0 \n1 \n1 \n0 \n1 \n1 \n119 950  to  120 050  \n1 \n0 \n0 \n0 \n1 \n0 \n1 \n1 \n0 \n1 \n0 \n120 050  to  120 150  \n1 \n0 \n0 \n0 \n1 \n0 \n1 \n1 \n1 \n1 \n0 \n120 150  to  120 250  \n1 \n0 \n0 \n0 \n1 \n0 \n1 \n1 \n1 \n0 \n0 \n120 250  to  120 350  \n1 \n0 \n0 \n0 \n1 \n0 \n1 \n0 \n1 \n0 \n0 \n120 350  to  120 450  \n1 \n0 \n0 \n0 \n1 \n0 \n1 \n0 \n1 \n1 \n0 \n120 450  to  120 550  \n1 \n0 \n0 \n0 \n1 \n0 \n1 \n0 \n0 \n1 \n0 \n120 550  to  120 650  \n1 \n0 \n0 \n0 \n1 \n0 \n1 \n0 \n0 \n1 \n1 \n120 650  to  120 750  \n1 \n0 \n0 \n0 \n1 \n0 \n1 \n0 \n0 \n0 \n1",
    "1 \n0 \n0 \n0 \n1 \n0 \n1 \n0 \n0 \n1 \n1 \n120 650  to  120 750  \n1 \n0 \n0 \n0 \n1 \n0 \n1 \n0 \n0 \n0 \n1 \n120 750  to  120 850  \n1 \n0 \n0 \n0 \n1 \n1 \n1 \n0 \n0 \n0 \n1 \n120 850  to  120 950  \n1 \n0 \n0 \n0 \n1 \n1 \n1 \n0 \n0 \n1 \n1 \n120 950  to  121 050  \n1 \n0 \n0 \n0 \n1 \n1 \n1 \n0 \n0 \n1 \n0 \n121 050  to  121 150  \n1 \n0 \n0 \n0 \n1 \n1 \n1 \n0 \n1 \n1 \n0 \n121 150  to  121 250  \n1 \n0 \n0 \n0 \n1 \n1 \n1 \n0 \n1 \n0 \n0 \n121 250  to  121 350  \n1 \n0 \n0 \n0 \n1 \n1 \n1 \n1 \n1 \n0 \n0 \n121 350  to  121 450  \n1 \n0 \n0 \n0 \n1 \n1 \n1 \n1 \n1 \n1 \n0",
    "1 \n0 \n0 \n0 \n1 \n1 \n1 \n1 \n1 \n0 \n0 \n121 350  to  121 450  \n1 \n0 \n0 \n0 \n1 \n1 \n1 \n1 \n1 \n1 \n0 \n121 450  to  121 550  \n1 \n0 \n0 \n0 \n1 \n1 \n1 \n1 \n0 \n1 \n0 \n121 550  to  121 650  \n1 \n0 \n0 \n0 \n1 \n1 \n1 \n1 \n0 \n1 \n1 \n121 650  to  121 750  \n1 \n0 \n0 \n0 \n1 \n1 \n1 \n1 \n0 \n0 \n1 \n121 750  to  121 850  \n1 \n0 \n0 \n0 \n1 \n1 \n0 \n1 \n0 \n0 \n1 \n121 850  to  121 950  \n1 \n0 \n0 \n0 \n1 \n1 \n0 \n1 \n0 \n1 \n1 \n121 950  to  122 050  \n1 \n0 \n0 \n0 \n1 \n1 \n0 \n1 \n0 \n1 \n0 \n122 050  to  122 150  \n1 \n0 \n0 \n0 \n1 \n1 \n0 \n1 \n1 \n1 \n0",
    "1 \n0 \n0 \n0 \n1 \n1 \n0 \n1 \n0 \n1 \n0 \n122 050  to  122 150  \n1 \n0 \n0 \n0 \n1 \n1 \n0 \n1 \n1 \n1 \n0 \n122 150  to  122 250  \n1 \n0 \n0 \n0 \n1 \n1 \n0 \n1 \n1 \n0 \n0 \n122 250  to  122 350  \n1 \n0 \n0 \n0 \n1 \n1 \n0 \n0 \n1 \n0 \n0 \n122 350  to  122 450  \n1 \n0 \n0 \n0 \n1 \n1 \n0 \n0 \n1 \n1 \n0 \n122 450  to  122 550  \n1 \n0 \n0 \n0 \n1 \n1 \n0 \n0 \n0 \n1 \n0 \n122 550  to  122 650  \n1 \n0 \n0 \n0 \n1 \n1 \n0 \n0 \n0 \n1 \n1 \n122 650  to  122 750  \n1 \n0 \n0 \n0 \n1 \n1 \n0 \n0 \n0 \n0 \n1 \nPULSE POSITIONS \n(0 or 1 in a pulse position denotes \nRANGE",
    "1 \n0 \n0 \n0 \n1 \n1 \n0 \n0 \n0 \n0 \n1 \nPULSE POSITIONS \n(0 or 1 in a pulse position denotes \nRANGE \nabsence or presence of a pulse, respectively) \nIncrements \n(Feet) \nD2 \nD4 \nA1 \nA2 \nA4 \nB1 \nB2 \nB4 \nC1 \nC2 \nC4",
    "122 750  to  122 850  \n1 \n0 \n0 \n0 \n0 \n1 \n0 \n0 \n0 \n0 \n1 \n122 850  to  122 950  \n1 \n0 \n0 \n0 \n0 \n1 \n0 \n0 \n0 \n1 \n1 \n122 950  to  123 050  \n1 \n0 \n0 \n0 \n0 \n1 \n0 \n0 \n0 \n1 \n0 \n123 050  to  123 150  \n1 \n0 \n0 \n0 \n0 \n1 \n0 \n0 \n1 \n1 \n0 \n123 150  to  123 250  \n1 \n0 \n0 \n0 \n0 \n1 \n0 \n0 \n1 \n0 \n0 \n123 250  to  123 350  \n1 \n0 \n0 \n0 \n0 \n1 \n0 \n1 \n1 \n0 \n0 \n123 350  to  123 450  \n1 \n0 \n0 \n0 \n0 \n1 \n0 \n1 \n1 \n1 \n0 \n123 450  to  123 550  \n1 \n0 \n0 \n0 \n0 \n1 \n0 \n1 \n0 \n1 \n0 \n123 550  to  123 650  \n1 \n0 \n0 \n0 \n0 \n1 \n0 \n1 \n0",
    "1 \n0 \n0 \n0 \n0 \n1 \n0 \n1 \n0 \n1 \n0 \n123 550  to  123 650  \n1 \n0 \n0 \n0 \n0 \n1 \n0 \n1 \n0 \n1 \n1 \n123 650  to  123 750  \n1 \n0 \n0 \n0 \n0 \n1 \n0 \n1 \n0 \n0 \n1 \n123 750  to  123 850  \n1 \n0 \n0 \n0 \n0 \n1 \n1 \n1 \n0 \n0 \n1 \n123 850  to  123 950  \n1 \n0 \n0 \n0 \n0 \n1 \n1 \n1 \n0 \n1 \n1 \n123 950  to  124 050  \n1 \n0 \n0 \n0 \n0 \n1 \n1 \n1 \n0 \n1 \n0 \n124 050  to  124 150  \n1 \n0 \n0 \n0 \n0 \n1 \n1 \n1 \n1 \n1 \n0 \n124 150  to  124 250  \n1 \n0 \n0 \n0 \n0 \n1 \n1 \n1 \n1 \n0 \n0 \n124 250  to  124 350  \n1 \n0 \n0 \n0 \n0 \n1 \n1 \n0 \n1 \n0 \n0",
    "1 \n0 \n0 \n0 \n0 \n1 \n1 \n1 \n1 \n0 \n0 \n124 250  to  124 350  \n1 \n0 \n0 \n0 \n0 \n1 \n1 \n0 \n1 \n0 \n0 \n124 350  to  124 450  \n1 \n0 \n0 \n0 \n0 \n1 \n1 \n0 \n1 \n1 \n0 \n124 450  to  124 550  \n1 \n0 \n0 \n0 \n0 \n1 \n1 \n0 \n0 \n1 \n0 \n124 550  to  124 650  \n1 \n0 \n0 \n0 \n0 \n1 \n1 \n0 \n0 \n1 \n1 \n124 650  to  124 750  \n1 \n0 \n0 \n0 \n0 \n1 \n1 \n0 \n0 \n0 \n1 \n124 750  to  124 850  \n1 \n0 \n0 \n0 \n0 \n0 \n1 \n0 \n0 \n0 \n1 \n124 850  to  124 950  \n1 \n0 \n0 \n0 \n0 \n0 \n1 \n0 \n0 \n1 \n1 \n124 950  to  125 050  \n1 \n0 \n0 \n0 \n0 \n0 \n1 \n0 \n0 \n1 \n0",
    "1 \n0 \n0 \n0 \n0 \n0 \n1 \n0 \n0 \n1 \n1 \n124 950  to  125 050  \n1 \n0 \n0 \n0 \n0 \n0 \n1 \n0 \n0 \n1 \n0 \n125 050  to  125 150  \n1 \n0 \n0 \n0 \n0 \n0 \n1 \n0 \n1 \n1 \n0 \n125 150  to  125 250  \n1 \n0 \n0 \n0 \n0 \n0 \n1 \n0 \n1 \n0 \n0 \n125 250  to  125 350  \n1 \n0 \n0 \n0 \n0 \n0 \n1 \n1 \n1 \n0 \n0 \n125 350  to  125 450  \n1 \n0 \n0 \n0 \n0 \n0 \n1 \n1 \n1 \n1 \n0 \n125 450  to  125 550  \n1 \n0 \n0 \n0 \n0 \n0 \n1 \n1 \n0 \n1 \n0 \n125 550  to  125 650  \n1 \n0 \n0 \n0 \n0 \n0 \n1 \n1 \n0 \n1 \n1 \n125 650  to  125 750  \n1 \n0 \n0 \n0 \n0 \n0 \n1 \n1 \n0 \n0 \n1",
    "1 \n0 \n0 \n0 \n0 \n0 \n1 \n1 \n0 \n1 \n1 \n125 650  to  125 750  \n1 \n0 \n0 \n0 \n0 \n0 \n1 \n1 \n0 \n0 \n1 \n125 750  to  125 850  \n1 \n0 \n0 \n0 \n0 \n0 \n0 \n1 \n0 \n0 \n1 \n125 850  to  125 950  \n1 \n0 \n0 \n0 \n0 \n0 \n0 \n1 \n0 \n1 \n1 \n125 950  to  126 050  \n1 \n0 \n0 \n0 \n0 \n0 \n0 \n1 \n0 \n1 \n0 \n126 050  to  126 150  \n1 \n0 \n0 \n0 \n0 \n0 \n0 \n1 \n1 \n1 \n0 \n126 150  to  126 250  \n1 \n0 \n0 \n0 \n0 \n0 \n0 \n1 \n1 \n0 \n0 \n126 250  to  126 350  \n1 \n0 \n0 \n0 \n0 \n0 \n0 \n0 \n1 \n0 \n0 \n126 350  to  126 450  \n1 \n0 \n0 \n0 \n0 \n0 \n0 \n0 \n1 \n1 \n0",
    "1 \n0 \n0 \n0 \n0 \n0 \n0 \n0 \n1 \n0 \n0 \n126 350  to  126 450  \n1 \n0 \n0 \n0 \n0 \n0 \n0 \n0 \n1 \n1 \n0 \n126 450  to  126 550  \n1 \n0 \n0 \n0 \n0 \n0 \n0 \n0 \n0 \n1 \n0 \n126 550  to  126 650  \n1 \n0 \n0 \n0 \n0 \n0 \n0 \n0 \n0 \n1 \n1 \n126 650  to  126 750  \n1 \n0 \n0 \n0 \n0 \n0 \n0 \n0 \n0 \n0 \n1"
  ]
}