{
  "source": "RTCA DO-301 2006.md",
  "chunks": [
    "RTCA, Inc. \n\n1828 L Street, NW, Suite 805 \nWashington, D.C. 20036-5133 USA \n\n# Minimum Operational Performance Standards (Mops) For Global Navigation Satellite System (Gnss) Airborne Active Antenna Equipment For Thel1 Frequency Band\n\n \nRTCA DO-301 \n\n      Prepared by: SC-159 \nDecember 13, 2006 \n\n        © 2006 RTCA, Inc. \n\nCopies of this document may be obtained from \n \nRTCA, Inc.",
    "© 2006 RTCA, Inc. \n\nCopies of this document may be obtained from \n \nRTCA, Inc. \n\n \nTelephone: 202-833-9339 \nFacsimile: 202-833-9434 \nInternet: www.rtca.org \n \nPlease visit the RTCA Online Store for document pricing and ordering information.",
    "--``,,,,,,,,,``````,`,,``,,,,`,,-`-`,,`,,`,`,,`---",
    "FOREWORD This report was prepared by Special Committee 159 (SC-159) and approved by the RTCA Program Management Committee (PMC) on December 13, 2006. RTCA, Inc. is a not-for-profit corporation formed to advance the art and science of aviation and aviation electronic systems for the benefit of the public.  The organization functions as a Federal Advisory Committee and develops consensus based recommendations on contemporary aviation issues.  RTCA's objectives include but are not limited to:",
    "- \ncoalescing aviation system user and provider technical requirements in a manner that helps government and industry meet their mutual objectives and responsibilities; \n- \nanalyzing and recommending solutions to the system technical issues that aviation faces as it \ncontinues to pursue increased safety, system capacity and efficiency; \n- \ndeveloping consensus on the application of pertinent technology to fulfill user and provider",
    "- \ndeveloping consensus on the application of pertinent technology to fulfill user and provider \nrequirements, including development of minimum operational performance standards for electronic \nsystems and equipment that support aviation; and \n- \nassisting in developing the appropriate technical material upon which positions for the International \nCivil Aviation Organization and the International Telecommunication Union and other appropriate international organizations can be based.",
    "The organization's recommendations are often used as the basis for government and private sector decisions as well as the foundation for many Federal Aviation Administration Technical Standard Orders. Since RTCA is not an official agency of the United States Government, its recommendations may not be regarded as statements of official government policy unless so enunciated by the U. S. government organization or agency having statutory jurisdiction over any matters to which the recommendations",
    "organization or agency having statutory jurisdiction over any matters to which the recommendations relate.",
    "2.4.2.5 \nActive Antenna Unit Output Load Stability Test (Section 2.2.7)........................24 \n2.4.2.6 \nHigh Radiated Power Performance Tests ............................................................25 \n2.4.3 \nActive Antenna Sub-assembly Tests ...........................................................................27 \n2.4.3.1 \nActive Sub-assembly RF Gain Response and Noise Temperature Test ..............27 \n2.4.3.2",
    "2.4.3.1 \nActive Sub-assembly RF Gain Response and Noise Temperature Test ..............27 \n2.4.3.2 \nActive Unit Radiated Hot-Cold Noise and Boresight Signal Performance Test .29 \n2.4.3.3 \nActive Sub-assembly Burnout Protection Test....................................................31",
    "Active Sub-assembly Burnout Protection Test....................................................31 \n3. INSTALLED EQUIPMENT PERFORMANCE..................................................................................33 4. EQUIPMENT OPERATIONAL PERFORMANCE CHARACTERISTICS ......................................35 \nMEMBERSHIP………………………………………………………………………………………………37",
    "## Appendix A",
    "A.   G/T Ratio Measurement Theory and Application to receiver System analysis and Test……………….A-1 \nA.1  GNSS Active Antenna G/T Ratio Measurement Theory…………….……………………………A-2 \nA.1.1  Antenna Unit Total Transducer Gain………………………………………….……………A-2 A.1.2  Antenna Unit Output Noise Power Density………………………………………………...A-2 \nA.1.3  G/T Ratio Calculation…………………………………………………………………..…..A-3 A.1.4  Relationship of G/T Ratio to Receiver System Input Signal-to-Noise Density Ratio………A-3",
    "A.2  Other Measurement Approaches and Associated Uncertainties in Conversion to G/T……………A-4 \nA.2.1 Anechoic Chamber Measurement of Antenna Unit Output Noise Power Density………A-4 \nA.2.2 Radiated Hot-Cold Chamber Measurement of Active Sub-assembly Performance….….A-5 A.2.3  Separate Measurements Passive Antenna Element and Active Sub-assembly………….A-7 \nA.3  Receiver System Test Application of Total Transducer Gain and G/T Ratio………………….….A-8",
    "A.3  Receiver System Test Application of Total Transducer Gain and G/T Ratio………………….….A-8 \nA.3.1  General GNSS Receiver System Test Set-up Considerations…………………………..A-8 \nA.3.2 Transformation of Antenna Input Signal and Noise Levels to Receiver Input Values......A-9 \nA.4  References……………………………………………………………………………..…………..A-10 \n \nTABLE OF FIGURES \n \nFigure 2-1  Representative Active Antenna Block Diagram.........................................................................6",
    "Figure 2-2  Minimum Input 1 dB Gain Compression Point vs. Frequency ..................................................8 Figure 2-3  Frequency Selectivity Requirements........................................................................................10 Figure 2-4  Antenna Measurement Range ..................................................................................................21 Figure 2-5  Output VSWR and Total Output Noise Test Set-Up",
    "Figure 2-5  Output VSWR and Total Output Noise Test Set-Up ...............................................................22 Figure 2-6  Boresight 1 dB Gain Compression and Recovery Time Test Set-up .......................................26 Figure 2-7  Active Sub-assembly Gain and Noise Temperature Test Set-up .............................................28 Figure 2-8  Radiated Hot-Cold Noise and Boresight Signal Test Setup.....................................................31 Figure 2-9",
    "and Boresight Signal Test Setup.....................................................31 Figure 2-9  Active Sub-assembly Burnout Protection Test Set-up.............................................................32",
    "Figure A-1 Simplified GNSS Active Antenna Unit Block Diagram…………………………………………A-2 Figure A-2 Radiated Hot-Cold Active Sub-assembly Noise /Gain Test Set-up…………………………….A-6 \nFigure A-3 GNSS Receiver System Installation Diagram……….………………………………………….A-9",
    "## 1. Purpose And Scope 1.1 Introduction",
    "This document contains minimum operational performance standards (MOPS) for GNSS",
    "airborne active antenna equipment designed to use the GPS or Gallileo L1 frequency augmented by other systems/equipment/techniques as appropriate to meet the performance requirements for primary means of navigation for en route, terminal, non-precision, and precision approach phases of flight.  An active antenna is one integrated with a preamplifier. Minimum requirements for passive designs are specified in DO-228 and DO-228, Change 1. Section 1.0 of this document provides information and",
    "are specified in DO-228 and DO-228, Change 1. Section 1.0 of this document provides information and assumptions needed to understand the rationale for equipment characteristics and requirements stated in the remaining sections.  It describes typical equipment applications and operational goals, and forms the basis for the standards stated in Sections 2.0 through 4.0. Section 2.0 contains the minimum performance standards for the equipment.  These standards define required performance under",
    "minimum performance standards for the equipment.  These standards define required performance under standard operating conditions and stressed physical environmental conditions.  It also details the recommended bench test procedures necessary to demonstrate compliance. Section 3.0 describes the performance required of the installed equipment.  Tests for the installed equipment are included when performance cannot be adequately determined through bench testing. Section 4.0 describes the",
    "when performance cannot be adequately determined through bench testing. Section 4.0 describes the operational characteristics for equipment installations, and defines conditions that will assure the operator that operations can be conducted safely and reliably in the expected operational environment. Compliance with these standards by manufacturers, installers, and users is recommended as one means of assuring that the equipment will satisfactorily perform its intended function(s) under",
    "one means of assuring that the equipment will satisfactorily perform its intended function(s) under conditions normally encountered in routine aeronautical operations. The word \"equipment\" as used in this document includes all components or units necessary (as determined by the equipment manufacturer or installer) for the equipment to properly perform its intended function. It is recognized that any regulatory application of these standards is the responsibility of appropriate government",
    "that any regulatory application of these standards is the responsibility of appropriate government agencies. Inasmuch as the measured values of equipment performance characteristics may be a function of the measurement method, standard test conditions and methods of test are recommended in this document.",
    "## 1.2 System Overview",
    "The GNSS is a world-wide position, velocity, and time determination system that includes one or more satellite constellations, receivers, and system integrity monitoring, augmented as necessary to support the required navigation performance for the actual phase of operation. The GNSS includes ground control and monitoring stations, satellites, and avionics including antenna(s), and currently consists of the United States Global Positioning System (GPS), the European Galileo, the Russian",
    "consists of the United States Global Positioning System (GPS), the European Galileo, the Russian Federation Global Orbiting Navigation Satellite System (GLONASS), and others.  GLONASS is not covered by this MOPS.  This MOPS only applies to the GPS and Galileo L1 frequency band.  The planned Japan QZSS system may be included in the future.  The GNSS also includes Satellite Based Augmentation Systems (SBASs), the United States WAAS, the European EGNOS, Japan's MSAS and, in the future, the Indian",
    "(SBASs), the United States WAAS, the European EGNOS, Japan's MSAS and, in the future, the Indian GAGAN.",
    "## 1.3 Operational Applications\n\nThe GNSS active antenna equipment is intended to be used in all phases of aircraft operation, including on the surface, approach and landing, departure, terminal, and en route. \n\n## 1.4 Intended Function",
    "## 1.4 Intended Function\n\nThe airborne GNSS navigation system can be used as a primary means navigation system in an aircraft when approved and an operational GNSS navigation satellite system is available. Incorporated within these standards are equipment characteristics that should be useful to users, designers, manufacturers, and installers of the equipment.  This document defines the antenna performance for antennas that will be used with GNSS receiver equipment in the L1 \nfrequency band.",
    "## 1.5 Operational Goals\n\nThe operational goal for the GNSS antenna is to provide adequate GNSS satellite signals under a wide range of environmental conditions and installations that will assure safe flight operations.  The requirements of this document provide the minimum requirements for antennas designed for GNSS service and employing active designs at the L1 frequency. \n\n## 1.6 Assumptions",
    "## 1.6 Assumptions\n\nIt is assumed that the GNSS active antenna will be used with GNSS receiver equipment defined in an appropriate MOPS. \n\n## 1.7 Test Procedures",
    "## 1.7 Test Procedures\n\nThe test procedures specified in this document are intended to be used as one means of demonstrating compliance with the performance requirements.  Although specific test procedures are cited, it is recognized that other methods may be preferred.  These alternate procedures may be used if they provide at least equivalent information.  In such cases, the procedures cited herein should be used as one criterion in evaluating the acceptability of the alternate procedures.",
    "The order of tests specified suggests that the antenna be subjected to a succession of tests as it moves from design, and design qualification, into operational use.  For example, compliance with the requirements of Section 2.0 shall have been demonstrated as a precondition to satisfactory completion of the installed systems tests of section 3.0. Four types of test procedures are specified.  These include: \n--``,,,,,,,,,``````,`,,``,,,,`,,-`-`,,`,,`,`,,`---",
    "--``,,,,,,,,,``````,`,,``,,,,`,,-`-`,,`,,`,`,,`---\na. Environmental Tests Environmental test requirements are specified in Section 2.3.  The procedures and their associated limit requirements are intended to provide a laboratory means of determining the electrical and mechanical performance of the antenna under environmental conditions expected to be encountered in actual operations.",
    "Unless otherwise specified, the environmental conditions and test procedures contained in RTCA/DO-160E, Environmental Conditions and Test Procedures for Airborne Equipment, will be used to demonstrate antenna compliance.",
    "b. Bench Tests Bench Test procedures are specified in Section 2.4.  These tests provide a laboratory means of demonstrating compliance with the requirements of Section 2.2.  Test results may be used by antenna manufacturers as design guidance, for monitoring compliance, and, in certain cases, for obtaining formal approval of antenna design.",
    "c. Installed Equipment Tests The installed equipment test procedures and their associated limits are specified in Section 3.0.  Although bench and environmental test procedures are not included in the installed antenna tests, their successful completion is a precondition to completion of the installed tests.  In certain instances, however, installed antenna tests may be used in lieu of bench test simulation of such factors as power supply characteristics, interference from, or to, other antenna",
    "simulation of such factors as power supply characteristics, interference from, or to, other antenna installed on the aircraft, etc.",
    "Installed tests are normally performed under two conditions:",
    "(1) With the aircraft on the ground and using simulated or operational system inputs. (2) With the aircraft in flight using operational system inputs appropriate to the antenna \nunder test. \nTest results may be used to demonstrate functional performance in the intended operational environment.",
    "d. Operational Tests The operational tests are specified in Section 4.0.  These test procedures and their associated limits are intended to be conducted by operating personnel as one means of ensuring that the equipment is functioning properly, and can be reliably used for its intended function(s). \n\n## 1.8 Definition Of Terms",
    "| Active Sub-assembly                                         |\n|-------------------------------------------------------------|\n| except for the passive radiating element and its associated |\n| passive feed network.                                       |\n| Axial Ratio                                                 | The ratio of the major axis to the minor axis of the        |",
    "|-------------------------------------------------------------|-------------------------------------------------------------|\n| polarization ellipse.                                       |                                                             |\n| dBic                                                        | dB relative to an isotropic antenna with circular           |",
    "| polarization.                                               |                                                             |\n| dBm                                                         | dB relative to one milliwatt.                               |\n| Elevation Angle                                             | The angle between the axis of the measurement line and      |",
    "| the installed antenna horizontal plane.                     |                                                             |\n| G/T Ratio                                                   | The ratio of the passive radiating element gain to the      |\n| equivalent input noise temperature of the active            |                                                             |",
    "| subassembly (referred to the passive antenna terminals)     |                                                             |\n| HIRF                                                        | High Intensity Radiated Fields (e.g., from a off-board high |\n| power radar transmitter)                                    |                                                             |",
    "| Polarization                                                | That property of a radiated electromagnetic wave            |\n| describing the time-varying direction and amplitude of the  |                                                             |\n| electric field vector; specifically, the figure traced as a |                                                             |",
    "| function of time by the extremity of the vector at a fixed  |                                                             |\n| location in space, as observed along the direction of       |                                                             |\n| propagation.                                                |                                                             |",
    "| Total Transducer Gain                                       | The product of the active antenna unit passive antenna      |\n| element gain and the active subassembly gain.               |                                                             |\n| VSWR                                                        | Voltage Standing Wave Ratio.                                |",
    "|                                                             |                                                             |",
    "## 2. Equipment Performance Requirements And Test Procedures 2.1 General Requirements 2.1.1 Airworthiness The Design, Manufacture, And Installation Of The Antenna Shall Not Impair The Airworthiness Of The Aircraft. 2.1.2 Intended Function The Antenna Shall Perform Its Intended Function(S), As Defined By The Manufacturer, And Its Proper Use Shall Not Create A Hazard To Other Users Of The National Airspace System. 2.1.3 Federal Communications Commission Rules All Equipment Shall Comply With The",
    "Airspace System. 2.1.3 Federal Communications Commission Rules All Equipment Shall Comply With The Applicable Rules Of The Federal Communications Commission. 2.1.4 Fire Protection All Materials Used Shall Be Self-Extinguishing Except For Small Parts (E.G., Seals, Grommets) That Would Not Contribute Significantly To The Propagation Of A Fire.",
    "NOTE: One means of showing compliance is contained in Federal Aviation Regulations \n(FAR), Part 25, Appendix F. \n\n## 2.1.5 Effects Of A Test The Antenna Shall Be Designed So That The Application Of Specified Test Procedures Shall Not Be Detrimental To Equipment Performance Following The Application Of These Tests, Except As Specifically Allowed.\n\n--``,,,,,,,,,``````,`,,``,,,,`,,-`-`,,`,,`,`,,`---\n\n## 2.2 Gnss Active Antenna Unit Performance - Standard Conditions",
    "The GNSS active antenna unit is a passive antenna element integrated with a preamplifier, as illustrated in Figure 2-1. It includes the antenna radiating element, RF interconnection between the antenna and preamplifier, burnout protection, selective RF filtering, a low-noiseamplifier (LNA), and DC bias interface circuitry. This MOPS does not specify performance standards for a passive GNSS antenna.  See either DO-228 or DO-228, Change 1 for performance standards for passive GNSS antennas.",
    "2.2.1 \nGPS L1 Operating Frequency Range The antenna unit shall operate over the minimum frequency range of 1575.42 MHz ± 10.23 \nMHz, unless otherwise specified for a particular parameter.",
    "## 2.2.2 Antenna Unit Output Vswr And Impedance The Output Vswr For A Dry Antenna Unit Shall Not Exceed 1.5:1 Over The Operating Frequency Range When Interfaced With A Nominal 50 Ohm Impedance Transmission Line. 2.2.3 Antenna Unit Relative Radiation Pattern And Passive Element Gain 2.2.3.1 Antenna Unit Relative Radiation Pattern",
    "The active antenna relative radiation pattern is specified in terms of the ratio (dB) of total transducer power gain at any give pattern angle coordinate pair (azimuth angle, elevation angle) to the maximum total transducer power gain within 15º elevation of  zenith (elevation angle = 90º).  See Appendix A for more details.  The relative radiation pattern at the operating center frequency 1575.42 MHz shall be contained at or within the limits in Table 2-1 for the specified elevation angles at",
    "MHz shall be contained at or within the limits in Table 2-1 for the specified elevation angles at any azimuth angle.  The relative antenna gain shall not vary more than 1 dB over the full temperature range for which the antenna is specified.",
    "| Minimum Pattern         | Maximum Pattern    |\n|-------------------------|--------------------|\n| Elevation               |                    |\n| Angle (degrees)         |                    |\n| Pattern Ratio (dB)      | Elevation          |\n| Angle (degrees)         |                    |\n| Pattern Ratio (dB)      |                    |\n| 0                       | -10                |\n| 5                       | -8.5               |\n| 10                      | -7.0               |",
    "| 5                       | -8.5               |\n| 10                      | -7.0               |\n| 20                      | -4.0               |\n| 10 < Elev.              |                    |\n| ≤                       |                    |\n| 75                      |                    |\n| linear increase to 0.0  |                    |\n| 30                      | -3.73              |\n| 30 < Elev.              |                    |\n| ≤                       |                    |",
    "| 30 < Elev.              |                    |\n| ≤                       |                    |\n| 75                      |                    |\n| linear increase to -2.5 |                    |\n| > 75                    | -2.5               |",
    "## 2.2.3.2 Passive Element Gain\n\nThe passive radiating element gain for the active antenna unit is specified in terms of the   \nabsolute gain (dBic) for the passive element and any associated passive feed network and radome with respect to an ideal circular isotropic antenna.  The passive radiating element gain at 1575.42 MHz and 5º elevation shall be at least -5.5 dBic over all azimuth angles. \n\n--``,,,,,,,,,``````,`,,``,,,,`,,-`-`,,`,,`,`,,`---\nNOTES:",
    "1. In their installation instructions, the manufacturer should identify the minimum \npassive element gain at 5 degrees and the maximum passive element gain above 75 \ndegrees elevation for their equipment.  Receiver manufacturers can take advantage of performance better than the minimum requirement, and documenting improved performance facilitates the installation and integration of the antenna and receiver. \n2. The maximum passive element gain above 75 degrees elevation is expected to be not",
    "2. The maximum passive element gain above 75 degrees elevation is expected to be not \nmore than +4 dBic",
    "## 2.2.4 Polarization And Axial Ratio The Antenna Radiation Pattern Polarization Shall Be Nominally Right-Hand (Clockwise) Circularly Polarized And Its Axial Ratio Shall Not Exceed 3.0 Db For Over The Operating Frequency Range As Measured At The Boresight Of The Antenna. 2.2.5 G/T Ratio",
    "The active antenna unit G/T ratio at 5 degrees elevation shall be not less than -32.6 dB/K \nover all azimuth angles, over the frequency range 1575.42 ± 8 MHz and over the full environmental temperature range.  Over the frequency range  1575.42 ± 2 MHz, the 5 degree elevation G/T ratio shall not be less that -31.6 dB/K over all azimuth angles and over the full environmental temperature range.  See Appendix A for further details.",
    "NOTE:  The manufacturer should identify the minimum G/T for their equipment in their installation instructions.  Receiver manufacturers can take advantage of performance better than the minimum requirement, and documenting improved performance facilitates the installation and integration of the antenna and receiver. \n\n## 2.2.6 Total Transducer Gain And Gain Compression 2.2.6.1 Minimum Boresight Total Transducer Gain",
    "The minimum boresight total transducer gain over the frequency range 1575.42 ± 2 MHz shall not be less than 29.5 dBic over the full environmental temperature range. \n\nNOTE: No maximum gain value is specified since the total transducer gain may need to be installation dependent.  The 29.5 dB minimum value is intended to cover standard receiver installations with cable attenuation up to 13 dB \n\n## 2.2.6.2 Active Sub-Assembly Transducer Gain",
    "## 2.2.6.2 Active Sub-Assembly Transducer Gain\n\nThe minimum active sub-assembly gain over the frequency range 1575.42 ±2 MHz shall not be less than 26.5 dB over the full temperature range.",
    "NOTES:  \n1. The active sub-assembly is assumed to contain the HIRF protection, pre- and postselection RF filtering, preamplifier and DC bias circuitry (i.e.; circuitry within the \ndotted box in Figure 2-1) and interface at a single input port to the passive radiating element. \n2. The listed active sub-assembly minimum gain value is consistent with the total \ntransducer gain limit in Section 2.2.6.1.  For installations with higher cable attenuation,",
    "transducer gain limit in Section 2.2.6.1.  For installations with higher cable attenuation, \na higher active sub-assembly minimum gain (and therefore a higher total transducer gain) may be necessary. To avoid excessive receiver dynamic range impact, the active sub-assembly mid-band gain value should remain within a ±3 dB range about a nominal manufacturer-specified value.",
    "3. The manufacturer should identify the nominal amplifier gain and tolerance for their \nequipment in their installation instructions.  Receiver manufacturers need this \ninformation to define installation instructions that integrate the antenna and receiver. \n\n## 2.2.6.3 Boresight Transducer Gain Compression Point",
    "The active antenna unit shall have less than 1 dB gain reduction to a low-level, 1575.42 MHz signal at boresight when a second test signal is present at the frequency and minimum power values shown in Figure 2-2 (-25 dBm, 1557 to 1593 MHz).  For test frequencies outside the range of Figure 2-2 below 1525 MHz, the test limit shall increase linearly from -10 to +23 dBm at 1315 MHz.  For test frequencies above 1660 MHz, the limit shall increase linearly to 20 dBm at 2 GHz.  Between 1000 and 1315",
    "above 1660 MHz, the limit shall increase linearly to 20 dBm at 2 GHz.  Between 1000 and 1315 MHz, the minimum limit shall be +23 dBm.",
    "The test signal level values are defined relative to a unity-gain, isotropic circular antenna.",
    "NOTE: The mid-band compression point value (Figure 2-2) is to provide sufficient linearity to mitigate multi-tone intermodulation effects from on-board aeronautical SATCOM. \n\n## 2.2.7 Output Load Stability The Active Antenna Unit Shall Be Unconditionally Stable For Any Positive-Real Output Load Impedance.",
    "2.2.8 \nBoresight Relative Gain Frequency Response The boresight relative gain for frequency response considerations is defined as the ratio (dB) \nof the total transducer gain at boresight at any frequency to the maximum boresight value in the frequency range 1575.42 ± 7.5 MHz. \n\n## 2.2.8.1 -3 Db Relative Response Frequencies",
    "## 2.2.8.1 -3 Db Relative Response Frequencies\n\nThe active antenna relative boresight gain lower frequency -3 dB point shall not be higher than 1567.92 MHz and the upper frequency -3 dB point shall not be lower than 1582.92 \nMHz. \n\n## 2.2.8.2 Maximum Boresight Relative Frequency Response\n\nThe maximum relative boresight gain shall have the frequency response specified in Table 2-\n2 and illustrated in Figure 2-3.",
    "| Frequency (MHz)                           |\n|-------------------------------------------|\n| 1315                                      |\n| ≤                                         |\n| f < 1504.42                               |\n| -50 dB                                    |\n| 1504.42                                   |\n| ≤                                         |\n| f < 1554.42                               |\n| Linearly increasing from -50 dB to -5 dB  |",
    "| f < 1554.42                               |\n| Linearly increasing from -50 dB to -5 dB  |\n| 1554.42                                   |\n| ≤                                         |\n| f < 1558.42                               |\n| Linearly increasing from -5 dB to 0 dB    |\n| 1558.42                                   |\n| ≤                                         |\n| f                                         |\n| ≤                                         |",
    "| f                                         |\n| ≤                                         |\n| 1591.92                                   |\n| 0 dB                                      |\n| 1591.92 < f                               |\n| ≤                                         |\n| 1605.42                                   |\n| Linearly decreasing to -25.35 dB          |\n| 1605.42 < f                               |\n| ≤                                         |",
    "| 1605.42 < f                               |\n| ≤                                         |\n| 1625.42                                   |\n| Linearly decreasing from -25.35 dB to -50 |\n| dB                                        |\n| 1625.42 < f                               |\n| ≤                                         |\n| 2000                                      |\n| -50 dB                                    |",
    "## 2.2.9 Burnout Protection The Preamplifier Shall Withstand A Cw Input Carrier Of +20 Dbm Without Damage.  Under These Conditions, The Output Of The Preamplifier Shall Be Limited To +20 Dbm.\n\nNOTE: \n         The burnout protection of +20 dBm may not guarantee compatibility with \n   all aircraft or all operations.  Some contemporary commercial airborne \n   installations require +30 dBm with the output limited to +20 dBm.",
    "2.2.10 \n               Pulse Power Saturation Recovery Time \n               The antenna preamplifier shall resume normal operation within 10 microseconds of the \n               trailing edge of a pulse with a width of up to 1 milliseconds, a peak power of 30 dBm, and a \n               duty cycle of 10%. \n                \n\n## 2.2.11 Group Delay Requirements 2.2.11.1 Boresight Differential Group Delay Versus Frequency",
    "## 2.2.11 Group Delay Requirements 2.2.11.1 Boresight Differential Group Delay Versus Frequency\n\nThe active antenna unit boresight differential group delay versus frequency shall not exceed 25 nanoseconds.  Differential group delay is defined (in seconds) as",
    "$\\Lambda\\tau(\\mathrm{f}_{1},\\mathrm{f}_{2})=\\frac{1}{360}\\frac{\\mathrm{d}[\\Phi(\\mathrm{f}_{1})]}{\\mathrm{df}}-\\frac{\\mathrm{d}[\\Phi(\\mathrm{f}_{2})]}{\\mathrm{df}}$ (Equation 2-1)\n \nwhere  f1 and f2 are any two different frequencies such that fc - 10.23 MHz ≤ f1, f2 ≤ fc + 10.23 MHz fc is L1 signal center frequency, 1575.42 MHz; \nΦ(f) is the total transducer phase response of the active antenna unit at boresight (in degrees); f is the frequency in Hz.",
    "## 2.2.11.2 Group Delay Versus Aspect Angle\n\nThe center frequency differential group delay of the antenna versus aspect angle (azimuth and elevation), defined as",
    "$$\\Delta\\tau\\left(\\text{Az},\\text{El}\\right)=\\left|\\frac{1}{360}\\frac{\\text{d}\\Phi\\left(\\text{f}_{\\text{c}},\\left(\\text{Az},\\text{El}\\right)\\right)}{\\text{df}}\\cdot\\tau\\left(\\text{Az},\\text{El}=5^{\\circ}\\right)\\right|\\text{(Equation2-2a)}$$\nshall not exceed the following limit: \n(2.5 - 0.04625·(El - 5º)) nanoseconds, for 5º ≤ El < 45º, and \n0.65 nanoseconds, for El ≥ 45º",
    "(2.5 - 0.04625·(El - 5º)) nanoseconds, for 5º ≤ El < 45º, and \n0.65 nanoseconds, for El ≥ 45º \nover all azimuth angles (Az) and all elevation angles (El) at or above 5º degrees, measured or computed at center frequency fc = 1575.42 MHz, where",
    "$${\\overline{{\\tau\\left(\\mathrm{Az},\\mathrm{El}=5^{\\circ}\\right)}}}={\\frac{1}{360}}{\\overline{{\\left(\\frac{\\mathrm{d}\\Phi\\left(\\mathrm{f}_{\\mathrm{c}},\\mathrm{Az},\\mathrm{El}=5^{\\circ}\\right)}{\\mathrm{df}}\\right)}}}$$ (Equation 2-2b)\nis the group delay at 5º elevation angle averaged over all azimuth angles.",
    "2.2.12 \nDC Power Interface The active antenna unit shall contain interface circuitry to obtain the necessary DC operating power from the center conductor of its coaxial RF output connector.  The load capacitance on the output connector center conductor from this internal interface circuitry shall not exceed 0.75 μF.  The active antenna unit shall perform properly over a DC input voltage range of at least 4.5 to 14.4 V and shall not draw more than 60 mA DC current.",
    "NOTE: In order to maximize reliability, the use of electrolytic capacitors in the active antenna unit should be avoided. \n\n## 2.3 Equipment Performance - Environmental Conditions",
    "The environmental tests and performance requirements described in this subsection are intended to provide a laboratory means of determining the overall performance characteristics of the antenna under conditions representative of those that may be encountered in actual operations. Some of the environmental tests contained in this subsection need not be performed unless the manufacturer wishes to qualify the equipment for that particular environmental condition. These tests are identified by the",
    "the equipment for that particular environmental condition. These tests are identified by the phrase \"When Required.\" If the manufacturer wishes to qualify the equipment to these additional environmental conditions, then these \"When Required\" tests shall be performed. Unless otherwise specified, the test procedures applicable to a determination of antenna performance under environmental test conditions are set forth in RTCA Document DO-160E, *Environmental Conditions and Test Procedures for",
    "are set forth in RTCA Document DO-160E, *Environmental Conditions and Test Procedures for Airborne Equipment*.  General information on the use of DO-160E is contained in Sections 1.0 through 3.0 of that document. Also, a method of identifying which environmental tests are conducted and other amplifying information on the conduct of the tests is contained in Appendix A of DO-160E.",
    "Some of the performance requirements in Section 2.2 are not required to be tested to all of the conditions contained in RTCA/DO-160E.  If judgment and experience indicate that these particular performance parameters are not susceptible to certain environmental conditions, and that the level of performance specified in Section 2.2 will not be measurably degraded by exposure to these particular environmental conditions, such tests may be omitted.",
    "In addition to the exceptions above, certain environmental tests contained in this section are not required for minimum performance equipment unless the manufacturer wishes to qualify the antenna for additional environmental conditions.  If the manufacturer wishes to qualify the antenna to these additional conditions, then these tests shall be performed.",
    "## 2.3.1 Specific Environmental Test Conditions The Equipment Shall Be Subjected To The Test Conditions As Specified In Rtca/Do-160E As Indicated Below (Table 2-3).  Categories Are For Locations External To The Aircraft. 2.3.2 Temperature And Altitude Tests (Do-160E, Section 4.0) Rtca/Do-160E Contains Several Temperature And Altitude Test Procedures That Are Specified According To The Category Specified In The Preceding Section 2.3.1.  The Following Sections Contain The Applicable Test",
    "Specified In The Preceding Section 2.3.1.  The Following Sections Contain The Applicable Test Conditions Specified In Section 4.0 Of Do-160E. 2.3.2.1 Operating Low Temperature Test",
    "The equipment shall be subjected to the test conditions as specified in DO-160E, Section 4.5.2, and the following requirements of this standard shall be met:",
    "1. Active Sub-assembly Input VSWR:  The input VSWR shall be less than 1.8 over the \noperating frequency range) \n2. Active Sub-assembly Input Noise Temperature:  The input noise temperature shall be \nless than 310 K over 1575.42 ± 2 MHz and less than 413 K over 1575.42 ± 8 MHz \n3. Section 2.2.6.2 - Active Sub-assembly Transducer Gain 4. Section 2.2.8.1 - -3 dB Relative Response Frequencies (active sub-assembly) 5. Section 2.2.8.2 - Maximum Boresight Relative Frequency Response",
    "The active sub-assembly shall meet the relative gain response requirement over the \nfrequency range 1535 - 1605 MHz (normalized to the maximum sub-assembly gain \nwithin 1575.42 ± 7.5 MHz) \n6 \nSection 2.2.7 - Output Load Stability {this test may be met with an integrated active \nunit} \n7. Section 2.2.9- Burnout Protection (active sub-assembly) 8 \nSection 2.2 11.1 - Boresight Differential Group Delay (active sub-assembly) \n9. Section 2.2.12 - DC Power Interface",
    "## 2.3.2.2 High Operating Temperature Test\n\nThe equipment shall be subjected to the test conditions as specified in DO-160E, Section 4.5.4, and the following requirements of this standard shall be met:",
    "1. Active Sub-assembly Input VSWR: The input VSWR shall be less than 1.8 over the \noperating frequency range) \n2. Active Sub-assembly Input Noise Temperature:  The input noise temperature shall be \nless than 310 K over 1575.42 ± 2 MHz and less than 413 K over 1575.42 ± 8 MHz  \n3. Section 2.2.6.2 - Active Sub-assembly Transducer Gain 4. Section 2.2.8.1 - -3 dB Relative Response Frequencies (active sub-assembly) 5. Section 2.2.8.2 - Maximum Boresight Relative Frequency Response",
    "The active sub-assembly shall meet the relative gain response requirement over the \nfrequency range 1535 - 1605 MHz (normalized to the maximum sub-assembly gain \nwithin 1575.42 ± 7.5 MHz) \n6. Section 2.2.9- Burnout Protection (active sub-assembly) 7. Section 2.2.10 - Pulse Power Saturation Recovery Time (active sub-assembly) 8 \nSection 2.2 11.1 - Boresight Differential Group Delay (active sub-assembly) \n9 \nSection 2.2.12 - DC Power Interface \n--``,,,,,,,,,``````,`,,``,,,,`,,-`-`,,`,,`,`,,`---",
    "|   Section #  | Section Title                            | Category    |\n|--------------|------------------------------------------|-------------|\n|           4  | Temperature and Altitude                 | F2          |\n|           5  | Temperature Variation                    | A           |\n|           6  | Humidity                                 | B           |\n|           7  | Operational Shock / Crash Safety         | B           |",
    "|           7  | Operational Shock / Crash Safety         | B           |\n|           8  | Vibration                                | C, L, Y     |\n|           9  | Explosion                                | X           |\n|          10  | Waterproofness                           | S           |\n|          11  | Fluids (1)                               | F           |\n|          12  | Sand and Dust                            | D           |",
    "|          12  | Sand and Dust                            | D           |\n|          13  | Fungus                                   | X           |\n|          14  | Salt Spray                               | S           |\n|          15  | Magnetic Effect                          | A           |\n|          16  | Power Input                              | X           |\n|          17  | Voltage Spike                            | X           |",
    "|          17  | Voltage Spike                            | X           |\n|          18  | Audio Frequency Conducted Susceptibility | X           |\n|          19  | Induced Signal Susceptibility            | ZC          |\n|          20  | Radio Frequency Susceptibility           | RR          |\n|          21  | Spurious Radio Frequencies               | H           |\n|          22  | Lightning Induced Effects                | A3J33       |",
    "|          22  | Lightning Induced Effects                | A3J33       |\n|          23  | Lightning Direct Effects                 | 2A          |\n|          24  | Icing (2)                                | C           |\n|          25  | Electrostatic Discharge                  | A           |\n|          26  | Fire, Flammablilty                       | C           |",
    "NOTES: \n\n1.  Fluid susceptibility for solvents, cleaning, and de-icing fluids. 2.  The antenna requires operation with an ice coating of 0.5 inches. \n\n## 2.3.2.3 Altitude Test\n\nThe equipment shall be subjected to the test conditions as specified in DO-160E, Section 4.6.1, and the following requirements of this standard shall be met during the test condition application except as noted:",
    "1. Section 2.2.5 - G/T Ratio (before and after test condition application) \nA radiated \"hot-cold\" noise test at boresight (Sect. 2.4.3.2) is an acceptable alternative to identify any relative change \n2. Active Sub-assembly Input Noise Temperature:  The input noise temperature shall be \nless than 310 K over 1575.42 ± 2 MHz and less than 413 K over 1575.42 ± 8 MHz \n3. Section 2.2.6.2 - Active Sub-assembly Transducer Gain",
    "## 2.3.3 Temperature Variation Test (Do-160E, Section 5.0) The Equipment Shall Be Subjected To The Test Conditions As Specified In Do-160E, Section 5.0, And The Following Requirements Of This Standard Shall Be Met During The Test Condition Application Except As Noted:",
    "1. Section 2.2.5 - G/T Ratio (before and after test condition application) \nA radiated \"hot-cold\" noise test at boresight (Sect. 2.4.3.2) is an acceptable alternative to identify any relative change in an integrated active antenna unit \n2. Active Sub-assembly Input Noise Temperature:  The input noise temperature shall be \nless than 310 K over 1575.42 ± 2 MHz and less than 413 K over 1575.42 ± 8 MHz",
    "less than 310 K over 1575.42 ± 2 MHz and less than 413 K over 1575.42 ± 8 MHz \n3. Section 2.2.6.2 - Active Sub-assembly Transducer Gain 4. Section 2.2.12 - DC Power Interface",
    "## 2.3.4 Humidity Test (Do-160E, Section 6.0) The Active Antenna Unit Equipment Shall Be Subjected To The Test Conditions As Specified In Do-160E, Section 6.0, And The Following Requirements Of This Standard Shall Be Met:\n\n1. Section 2.2.2 - Antenna Unit Output VSWR and Impedance (After) 2. Section 2.2.5 - G/T Ratio (Before and After) 3.   Section 2.2.6.2 - Active Sub-assembly Transducer Gain 4.   Section 2.2.8.2 - Maximum Boresight Relative Frequency Response (After, LNA Assy)",
    "## 2.3.5 Shock Tests (Do-160E, Section 7.0) 2.3.5.1 Operational Shocks\n\n--``,,,,,,,,,``````,`,,``,,,,`,,-`-`,,`,,`,`,,`---\nThe active antenna unit equipment shall be subjected to the test conditions as specified in DO-160E, Section 7.2, and the following requirements of this standard shall be met: 1. Section 2.2.2 - Antenna Unit Output VSWR and Impedance (After) 2. Section 2.2.5 - G/T Ratio (After) 3.   Section 2.2.6.1 - Minimum Boresight Total Transducer Gain (After, LNA Assy)",
    "## 2.3.5.2 Crash Safety Shocks\n\nThe application of Crash Safety Shock tests in RTCA/DO-160E, Section 7.3 may result in damage to the antenna under test.  Therefore this test may be conducted after the other tests have been completed.  In this case, Section 2.1.5 \"Effects of Test\" does not apply.  The active antenna unit is considered to have passed this test if it stays attached to its mounting.",
    "## 2.3.6 Vibration Test (Do-160E, Section 8.0) The Equipment Shall Be Subjected To The Test Conditions As Specified In Do-160E, Section 8.0, And The Following Requirements Of This Standard Shall Be Met:",
    "1. Section 2.2.2 - Antenna Unit Output VSWR and Impedance (After) 2. Section 2.2.5 - G/T Ratio (Before & After) 3. Section 2.2.6.2 - Active Sub-assembly Transducer Gain (during vibration) 4. Section 2.2.12 - DC Power Interface (active during vibration) \nThe DC current shall not indicate intermittent behavior during vibration",
    "## 2.3.7 Explosion Test (Do-160E, Section 9.0) Explosion Testing Is Not Required Because The Antenna Is Not Normally Installed In An Explosive Environment. 2.3.8 Waterproofness Tests (Do-160E, Section 10.0) The Integrated Active Antenna Equipment Shall Be Subjected To The Continuous Stream Proof Test Conditions As Specified In Do-160E, Section 10.3.3, And The Following Requirements Of This Standard Shall Be Met:",
    "1. Section 2.2.2 - Antenna Unit Output VSWR and Impedance (After) 2. Section 2.2.5 - G/T Ratio (Before & After) \nA radiated \"hot-cold\" noise test at boresight (Sect. 2.4.3.2) is an acceptable alternative to identify any relative change. \nNOTE:  \nThis test shall be conducted with the spray directed perpendicular to the most vulnerable area(s) as determined by the equipment manufacturer.",
    "## 2.3.9 Fluids Susceptibility Tests (Do-160E, Section 11.0) The Following Sections Contain The Applicable Test Conditions Specified In Section 11.0 Of Do-160E. 2.3.9.1 Spray Test\n\nThe integrated active antenna equipment shall be subjected to the test conditions as specified in DO-160E, Section 11.4.1, and the following requirements of this standard shall be met:",
    "A. At the end of the 24-hour exposure period, the equipment shall operate at a level of \nperformance that indicates that no significant failures of components or circuitry have occurred. \nB. Following the 2 hour operational period at ambient temperature, after the 160-hour \nexposure period at elevated temperature, the following requirements of this standard shall be met:  \n--``,,,,,,,,,``````,`,,``,,,,`,,-`-`,,`,,`,`,,`---",
    "1. Section 2.2.2 - Antenna Unit Output VSWR and Impedance (after environment) \n2. Section 2.2.5 - G/T Ratio (before and after environment) \nA radiated \"hot-cold\" noise test at boresight (Sect. 2.4.3.2) is an acceptable alternative to \nidentify any relative change. \n3.   Section 2.2.6.2 - Active Sub-assembly Transducer Gain (after, radiated test) 4.   Section 2.2.8.2 - Maximum Boresight Relative Frequency Response (after, radiated test) \n\n## 2.3.9.2 Immersion Test",
    "## 2.3.9.2 Immersion Test\n\nThe integrated active antenna equipment shall be subjected to the test conditions as specified in DO-160E, Section 11.4.2, and the following requirements of this standard shall be met:",
    "A. At the end of the 24-hour immersion period, the equipment shall operate at a level of \nperformance that indicates that no significant failures of components or circuitry have occurred. \nB. Following the 2-hour operational period at ambient temperature, after the 160-hour \nexposure period at elevated temperature, the following requirements of this standard shall be met:  \n1. Section 2.2.2 - Antenna Unit Output VSWR and Impedance (after environment)",
    "1. Section 2.2.2 - Antenna Unit Output VSWR and Impedance (after environment) \n2. Section 2.2.5 - G/T Ratio (before and after environment) \nA radiated \"hot-cold\" noise test at boresight (Sect. 2.4.3.2) is an acceptable alternative to \nidentify any relative change. \n3.   Section 2.2.6.2 - Active Sub-assembly Transducer Gain (after, radiated test) 4.   Section 2.2.8.2 - Maximum Boresight Relative Frequency Response (after, radiated test)",
    "## 2.3.10 Sand And Dust Test (Do-160E, Section 12.0) The Integrated Active Antenna Equipment Shall Be Subjected To The Test Conditions As Specified In Do-160E, Section 12.0, And The Following Requirements Of This Standard Shall Be Met:",
    "1. Section 2.2.2 - Antenna Unit Output VSWR and Impedance (after environment) 2. Section 2.2.5 - G/T Ratio (before and after environment) \nA radiated \"hot-cold\" noise test at boresight (Sect. 2.4.3.2) is an acceptable alternative to identify any relative change. \n3.   Section 2.2.6.2 - Active Sub-assembly Transducer Gain (after, radiated test) 4.   Section 2.2.8.2 - Maximum Boresight Relative Frequency Response (after, radiated test)",
    "## 2.3.11 Fungus Resistance Test (Do-160E, Section 13.0) Fungus Testing Is Not Required Because The Antenna Is Not Normally Installed In A Location That Is Conducive To Growth Of Fungus. 2.3.12 Salt Spray Test (Do-160E, Section 14.0) The Integrated Active Antenna Equipment Shall Be Subjected To The Test Conditions As Specified In Do-160E, Section 14.0, And The Following Requirements Of This Standard Shall Be Met:",
    "1. Section 2.2.2 - Antenna Unit Output VSWR and Impedance (after environment) \n2. Section 2.2.5 - G/T Ratio (before and after environment) \nA radiated \"hot-cold\" noise test at boresight (Sect. 2.4.3.2) is an acceptable alternative to identify any relative change. \n3.   Section 2.2.6.2 - Active Sub-assembly Transducer Gain (after, radiated test) 4.   Section 2.2.8.2 - Maximum Boresight Relative Frequency Response (after, radiated test)",
    "## 2.3.13 Magnetic Effect Test (Do-160E, Section 15.0) The Integrated Active Antenna Equipment Shall Be Subjected To The Test Conditions As Specified In Do-160E, Section 15.0, And The Equipment Shall Meet The Requirements Of The Appropriate Instrument Or Equipment Class Specified Therein. 2.3.14 Power Input Tests (Do-160E, Section 16.0) This Test Is Not Applicable Since The Aircraft Power Bus Does Not Directly Apply Dc Power To The Active Antenna.",
    "--``,,,,,,,,,``````,`,,``,,,,`,,-`-`,,`,,`,`,,`---\n\n## 2.3.15 Voltage Spike Conducted Test (Do-160E, Section 17.0) This Test Is Not Applicable Since The Aircraft Power Bus Does Not Directly Apply Dc Power To The Active Antenna. 2.3.16 Audio Frequency Conducted Susceptibility Test (Do-160E, Section 18.0) This Test Is Not Applicable Since The Aircraft Power Bus Does Not Directly Apply Dc Power To The Active Antenna.",
    "2.3.17 \nInduced Signal Susceptibility Test (DO-160E, Section 19.0)",
    "The integrated active antenna equipment shall be subjected to the test conditions as specified in DO-160E, Section 19.0.as described in Sub-sections 19.3.1 though 19.3.4.  For conditions in Sub-section 19.3.1, the magnetic field need only be applied under the antenna unit-undertest.  The induced signals in Sub-sections 19.3.2 though 19.3.4 are applied to the RF coaxial output cable from the unit.  The following requirements shall be met during application of the environmental condition:",
    "1. Section 2.2.2 - Antenna Unit Output VSWR and Impedance (radiated test) \n2. Section 2.2.6.2 - Active Sub-assembly Transducer Gain (radiated test) \n2.3.18 \nRadio Frequency Susceptibility Test (Radiated & Conducted) (DO-160E, Section 20.0)",
    "The equipment shall be subjected to the test conditions as specified in DO-160E, Section 20. Radiated susceptibility test levels for frequencies between 1.0 and 2.0 GHz shall follow the frequency response shape of Section 2.2.6.2 (where the listed power limits are converted to equivalent field strength values).  The following requirements of this standard shall be met during application of the environmental test stimulus:",
    "## 2.3.18.1 Conducted Susceptibility Performance\n\n1. Section 2.2.2 - Antenna Unit Output VSWR and Impedance (radiated test) 2. Section 2.2.6.2 - Active Sub-assembly Transducer Gain (radiated test) \n\n## 2.3.18.2 Radiated Susceptibility Performance",
    "1. Section 2.2.6.3 - Boresight Transducer Gain Compression Point (determined by radiating \nat the antenna unit a second, low-level, CW signal at 1575.42 MHz together with the test stimulus and monitoring for less than 1 dB peak decrease in CW signal level.  See Section 2.4.2.6 for 1-2 GHz test levels, and modulation, and other details.) \n2. Section 2.2.9 - Burnout Protection (saturated output power only).  For high level signal",
    "2. Section 2.2.9 - Burnout Protection (saturated output power only).  For high level signal \ntest frequencies between 1.0 and 2.0 GHz the active unit (peak) output power at the test \nfrequency from the 150 V/m peak incident field shall not exceed the +20 dBm output limit. \n3. Section 2.2.10 –Pulse Saturation Recovery Time:  (See Section 2.4.2.6 for test procedure \ndetails.)",
    "## 2.3.19 Emission Of Radio Frequency Energy Test (Do-160E, Section 21.0) When The Integrated Active Antenna Equipment Is Subjected To The Test Conditions As Specified In Do-160E, Section 21.0, It Shall Meet The Requirements Specified Therein. 2.3.20 Lightning Induced Transient Susceptibility (Do-160E, Section 22.0) The Integrated Active Antenna Equipment Shall Be Subjected To The Test Conditions As Specified In Do-160E, Section 22.0, And The Following Requirements Of This Standard Shall Be Met",
    "As Specified In Do-160E, Section 22.0, And The Following Requirements Of This Standard Shall Be Met Before And After The Environmental Condition Is Applied:",
    "1. Section 2.2.2 - Antenna Unit Output VSWR and Impedance 2. Section 2.2.5 - G/T Ratio (optional measurement at boresight) 3. Section 2.2.6.2 - Active Sub-assembly Transducer Gain (radiated test) \nNOTE: \nThe intent of these tests is to check for performance degradation after the lightning induced transients have been applied to the integrated antenna unit.",
    "## 2.3.21 Lightning Direct Effects (Do-160E, Section 23.0) The Integrated Active Antenna Equipment Shall Be Subjected To The Test Conditions As Specified In Do-160E, Section 23.0, And The Following Requirements Of This Standard Shall Be Met Before And After The Environmental Condition Is Applied.",
    "1. Section 2.2.2 - Antenna Unit Output VSWR and Impedance 2. Section 2.2.5 - G/T Ratio (optional measurement at boresight) 3. Section 2.2.6.1 - 2 - Active Sub-assembly Transducer Gain (radiated test) 4. Lightning-induced signals on the RF coaxial cable shall not exceed the levels associated \nwith DO-160E Section 22, Category A3J33 when measured at the 50 Ohm cable termination.",
    "with DO-160E Section 22, Category A3J33 when measured at the 50 Ohm cable termination. \nNOTE: The intent of these tests is to check for performance degradation after the lightning direct transients have been applied to the integrated antenna unit. The induced output transient signals on the coax cable become the receiver indirect test condition.",
    "## 2.3.22 Icing (Do-160E, Section 24.0) The Integrated Active Antenna Equipment Shall Be Subjected To The Test Conditions As Specified In Do-160E, Section 24.0, And The Following Requirements Shall Be Met:",
    "1. Antenna Unit Output VSWR and Impedance  \nThe output VSWR for an antenna unit exposed to an ice accumulation of 0.5 inches shall \nnot exceed 2.0. \n2. Antenna Unit Relative Radiation Pattern: \nThe antenna unit relative pattern gain shall not degrade more than 4.5 dB at 30º elevation from the dry condition value at the same ambient temperature. \n\n## 2.4 Equipment Test Procedures",
    "The test procedures in this section constitute a satisfactory method of determining that the GNSS antenna meets the required performance stated in Section 2.  Although specific test procedures are cited, it is recognized that other methods may be preferred.  Such alternative methods may be used if the manufacturer can demonstrate equivalent test procedures.  In this case, the test procedures cited herein must be used as one set of criteria in evaluating the acceptability of the alternate",
    "cited herein must be used as one set of criteria in evaluating the acceptability of the alternate procedures. Table 2-4 indicates the correspondence between the equipment performance requirements in Section 2.2 and the tests in this section.",
    "| Requirement    | Subject                                       | Tests     |\n|----------------|-----------------------------------------------|-----------|\n| 2.2.1          | GPS Operating Frequency Range                 | 2.4.2.1   |\n| 2.2.2          | Antenna Unit Output VSWR and Impedance        | 2.4.2.1   |\n| 2.2.3.1        | Antenna Unit Relative Radiation Pattern       | 2.4.2.2   |\n| 2.2.3.2        | Passive Element Gain                          | 2.4.2.2   |",
    "| 2.2.3.2        | Passive Element Gain                          | 2.4.2.2   |\n| 2.2.4          | Polarization and Axial Ratio                  | 2.4.2.3   |\n| 2.2.5          | G/T Ratio                                     | 2.4.2.2,  |\n| 2.4.2.4        |                                               |           |\n| 2.2.6.1        | Minimum Boresight Total Transducer Gain       | 2.4.2.2   |\n| 2.2.6.2        | Active Sub-assembly Transducer Gain           | 2.4.2.2,  |",
    "| 2.2.6.2        | Active Sub-assembly Transducer Gain           | 2.4.2.2,  |\n| 2.4.3.1,       |                                               |           |\n| 2.4.3.2        |                                               |           |\n| 2.2.6.3        | Boresight Transducer Gain Compression Point   | 2.4.2.6.1 |\n| 2.2.7          | Output Load Stability                         | 2.4.2.5   |\n| 2.2.8.1        | -3 dB Relative Response Frequencies           | 2.4.2.2,  |",
    "| 2.2.8.1        | -3 dB Relative Response Frequencies           | 2.4.2.2,  |\n| 2.4.3.1        |                                               |           |\n| 2.2.8.2        | Maximum Boresight Relative Frequency Response | 2.4.2.2,  |\n| 2.4.3.1,       |                                               |           |\n| 2.4.3.2        |                                               |           |\n| 2.2.9          | Burnout Protection                            | 2.4.3.3   |",
    "| 2.2.9          | Burnout Protection                            | 2.4.3.3   |\n| 2.2.10         | Pulse Power Saturation Recovery Time          | 2.4.2.6.2 |\n| 2.2.11.1       | Boresight Differential Group Delay versus     |           |\n| Frequency      |                                               |           |\n| 2.4.2.2,       |                                               |           |\n| 2.4.3.2        |                                               |           |",
    "| 2.4.3.2        |                                               |           |\n| 2.2.11.2       | Group Delay Versus Aspect Angle               | 2.4.2.2   |\n| 2.2.12         | DC Power Interface                            | 2.4.3.3   |",
    "## 2.4.1 Test Conditions The Following Tests Conditions Are Applicable To The Tests Specified In This Document: 2.4.1.1 Power Input Voltage\n\nUnless otherwise specified, all tests shall be conducted with the input voltage adjusted to design voltage ±2%. \n\n## 2.4.1.2 Power Frequency\n\nIn the case of equipment designed for operation from an AC power source of essentially constant frequency (e.g., 400 Hz), the input frequency shall be adjusted to design frequency \n±2%.",
    "## 2.4.1.3 Antenna Installation\n\nThe antenna test installation shall include any adapter plates, where used, or other hardware used to interface the antenna to the fuselage.  The Antenna Subsystem under test shall include any electronics considered part of the installed Antenna Subsystem.  If a radome forms part of the antenna, this shall also be installed during the measurements. \n\n## 2.4.1.4 Ambient Conditions",
    "## 2.4.1.4 Ambient Conditions\n\nUnless otherwise specified, all tests shall be conducted under conditions of ambient room temperature, pressure, and humidity. \n\n## 2.4.1.5 Warm-Up Period\n\nUnless otherwise specified, all tests shall be conducted after the manufacturer's specified warm-up period. \n\n## 2.4.1.6 Connected Loads\n\nUnless otherwise specified, all tests shall be performed with the equipment connected to loads having the impedance values for which it was designed.",
    "## 2.4.1.7 Antenna Ground Plane",
    "An antenna ground plane shall be used to simulate the conductive mounting surface on the intended aircraft.  The metallic ground plane shall have at least a 2 foot radius flat section extending from the center of the antenna unit mounting area.  In addition, beyond the minimum 2 foot radius flat section, the ground plane shall incorporate a minimum 90 degree arc as a means of reducing the edge diffraction effects.  One example is a minimum 2-inch radius-of-curvature cylindrical metallic section",
    "effects.  One example is a minimum 2-inch radius-of-curvature cylindrical metallic section attached below and approximately tangent to the flat section around the entire flat section circumference.",
    "## 2.4.1.8 Antenna Measurement Range",
    "Testing shall be performed in accordance with the Institute of Electrical and Electronic Engineers (IEEE) Standard Test Procedures for Antennas, IEEE-STD-149-1979.  A suitable test range shall be used having a reflectivity level less than -25 dB within a quiet zone containing the antenna under test and the ground plane, and meet the 2D2/λ criterion.  Figure",
    "2-4 shows a representative test configuration for the test range.  \"Compact ranges\" and/or near-field probing techniques may also be employed if analysis shows that an equivalent accuracy may be obtained. Other items of standard test equipment are:",
    "Range instrumentation including a 2-axis (minimum) positioner, positioner controller, tunable L-Band RF signal source, receiver, pattern recorder, and polarization measurement instrumentation. Reference RHCP or linearly-polarized, standard-gain antenna, with gain calibration traceable to National Institute for Standards and Technology (NIST), or other national standards.",
    "## 2.4.1.9 Test Frequencies\n\nAntenna unit measurements for relative pattern and aspect angle group delay tests shall be performed at a minimum of 17 frequencies to include: \n\n| Test Frequency Point    | Frequency Value    |\n|-------------------------|--------------------|\n| Lower Band-edge         | 1559.42 MHz        |\n| GPS Mid-Band            | 1575.42 MHz        |\n\n--``,,,,,,,,,``````,`,,``,,,,`,,-`-`,,`,,`,`,,`---\n\nUpper Band-edge \n1591.42 MHz",
    "--``,,,,,,,,,``````,`,,``,,,,`,,-`-`,,`,,`,`,,`---\n\nUpper Band-edge \n1591.42 MHz \n\nFor boresight relative frequency response and boresight differential group delay tests, antenna unit measurements shall be performed over a wide frequency range to include at least the -50 dB breakpoints in the frequency response requirement and with frequency steps small enough to enable time delay computation and resolve gain breakpoints.",
    "Unless otherwise indicated, all other measurements shall be performed over the minimum operating frequency range of 1575.42 ± 10.23 MHz. \n\nNOTE: Frequency accuracy shall be within ± 0.002 MHz. \n\n## 2.4.2 Gnss Antenna Unit Tests 2.4.2.1 Antenna Unit Output Vswr And Impedance Test (Section 2.2.2)\n\nEquipment Required: Ground Plane - refer to Section 2.4.1.7. Automatic Network Analyzer (Hewlett-Packard 8753, 8720, 8510, or equivalent).",
    "RF Bias Tee and DC Supply. Measurement Requirements: \nConnect the equipment as shown in Figure 2-5 with the network analyzer as the measurement instrument.  Measure the output VSWR over the operating frequency range 1565.42 - 1585.42 MHz at the RF port of the active antenna unit in an anechoic chamber or reflection-less environment.  Verify that the results comply with the requirements in Section 2.2.2.",
    "## 2.4.2.2 Radiation Pattern Gain And Transfer Phase Test (Sections 2.2.3, .5, .6, .8, .11)\n\nEquipment Required: Antenna Measurement Range - refer to Section 2.4.1.8. Ground Plane - refer to Section 2.4.1.7. Automatic Network Analyzer (Hewlett-Packard 8753, 8720, 8510, or equivalent). \n\nRF Bias Tee and DC Supply Gain Standard Antenna, RHCP source antenna.",
    "RF Bias Tee and DC Supply Gain Standard Antenna, RHCP source antenna. \n\nMeasurement Requirements: Connect the equipment as shown in Figure 2-4.  Measure the antenna unit total gain and transfer phase, per IEEE Standard 149-1979, for azimuth angles of at least 0, 45, 90, 135, \n180, 225, 270, and 315 degrees, and elevation angles of at least 0, 5, 10, 20, 30, 45, 60, 75 \nand 90 degrees and at the frequencies defined in Section 2.4.1.9.",
    "## 2.4.2.2.1 Relative Radiation Gain Pattern (Section 2.2.3.1)\n\nAt the L1 center frequency, 1575.42 MHz, form the relative pattern gain by dividing the pattern total gain at every elevation and azimuth measurement point by the maximum gain value within 15 degrees elevation of the zenith point (elevation = 90º). Verify the relative gain falls within the limits of Table 2-1 at all the upper hemisphere pattern points. \n\n--``,,,,,,,,,``````,`,,``,,,,`,,-`-`,,`,,`,`,,`---",
    "--``,,,,,,,,,``````,`,,``,,,,`,,-`-`,,`,,`,`,,`---\n\n## 2.4.2.2.2 Passive Element Gain (Section 2.2.3.2)\n\nAt the L1 center frequency, 1575.42 MHz, measure the absolute gain at 5 degrees elevation and all azimuth angles.  Verify that the gain equals or exceeds the limit of Section 2.2.3.2 \nover all azimuth angles. \n\n## 2.4.2.2.3 Total Transducer Gain Factor For G/T Ratio (Section 2.2.5)",
    "## 2.4.2.2.3 Total Transducer Gain Factor For G/T Ratio (Section 2.2.5)\n\nCombine the total gain measurements at 5º elevation and frequencies 1575.42 ± 8 MHz with the total output noise measurements as indicated in Section 2.4.2.4. \n\n2.4.2.2.4 \nMinimum Boresight Total Transducer Gain (Section 2.2.6) \nVerify that the total transducer gain at 90º elevation meets the limit of Section 2.2.6.1. \n\n## 2.4.2.2.5 Boresight Relative Gain Frequency Response (Section 2.2.8)",
    "## 2.4.2.2.5 Boresight Relative Gain Frequency Response (Section 2.2.8)\n\nNormalize the wide swept frequency boresight total gain measurements (indicated in 2.4.1.9) \nby the maximum gain value within 1575.42 ± 7.5 MHz.  Verify that the -3dB relative response and maximum relative response requirements of Section 2.2.8.1 and 2.2.8.2 are met. \n\n## 2.4.2.2.6 Differential Group Delay Requirements (Section 2.2.11)",
    "## 2.4.2.2.6 Differential Group Delay Requirements (Section 2.2.11)\n\nCalculate the group delay, $\\tau(f)$, at frequency, $f$, from transfer phase measurements, $\\Phi(f_{i})$, at successive test frequencies, $f_{1}$ and $f_{2}$ with $f_{1}\\leq f<f_{2}$ by the discrete approximation formula:",
    "$$\\tau(f)=-\\frac{\\left[\\Phi(f_{2})-\\Phi(f_{1})\\right]}{360\\left[f_{2}-f_{1}\\right]}\\quad(Equation\\ 2-3)$$\n(Φ(fi) is in degrees, fi is in Hz and time delay is in seconds.)  Insert the delay values in the appropriate limit formula in Section 2.2.11 and verify that the requirements of Sub-sections 2.2.11.1 and 2.2.11.2 are met.",
    "NOTE: Normally for test frequency steps more than about 2 MHz, the assigned frequency for the delay, f = 0.5(f2 + f1).  For small steps (≤ 0.5 MHz), f = f1 is acceptable. \n\n## 2.4.2.3 Polarization And Boresight Axial Ratio Test (Section 2.2.4)\n\nEquipment Required: Antenna Measurement Range - refer to Section 2.4.1.8. Antenna Ground Plane - refer to Section 2.4.1.7. Automatic Network Analyzer (Hewlett-Packard 8753, 8720, 8510, or equivalent).",
    "RF Bias Tee and DC Power Supply. LHCP gain standard antenna. Measurement Requirements: Connect the equipment as shown in Figure 2-4.  Measure the unit-under-test total transducer gain relative to the LHCP gain standard per IEEE Standard 149-1979, for one set of principal plane points defined in Section 2.4.2.2.  Calculate the ratio of RHCP gain to LHCP gain (i.e.; the cross-polarization ratio) for the same set of principal plane points.  The requirements of Section 2.2.4 are satisfied if the",
    "for the same set of principal plane points.  The requirements of Section 2.2.4 are satisfied if the cross-polarization ratio is greater than 15 dB at 1575.42",
    "MHz over the range of 75 - 90 degrees elevation.",
    "## 2.4.2.4 Total Output Noise Test (Section 2.2.5)\n\nEquipment Required: Antenna Ground Plane - refer to Section 2.4.1.7. Noise Measurement Receiver or Spectrum Analyzer (Agilent N8973A, HP-8970B, or equivalent) Noise Diode or noise calibration source (HP 346B or equivalent) RF Bias Tee  \nDC Power Supply Measurement Requirements:",
    "1) Mount the ground plane in a horizontal orientation at a suitable outdoor location and \nattach the active antenna unit-under-test. \n2) Connect the equipment as shown in Figure 2-5 with the noise measurement receiver as \nthe measuring instrument. \n3) Calibrate the noise measurement receiver set-up with the noise diode connected to the \nset-up at the interface to the antenna unit RF output connector (no bias applied through \nthe bias tee).",
    "the bias tee). \n4) Measure the antenna unit output noise power ratio (NPRout in dB with respect to \nkT0BMEAS) at each RF frequency, f, for which the 5 degree elevation, total transducer \ngain, GTTG(φ,85º,f) was measured (Section 2.4.2.2). \n5) Calculate the G/T ratio (in dB/K) at 5 degrees elevation angle (85º from zenith) per \nEquation 2-4 and verify that the requirement of Section 2.2.5 is satisfied. \n (Equation 2-4) \n \n(\n)\nG\n,85 ,f\nG\n,85 ,f\n10log\n290\nNPR\nf\nT\nf\n( )\n(\n)\n(\n)\n( )\no\nA\no\nTTG\n10\nOUT",
    "(Equation 2-4) \n \n(\n)\nG\n,85 ,f\nG\n,85 ,f\n10log\n290\nNPR\nf\nT\nf\n( )\n(\n)\n(\n)\n( )\no\nA\no\nTTG\n10\nOUT\nSYS\n⎛\n⎞\nφ\n⎜\n⎟=\nφ\n−\n−\n⎜\n⎟\n⎜\n⎟\n⎝\n⎠\n \nwhere GTTG and NPROUT are in dB. \nNOTES: 1. If the test is performed at or near room ambient temperature, sufficient margin must \nbe allowed to account for degradation over the full temperature range.  \n2. The output noise temperature measurement at the L1 center frequency (1575.42",
    "2. The output noise temperature measurement at the L1 center frequency (1575.42 \nMHz) will likely contain a contribution from the GPS L1 C/A aggregate satellite power visible at the test location.  To correct the measurement for this component, \nthe noise power ratio value used in Equation 2-4 at 1575.42 MHz should be the average of the readings at the two adjacent frequencies, one on either side of 1575.42 MHz (2 MHz nominal frequency spacing).",
    "## 2.4.2.5 Active Antenna Unit Output Load Stability Test (Section 2.2.7)\n\nEquipment Required: Spectrum Analyzer (Hewlett-Packard 8568B, or equivalent). Antenna Test Set. \n\n--``,,,,,,,,,``````,`,,``,,,,`,,-`-`,,`,,`,`,,`---\nAntenna Test Set (to provide power as required by the manufacturer to the preamplifier). \n\n50 Ohm RF Terminator. Bridge-T. \n\nMeasurement Requirements: The stability of the amplifier shall be tested in 8 steps:",
    "1. Mount the unit-under-test in a shielded anechoic chamber and connect the antenna unit \noutput through an RF bias tee, cable, and coupler to the spectrum analyzer.  Set the spectrum analyzer to measure signals at least as low as -110 dBm, and with as wide a frequency range as practical. \n2. Apply power to the antenna unit and verify that the antenna unit does not generate any \ndetectable signals. \n3. Connect an adjustable-length, short-circuited transmission line to the straight-through",
    "3. Connect an adjustable-length, short-circuited transmission line to the straight-through \npath of the couplet to which the spectrum analyzer is attached and adjust the line length \nthrough at least 1 wavelength. . \n4. Verify that the active antenna unit does not generate any signals at its output under \ndifferent positions of the variable length shorted line.",
    "## 2.4.2.6 High Radiated Power Performance Tests",
    "The following tests are intended to be used in conjunction with standard DO-160E Section",
    "20 radiated susceptibility environmental test.  Specific test frequencies, levels, and modulation are given for the 1-2 GHz frequency range.  Outside that range, DO-160E levels apply. Equipment Required: Bias Tee and DC Power Supply Two Synthesized RF Signal Generators (Hewlett-Packard 8662A or equivalent) Spectrum Analyzer (Hewlett-Packard 8568B, or equivalent) Modulator (Hewlett-Packard 11665B, or equivalent) Pulse Generator (Fluke 5712, or equivalent) Linear RF Power Amplifier (500 W peak,",
    "or equivalent) Pulse Generator (Fluke 5712, or equivalent) Linear RF Power Amplifier (500 W peak, minimum) 30 dB Directional Coupler Variable Attenuator (0-40 dB) (optional) Two. 6 dB Power Splitters (for recovery time test) Adjustable Phase Delay Line (for recovery time test) Phase Detector (for recovery time test) Oscilloscope",
    "## 2.4.2.6.1 Boresight Gain Compression Point And Test (Section 2.2.6.3)\n\nMeasurement Requirements:",
    "1. Mount the antenna unit-under-test on the ground plane and connect the equipment as \nshown in Figure 2-6. \n2. Set the RF Signal Generator #1 for frequency to 1575.42 MHz and set the CW signal \nlevel such that the antenna unit-under-test is in its linear operating range (~-40 dBm from a 0 dBic antenna) \n3. Tune the spectrum analyzer to the 1575.42 low level probe signal and set the analyzer to \nthe \"zero-span\" mode.",
    "the \"zero-span\" mode. \n4. Set the RF Signal Generator #2 frequency to the test #1 setting from Table 2-5, set the \nlevel to produce the associated test field strength for that frequency, set the pulse modulator to produce the desired waveform, and synchronize the spectrum analyzer sweep to the pulse PRF. \n5. Verify that any compression of the probe signal level is within the 1 dB limit of Section \n2.2.6.3 during the test frequency pulse duration.",
    "2.2.6.3 during the test frequency pulse duration. \n6. Repeat Steps 4-5 for all the test settings in Table 2-5",
    "## 2.4.2.6.2 Pulse Saturation Recovery Time Test (Section 2.2.10) Measurement Requirements:",
    "1. Connect the equipment as shown in Figure 2-6. 2. Temporarily disable the pulse power signal from RF Signal Generator #2.  Set the RF \nSignal Generator #1 frequency of 1575.42 MHz and adjust its signal level to produce an input power of about 10 dB below the 1 dB input compression point of the active antenna unit-under-test.  Verify that the RF Signal Generator #1 power input to the \nphase detector is in the range for proper operation.",
    "phase detector is in the range for proper operation. \n3. Apply DC bias to the active antenna unit-under-test and adjust the phase delay line (line \nstretcher) such that the oscilloscope shows a 90 degree phase difference between the active antenna unit output and the delayed generator #1 signal (0 Volts on scope \ndisplay). Note also the phase detector peak output voltage (0 or 180 degree path phase \ndifference).",
    "difference). \n4. Set the Pulse Generator and RF Signal Generator #2 to produce the pulsed signal \nrequired for test #3 in Table 2-5.  The level should be set to produce 115 V/m at the unitunder-test. \n5. Verify that the preamplifier meets all criteria set forth in Section 2.2.10.  The recovery \ntime shall be measured as the time needed by the preamplifier to return to a peak phase difference between its output signal and the delayed RF Signal Generator #1 signal of",
    "less that 30 degrees (half the peak amplitude), as shown by the oscilloscope. \n5. Repeat Steps 4 and 5 for tests 4 and 6 using the appropriate settings shown in Table 2-5 \nfor each test.",
    "| Test        |   RF Frequency  |\n|-------------|-----------------|\n| (MHz)       |                 |\n| Pulse       |                 |\n| Width       |                 |\n| PRF         |                 |\n| (pps)       |                 |\n| RF Peak     |                 |\n| Field (V/m) |                 |\n| 1           |         1000    |\n| 2           |         1315    |\n| 3           |         1525    |\n| 4           |         1565.42 |\n| 5           |         1585.42 |",
    "| 4           |         1565.42 |\n| 5           |         1585.42 |\n| 6           |         1610    |\n| 7           |         1660    |\n| 8           |         2000    |",
    "* The Pulse Power Saturation Recovery Time test uses the settings from lines 3, 4, and 6 \nexcept that the field strength value in each case is 115 V/m.",
    "2.4.3 \nActive Antenna Sub-assembly Tests The tests in the following subsections address requirements which are impractical to perform on the entire active antenna unit.  Examples of the requirements include mainly the environmental requirements of Section 2.3.  Proper care shall be taken so that the performance of the active subassembly and, if necessary, the passive radiating element used in these tests remain unchanged from the complete integrated assembly.",
    "## 2.4.3.1 Active Sub-Assembly Rf Gain Response And Noise Temperature Test\n\nThis test is intended for use in the environmental tests of Section 2.3.2 and 2.3.3 for measuring unit performance while the environmental test conditions are applied.",
    "Equipment Required: RF Bias Tee and DC Supply. Automatic Network Analyzer (Hewlett-Packard 8753, 8720, 8510, or equivalent). Automatic Noise Figure Meter (Hewlett-Packard 8970A or equivalent) \nMeasurement Requirements: \n--``,,,,,,,,,``````,`,,``,,,,`,,-`-`,,`,,`,`,,`---\nAny loss in the RF cables connecting the antenna and the test equipment shall be properly taken into account. \n\n## 2.4.3.1.1 Rf Gain And Frequency Response Test :",
    "1. Connect the RF output of the network analyzer to the active sub-assembly input,as \nshown in Figure 2-7.  Connect the active sub-assembly output through the bias tee and \noutput cabling to the network analyzer input. \n2. Set the network analyzer to sweep from 1559.42 MHz to 1591.42 MHz, and set the \noutput level to -40dBm. \n3. Verify that the active sub-assembly transducer gain meets the requirement of Section",
    "3. Verify that the active sub-assembly transducer gain meets the requirement of Section \n2.2.6.2,and the -3 dB gain normalized response requirement of Section 2.2.8.1 over the specified frequency ranges. \n4. Verify that the active sub-assembly differential group delay meets the requirement of \nSection 2.2.11.1 \n5. Set the network analyzer to sweep from 1535 MHz to 1610 MHz at -40 dBm and verify \nthat the normalized frequency response meets the requirements of Section 2.2.8.2",
    "## 2.4.3.1.2 Noise Temperature Test:",
    "1. Connect the noise diode voltage input to the noise measurement receiver drive voltage \nport and the noise diode output port to the test set-up at the point where the RF bias tee and output cabling would connect to the active sub-assembly output (Figure 2-7).  \nCalibrate the noise measurement receiver over the frequency range 1575.42 ± 16 MHz. \n2. Connect the noise diode to the active sub-assembly input and active sub-assembly output",
    "2. Connect the noise diode to the active sub-assembly input and active sub-assembly output \nto the noise measurement receiver RF input through the RF bias tee and output cabling. \n3. Verify that the noise figure is no more than [4 dB] over the frequency band of [1567.42 \nMHz to 1583.42 MHz.",
    "## 2.4.3.2 Active Unit Radiated Hot-Cold Noise And Boresight Signal Performance Test",
    "Equipment Required: \n1) Small, shielded, anechoic material-lined test chamber \n2) Circularly-polarized source antenna 3) Noise Generator 4) Antenna ground plane and mounting plate (sufficient to cover one end of the chamber) \n5) Reference Passive Antenna (identical in design and packaged in the identical manner as \nthe passive radiating element in the active antenna unit) \n6) Noise Measurement Receiver or Spectrum Analyzer (Agilent N8973A, HP-8970B, or \nequivalent)",
    "6) Noise Measurement Receiver or Spectrum Analyzer (Agilent N8973A, HP-8970B, or \nequivalent) \n7) Network Analyzer 8) RF Bias Tee 9) DC-Power Supply",
    "## 2.4.3.2.1 Radiated Hot-Cold Test For Active Sub-Assembly Gain And Noise Temperature Measurement Requirements:",
    "1) Mount the ground plane with the reference passive antenna attached to the small \nanechoic test chamber. \n2) Connect the equipment for noise measurements as shown in Figure 2-8. 3) Calibrate the noise measurement receiver set-up at each RF frequency, f, at which the \nperformance is to be verified with the noise diode connected to the set-up at the interface to the antenna unit RF output connector (no bias applied through the bias tee).",
    "4) Measure the reference passive antenna unit output noise power ratio (dB with respect to \nkT0BMEAS) at each RF frequency, f, at which the performance is to be verified for both \nthe \"hot\" and \"cold\" settings of the radiating noise source. (measurements designated \nPRHOT(f) and PRCOLD(f)) \n5) Replace the reference passive antenna with the active antenna unit-under-test and \nmeasure active antenna unit output noise power ratio (dB with respect to kT0BMEAS) at",
    "measure active antenna unit output noise power ratio (dB with respect to kT0BMEAS) at \neach RF frequency, f, at which the performance is to be verified for both the \"hot\" and \n\"cold\" settings of the radiating noise source (measurements designated PAHOT(f) and \nPACOLD(f)) \n6) Calculate the antenna unit active sub-assembly input noise temperature, \n( )\nR\nT\nf",
    "and gain, \n, by: \n\n( )\nR,dB\nG\nf\n$$\\tilde{\\mathrm{T}}_{\\mathrm{R}}\\left(\\mathrm{f}\\right)=\\left(\\frac{\\mathrm{T}_{\\mathrm{HOT}}\\left(\\mathrm{f}\\right)\\cdot\\Delta\\mathrm{G}_{\\mathrm{A}}\\left(\\mathrm{f}\\right)-\\mathrm{Y}_{\\mathrm{UUT}}\\left(\\mathrm{f}\\right)\\cdot\\mathrm{T}_{\\mathrm{COLD}}\\left(\\mathrm{f}\\right)}{\\mathrm{Y}_{\\mathrm{UUT}}\\left(\\mathrm{f}\\right)-1}\\right)$$ (Equation 2-5)\nand",
    "$$\\tilde{\\mathrm{G}}_{\\mathrm{R,all}}\\left(\\mathrm{f}\\right)=10\\cdot\\log\\left(\\frac{\\left(\\mathrm{Y}_{\\mathrm{UUT}}\\left(\\mathrm{f}\\right)-1\\right)\\cdot\\mathrm{T}_{\\mathrm{COLD}}^{\\prime}\\left(\\mathrm{f}\\right)}{\\mathrm{T}_{\\mathrm{HOT}}\\left(\\mathrm{f}\\right)\\cdot\\Delta\\mathrm{G}_{\\mathrm{A}}\\left(\\mathrm{f}\\right)-\\mathrm{T}_{\\mathrm{COLD}}\\left(\\mathrm{f}\\right)}\\right)$$ (Equation (2-6))\nwhere",
    "$\\rm Y_{\\rm UUT}(f)=10^{0.1\\cdot(PA_{\\rm HOT}(f)-PA_{\\rm COLID}(f))}$ (Equation 2-7) ( ) ( ) ( ) HOT 0.1 PR f HOT T f 290 10 = i i  (Equation 2-8)  ( ) ( ) ( ) COLD 0.1 PR f COLD T f 290 10 = i i  (Equation 2-9) \nand \n\n$\\rm T_{\\rm COLD}^{\\prime}(f)=290\\cdot10^{0.1\\cdot(PA_{\\rm COLD}(f))}$ (Equation 2-10)\n is greater than 26.5 dB \n\n7) Set ΔGA =1 and verify that \n( )\nR\nT\nf\n\n is less than 310 K and \n( )\nR,dB\nG\nf\nfor the range 1575.42 ± 2 MHz and that \n( )\nR\nT\nf",
    "is less than 310 K and \n( )\nR,dB\nG\nf\nfor the range 1575.42 ± 2 MHz and that \n( )\nR\nT\nf\n\n is less than 413 K for 1575.42 ± 8 MHz.  \nThe measured values shall be within the limits by at least the associated measurement procedure uncertainty as described in Appendix A.2.  If the measurement is made at or near room ambient temperature, an additional temperature variation margin shall be used.",
    "NOTES: \n1. The parameter ΔGA(f) is the ratio of the passive radiator element gain of the unit under \ntest to the reference passive element gain.  As such, it represents a first-order uncertainty in the measurement procedure.  Setting the baseline ratio at unity for the test \nresult enables the use of the measurement uncertainty computation described in Appendix A.2. \n2. The noise generator used in the test should have sufficient output noise density to",
    "2. The noise generator used in the test should have sufficient output noise density to \nproduce a ratio PRHOT/PRCOLD ≅ 10 dB with the reference passive antenna.",
    "## 2.4.3.2.2 Boresight Radiated Active Sub-Assembly Gain Response Test Measurement Requirements:",
    "1. Connect the equipment for network analyzer measurements as shown in Figure 2-8. \n2. Calibrate the analyzer with appropriate reflection and transmission standards. \n3. Mount the reference passive antenna and measure the boresight transmission gain and \nphase of the path though the chamber and the passive reference antenna over the \nfrequency range 1575.42 ± 16 MHz, (This measurement serves as the chamber \ncalibration to be de-embedded from the active antenna unit-under-test measurement) \n4",
    "calibration to be de-embedded from the active antenna unit-under-test measurement) \n4 \nMount the active antenna unit-under-test and measure the boresight transmission gain \nand phase of the path though the chamber and the unit-under-test over the frequency \nrange 1575.42 ± 16 MHz.  Correct the measurement with the chamber/passive reference \ncalibration from Step 3. \n5. Verify that the active sub-assembly transducer gain meets the requirement of Section",
    "5. Verify that the active sub-assembly transducer gain meets the requirement of Section \n2.2.6.2, and the -3 dB gain normalized response requirement of Section 2.2.8.1 over the \nspecified frequency ranges. \n6. Verify that the (active sub-assembly) boresight differential group delay meets the \nrequirement of Section 2.2.11.1 \n \n--``,,,,,,,,,``````,`,,``,,,,`,,-`-`,,`,,`,`,,`---",
    "## 2.4.3.3 Active Sub-Assembly Burnout Protection Test\n\nEquipment Required: RF Bias Tee and DC Power Supply Synthesized Signal Generator (Hewlett-Packard 8662A or equivalent). Spectrum Analyzer (Hewlett-Packard 8568B, or equivalent). RF Amplifier (Hewlett-Packard 8347A, or equivalent). Measurement Requirements:",
    "1. Connect the equipment as shown in Figure 2-9. 2. Set RF Signal Generator #1 to a frequency of 1575.42 MHz and adjust the level to \nobtain a low level input signal of -35 dBm at the active subassembly input, apply DC \npower to the active sub-assembly and determine the transducer linear power gain using \nthe spectrum analyzer. \n3. Set RF Signal Generator #2 to a frequency of 1565.42 MHz with a peak pulse power of \n+30 dBm for a 1 ms pulse at 100 Hz PRF (10% duty factor, +20 dBm ave. power)",
    "+30 dBm for a 1 ms pulse at 100 Hz PRF (10% duty factor, +20 dBm ave. power) \n4. Subject the active sub-assembly input to the +30 dBm peak test signal at 1565.42 MHz \nfor 5 minutes while monitoring the gain of the low level 1575.42 MHz probe signal. \nThen change the RF Signal Generator #2 frequency to 1585.42 MHz and dwell for 5 \nminutes while monitoring the probe signal gain.  Verify for each test signal frequency \nthat the peak pulse output from the active antenna unit remains below +20 dBm.",
    "that the peak pulse output from the active antenna unit remains below +20 dBm. \n5. Repeat the tests described in Section 2.4.3.1 to verify that the active sub-assembly still \nmeets the gain, delay and noise temperature requirements therein. \n6. Re-connect the equipment as stated in step 1. 7. With no RF Signal Generator #1 probe signal and DC power removed from the active \nsub-assembly, subject the input to a RF Signal Generator #2 test signal of +30 dBm at 1575.42 MHz for 5 minutes.",
    "--``,,,,,,,,,``````,`,,``,,,,`,,-`-`,,`,,`,`,,`---",
    "8. Repeat the tests described in Section 2.4.3.1 to verify that the preamplifier still meets the \ngain, delay, and noise temperature requirements therein. \n\n## 3. Installed Equipment Performance\n\nThe installed performance of the GNSS antenna shall be evaluated in conjunction with the installed GNSS receiver equipment to ensure that GNSS performance is met in accordance with the appropriate MOPS. \n\nThis page intentionally left blank \n--``,,,,,,,,,``````,`,,``,,,,`,,-`-`,,`,,`,`,,`---",
    "This page intentionally left blank \n--``,,,,,,,,,``````,`,,``,,,,`,,-`-`,,`,,`,`,,`---\n\n## 4. Equipment Operational Performance Characteristics\n\nThe operational performance of the GNSS antenna shall be evaluated in conjunction with the operational tests of the GNSS receiver equipment to ensure that GNSS performance is met in accordance with the appropriate MOPS.  Operational tests of GNSS antennas may be conducted as part of normal preflight tests.",
    "This page intentionally left blank \n--``,,,,,,,,,``````,`,,``,,,,`,,-`-`,,`,,`,`,,`---\n\n## Membership Special Committee 159 Minimum Operational Performance Standards For Airborne Navigation Equipment Using Global Positioning System (Gps) Co-Chairman Christopher Hegarty The Mitre Corporation/Caasd George Ligler Project Management Enterprises, Inc. Secretary Young Lee The Mitre Corporation/Caasd",
    "Members \nSteven Aab \n \n \nRockwell Collins, Inc. \nHamza Abduselam \n         Federal Aviation Administration \nRaghavendra Achanta \n   Advanced Management Technology \nWayland Adams \n \n Honeywell International, Inc. \nMark Ahlbrecht \n \n Honeywell International, Inc. \nJeffrey Aimar \n \n \nThe Boeing Company \nJean-Claude Aime",
    "French CAA \nDennis Akos \n \n           University of Colorado \nGerard Alcouffe \n \n \nThales Avionics, Inc. \nFrank Alexander \n \n         Northwest Airlines, Inc. \nKenneth Alexander \n         Federal Aviation Administration \nDavid Anderson \n \nU. S. Department of Commerce \nRob Anderson  \n         Federal Aviation Administration \nCarl Andren \n      \n    The Institute of Navigation \nRobert Anoll \n         Federal Aviation Administration \nJean-Pierre Arethens \n \n \nThales Avionics, Inc. \nJohn Ashley",
    "Jean-Pierre Arethens \n \n \nThales Avionics, Inc. \nJohn Ashley \n \n        The MITRE Corporation \nLaurent Azoulai",
    "Airbus France \nChad Baber \n\n  Consultant \nMichael Ball \n         Nothrop Grumman Corportation \nClayton Barber \n \n      Garmin International, Inc. \nMelvin Barmat \n   Jansky/Barmat Telecommunications \nJohn Barrer \n \n       The MITRE Corporation \nTerrence Barrett \n\n\nUCI \nJohn Barrows \n           Barrows Consulting Associates \nChris Bartone \n\n       Ohio University \nSteve Baruch \n\n  LSL-LAW \nFrederic Bastide    \n\n    Sofreavia \nEdward Bayliss \n \n        MIT Lincoln Laboratory \nMichael Beamish",
    "Sofreavia \nEdward Bayliss \n \n        MIT Lincoln Laboratory \nMichael Beamish \n\n  Analysis Unlimited \nKevin Bean \n \n       The MITRE Corporation \nSteven Bellingham \n\n           NAV Canada \nDon Benson \n \n       The MITRE Corporation \nKnute Berstis \n\n        NOAA \nGerhard Berz \n\n    Skyguide Yi Bian Innovative Solutions International, Inc.",
    "NOAA \nGerhard Berz \n\n    Skyguide Yi Bian Innovative Solutions International, Inc. \n\nMichael Biggs \n         Federal Aviation Administration Barry Billmann                                                      Innovative Solutions International, Inc. Kathleen Boseley \n \n Honeywell International, Inc. \n\nPhil  Boughton \n\n DORS International Michael Braasch",
    "Phil  Boughton \n\n DORS International Michael Braasch \n\n       Ohio University Ronald Braff \n \n        The MITRE Corporation Allen Branch \n         Federal Aviation Administration Mats Brenner \n \n Honeywell International, Inc. \n\nKevin Bridges \n         Federal Aviation Administration Ned Brokloff \n            The Johns Hopkins University Alison Brown \n \n           NAVSYS Corporation Sam Buckwalter \n\n\nARINC, Inc.",
    "ARINC, Inc. \n\nDeane Bunce \n         Federal Aviation Administration Jason Burns \n         Federal Aviation Administration Bob Buschette \n \n            Rockwell Collins, Inc. \n\nHank Cabler \n         Federal Aviation Administration Curtis Call \n \n Honeywell International, Inc.",
    "Alan Cameron \n         Northrop Grumman Corporation James Carroll                                             Volpe National Transportation Systems Center Tim Cashin \n \n       The MITRE Corporation Rick Cassell \n \n            Rannoch  Corporation Rebecca Casswell \n\n    U. S. Coast Guard Eric Chatre \n \n       Galileo Support Structure Jean Chenebault \n \n         Alcatel Space Industries Lawrence Chesto \n\n                Consultant Thomas Christein",
    "Consultant Thomas Christein \n\n          SAIC \nBarbara Clark \n         Federal Aviation Administration Gregory Clark \n\n         AMTI \nClark Cohen \n \n    IntegriNautics Corporation Ray Cole \n \n Federal Express Corporation George Cooley \n\n      Garmin AT, Inc. \n\nRichard Cooley \n \n Honeywell International, Inc. \n\nJim D'ottaui \n         Federal Aviation Administration Steven Davies \n \n Raytheon Systems Company James Davis \n\n Free Flight Systems Jerry Davis",
    "Free Flight Systems Jerry Davis \n\n     Airbus Industries Bruce DeCleene \n         Federal Aviation Administration Thomas Dehel \n         Federal Aviation Administration Mike DiBenedetto \n\n       Ohio University Mike Dion \n            Alion Science and Technology Maria Dipasquantonio \n         Federal Aviation Administration James Doherty \n \n     Institute for DEF Analyses Daniel Domey \n \n \nCMC Electronics, Inc. \n\nJoe Dorfler",
    "Joe Dorfler \n\n DORS International John Doughty \n \n      Garmin International, Inc. \n\nChristopher Douglas \n \n    Sierra Nevada Corporation \n\nEd Drocella \n          U.S. Department of Commerce \nKevin Dutton \n \n Honeywell International, Inc. \nGlen Dyer \n\n          ITT Industries \nBakry El-Arini \n \n       The MITRE Corporation \nJoe Elchynski \n \n Honeywell International, Inc. \nLeo Eldredge \n         Federal Aviation Administration \nBryant Elrod",
    "ITT Industries \nWilliam Ely \n \n \nAirservices Australia \nPer Enge \n\n Stanford University \nRobert Erlandson \n\n          SAIC \nCarl Evers \n \n             Rannoch Corporation \nSohel Fares \n \n            CMC Electronics, Inc. \nRichard Farr \n \n          American Airlines, Inc. \nJames Fernow \n \n       The MITRE Corporation \nJohn Foley \n\n      Garmin AT, Inc. \nJoAnn Ford \n         Federal Aviation Administration \nThomas Foster",
    "Garmin AT, Inc. \nJoAnn Ford \n         Federal Aviation Administration \nThomas Foster \n\n          SAIC \nRobert Frazier \n         Federal Aviation Administration \nSally Frodge \n         Federal Aviation Administration \nPeter Fyfe \n \n            The Boeing Company \nPaul Galyean \n \n              Navcom Technology \nRobert Geary \n\n    Titan Corporation \nMichael Geyer \nVolpe National Transporation  Systems Center \nKyle Gilbertson",
    "Free Flight Systems \nDavid Girts \n \n  Honeywell International, Inc. \nTracey Golden \n\n      JetBlue Airways \nRussell Gollnich \n \n            Rockwell Collins, Inc. \nPamela Gomez \n         Federal Aviation Administration \nJoe Grabowski \n\n     ZETA Associates \nSylvie Grand-Perret \n\n              Eurocontrol \nRobert Grappel \n \n        MIT Lincoln Laboratory \nCharisse Green \n         Federal Aviation Administration \nDuncan Greer \nQueensland University of Technology \nDieder Guenter",
    "ISI, Inc. \nHerve Guichon \n \n \nThales Avionics, Inc. \nGondo Gulean \n\nEurocontrol \nTim Hailes \n      Aviation Data Systems (Australia) \nAlan Hankin \nInnovative Solutions International, Inc. \nWayne Hanley \nInnovative Solutions International, Inc. \nJoe Hansen \n \n    Sierra Nevada Corporation \nSteve Harding \n            Qinetiq, ATC Research Group \nMatt Harris \n \n            The Boeing Company \nRandolph Hartman \n \n Honeywell International, Inc. \nStephen Heppe \n\n   Telenergy \nMichael Hilbert",
    "Telenergy \nMichael Hilbert \n\n         AMTI \nNobuo Hiroe \n\n    NEC Corporation  \nDave Holloway \n \n          Comant Industries, Inc. \nPhilip Holmer \n\n    Titan Corporation \nKent Horton \n\nDelta Air Lines, Inc. \n\nSusan Houston \n         Federal Aviation Administration Kris Hutchison \n     Aviation Spectrum Resources, Inc. \n\nPeter Hwoschinsky \n         Federal Aviation Administration Richard Idiens \n\n           FDC Belgium Jean-Luc Issler",
    "FDC Belgium Jean-Luc Issler \n\n         CNES \nRobert Jackson \n \n Raytheon Systems Company Steven Jackson \n         Federal Aviation Administration Merlin James \n \n Honeywell International, Inc. \n\nJames Jameson \n \n          Aerospace Corporation James Janky \n\n Trimble Navigation Robert Jeans \n\n NATS Ltd. \n\nDavid Jensen \n \n Honeywell International, Inc. \n\nSteve Jones Federal Communications Commission Jeff Kacirek \n \n Honeywell International, Inc. \n\nRudolph Kalafus",
    "Rudolph Kalafus \n\n Trimble Navigation Elliott Kaplan \n \n       The MITRE Corporation Tim Katanik \n \n Raytheon Systems Company Robert Kelly \n \n    Kelly Systems Engineering Paul Kline \n \n Honeywell International, Inc. \n\nJoseph Kolesar \n \n       The MITRE Corporation Karl Kovach \n\n\nARINC, Inc. \n\nJohn Kraemer Volpe National Transporation  Systems Center Steve Kuhar \n \n Federal Express Corporation E.F. Charles LaBerge \n \n Honeywell International, Inc.",
    "Jonathan Lai \n \n            Rockwell Collins, Inc. \n\nStephane Lannelongue \n \n        Alcatel Space Industries Vladimir Latev \n \n  Universal Avionics Systems Roland Lejeune \n \n       The MITRE Corporation Michael Lemke \n \n         Department of Defense Cedric Lewis \n       Innovative Solutions International Fan Liu \n \n Honeywell International, Inc.",
    "Gary Livack \n         Federal Aviation Administration Bruno Lobert \n \n        Alcatel Space Industries Robert Loh Innovative Solutions International, Inc. \n\nRussell Longley \n              \n            CMC Electronics, Inc. \n\nBenjamin Longwood \n \n Alion Science & Technology Mark Lorenz \n\n          ITT Industries Robert Lorenz \n\n     Magellan Ming Luo \n\n Stanford University  \nPaul Magno \n   Helicopter Association International Robert Mallet \n \n      Technology Planning Inc.",
    "Ian Mallett \n \n       CASA Central Authority Christophe Marionneau \n \n \nThales Avionics, Inc. \n\nKelly Markin \n \n       The MITRE Corporation Tim Martin \n\n    Titan Corporation Navin Mathur \n\n         AMTI \nJim McDonald \n \n Honeywell International, Inc. \n\nKeith McDonald \n\n Navtech Consulting \nEdward McGann",
    "Megapulse, Inc. \nGary McGraw \n \n            Rockwell Collins, Inc. \nThomas McKendree \n \n Raytheon Systems Company \nKeith McPherson \n \n              Airservices Australia \nPaul Mettus \n             Lockheed Martin Corporation \nJeff Meyers \n         Federal Aviation Administration \nBarry Miller \n         Federal Aviation Administration \nBradford Miller  \n         Federal Aviation Administration \nJames Miller \n            National Aeronautics and Space Administration \nCalvin Miles",
    "James Miller \n            National Aeronautics and Space Administration \nCalvin Miles \n         Federal Aviation Administration \nPratap Misra \n \n        MIT Lincoln Laboratory \nSteve Mitchell",
    "NATS Ltd. \nSteve Molina \n \n  Department of Defense/JSC \nFrederick Moorefield \n\n                U.S. Navy \nKenneth Morgan \n \n Honeywell International, Inc. \nJoseph Morrissey \n \n       The MITRE Corporation \nThomas Morrissey \n\n    ZETA Associates \nHarold Moses",
    "ZETA Associates \nHarold Moses \n\nRTCA, Inc. \nCampbell Motley \n   Advanced Management Technology \nJoel Murdock \n \n Federal Express Corporation \nTimothy Murphy \n \n            The Boeing Company \nArun Murthi \n \n        Aero & Space USA, Inc. \nK. Prasad Nair \n  Project Management Enterprises Inc. \nMitchell Narins \n         Federal Aviation Administration \nTien Ngo \n\n  U.S. Navy \nJames Nixon \nInnovative Solutions International, Inc. \nPaul Novak \n\n          SAIC \nYataka Nozaki",
    "SAIC \nYataka Nozaki \n\n     NEC Corporation \nOrville Nyhus \n \n Honeywell International, Inc. \nDaniel O'Laughlin \n \n       The MITRE Corporation \nJohn Oelschlaeger \n \n Honeywell International, Inc. \nLarry Oliver \n         Federal Aviation Administration \nDavid Olsen \n         Federal Aviation Administration \nA.J. Oria \n Overlook Systems Technologies, Inc. \nRick Qwen \n \n       The MITRE Corporation \nRick Packard \n\n            ARINC, Inc. \nMike Palmer",
    "ARINC, Inc. \nMike Palmer \n\n    Transport Canada \nPatrice Pasturel \n\n      Garmin AT, Inc. \nMichael Perz \n\n        U.S. Air Force \nBarbara Pederson \n \n            Rockwell Collins, Inc. \nWilliam Petruzel \n         Federal Aviation Administration \nEric Phelts \n\n Stanford University \nElio Picchetti \n \n            Rockwell Collins, Inc. \nBrian Pierce \n\nARINC Inc. \nRyan Porisch \n \n Honeywell International, Inc. \nDaniel Porras \n\n           GMV (Spain) \nPaul Prisaznuk",
    "GMV (Spain) \nPaul Prisaznuk \n\nARINC Inc. \nSam Pullen \n\n Stanford University Patrick Quach \n\n        NASA Langley Jim Radice \n\n    U.S. Coast Guard Srini Raghavan \n \n          Aerospace Corporation B. Rao \n \n           The Mitre Corporation Jayanta Ray \n        Accord Software & Systems, Inc. \n\nPatrick Reddan \n\n    ZETA Associates Patrick Reines \n \n Honeywell International Inc. \n\nJohn Rickards \n         Federal Aviation Administration Lionel Ries",
    "John Rickards \n         Federal Aviation Administration Lionel Ries \n\n         CNES \nAbbas Rizvi \n         Federal Aviation Administration Paul Rodriguez \n             Leventhal, Senter & Lewman Jeff Ross \n \n     Time Domain Corporation Linn Roth \n\n Locus, Inc. \n\nBenoit Roturier \n\n        DGAC \nSteve Rowson \n\n    Thales ATM, Inc. \n\nJason Rudisill \n \n Honeywell International, Inc. \n\nDean Rudy \n \n    Sierra Nevada Corporation John Rudzis \n\nARINC Inc.",
    "Dean Rudy \n \n    Sierra Nevada Corporation John Rudzis \n\nARINC Inc. \n\nWilliam Ruhl \n \n           CMC Electronics, Inc. \n\nWilliam Russell \n \n                     Russell Systems John Savoy \n \n Honeywell International, Inc. \n\nAlbert Sayadian \n         Federal Aviation Administration Walter Scales \n \n       The MITRE Corporation Joseoh Scheitlin \n \n Honeywell International, Inc. \n\nTim Schempp \n \n Raytheon Systems Company Ron Schroer",
    "Tim Schempp \n \n Raytheon Systems Company Ron Schroer \n\n          SAIC \nDavid Scull \n \n         OPTIMUS Corporation Mark Settle \n\n          NTIA \nRalph Sexton Innovative Solutions Interntional, Inc. \n\nM. Shenoy \n        Accord Software & Systems, Inc. \n\nRanjeet Shetty \n   Advanced Management Technology Curtis Shively \n \n       The MITRE Corporation C. Edward Sigler \n\n         AMTI \nTrent Skidmore \n\n       Ohio University Rhonda Slattery \n\n\nARINC, Inc.",
    "AMTI \nTrent Skidmore \n\n       Ohio University Rhonda Slattery \n\n\nARINC, Inc. \n\nBernald Smith \n  The Soaring Society of America/FAI \nAllen Snowball \n \n    WSIC Navigation Systems Dusty Somerville \n\n      JetBlue Airways George Sotolongo \n \n            The Boeing Company Cary Spitzer \n\n       AvioniCon, Inc. \n\nThomas Stansell \n\n Stansell Consulting Ken Staub \n \n \nTrios Associates, Inc. \n\nJeff Stevens \n\nARINC Inc.",
    "Stansell Consulting Ken Staub \n \n \nTrios Associates, Inc. \n\nJeff Stevens \n\nARINC Inc. \n\nBob Stimmler \n \n Raytheon Systems Company Victor Strachan \n \n \nLitton Industries, Inc. \n\nAlex Stratton \n \n            Rockwell Collins, Inc. \n\nJohn Studenny \n \n            CMC Electronics, Inc. \n\nMahesh Surathu \n \n            Rockwell Collins, Inc. \nAbdul Tahir \n\n  Aviso, Inc. \nMichael Teems \n            The Johns Hophins University \nTom Teetor \n         Defense Concept Associates Inc. \nHenry Therrien",
    "ARINC Inc. \nPatrick Thusius \n\n         U.S. Air Force \nMarcus Tittiger \n\n    Transport Canada \nMichael Tran \n \n       The MITRE Corporation \nMike Tuley \n\n       IDA Consultant \nDavid Turner \n\n        NOAA \nTed Urda \n         Federal Aviation Administration \nA . J. Van Dierendonck \n \n      AJ Systems/NovAtel, Inc. \nKaren Van Dyke \n \n \nVolpe National Transporation Systems Center \nFrank Van Graas",
    "Ohio University \nKevin Vanderwerf \n \n Honeywell International, Inc. \nChristopher Varner \n \n              \n \n                     The MITRE Corporation \nLewis Vaughn \n\n         U.S. Air Force \nMichael Vaujin \n \n Honeywell International, Inc. \nFrederick Ventrone",
    "U.S. Air Force \nMichael Vaujin \n \n Honeywell International, Inc. \nFrederick Ventrone \n\nARINC Inc. \nJavier Ventura-Traveset \n \n        European Space Agency \nMatthew Wade \n         Federal Aviation Administration \nJames Waid \n \nHoneywell International, Inc. \nKenneth Wallace \n \n \nARINC Incorporated \nTodd Walter \n              \n \n  Stanford University \nAlan Waltho",
    "Intel Corporation \nRick Walton \n \nLockheed Martin Corporation \nRaymond Wasilko \n         Federal Aviation Administration \nDavid Weinreich \n           Globalstar Limited Partnership \nMike Webb \n         Federal Aviation Administration \nMichael Whitehead",
    "Satloc \nJoel Wichgers \n \n            Rockwell Collins, Inc. \nLarry Wiederholt \n \n       The MITRE Corporation \nJeffrey Williams \n         Federal Aviation Administration \nRobert Williams \n \n  Department of Defense/JSC \nChristopher Wolf \n         Federal Aviation Administration \nMarcus Wolf \nFederal Communications Commission \nSandra Wright \n \n Alion Science & Technology \nThomas Wright \n \n Alion Science & Technology \nVictor Wullschleger \n         Federal Aviation Administration",
    "Alion Science & Technology \nVictor Wullschleger \n         Federal Aviation Administration \nDavid York \n   Helicopter Association International \nJim Young \n \n Honeywell International, Inc. \nRobert Yowell \n \n          Aerospace Corporation \nTom Zalesk",
    "U. S. Navy \n Nestor Zarraoa-Lopez \n\n           GMV - Spain Melvin Zeltser \n \n       The MITRE Corporation \n--``,,,,,,,,,``````,`,,``,,,,`,,-`-`,,`,,`,`,,`---\n\n## Appendix A G/T Ratio Measurement Theory And Application To Receiver System Analysis And Test\n\n \n\n                                                                                  \n                                                       This page intentionally left blank",
    "## A G/T Ratio Measurement Theory And Application To Receiver System Analysis And Test",
    "GNSS airborne antennas with integral RF amplifiers and preselector filters pose difficulties for testing gain and noise performance of the amplifier and filter section and the gain of the passive antenna radiator element independently.  Production units typically have only one connector interface, an RF coaxial connector which outputs the amplified GNSS satellite signals.  DC power is also fed through the cable and connector center conductor to the antenna active circuitry.  No external access",
    "the cable and connector center conductor to the antenna active circuitry.  No external access is available to the junction between the passive radiator terminals and the active circuit section.  One practical way to overcome the lack of direct access to the passive antenna radiator terminals is to measure the active antenna unit radiation pattern in terms total transducer gain (see Sect. 2.4.2.2) and the noise performance in terms of output noise power (see Sect. 2.4.2.4).  Overall antenna unit",
    "and the noise performance in terms of output noise power (see Sect. 2.4.2.4).  Overall antenna unit performance, specified (Sect. 2.2.5) in terms of gainto-noise temperature (G/T) ratio, is then determined by from the ratio of the measured total transducer gain to the measured output noise power. Other methods for measuring active antenna performance could be used (such as passive element gain and noise figure).  However, performance parameters measured with these other methods must be",
    "gain and noise figure).  However, performance parameters measured with these other methods must be converted to G/T ratio and uncertainties must be accounted for in the test results and the conversion.  In all cases, some parameter estimation is required. The goal is to minimize the effect of parameter estimation. Section A.1 gives the theoretical background for the G/T requirements and measurement approach taken in the active antenna unit MOPS.  The total transducer gain and output noise power",
    "approach taken in the active antenna unit MOPS.  The total transducer gain and output noise power ratio parameters are defined and the antenna unit G/T ratio is derived from them.  Relative pattern gain and selectivity performance responses are shown to be derived from total transducer gain data.  The importance of G/T ratio in determining receiver system signal-to-thermal noise ratio density is demonstrated. Section A.2 describes some other measurement approaches and how their results can be",
    "demonstrated. Section A.2 describes some other measurement approaches and how their results can be related to the G/T requirements along with corresponding measurement and relational uncertainties. Section A.3 describes how the active antenna performance parameters are used to calculate input signal, thermal noise, and interference levels at the input to the GNSS",
    "receiver for receiver performance testing.",
    "--``,,,,,,,,,``````,`,,``,,,,`,,-`-`,,`,,`,`,,`---\n\n## A.1 Gnss Active Antenna G/T Ratio Measurement Theory A.1.1 Antenna Unit Total Transducer Gain\n\n \nThe first of two measurements needed to determine the antenna unit G/T ratio is the total transducer gain.  From the simplified antenna unit block diagram (Figure A-1) define the total transducer power gain as",
    "$\\mathbf{G}_{\\mathrm{TTG}}\\left(\\phi,\\theta,\\mathrm{f}\\right)=\\mathbf{G}_{\\mathrm{A}}\\left(\\phi,\\theta,\\mathrm{f}\\right)\\mathbf{G}_{\\mathrm{R}}\\left(\\mathrm{f}\\right)$ (Equation A-1)",
    "where GA(φ,θ,f) is the passive radiator element gain as a function of the pattern polar coordinate angles (φ, θ) and frequency, and GR(f) is the active sub-assembly net power gain as a function of frequency.  The total transducer power gain, GTTG(φ,θ,f), is the measured gain value of the integrated active antenna unit from a conventional antenna pattern measurement.  For maximum usefulness in GNSS airborne receive system applications, the transducer gain is referenced to a unity-gain,",
    "in GNSS airborne receive system applications, the transducer gain is referenced to a unity-gain, isotropic, right-hand circular polarized antenna and measured over a sufficient frequency range to determine its passband shape and out-of-band rejection.",
    "In addition to its role in the G/T ratio, the total transducer gain, GTTG(φ,θ,f), can also be normalized to a convenient value, for example at the L1 center frequency and boresight orientation (θ=0).  Relative gain patterns versus pattern orientation can then be plotted and compared with requirements.  Boresight total transducer gain, normalized to the maximum passband value, can also be used for passband bandwidth and skirt selectivity requirements.",
    "## A.1.2 Antenna Unit Output Noise Power Density\n\nThe second measurement needed for the antenna unit G/T ratio is the output noise power density as a function of frequency, PSDOUT(f), over the same frequency range as in the transducer gain measurement.  A noise analysis of the antenna unit diagram (Figure A-1) yields the following result for the output noise power density:",
    "$\\mathrm{PSD}_{\\mathrm{OUT}}\\left(\\mathrm{f}\\right)=\\mathrm{k}\\bullet\\left(\\mathrm{T}_{\\mathrm{A}}\\left(\\mathrm{f}\\right)+\\mathrm{T}_{\\mathrm{R}}\\left(\\mathrm{f}\\right)\\right)\\bullet\\mathrm{G}_{\\mathrm{R}}\\left(\\mathrm{f}\\right)$ (Equation A-2)",
    "where k is Boltzmann's Constant (1.38065 x 10-23 W/Hz/K); TR(f) is the effective input noise temperature (K) of the active circuit section terminals; GR(f) is the active subassembly net power gain; and TA(f) is the effective antenna temperature.  All three parameters are referenced to the passive antenna radiator element port.  Note that the \n--``,,,,,,,,,``````,`,,``,,,,`,,-`-`,,`,,`,`,,`---",
    "--``,,,,,,,,,``````,`,,``,,,,`,,-`-`,,`,,`,`,,`---\nactive section net power gain term, GR(f), in (Equation A-2) is the same term as in the transducer gain (Equation A-1).",
    "The active section input noise temperature; TR(f), (in K) is related to its input noise factor, FR(f), given in ratio, by",
    "$\\rm T_{R}\\left(f\\right)=\\left(F_{R}\\left(f\\right)-1\\right)$-290 (Equation A-3)\nThe effective antenna temperature, TA(f), a less well-known parameter, is essentially the average over the antenna pattern of the received black-body radiation at frequency, f \n[Ref. A-1].  A common range of TA values observed for GNSS airborne antennas is 75 to",
    "100 K when mounted outdoors with the pattern main lobe pointing upward.  The antenna noise temperature is about 300 K when measured in an indoor anechoic chamber whose absorber material is at normal room temperature (23 C).  Since the antenna temperature is a significant component in the sum with TR, the output noise power density measurement should be taken outdoors with the antenna mounted on the same ground plane used in the transducer pattern tests.  This outdoor measurement will then",
    "on the same ground plane used in the transducer pattern tests.  This outdoor measurement will then reasonably replicate actual aircraft-installed conditions.  Correction of anechoic chamber measurements of output noise power density and the associated uncertainties are discussed in a later section.",
    "## A.1.3 G/T Ratio Calculation\n\nThe G/T ratio for the GNSS antenna is determined by the scaling the measured transducer gain (Equation A-1) by Boltzmann's Constant and dividing by the measured output noise power density (Equation A-2) as shown below:",
    "$\\mathbf{k}\\bullet\\mathbf{G}_{\\text{TTG}}\\left(\\phi,\\theta,\\text{f}\\right)=\\frac{\\mathbf{k}\\bullet\\mathbf{G}_{\\text{A}}\\left(\\phi,\\theta,\\text{f}\\right)\\bullet\\mathbf{G}_{\\text{R}}\\left(\\text{f}\\right)}{\\mathbf{k}\\bullet\\left(\\mathbf{T}_{\\text{A}}\\left(\\text{f}\\right)+\\mathbf{T}_{\\text{R}}\\left(\\text{f}\\right)\\right)\\bullet\\mathbf{G}_{\\text{R}}\\left(\\text{f}\\right)}$ (Equation A-4)",
    "(Equation A-4) $$=\\frac{\\mathbf{G}_{\\text{A}}\\left(\\phi,\\theta,\\text{f}\\right)}{\\left(\\mathbf{T}_{\\text{A}}\\left(\\text{f}\\right)+\\mathbf{T}_{\\text{R}}\\left(\\text{f}\\right)\\right)}$$",
    "Substituting the definition of the integrated active antenna unit input noise temperature,",
    "$$\\mathrm{T_{IN}\\left(f\\right)=T_{A}\\left(f\\right)+T_{R}\\left(f\\right)\\,\\,(Equation\\,\\,A-5)}$$\ninto the interim result in Equation A-4 yields the final G/T ratio result:",
    "$\\mathbf{k}\\cdot\\mathbf{G}_{\\text{TTG}}\\left(\\phi,\\theta,\\text{f}\\right)=\\left(\\frac{\\mathbf{G}_{\\text{A}}\\left(\\phi,\\theta,\\text{f}\\right)}{\\text{T}_{\\text{IN}}\\left(\\text{f}\\right)}\\right)$ (Equation A-6)\nThe principal GA/TIN pattern angle range of interest is the constant 5º elevation contour (θ \n= 85º, φ= -180º to + 180º).  The associated frequency ranges of interest are 1575.42 ±2",
    "= 85º, φ= -180º to + 180º).  The associated frequency ranges of interest are 1575.42 ±2 \nMHz and ±8 MHz.  These correspond to the elevation angle for the minimum GPS satellite signal-in-space power and frequency range of the principal lobe and one or more adjacent sidelobes of the GPS L1 C/A signal spectrum.  The minimum limit (Sect. 2.2.5) \nfor GA/TIN is to apply over these angles and frequency ranges.",
    "## A.1.4 Relationship Of G/T Ratio To Receiver System Input Signal-To-Noise Density Ratio\n\n--``,,,,,,,,,``````,`,,``,,,,`,,-`-`,,`,,`,`,,`---\nThe receiver system equivalent input carrier-to-thermal noise density ratio, S/N0, can be written as",
    "$$\\left({\\frac{\\mathbf{S}}{\\mathbf{N}_{0}}}\\mathbf{(f)}\\right)={\\frac{\\mathbf{S}}{\\mathbf{k}}}\\bullet\\left({\\frac{\\mathbf{G}_{\\mathbf{S}}}{\\mathrm{T}_{\\mathrm{sys}}}}\\mathbf{(f)}\\right){\\mathrm{(Equation~A-7)}}$$",
    "where S is the desired GPS satellite signal power (into a 0 dBic antenna), GS is the antenna unit equivalent passive gain toward the GPS satellite, TSYS is the receiver system input temperature and k is Boltzmann's Constant.  Note, that in general, this carrier-tonoise density ratio is a function of frequency, f.  A representative GPS receiver system consists of an active antenna unit connected to a receiver through a coaxial cable. Neglecting the frequency dependency, the system input noise",
    "to a receiver through a coaxial cable. Neglecting the frequency dependency, the system input noise temperature, in that case is",
    "$\\rm T_{SYS}=T_{A}+T_{R}+\\frac{T_{Rcv}\\cdot L_{Cab}}{G_{R}}+\\frac{T_{Cab}\\cdot(L_{Cab}-1)}{G_{R}}$ (Equation A-8)",
    "where GR is the antenna unit active sub-assembly net gain, LCab is the coax cable loss factor (> 1), TCab is the cable ambient temperature (~300K), and TRcvr is the receiver input noise temperature.  Note the sum of the first two terms in Equation A-8 equals the antenna unit effective input temperature, TIN.  In a well-designed system, GR will be sufficiently large to make third and fourth terms in Equation A-8 insignificant compared to TIN.  Thus, Equation A-8 reduces to TSYS ≅ TIN.  With this",
    "Equation A-8 insignificant compared to TIN.  Thus, Equation A-8 reduces to TSYS ≅ TIN.  With this approximation for TSYS",
    "applied for the case of minimum GPS signal conditions, Equation A-6 becomes",
    "$$\\left({\\frac{\\mathrm{S}}{\\mathrm{N}_{0}}}\\right)_{\\mathrm{MIN}}={\\frac{\\mathrm{S}_{\\mathrm{MIN}}}{\\mathrm{k}}}\\bullet\\left({\\frac{\\mathrm{G}_{\\mathrm{S}}}{\\mathrm{T}_{\\mathrm{SYS}}}}\\right)_{\\mathrm{MIN}}\\cong{\\frac{\\mathrm{S}_{\\mathrm{MIN}}}{\\mathrm{k}}}\\bullet\\left({\\frac{\\mathrm{G}_{\\mathrm{A}}}{\\mathrm{T}_{\\mathrm{IN}}}}\\right){\\mathrm{(Equation~A-9)}}$$",
    "Equation A-9 demonstrates how the minimum G/T ratio, defined in Section A.1.3 above, essentially determines the minimum input S/N0 ratio (a key system sensitivity parameter)",
    "resulting from the minimum GPS satellite signal limit. Note, that in general, this carrier-to-noise density ratio is a function of frequency, f.  The minimum G/T ratio, as specified in Section 2.2.5, and thus the minimum S/N0, can be at some frequency other than at the center of the band, 1575.42 ± 2 MHz.  However, due to the receiver's correlation spreading process, this dependency on frequency will change.",
    "## A.2 Other Measurement Approaches And Associated Uncertainties In Conversion To G/T A.2.1 Anechoic Chamber Measurement Of Antenna Unit Output Noise Power Density",
    "A variation on the G/T measurement approach described in Section A.1 is to perform the same total transducer gain measurements and then make the output noise power density measurements in the same anechoic chamber in which the gain measurements are performed. The measured output noise density, PSDOUT,M, must be corrected for the estimated difference between the anechoic chamber temperature and an assumed antenna/sky temperature (between 75K and 100K).  For this approach, Equation A-4 \nbecomes",
    "$\\text{k}\\cdot\\text{G}_{\\text{TTG}}\\left(\\phi,\\theta,\\text{f}\\right)=\\frac{\\text{k}\\cdot\\text{G}_{\\text{TTG}}\\left(\\phi,\\theta,\\text{f}\\right)}{\\text{PSD}_{\\text{OUT,C}}\\left(\\text{f}\\right)}$ (Equation A-10)\nwhere PSDOUT,M(f) is the anechoic chamber measured PSD and ΔTA is the estimated temperature difference (smallest if TA = 100K).  The description following Equation A-4 \nis then the same except that the final result must account for an additional error source -",
    "is then the same except that the final result must account for an additional error source - \nthe error in the estimate of the temperature difference, multiplied by an estimate of the active section net power gain.  This would result in a requirement for a higher G/T than specified in Section 2.2.5 of the MOPS. In terms of Equation A-4 and including temperature and gain estimation error terms, Equation A-10 becomes",
    "i i k G f k G f G f ( ) ( ) ( ) TTG A R , , , , ˆ i i i i - φ θ φ θ = + − Δ PSD f k T f T f G f k T G f ( ) , ( ) ( ) ( ) ( ) ( ) OUT C AC R R A R (Equation A-11)  , , G f ( ) A i i G f G f T f T 1 T G f G f ( ) ( ) ( ) ( ) ( ) R R IN A A R R , , A ( ) ( ) IN R R A A i i G f 1 T f G f G f T T 1 1 T f G f T f G f ( ) ( ) ( ) ( ) ( ) ( ) IN R IN R $$=\\frac{\\mathrm{G_{A}\\left(\\phi,\\theta,f\\right)}}{\\mathrm{T_{IN}\\left(f\\right)-\\delta\\Delta T_{A}\\left(f\\right)}}\\left(1+\\frac{\\delta",
    "T_{A}\\left(f\\right)}}\\left(1+\\frac{\\delta G_{R}\\left(f\\right)}{G_{R}\\left(f\\right)}\\right)-\\Delta T_{A}\\left(\\frac{\\delta G_{R}\\left(f\\right)}{G_{R}\\left(f\\right)}\\right)\\right.$$ $$=\\frac{\\mathrm{G_{A}\\left(\\phi,\\theta,f\\right)}}{\\mathrm{T_{IN}\\left(f\\right)}}\\left(1-\\frac{\\delta\\Delta T_{A}}{\\mathrm{T_{IN}\\left(f\\right)}}\\left(1+\\frac{\\delta G_{R}\\left(f\\right)}{G_{R}\\left(f\\right)}\\right)-\\frac{\\Delta T_{A}}{\\mathrm{T_{IN}\\left(f\\right)}}\\left(\\frac{\\delta",
    "T_{A}}{\\mathrm{T_{IN}\\left(f\\right)}}\\left(\\frac{\\delta G_{R}\\left(f\\right)}{G_{R}\\left(f\\right)}\\right)\\right)$$",
    "where the errors are δΔTA, the error in the temperature difference estimate, and δGR(f), the error in the estimate of the active section net power gain.  δΔTA is constrained at the limits of ΔTA - this error can only be negative when TA is assumed to be 100K and only positive when TA is assumed to be 75K.  Neglecting products of error terms and linearizing, Equation A-11 becomes",
    "$$\\approx\\frac{\\mathrm{G_{A}\\left(\\phi,\\theta,f\\right)}}{\\mathrm{T_{IN}\\left(f\\right)}}\\Bigg{(}1+\\frac{\\Delta\\mathrm{T_{A}}}{\\mathrm{T_{IN}\\left(f\\right)}}\\Bigg{(}\\frac{\\delta\\mathrm{G_{R}\\left(f\\right)}}{\\mathrm{G_{R}\\left(f\\right)}}\\Bigg{)}+\\frac{\\delta\\mathrm{AT_{A}}}{\\mathrm{T_{IN}\\left(f\\right)}}\\Bigg{)}$$ (Equation A-12)",
    "(Equation A-12) $$\\approx\\frac{\\mathrm{G_{A}\\left(\\phi,\\theta,f\\right)}}{\\mathrm{T_{IN}\\left(f\\right)}}\\Bigg{(}1+\\frac{\\Delta\\mathrm{T_{A}}}{\\mathrm{T_{IN}\\left(f\\right)}}\\Bigg{(}\\frac{\\delta\\mathrm{G_{R}\\left(f\\right)}}{\\mathrm{G_{R}\\left(f\\right)}}\\Bigg{)}+\\frac{\\delta\\mathrm{AT_{A}}}{\\mathrm{T_{IN}\\left(f\\right)}}\\Bigg{)}$$",
    "Note that the first term of the multiplication term includes the gain estimation error.  This error can easily dominate since it multiplies the gain error times the entire temperature correction. Once compensation is applied to account for the estimation errors, the procedure to verify specification compliance is the same as described in Section A.1.3.  If TA is assumed to be 100K, δΔTA can be set to zero.  Likewise, if the active gain estimation is set to its minimum limit, the gain estimation",
    "to zero.  Likewise, if the active gain estimation is set to its minimum limit, the gain estimation error can also be set to zero.  These two conditions set TIN(f) to its maximum possible value.",
    "## A.2.2 Radiated Hot-Cold Chamber Measurement Of Active Sub-Assembly Performance",
    "This method uses a small anechoic chamber to measure total boresight gain and the combined noise temperature of the active antenna/anechoic chamber relative to a representative reference patch antenna (Figure A-2).  First the noise measurement receiver is calibrated with a standard noise diode.  Next the \"hot\" and \"cold\" chamber noise temperatures are measured with representative passive antenna in the place of the active antenna.  Finally the gain and input noise temperature of the active",
    "in the place of the active antenna.  Finally the gain and input noise temperature of the active antenna unitunder-test (UUT) are measured in a conventional Y-factor test [Ref. A-2].",
    "THR\nSmall Shielded Anechoic Chamber\n\n$\\rm T_{\\rm HOT}=(T_{\\rm HOT}\\cdot\\Delta G_{\\rm A}+T_{\\rm R})\\cdot G_{\\rm R}$ (Equation A-13)\nand \n\n$$\\mathrm{T_{\\cal{C}O L D}^{\\prime}=(T_{\\cal{C}O L D}+T_{R})\\bullet G_{R}~(Equation~A-14)}$$\nIn these equations",
    "$$\\Delta\\mathbf{G}_{\\mathrm{A}}={\\frac{\\mathbf{G}_{\\mathrm{A,UUT}}}{\\mathbf{G}_{\\mathrm{A,REF}}}}{\\mathrm{~(Equation~A-15)}}$$\nis the ratio of the boresight passive element gains and represents a principal uncertainty in the measurement.  Then, define the active antenna measured Y-factor as \n--``,,,,,,,,,``````,`,,``,,,,`,,-`-`,,`,,`,`,,`---",
    "$$\\mathbf{Y}_{\\mathrm{{\\small{UUT}}}}={\\frac{\\mathbf{T}_{\\mathrm{{\\small{HOT}}}}^{\\prime}}{\\mathbf{T}_{\\mathrm{{\\small{COLD}}}}^{\\prime}}}{\\mathrm{~(Equation~A-16)}}$$\nThis set of measurements yields estimates of the test unit active sub-assembly input noise temperature and the gain as",
    "$${\\hat{\\mathrm{T}}}_{\\mathrm{R}}=\\!\\!\\left({\\frac{\\mathrm{T}_{\\mathrm{HOT}}\\!\\cdot\\!\\Delta\\!\\mathrm{G}_{\\mathrm{A}}-\\mathrm{Y}_{\\mathrm{UUT}}\\!\\cdot\\!\\mathrm{T}_{\\mathrm{COLD}}}{\\mathrm{Y}_{\\mathrm{UUT}}-1}}\\right){\\mathrm{(Equation~A-17)}}$$\nand",
    "$${\\hat{\\mathbf{G}}}_{\\mathrm{R}}=\\!\\left({\\frac{(\\mathbf{Y}_{\\mathrm{{UUT}}}-\\mathbf{1})\\!\\cdot\\!\\mathbf{T}_{\\mathrm{{Cool,D}}}^{\\prime}}{\\mathbf{T}_{\\mathrm{{HOT}}}\\!\\cdot\\!\\mathbf{\\Delta}\\mathbf{G}_{\\mathrm{A}}-\\mathbf{T}_{\\mathrm{{Cool,D}}}}}\\right){\\mathrm{(Equation~A-18)}}$$",
    "Note how the passive element gain uncertainty affects both input noise temperature and active gain. Since this simple anechoic chamber is assumed to lack an antenna positioner, total transducer gain versus roll and pitch angles, needed for the G/T ratio, must be made on the active unit-under-test in a full-featured anechoic chamber.  Once the total transducer gain at 5º elevation has been measured, the G/T ratio estimate for the active antenna is computed as follows",
    "$$\\left({\\frac{\\mathrm{G_{A}\\left(85^{\\circ},f\\right)}}{\\mathrm{T_{IN}\\left(f\\right)}}}\\right)_{\\mathrm{EST}}={\\frac{\\mathrm{G_{TTG}\\left(85^{\\circ},f\\right)}}{\\left(\\mathrm{T_{A}+\\bar{T}_{R}\\left(f\\right)\\bullet\\bar{G}_{R}\\left(f\\right)}\\right)}}{\\mathrm{~(Equation~A-19)}}$$\nwhere GTTG(85º,f) is the minimum total transducer gain at frequency, f, over all azimuth angles at 5 degrees elevation.",
    "The parameters measured using this method are essentially the same as those described in A.2.3 except that the signal path is not broken and test points are not used.  However, the passive antenna used as a reference must be representative of that of the active antenna under test, and, of course, mismatch errors relative to that passive antenna still apply.",
    "Antenna/sky temperature, TA, must still be estimated to convert the measurements to the G/T specification. The method is also useful in checking G/T before and after certain environmental tests described in this MOPS.  In those cases, the GTTG factor at boresight can be approximated by multiplying the boresight reference patch gain, GA,REF times the active element gain estimate shown in the denominator of Equation A-19.  The formula in that equation (computed at boresight) can be used with the",
    "of Equation A-19.  The formula in that equation (computed at boresight) can be used with the small-chamber noise measurements before and after the environmental condition to check for excessive change.",
    "## A.2.3 Separate Measurements Passive Antenna Element And Active Sub-Assembly",
    "In this approach G/T is not measured directly, but rather computed from separate passive antenna gain and active sub-assembly gain and noise temperature measurements.  One possible means to accomplish the separate measurements is to break the signal path and insert RF test points between the passive antenna and the active sub-assembly.  Another means is to construct identical packaged units - one with only an antenna, the other with only an active sub-assembly and an additional input RF",
    "- one with only an antenna, the other with only an active sub-assembly and an additional input RF connector.  The parameters measured are the passive antenna gain, GA(φ,θ,f), the active sub-assembly net power gain, GR(f), and noise temperature TR, all with potential errors because of impedance mismatch and other losses associated with breaking the signal path.",
    "The S/N0 used in GNSS receiver performance analyses using inserted test point measurements is given by (neglecting implementation losses):",
    "$\\mathbf{N}_{0}(\\theta,\\mathbf{f})=\\frac{\\mathbf{S}(\\theta)}{\\mathbf{k}}\\cdot\\left(\\frac{\\mathbf{G}_{\\mathrm{A}}(\\theta,\\mathbf{f})}{\\mathbf{T}_{\\mathrm{A}}+\\mathbf{T}_{\\mathrm{R}}\\left(\\mathbf{f}\\right)}\\right)$ (Equation A-20)\nwhere, in this case, GA(θs,f) is the minimum measured GA(φ,θ,f) at a particular elevation angle (90-θ) over all azimuth angles, φ; TA is the assumed antenna/sky noise temperature; \nand TR(f) is the measured noise temperature of the active sub-assembly (Figure A-1).",
    "The denominator of the bracketed quantity represents an estimate of the integrated antenna unit input noise temperature, TIN(f) (see Sect. A.1.4). Thus, the bracketed quantity in Equation A-20 can be compared to the specified G/T requirements, accounting for uncertainties in the measurements and the conversion to G/T ratio. The uncertainties include the uncertainty in the measured passive antenna gain (due to mismatches as a result of breaking the connection), the antenna/sky temperature",
    "gain (due to mismatches as a result of breaking the connection), the antenna/sky temperature assumption error, and the uncertainty in the measured noise temperature (due to mismatches as result of breaking the connection).  Neglecting products of error terms and linearizing, Equation A-20 becomes",
    "A A , , G f G G f T T T T f T ( ) ( ) ( ) A A R R ITP , G f G A A T f T T ( ) ( ) IN A R A  (Equation A-21)  , , ( ) A A i ( ) ( ) R A IN G 1 G f G f T T T f 1 T f ( ) IN , A A R A i , G f T T G 1 T f T f T f G f ( ) ( ) ( ) ( ) ( ) IN IN IN A ⎛ ⎞ θ + δ ⎛ ⎞ θ = ⎜ ⎟ ⎜ ⎟ ⎜ ⎟ −δ + + δ ⎝ ⎠ ⎝ ⎠ ⎛ ⎞ θ + δ = ⎜ ⎟ ⎜ ⎟ −δ + δ ⎝ ⎠ δ ⎛ ⎞ + ⎜ ⎟ ⎛ ⎞ θ θ ⎜ ⎟ = ⎜ ⎟ ⎜ ⎟ δ −δ ⎜ ⎟ ⎝ ⎠ + ⎜ ⎟ ⎝ ⎠ ⎛ ⎞⎛ ⎞ θ δ δ δ ≈ + − + ⎜ ⎟⎜ ⎟ ⎜ ⎟⎜ ⎟ θ ⎝ ⎠⎝ ⎠",
    "Once compensation is applied to account for the estimation errors, the procedure to verify specification compliance is the same as described in Section A.1.3.  If TA is assumed to be 100K, δΔTA can be set to zero.  However, the other errors are due to breaking the signal path and can not be set to zero.  One source for a description of those error sources is Agilent Application Note 57-2 [Ref. A-2].",
    "## A.3 Receiver System Test Application Of Total Transducer Gain And G/T Ratio\n\nThe following sections describe how the total transducer gain parameter (Sec. A.1.1) and the minimum GA/TIN ratio parameter (Sec. A.1.2) enable the calculation of receiver input GNSS signal level, thermal noise and interference densities when an active antenna unit is used. \n\n## A.3.1 General Gnss Receiver System Test Set-Up Considerations",
    "The general receiver system installed configuration can be diagramed as shown below",
    "(Figure A-3).  The active antenna is connected through an RF coaxial cable to the GNSS receiver.  The receiver supplies DC bias for the active antenna through the cable and processes the GNSS signals output from the active antenna. Signal, noise, and RFI levels in the GNSS receiver MOPS are all defined relative to Point A.  For better control and repeatability, GNSS receiver performance tests are typically run by simulating effect of the active antenna on the signal, noise and RF interference",
    "typically run by simulating effect of the active antenna on the signal, noise and RF interference conditions at Point C.  The key parameters in this active antenna MOPS give relative antenna pattern gain ratio (equivalent to passive antenna gain) and G/T ratio (essentially the signal-to-thermal noise ratio) all referenced to Point A.  In addition the active antenna MOPS specifies a minimum passive antenna element gain (5º elevation), GA,min for the unit and a minimum active sub-assembly gain,",
    "antenna element gain (5º elevation), GA,min for the unit and a minimum active sub-assembly gain, GR.",
    "The only additional parameters needed to complete the necessary transformation of the Receiver MOPS requirements referenced to Point A to test values at Point C is the RF \ncable insertion loss.  Antenna-to-receiver cable insertion loss is actually dependent on aircraft installation details.  However, guidance on the cable loss from ARINC \nCharacteristic 743A [Ref. A-3] suggests that 13 dB loss is appropriate assumption.",
    "## A.3.2 Transformation Of Antenna Input Signal And Noise Levels To Receiver Input Values\n\nThe minimum passive element gain at 5º elevation is used as follows to find the antenna input noise temperature at center frequency (fC) from the minimum mid-band G/T ratio . \n\nSince the minimum passive element gain at 5º elevation, GA(φ,85º,fc) is -5.5 dBic, the 5º \nelevation minimum G/T ratio, [GA(φ,85º,fc)/ TIN(fc)], is -31.6 dB/K and",
    "$\\mathrm{T_{IN}}\\left(\\mathrm{f_{c}}\\right)=\\mathrm{G_{A}}\\left(\\phi,85^{\\circ},\\mathrm{f_{c}}\\right)\\left(\\frac{\\mathrm{T_{IN}}\\left(\\mathrm{f_{c}}\\right)}{\\mathrm{G_{A}}\\left(\\phi,85^{\\circ},\\mathrm{f_{c}}\\right)}\\right)$ (Equation A-22)\nthen TIN(fc**)=26.1 dB-K (=407 K)**.  The input thermal noise density at Point A, NIN(fC) = \nkTIN(fC) = **-172.5 dBm/Hz** (also known as NSKY,ANTENNA in DO-229D)",
    "kTIN(fC) = **-172.5 dBm/Hz** (also known as NSKY,ANTENNA in DO-229D) \nThe minimum Earth-surface GPS L1 C/A signal level at 5 degrees elevation is specified to be -128.5 dBm (from a 0 dBic antenna).  At Point A the minimum received signal, SMIN, is -128.5 dBm - 5.5 dBic = **-134.0 dBm**.",
    "When translated to Point C, the minimum satellite signal is: -128.5 dBm + GA(φ,85º,fc) \n(in dBic) + GR(fc) (in dB) - 13 dB (cable loss). Thus the GPS signal is **-120.5 dBm** \n(= -134 +26.5-13).  The RFI densities are already referenced to Point A so they are just increased by the net active amplifier gain and cable loss (= 13.5 dB). \n\nThe input thermal noise temperature, TIN(fc) is translated to the cable output Point C by",
    "$$\\mathrm{T_{OUT}\\left(f_{c}\\right)}=\\frac{\\mathrm{T_{IN}\\left(f_{c}\\right)\\cdot G_{R}\\left(f_{c}\\right)}}{\\mathrm{L_{Cab}\\left(f_{c}\\right)}}+\\mathrm{T_{Cab}\\cdot}\\left(1-\\frac{1}{\\mathrm{L_{Cab}\\left(f_{c}\\right)}}\\right)$$ (Equation A-23)\nwhere TCab is the cable temperature (~300 K) and LCab is the assumed cable loss factor \n(1013/10).  Using the parameter determined above, the equivalent thermal noise temperature at Point C, TOUT becomes 11,770 K and the thermal noise density (kTOUT)",
    "is **-157.9 dBm/Hz**.  This value does not include the receiver unit input noise temperature; \nthe receiver unit-under-test contributes that value itself.",
    "## A.4 References\n\n[A-1] \nJanda, R., *et al*, \"Linking Microwave Remote Sensing Measurements to \nFundamental Noise Standards\" (antenna temperature theory and measurement) \n<http://www.boulder.nist.gov/div818/81801/Noise/publications/04_StdRad_CPE\nM.pdf> \n[A-2] \n\"Noise Figure Measurement Accuracy - the Y-Factor Method,\" Agilent \nApplication Note 57-2, Agilent Technologies, Inc., Literature # 5952-3706 (see \nalso AN 57-1 and AN 57-3) \n[A-3] \nARINC CHARACTERISTIC 743A-4, December 27, 2001",
    "--``,,,,,,,,,``````,`,,``,,,,`,,-`-`,,`,,`,`,,`---"
  ]
}