{
  "source": "RTCA DO-210D CHG 4 2015-03 12P.md",
  "chunks": [
    "RTCA, Inc. \n\n1150 18th Street, NW, Suite 910 \nWashington D.C. 20036 \n\n# Minimum Operational Performance Standards For Geosynchronous Orbit Aeronautical Mobile Satellite Services (Amss) Avionics\n\n \n\n# Change 4\n\n \n(RTCA Paper No. 014-15/SC222-36) RTCA DO-210D Change 4  \nPrepared by : SC-222 \nMarch 24, 2015 \nCopies of this document may be obtained from RTCA, Inc.",
    "1150 18th St., NW, Suite 910 \nWashington, DC 20036 USA \n \nTelephone:  202-833-9339 \nFacsimile:  202-833-9434 \nInternet:  www.rtca.org Please call RTCA for price and ordering information. \n\n \n\n## Foreword",
    "This document was prepared by Special Committee 222 (SC-222) and was approved by the RTCA \nProgram Management Committee (PMC) on March 24, 2015. RTCA, Incorporated is a not-for-profit corporation formed to advance the art and science of aviation and aviation electronic systems for the benefit of the public.  The organization functions as a Federal Advisory Committee and develops consensus-based recommendations on contemporary aviation issues.",
    "RTCA's objectives include but are not limited to:",
    "- \ncoalescing aviation system user and provider technical requirements in a manner that helps \ngovernment and industry meet their mutual objectives and responsibilities; \n- \nanalyzing and recommending solutions to the system technical issues that aviation faces as it continues to pursue increased safety, system capacity and efficiency; \n-",
    "- \ndeveloping consensus on the application of pertinent technology to fulfill user and provider requirements, including development of minimum operational performance standards for electronic systems and equipment that support aviation; and \n- \nassisting in developing the appropriate technical material upon which positions for the International Civil Aviation Organization and the International Telecommunications Union  and other appropriate international organizations can be based.",
    "The organization's recommendations are often used as the basis for government and private sector decisions as well as the foundation for many Federal Aviation Administration Technical Standard Orders. Since RTCA is not an official agency of the United States Government, its recommendations may not be regarded as statements of official government policy unless so enunciated by the U.S. government organization or agency having statutory jurisdiction over any matters to which the recommendations",
    "organization or agency having statutory jurisdiction over any matters to which the recommendations relate.",
    "This Page Intentionally Left Blank \n\n## Change 4 To Do-210D.",
    "[Editorial Note, not for inclusion in the FRAC document. The changes suggested in item 1 of SC222/WP152 have been withdrawn, subject to discussion at the January 22, 2015 plenary meeting of SC-222.  The items below have been renumbered to be sequential starting at 1]",
    "1. On page 19 of DO-210D, insert the following new paragraphs before 2.2.2.1.  The new paragraph is numbered 2.2.2.0 *et seq*. to avoid the necessity of renumbering subsequent paragraphs and crossreferences.  The purpose of these new paragraphs is to bring DO-210D into alignment with the equivalent requirements of 2.2.3.1.1 in Appendix E of DO-262B.",
    "2.2.2.0   Satellite Operator and Service Provider Type Approval.",
    "In addition to any other requirements stated in this document and associated changes, any complete AES design seeking to demonstrate compliance with this MOPS shall achieve satellite operator Type Approval as evidenced by a Type Approval Certificate issued by the satellite operator.  Furthermore, the AES design shall be approved, in writing, by a relevant Communications Network Provider as being fit for use on their network (e.g. ARINC AQP or SITA VAQ Testing).",
    "2.2.2.0.1 Separately Approved Antenna Systems In addition to any other requirements stated in this document and associated changes, any intermediate gain antenna (IGA) design or high gain antenna (HGA) design seeking to demonstrate compliance with the relevant portions of this MOPS shall achieve a successful satellite operator Type Approval as evidenced by a Type Assessment Letter issued by the satellite operator.  In addition, such an antenna design shall achieve a satellite operator Type",
    "satellite operator.  In addition, such an antenna design shall achieve a satellite operator Type Approval as an element of a complete AES system, as evidenced by a Type Approval for such a system.",
    "2.2.2.0.2 Separately Approved Transceiver Systems In addition to any other requirements stated in this document and associated changes, any transceiver design seeking to demonstrate compliance with the relevant portions of this MOPS shall achieve a successful satellite operator Type Approval as evidenced by a Type Assessment Letter issued by the satellite operator.  In addition, such a transceiver design shall achieve a satellite operator Type Approval as an element of a complete AES system, as",
    "design shall achieve a satellite operator Type Approval as an element of a complete AES system, as evidenced by a Type Approval for such a system.",
    "2.  [Editorial Note: The new table is designated Table 2-15.A to avoid renumbering subsequent tables.] \n \nOn page 90 of DO-210D, immediately before paragraph 2.4.1, add the following text and new Table 2-\n15.A: Paragraph 2.2.2.0 of this document requires satellite operator Type Approval of any AES equipment seeking approval under this MOPS.  Therefore, in order to streamline testing of the unit(s), Table 2-15.A",
    "indicates equivalent Inmarsat test procedures that may be substituted for the detailed test conditions and procedures defined in subsequent paragraphs.",
    "--```,,`,`,,,`,,``,,`,,,,,`,```,-`-`,,`,,`,`,,`--- 3.  The following changes to the environmental testing tables make DO-210D consistent with similar tables in the system-specific material of DO-262B.  To implement this change, replace the receiver and transmitter sections of Table 2-15 of DO-210D with the following replacement tables.",
    "TABLE 2-15.  PERFORMANCE VERSUS TEST REQUIREMENT MATRIX (continued) \n \nb. Receiver Subsystem                                                    RTCA/DO-160C SECTION \n \nSection \nFunction \n4 \n5 \n6 \n7 \n8 \n15 \n16 \n17 \n18 \n19 \n20 \n21 \n22 \n2.2.4.1.2 \nReceiver Sensitivity \nX \n- \nX \n- \nX \n- \nX \n- \n- \n- \nX \n- \n(22) \n2.2.4.1.3 \nImage and Spur. Response Rejection \n- \n- \n- \n- \n- \n- \n- \n- \n- \n- \n- \n- \n- \n2.2.4.1.4 \nRej. of Signal Outside Rcv Band \n- \n- \n- \n- \n- \n- \n- \n- \n- \n- \n- \n- \n- \n2.2.4.1.5",
    "- \n- \n2.2.4.1.4 \nRej. of Signal Outside Rcv Band \n- \n- \n- \n- \n- \n- \n- \n- \n- \n- \n- \n- \n- \n2.2.4.1.5 \nReceiver Linearity \n- \n- \n- \n- \n- \n- \n- \n- \n- \n- \n- \n- \n- \n2.2.4.1.6 \nDesired Signal Dynamic Range \nX \n- \n- \n- \n- \n- \n- \n- \n- \n- \n- \n- \n- \n2.2.4.1.7.1 \nTuning Range and Chnl Increments \nX \n- \nX \n- \n- \n- \n- \n- \nX \nX \nX \n- \n- \n2.2.4.1.7.2 \nChannel Numbering \n- \n- \n- \n- \n- \n- \n- \n- \n- \n- \n- \n- \n- \n2.2.4.1.8 \nCapture Range \n- \n- \n- \n- \n- \n- \n- \n- \n- \n- \n- \n- \n- \n2.2.4.1.9 \nDoppler Rate \n- \n- \n- \n-",
    "Capture Range \n- \n- \n- \n- \n- \n- \n- \n- \n- \n- \n- \n- \n- \n2.2.4.1.9 \nDoppler Rate \n- \n- \n- \n- \n- \n- \n- \n- \n- \n- \n- \n- \n- \n2.2.4.1.11.1 \nBER Performance (P- Channel) \n- \n- \n- \n- \n- \n- \n- \n- \n- \n- \n- \n- \n- \n2.2.4.1.11.2 \nTime to Acquire Superframe Lock \n- \n- \n- \n- \n- \n- \n- \n- \n- \n- \n- \n- \n- \n2.2.4.1.12.1 \nBER Requirements (C- Channel) \n- \n- \n- \n- \n- \n- \n- \n- \n- \n- \n- \n- \n- \n2.2.4.1.12.2 \nBit Timing Recovery \n- \n- \n- \n- \n- \n- \n- \n- \n- \n- \n- \n- \n- \n2.2.4.1.12.3 \nFrame Lock Acquisition Probability \n-",
    "- \n- \n- \n- \n- \n- \n- \n- \n- \n- \n- \n- \n- \n2.2.4.1.12.3 \nFrame Lock Acquisition Probability \n- \n- \n- \n- \n- \n- \n- \n- \n- \n- \n- \n- \n- \n2.2.4.1.12.4 \nMaintaining Bit Synchronization \n- \n- \n- \n- \n- \n- \n- \n- \n- \n- \n- \n- \n- \n2.2.4.1.12.5 \nChannel BER Measure. Accuracy \n- \n- \n- \n- \n- \n- \n- \n- \n- \n- \n- \n- \n- \nc. Transmitter Subsystem, RTCA/DO-160C SECTION \n \nSection \nFunction \n4 \n5 \n6 \n7 \n8 \n15 \n16 \n17 \n18 \n19 \n20 \n21 \n22 \n2.2.4.2.1 \nChannel Rates and Tolerances \n(18) \n- \n- \n- \n- \n- \n- \n- \n- \n- \n- \n- \n-",
    "19 \n20 \n21 \n22 \n2.2.4.2.1 \nChannel Rates and Tolerances \n(18) \n- \n- \n- \n- \n- \n- \n- \n- \n- \n- \n- \n- \n2.2.4.2.2 \nOutput Power \nX \n- \nX \n- \n- \nX \nX \n(20) \nX \nX \nX \n- \n(22) \n2.2.4.2.3 \nOutput Power Adjustment \nX \n- \n- \n- \n- \n- \n- \n- \n- \n- \n- \n- \n- \n2.2.4.2.4 \nOutput Power Stability \nX \nX \n- \n- \n- \n- \nX \n- \n- \n- \n- \n- \n- \n2.2.4.2.5 \nHarmonics Spurious and Noise Density \n(18) \n- \n- \n- \nX \n- \n- \n- \n- \n- \n- \n- \n- \n2.2.4.2.6 \nIntermodulation Products \n(18) \n- \n- \n- \n- \n- \n- \n- \n- \n- \n- \n- \n- \n2.2.4.2.7",
    "- \n- \n- \n2.2.4.2.6 \nIntermodulation Products \n(18) \n- \n- \n- \n- \n- \n- \n- \n- \n- \n- \n- \n- \n2.2.4.2.7 \nCarrier Off Level \nX \n- \n- \n- \n- \n- \n- \n- \n- \n- \n- \n- \n(22) \n2.2.4.2.8 \nTransmitter/ Channel Muting \n- \n- \n- \n- \n- \n- \n- \n- \n- \n- \n- \n- \n- \n2.2.4.2.9 \nLoad VSWR Capability",
    "--```,,`,`,,,`,,``,,`,,,,,`,```,-`-`,,`,,`,`,,`---\n2.2.4.2.10.1 \nTuning Range and Channel Increments \n(18) \n- \n- \n- \n- \n- \n- \n- \n- \n- \n- \n- \n- \n2.2.4.2.10.2 \nChannel Numbering \n(18) \nX \n- \n- \nX \n- \n- \n- \n- \n- \n- \n- \n- \n2.2.4.2.11 \nTuning Stabilization Time \n- \n- \n- \n- \n- \n- \n- \n- \n- \n- \n- \n- \n- \n2.2.4.2.12 \nPhase Noise \n- \n- \n- \n- \n- \n- \n- \n- \n- \n- \n- \n- \n- \n2.2.4.2.13 \nFrequency Accuracy \n(18) \n- \nX \n- \nX \n- \n(20) \n- \nX \n- \n- \n- \n(22) \n2.2.4.2.14 \nDoppler Correction \n(18) \nX \nX \nX \n- \n- \nX",
    "- \nX \n- \nX \n- \n(20) \n- \nX \n- \n- \n- \n(22) \n2.2.4.2.14 \nDoppler Correction \n(18) \nX \nX \nX \n- \n- \nX \n- \n- \n- \n- \n- \n- \n2.2.4.2.15 \nDoppler Rate Capability \n(18) \n- \nX \n- \nX \n- \nX \n- \n- \n- \n- \n- \n- \n2.2.4.2.16 \nSignal Spectrum \n- \n- \n- \n- \n- \n- \n- \n- \n- \n- \n- \n- \n- \n2.2.4.2.17.1 \nPulse-Shaping Filtr Resp(R/T Ch) \n- \n- \n- \n- \n- \n- \n- \n- \n- \n- \n- \n- \n- \n2.2.4.2.18.1 \nPulse-Shaping Filtr Resp (C-Ch)\" \n- \n- \n- \n- \n- \n- \n- \n- \n- \n- \n- \n- \n-",
    "--```,,`,`,,,`,,``,,`,,,,,`,```,-`-`,,`,,`,`,,`--- In addition, insert the following new note after the modified Table 2-15:",
    "22. Not required for systems certified to Design Assurance Level D. For systems certified to Design Assurance Level C or higher, equipment is not required to meet performance specifications during the period of application of the Lightning Induced Transient test, but must meet all requirements following the test (Ref AC 20-136B) 4.   Replace the text of 2.2.3.13 with the following text.  This change modifies the signal levels, but no other aspect of the DO-210D specification.  The signal levels",
    "modifies the signal levels, but no other aspect of the DO-210D specification.  The signal levels are in alignment with DO-262B. 2.2.3.13 Radiated Antenna Intermodulation Products For multi-carrier operation, when operating with two unmodulated carriers anywhere within the transmit frequency band specified in Section 2.2.3.1.1 and each having half the maximum multi-carrier average RF",
    "power rating of the antenna, the antenna subsystem shall not radiate internally- generated intermodulation products in a direction toward a likely location(s) of a GNSS antenna(s) on the same aircraft so as to cause a power level exceeding -128.5 dBm for any discrete seventh- and higher-order product in the frequency range of 1565-1585 MHz, or power level exceeding -127 dBm for any discrete seventh- and higher-order product in the frequency range of 1585-1605 MHz. In all cases, the power level",
    "and higher-order product in the frequency range of 1585-1605 MHz. In all cases, the power level is referenced to the GNSS antenna port, where the GNSS antenna is taken to be a quarter-wave monopole antenna matched to its load, and the isolation between the AES antenna port and the GNSS antenna port is taken to be 40 dB. NOTE: The term \"maximum multicarrier average RF power rating\" is defined as the maximum multicarrier average RF power for which the AES antenna subsystem is qualified to all",
    "the maximum multicarrier average RF power for which the AES antenna subsystem is qualified to all other requirements in this document.",
    "5.  Clarification of tables associated with 2.2.4.2.5.1 and 2.2.4.2.5.2 of Change 3 to DO-210D In Change 3, Section 2.2.4.2.5.1, re-establish Table Note 1 as follows \"1. In the frequency bands from 1559 to 1605 MHz, the indicated Power Density includes the standard 40",
    "dB isolation between the transceiver antenna port and the victim antenna (GPS or other GNSS) output port.  For example, the -155 dBc/MHz given above would be 40 dB higher (-115 dBc/MHz) if measured at the transceiver antenna port.\" This note will apply to Change 3 Section 2.2.4.2.5.2 as well, as indicated by the existing *NOTE* following that paragraph. 6.  Clarification of tables associated with 2.2.4.2.6.2 and 2.2.4.2.6.3 of Change 3 to DO-210D In Change 3, Section 2.2.4.2.6.2, re-establish",
    "2.2.4.2.6.2 and 2.2.4.2.6.3 of Change 3 to DO-210D In Change 3, Section 2.2.4.2.6.2, re-establish Table Note 1 as follows \"1. In the frequency bands from 1559 to 1605 MHz, the indicated level includes the standard 40 dB",
    "isolation between the transceiver antenna port and the victim antenna (GPS or other GNSS) output port.  \nFor example, the -135 dBc given above would be 40 dB higher (-95 dBc) if measured at the transceiver antenna port.\" This note will apply to Change 3 2.2.4.2.6.3 as well, as indicated by the existing *NOTE* following that paragraph. 7.  Replace DO-210D 2.2.4.2.16 in its entirety by the following text:",
    "\"While transmitting a single modulated signal at the rated output power of the transmitter, the transmitted signal power spectrum levels at the transmitter output terminal shall be no greater than the values shown in Figure 2-0A (8.4kbps channel) and Figure 2-0 (all other channels). The breakpoints in Figure 2-0 are:",
    "| Frequency Offset     | Spectrum Level     |\n|----------------------|--------------------|\n| ±                    |                    |\n| 0.75 x SR            |                    |\n| ±                    |                    |\n| 1.40 x SR            |                    |\n| ±                    |                    |\n| 2.80 x SR            |                    |\n| greater of           |                    |\n| ±                    |                    |",
    "| greater of           |                    |\n| ±                    |                    |\n| 4 x SR and           |                    |\n| ±                    |                    |\n| 35 kHz               | - 40 dBe           |",
    "where: SR = Symbol Rate SR = 1 x Channel rate for A-BPSK SR = 1/2 x Channel rate for A-QPSK The breakpoints in Figure 2-0A are:",
    "|          |    | Frequency Offset     | Spectrum Level     |\n|----------|----|----------------------|--------------------|\n| ±2.6kHz  |    |                      | 0 dBe              |\n| ±3.5kHz  |    |                      | - 13 dBe           |\n| ±5.3kHz  |    |                      | - 23 dBe           |\n| ±7.1kHz  |    |                      | - 23 dBe           |\n| ±12.3kHz |    |                      | - 40 dBe           |\n| ±35kHz   |    |                      | - 40 dBe           |",
    "For frequencies within ±35 kHz or 4 x SR of the designated channel, the measurement resolution bandwidth should be approximately 0.1 x SR. The envelope level listed in the table is the relative amplitude as measured in the resolution bandwidth as a function of the frequency offset from the carrier frequency. The maximum level, which is the reference for the dBe criteria, will occur at the carrier frequency. In the frequency band from +/-35 kHz or 4 x SR until +/-100 kHz from the designated",
    "frequency. In the frequency band from +/-35 kHz or 4 x SR until +/-100 kHz from the designated channel, the emissions level shall be less than -55 dBc/4 kHz.  Compliance with this requirement shall be measured using the techniques of 2.2.4.2.5.1 and 2.2.4.2.5.2. Beyond +/-100 kHz from the designated channel, the emissions shall meet the requirements of 2.2.4.2.5.1 and 2.2.4.2.5.2.\"",
    "8. Add the following text at the beginning of 2.4.8 \"The manufacturer may propose an alternate test method.  Any such alternate test method shall demonstrate both the correct implementation of the vocoding algorithm and the performance of the analog circuitry.   \nNote: An example of a suitable method of demonstrating the performance of the analog circuitry may be found in RTCA DO-262B Appendix E.\" \n9. In Change 3, Section 2.2.4.2.5.1; modify TABLE NOTE 2 to read as follows",
    "2. Within the transmit band, excluding the frequency band within\n of the carrier, where \nthe requirements of 2.2.4.2.16 apply."
  ]
}