{
  "source": "RTCA DO-207 1991.md",
  "chunks": [
    "RTCA, Inc. \n\n1425 K St. NW, Suite 500 \nWashington, DC  20005 USA \n\n# Minimum Operational Performance Standards (Mops) For Devices That Prevent Blocked Channels Used In Two-Way Radio Communications Due To Unintentional Transmissions\n\nCopies of this document may be obtained from RTCA, Inc.",
    "Copies of this document may be obtained from RTCA, Inc. \n\nTelephone: 202-833-9339 \nFacsimile: 202-833-9434 \nInternet: www.rtca.org Please visit the RTCA Online Store for document pricing and ordering information.  \nThis document was prepared by Special Committee 163 of the Radio Technical Commission for Aeronautics. \n\nIt was approved by the RTCA \nExecutive Committee on January 25, 1991.",
    "It was approved by the RTCA \nExecutive Committee on January 25, 1991. \n\nRTCA is an association of aeronautical organizations of the United States from both government and industry. Dedicated to the ~vancement of aeronautics, RTCA seeks sound technical solutions to problems involving the application of electronics and telecommunications to aeronautical operations. \n\nIts objective is the resolution of such problems by mutual agreement of its member organizations.",
    "Its objective is the resolution of such problems by mutual agreement of its member organizations. \n\nThe findings of RTCA are in the nature of recommendations to all organizations concerned. Since RTCA is not an official agency of the United States Government, its recommendations may not be regarded as statements of official government policy unless so enunciated by the U. S. government organization or agency having statutory jurisdiction over any matters to which the recommendations relate.",
    "Coordination of these standards was accomplished by RTCA SC-163 \nwith the European Organisation for Civil Aviation Equipment (EUROCAE) \nWG-38.",
    "PURPOSE AND SCOPE ................................................. \n. \n1 \n1.0 \nIntroduction ........................ . ........................... \n. \nSystem Overview \n............................................... \n. \nOperational Application ........................................... \n. \nOperational Goals ............................................... \n. \nAssumptions ......... . ......................................... \n. \n1 \n1 \n2 \n2 2 \n1.1 \n1.2 \n1.3 \n1.4 \n1.5 \n1.5.1",
    ". \n1 \n1 \n2 \n2 2 \n1.1 \n1.2 \n1.3 \n1.4 \n1.5 \n1.5.1 \nUnintentional Continuous Transmissions ........................... \n2 \n1.5.1.1 Stuck Microphone PTT Switches .......................... \n2 \n1.5.1.2 Loose Microphone Jacks ................................ \n2 \n1.5.1.3 PTT Line Activation by Other Causes. . . . . . . . . . . . . . . . . . . . . . . \n3 \n1.5.1.4 Unkeyed Continuous Transmissions ........................ \n3 \n1.6 \nTest Procedures \n3 \nDefinitions of Terms \n4 \n1.7 \n2.0",
    "3 \n1.6 \nTest Procedures \n3 \nDefinitions of Terms \n4 \n1.7 \n2.0 \nEQUIPMENT PERFORMANCE REQUIREMENTS AND TEST PROCEDURES ......... \n. \n5 \n2.1 \nGeneral Requirements ............................................. \n. \n5 \n2.1.1 2.1.2 \n2.1.3 2.1.4 2.1.5 2.1.6 2.1.7 \nAirworthiness ............................................ \n. \nIntended Function .......................................... \n. \nFederal Communications Commission Rules ....................... \n.",
    ". \nFederal Communications Commission Rules ....................... \n. \nFire Protection .......................................... . . . \nOperation of Controls ....................................... \n. \nAccessibility of Controls ..................................... \n. \nEffects of Test ................................ . . . ......... \n. \n5 \n5 5 \n5 \n5 \n5 5 \nEquipment Performance - Standard Conditions ........................... \n. \n7 \n2.2 \n2.2.1 \n2.2.2 \n2.2.3",
    ". \n7 \n2.2 \n2.2.1 \n2.2.2 \n2.2.3 \nAutomatic Termination of Transmissions .......................... \n. \nResetting of Transmission Timer ................................ \n. \nBypass Switch ............................................ \n. \n7 \n7 \n7 \n2.3 \nEquipment Performance - Environmental Conditions ........................ \n. \n9 \n2.3.1 \nTemperature and Altitude Tests ................................. \n9 \n2.3.1.1 Ground Survival Low Temperature Test and Operating Low",
    "9 \n2.3.1.1 Ground Survival Low Temperature Test and Operating Low \nTemperature Test ..................................... \n9 \n2.3.1.2 Ground Survival High Temperature Test and Shon-Time Operating \nHigh Temperature Test ................................. \n9 \n2.3.1.3 Operating High Temperature Test ......................... \n9 \n2.3.1.4 In-Flight Loss of Cooling Test ........................... \n10 \n2.3.1.5 Altitude Test ........................................ \n10",
    "--``,`,,`,`,`,,```,`,,,```,`,,,-`-`,,`,,`,`,,`---",
    "2.3.1.6 Decompression Test ................................... \n10 \n2.3.1.7 Overpressure Test .................................... \n10 \nTemperature Variation Test .. . ................................ \n. \nHumidity Test ............................................ \n. \nOperational Shocks and Crash Safety Tests .. . ..................... \n. \n10 \n10 \n10 \n2.3.2 \n2.3.3 2.3.4 \n2.3.4.1 Operational Shocks ................................... \n10",
    "10 \n10 \n10 \n2.3.2 \n2.3.3 2.3.4 \n2.3.4.1 Operational Shocks ................................... \n10 \n2.3.4.2 Crash Safety ........................................ \n11 \nVibration Tests ........................................... \n. \nExplosion Proofness Test' .................................... \n. \nWaterproofness Tests .•....................................... \n11 \n11 \n11 \n2.3.5 \n2.3.6 \n2.3.7 \n2.3.7.1 Drip Proof Test ...................................... \n11",
    "11 \n11 \n2.3.5 \n2.3.6 \n2.3.7 \n2.3.7.1 Drip Proof Test ...................................... \n11 \n2.3.7.2 Spray Proof Test. . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . \n11 \n2.3.7.3 Continuous Stream Proof Test ............................ \n11 \n2.3.8 \nFluids Susceptibility Tests ..................................... \n12 \n2.3.8.1 Spray Test. . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . \n12",
    "12 \n2.3.8.2 Immersion Test. . . . . . . . - . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . \n12 \nSand and Dust Test ........................................ \n. \nFungus Resistance Test ...................................... \n. \nSalt Spray Test . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . .. \nMagnetic Effect Test ....................................... \n. \nPower Input Tests ......................................... \n. \n2.3.9",
    ". \nPower Input Tests ......................................... \n. \n2.3.9 \n2.3.10 2.3.11 2.3.12 2.3.13 \n12 \n12 \n12 \n13 \n13 \n2.3.13.1 Normal Operating Conditions ............................ \n13 \n2.3.13.2 Abnormal Operating Conditions .......................... \n13 \n2.3.14 \nVoltage Spike Tests ......................................... \n13 \n2.3.14.1 Category 'A' Requirements. . . . . . . . . . . . . . . . . . . . . . . . . - . . . . \n13",
    "2.3.14.1 Category 'A' Requirements. . . . . . . . . . . . . . . . . . . . . . . . . - . . . . \n13 \n2.3.14.2 Category 'B' Requirements. . . . . . . . . . . . . . . . . . . . . . . . . . . . . . \n13 \n2.3.15 \nAudio Frequency Conducted Susceptibility Test. . . . . . . . . . . . . . . . . . . . . - \n14 \n2.3.16 Induced Signal Susceptibility Test ........................•...... \n14 \n2.3.17 Radio Frequency Susceptibility Test (Radiated and Conducted) ........... \n14 \n2.3.18",
    "14 \n2.3.17 Radio Frequency Susceptibility Test (Radiated and Conducted) ........... \n14 \n2.3.18 \nEmission of Radio Frequency Energy Test. . . . . . . . . . . . . . . . . . . . . . . . . . \n14 \n2.3.19 Lighbling Induced Transient SusceptIbility Test ............ ,......... \n14 \n2.3.20 Lighbling Direct Effects Test ..... . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . \n14 \n2.3.21",
    "14 \n2.3.21 \nIcing Test. . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . \n14 \n2.4 \nEquipment Test Procedures ......................................... \n. \n15 \n2.4.1 \nDefmitions of Terms and Conditions of Test ........................ \nIS \n2.4.2 \nDetailed Test Procedures .......................•........••.... \n16",
    "--``,`,,`,`,`,,```,`,,,```,`,,,-`-`,,`,,`,`,,`---\n\n## Purpose And Scope 1.0 Introduction 1.1\n\nThis document sets forth minimum operational perfonnance standards for systems that prevent blocked frequencies used in air traffic control (ATC) two-way radio communications due to unintentional transmissions. Incorporated within these standards are system characteristics that should be beneficial to users of the systems as well as to designers, manufacturers and installers.",
    "Compliance with these standards is recommended as a means of assuring that the equipment will perform its intended function(s) satisfactorily under all conditions nonnaRy encountered in routine operations. Any regulatory application of this document is the sole responsibility of appropriate government agencies.",
    "Because the measured values of equipment perfonnance characteristics may be a function of the measurement method, standard test conditions and methods of test are recommended in this documenL",
    "This document considers an equipment configuration to consist of: transmitter, receiver, power supply, microphone, control panels, antenna, interconnecting cables and related accessories. It should not be inferred that all equipment will necessarily include all of the foregoing components as separate units.",
    "This will depend on the specific design configuration chosen by the manufacturer. Additional functions and components that may refer to expanded equipment capabilities that exceed the stated minimum requirements are identified as optional features. \n\nEquipment features that are beyond the scope of this document may be developed in future RTCA \nactivities.",
    "If the equipment implementation includes a computer software package, the guidelines contained in RTCNDO-178A, Software Considerations in Airborne Systems and Equipment Certification, shall be considered. \n\n## 1.2 System Overview",
    "## 1.2 System Overview\n\nThe aviation communications system includes ground-based and airborne recelvmg and transmitting equipment that provides air-to-ground, ground-to-air, air-to-air and ground-to-ground voice and data communications. The equipment addressed in this document provides the means for reducing unintentional transmissions that adversely affect two-way voice radio communications.",
    "Disruption to voice communications in the ATC system presents the potential for degrading flight safety. Although these communication disruptions may occur in areas where traffic density is low, the growth of air traffic (and communications) has increased the number of disruption incidents.",
    "The FAA concluded, as early as 1968, that the occurrence of communication disruptions presented serious problems, e.g., the loss of separation standards between aircraft, near mid-air collisions, delays and potentially disastrous disruptions of traffic flow. \n\nVarious educational programs and advisory material issued by the FAA have not reduced the problem.",
    "In fact, subsequent surveys have indicated that the problem has intensified. In 1984, the FAA was petitioned to enact rulemaking requiring two-way radio communication systems employing anti-blocking and stuck microphone protection circuitry. \n\nThe FAA \nsubsequently published the petition for rulemaking for public comment. The majority of responses to the petition for rulemaking were favorable.",
    "--``,`,,`,`,`,,```,`,,,```,`,,,-`-`,,`,,`,`,,`---\nBecause an industry standard for such devices was not available, the FAA deferred further action on the petition for rulemaking and requested that the Radio Technical Commission for Aeronautics \n(RTCA) Executive Committee establish a Special Committee to develop appropriate guidance and equipment standards.",
    "As a result of the FAA's request, the RTCA Executive Committee established Special Committee \n163 to develop design criteria and guidance infonnation pertaining to unintentional or simultaneous transmissions that adversely affect two-way radio communications, and to develop minimum operational perfonnance standards (MOPS) for devices that minimize unintentional and/or simultaneous transmissions. This MOPS only addresses unintentional transmissions.",
    "Unintentional transmissions may be caused by a jammed microphone push-to-talk (P'IT) button or by equipment malfunction that results in a continuous transmission from the associated transmitter. This problem is often referred to as the \"stuck-mike\" problem. \n\n## Operational Application 1.3",
    "## Operational Application 1.3\n\nThis specification is applicable to ground-based, ground mobile and airborne two-way UHF and VHF radio voice communications equipment used for control of air traffic. These standards apply to three different methods of incorporation: retrofit, modification and new designs. \n\n## Operational Goals 1.4",
    "## Operational Goals 1.4\n\nThese devices are intended to minimize communication disruptions caused by unintentional transmissions that are detrimental to the safety and efficiency of flight operations. Equipment designers, manufacturers and installers are encouraged to provide indications or annunciations to the pilot of transmitter operation, or of impending or existing actions by the'equipment to inhibit transmitter operation. \n\n## Assumptions 1.5 Unintentional Continuous Transmissions 1.5.1",
    "## Assumptions 1.5 Unintentional Continuous Transmissions 1.5.1\n\nTransmissions of an unreasonable duration are considered detrimental, for the purpose of this specification, and must be tenninated and may be annunciated. Unintentional continuous radio frequency transmissions that cause frequency blocking can be produced by the following conditions: \n\n## Stuck Microphone Ptt Switches 1.5.1.1",
    "## Stuck Microphone Ptt Switches 1.5.1.1\n\nStuck microphone PTT switches are the most common causes of frequency blocking in the category of unintentional continuous transmissions. These conditions are of too caused by improper microphone stowage provisions and techniques or by a defective microphone P1T \nswitch, the contacts of which will not properly open when the button is released. \n\n## Loose Microphone Jacks 1.5.1.2",
    "A malfunction that provides a low resistance between a P1T line and airplane ground is a frequent cause of unintentional transmitter keying. Although unmodulated, the emitted radio frequency can cause blocking of the selected frequency channel. This condition is often caused by a loosely secured microphone jack. Rotation of this jack can cause the attached microphone high, microphone low, P'IT and ground wires to twist, thereby applying excessive tension on the jack terminals, and, in turn,",
    "and ground wires to twist, thereby applying excessive tension on the jack terminals, and, in turn, causing the P1T line terminal to short to one of the other terminals. This condition will result in unintentional continuous transmitter emissions. The insulation on these wires can also be damaged by rotary manipulation of an unsecured microphone jack. This condition creates a potential for unintentional transmitter keying due to shorting wires.",
    "## Ptr Line Activation By Other Causes",
    "1.5.1.3 \nA PTr line can be activated unintentionally by other low resistance paths to ground that are originated by associated malfunctioning line replaceable units (LRUs) such as audio selector panels, audio accessory units, remote electronics units, transceivers and by defective airplane wiring. It is assumed, however, that these unwanted conditions are comparatively rare, and are not significant contributors to the unintentional continuous transmission problem.",
    "## Unkeyed Continuous Transmissions\n\n1.5.1.4 \nContinuous unintentional transmissions, which are not initiated by unintentional keyline activation, may be caused by a circuit malfunction within the transmitter itself. It is assumed that this condition occurs infrequently and, in any event, will not be a significant contributor to the frequency blocking problem. \n\n## 1.6 Test Procedures",
    "--``,`,,`,`,`,,```,`,,,```,`,,,-`-`,,`,,`,`,,`---",
    "The test procedures specified in this document are intended to be used as one means of demonstrating compliance with the performance requirements. Although specific test procedures are cited, it is recognized that other methods may be preferred. These alternate procedures may be used if they provide at least equivalent information. In such cases, the procedures cited herein should be used as one criterion in evaluating the acceptability of the alternate procedures.",
    "The order of tests specified suggests that the equipment be subjected to a succession of tests as it moves from design, and design qualification, into operational use. For example, compliance with the requirements of Section 2.0 shall have been demonstrated as a precondition to satisfactory completion of the installed system tests of Section 3.0. \n\nThree types of test procedures are specified. These include: \n\n## A. Environmental Tests",
    "Three types of test procedures are specified. These include: \n\n## A. Environmental Tests\n\nEnvironmental test requirements are specified in Subsection 2.3. The procedures and their associated limit requirements are intended to provide a laboratory means of determining the electrical and mechanical performance of the equipment under environmental conditions expected to be encountered in actual operations.",
    "Unless otherwise specified, the environmental conditions and test procedures contained in RTCA/DO-I6OC, Environmental Conditions and Test Procedures for Airborne Equipment, will be used to demonstrate equipment compliance. \n\n## B. Bench Tests",
    "## B. Bench Tests\n\nBench test procedures are specified in Subsection 2.4. These tests provide a laboratory means of demonstrating compliance with the requirements of Subsection 2.2. Test results may be used by equipment manufacturers as design guidance, for monitoring manufacturing compliance and, in certain cases, for obtaining formal approval of equipment design. \n\n## C. Installed Equipment Tests",
    "The installed equipment test procedures and their associated limits are specified in Section 3.0. Although bench and environmental test procedures are not included in the installed equipment tests, their successful completion is a precondition to completion of the installed tests. In certain instances, however, installed equipment tests may be used in lieu of bench test simulation of such factors as power supply characteristics, interference from or to other equipment installed on the aircraft,",
    "as power supply characteristics, interference from or to other equipment installed on the aircraft, etc. Installed tests are normally performed under two conditions:",
    "(1) \nWith the aircraft on the ground and using simulated or operational system \ninputs. \n(2) \nWith the aircraft in flight using operational system inputs appropriate to the \nequipment under tesL \nTest results may be used to demonstrate functional performance in the intended operational environment \n\n## Definition Of Terms 1.7\n\nUnintentional Transmission(s) - Transmitter operation when such operation is not intended. This is commonly referred to as a stuck-mike condition.",
    "1B!! - Line Replaceable Unit \nill \n- Push-To-Talk \n--``,`,,`,`,`,,```,`,,,```,`,,,-`-`,,`,,`,`,,`---\n\n## Equipment Performance Requirements And Test Procedures 2.0 General Requirements 2.1\n\nThe following general requirements shall be met by all unintentional transmission prevention equipment. Equipment designed to prevent unintentional transmissions shall include the capability of automatically inhibiting transmitter operation. \n\n## Airworthiness 2.1.1",
    "## Airworthiness 2.1.1\n\nIn the design and manufacture of the equipment, the manufacturer shall provide for installation so as not to impair the airworthiness of the aircraft \n\n## 2.1.2 Intended Function\n\nThe equipment shall perform its intended function(s), as defmed by the manufacturer, and its proper use shall not create a hazard to other users of the National Airspace System. \n\n## Federal Communications Commission Rules 2.1.3",
    "## Federal Communications Commission Rules 2.1.3\n\nAll equipment shall comply with the applicable rules of the Federal Communications Commission.1 \n\n## Fire Protection 2.1.4\n\nAll materials used shall be self-extinguishing except for small parts (such as knobs, fasteners, seals, grommets and small electrical parts) that would not contribute significantly to the propagation of a flre. \n\nNOTE: One means of showing compliance is contained in Federal Aviation Regulations (FAR) \nPart 25, Appendix F.",
    "## Operation Of Controls 2.1.5\n\nThe equipment shall be designed so that controls intended for use during flight cannot be operated in any position, combination or sequence that would result in a condition detrimental to the reliability of the equipment or operation of the aircraft. \n\n## 2.1.6 Accessibility Of Controls\n\nControls that do not require adjustment during flight shall not be readily accessible to flight personnel. \n\n## 2.1.7 Effects Of Test",
    "## 2.1.7 Effects Of Test\n\n--``,`,,`,`,`,,```,`,,,```,`,,,-`-`,,`,,`,`,,`---\nThe equipment shall be designed so that the application of specified test procedures shall not be detrimental to equipment performance following the application of these tests, except as specifically allowed. \n\n \n                                  This Page Intentionally Left Blank",
    "## Equipment Perfonnance - Standard Conditions 2.2 Automatic Tennination Of Transmission 2.2.1\n\nThe equipment shall terminate a continuous transmission after a maximum of 35 seconds.",
    "~: (1) \nIt is preferred that the radio and audio equipment return to the receive mode \nafter transmission tennination and that equipment provide a means to alert the \ncrew that the transmission has been terminated. An annunciation to the user \nthat transmission is about to be terminated is also desirable, providing the \nopportunity for the user to reset the timer prior to tennination. \n(2) \nTransmissions may be detected by sensing the RF output signal from the",
    "(2) \nTransmissions may be detected by sensing the RF output signal from the \ntransmitter, the primary input current or power to the transmitter, the push-totalk line, or by sensing other appropriate control or status lines in the radio \nsystem. It is preferred that the sensing method use signals that are provided \nwithin, directly to, or directly from the transmitter.",
    "## Resetting Of Transmission Timer 2.2.2\n\nThe transmission timer shall be reset by one or both of the following conditions: (a) at the beginning of the transmission (except as provided by paragraph 2.2.3); (b) by a primary power interrupt.",
    "Note: \n(I) \nWith a device designed to tolerate a power interrupt it is possible that a \ndeliberate momentary PTT release may not be recognized as an attempt to reset \nthe timer. The VHF transmitter may then be unintentionally disabled following \nexpiry of the continually counting timer. \n(2) \nThe consequence of allowing momentary power interrupts to reset the timer is \nonly that an accidentally stuck microphone may not be tenninated for between",
    "only that an accidentally stuck microphone may not be tenninated for between \n35 to 70 seconds, rather than the proposed 35 seconds. This event will only \noccur when the stuck microphone coincides with a power interruption.",
    "## Bypass Switch 2.2.3\n\nA means of immediate operator override of the transmitter tennination function may be provided. \n\nSuch means of override shall be substantially incapable of being left in the bypass or override position either deliberately or accidentally and shall not reset the transmission timer. A springloaded, guarded toggle switch is one means of complying with this requirement.",
    "This Page Intentionally Left Blank \n                                                      \n\n## Equipment Performance - Environmental Conditions 2.3\n\nThe environmental tests and performance requirements described in this subsection provide a laboratory means of determining the overall performance characteristics for the equipment under conditions representative of those that may be encountered in actual aeronautical operations.",
    "Some of the environmental tests contained in this subsection do not have to be performed unless the manufacturer wishes to qualify the equipment for that particular environmental condition. \n\nThese tests are identified by the phrase \"when required.\" If the manufacturer wishes to qualify the equipment under any of these additional environmental conditions, then the appropriate \"When Required\" tests shall be performed.",
    "Unless otherwise specified, the test procedures applicable to a determination of equipment performance under environmental test conditions are contained in RTCA Document 00-I6OC. \n\nEnvironmental Conditions and Test Procedures for Airborne Equipment.",
    "--``,`,,`,`,`,,```,`,,,```,`,,,-`-`,,`,,`,`,,`---\nSome of the performance requirements in Subsection 2.2 are not required to be tested to all of the conditions contained in RTCA/OO-16OC. Judgement and experience have indicated that these particular performance parameters are not susceptible to certain environmental conditions and that the level of performance specified in Subsection 2.2 will not be measurably degraded by exposure to these conditions.",
    "## 2.3.1 Temperature And Altitude Tests (Rtcndo-I6Oc, Section 4.0)\n\nRTCA/DO-I6OC contains several temperature and altitude test procedures that are specified according to equipment category. These categories are included in Subsection 4.3 of DO-I6OC. \n\nThe following subparagraphs contain the applicable test conditions specified in Section 4.0 of DO-I6OC. \n\n## 2.3.1.1 Ground Survival Low Temperature Test And Operating Low Temperature Test",
    "## 2.3.1.1 Ground Survival Low Temperature Test And Operating Low Temperature Test\n\nThe equipment shall be subjected to the test conditions as specified in RTCNDO-I6OC. paragraph \n4.5.1.. and the following requirements of this standard shall be met: \n\na. \nParagraph 2.2.1 - Automatic Termination of Transmissions \nb. \nParagraph 2.2.2 - Resetting of Transmission Timer \n\n## 2.3.1.2 Ground Survival High Temperature Test And Short-Time Operating High Temperature Test",
    "## 2.3.1.2 Ground Survival High Temperature Test And Short-Time Operating High Temperature Test\n\nThe equipment shall be subjected to the test conditions as specified in RTCA/OO-I6OC, paragraph \n4.5.2, and the following requirements of this standard shall be met: \n\n| a.    | Paragraph                      | 2.2.1        | -     |\n|-------|--------------------------------|--------------|-------|\n| b.    | Paragraph 2.2.2 - Resetting of | Transmission | Timer |",
    "## Operating High Temperature Test 2.3.1.3\n\nThe equipment shall be subjected to the test conditions specified in RTCNDO-I6OC, paragraph \n4.5.3, and the following requirements of this standard shall be met: \n\n| a.    | Paragraph                      | 2.2.1        | -     |\n|-------|--------------------------------|--------------|-------|\n| b.    | Paragraph 2.2.2 - Resetting of | Transmission | Timer |",
    "This test is intended for equipment whose continued operation in the event of loss of cooling is essential to the safe flight of the aircraft \n\n## 2.3.1.4 In-Flight Loss Of Cooling Test\n\nThe equipment shall be subjected to the test conditions as specified in RTCA/DO-I6OC, paragraph \n4.5.4, and the following requirements of this standard shall be met:",
    "a. \nParagraph 2.2.1 - Automatic Termination of Transmissions \nb. \nParagraph 2.2.2 - Resetting of Transmission Timer \nThis test is intended for equipment whose continued operation in the event of loss of cooling is essential to the safe flight of the aircraft. \n\n## Altitude Test 2.3.1.5\n\nThe equipment shall be subjected to the test conditions as specified in RTCA/DO-I6OC, paragraph \n4.6.1, and the following requirements of this standard shall be met:",
    "a. \nParagraph 2.2.1 - Automatic Termination of Transmissions \nb. \nParagraph 2.2.2 - Resetting of Transmission Timer \n\n## Decompression Test 2.3.1.6\n\nThe equipment shall be subjected to the test conditions as specified in RTCA/DO-l60C, paragraph \n4.6.2, and the following requirements of this standard shall be met: \n\na. \nParagraph 2.2.1 - Automatic Termination of Transmissions \nb. \nParagraph 2.2.2 - Resetting of Transmission Timer \n\n## Overpressure Test 2.3.1.7",
    "## Overpressure Test 2.3.1.7\n\nThe equipment shall be subjected to the test conditions as specified in RTCA/DO-160C, paragraph \n4.6.3, and the following requirements of this standard shall be met: \n\na. \nParagraph 2.2.1 - Automatic Termination of Transmissions \nb. \nParagraph 2.2.2 - Resetting of Transmission Timer \n\n## Temperature Variation Test 2.3.2",
    "## Temperature Variation Test 2.3.2\n\nThe equipment shall be subjected to the test conditions as specified in RTCA/DO-160C, Section \n5.0, and the following requirements of this standard shall be met: \n\na. \nParagraph 2.2.1 - Automatic Termination of Transmissions \nb. \nParagraph 2.2.2 - Resetting of Transmission Timer \n\n## Humidity Test 2.3.3",
    "## Humidity Test 2.3.3\n\nThe equipment shall be subjected to the test conditions as specified in RTCA/DO-I60C, Section \n6.0, and the following requirements of this standard shall be met: \n\na. \nParagraph 2.2.1 - Automatic Termination of Transmissions \nb. \nParagraph 2.2.2 - Resetting of Transmission Timer \n\n## Operational Shocks And Crash Safety Tests 2.3.4 Operational Shocks 2.3.4.1",
    "## Operational Shocks And Crash Safety Tests 2.3.4 Operational Shocks 2.3.4.1\n\nThe equipment shall be subjected to the test conditions as specified in RTCA/DO-160C, \n--``,`,,`,`,`,,```,`,,,```,`,,,-`-`,,`,,`,`,,`---\nSubsection 7.2, and the following requirements of this standard shall be met: \n\na. \nParagraph 2.2.1 - Automatic Termination of Transmissions \nb. \nParagraph 2.2.2 - Resetting of Transmission Timer \n\n## Crash Safety 2.3.4.2",
    "## Crash Safety 2.3.4.2\n\nThe application of the crash safety shock tests may result in damage to the equipment under test; \ntherefore, this test may be conducted after the other tests have been completed. In this case, Paragraph 2.1.7, \"Effects of Test,\" does not apply. \n\nThe equipment shall be subjected to the test conditions as specified in RTCA/OO·16OC, Subsection 7.3, and shall meet the requirements specified therein. \n\n## Vibration Tests 2.3.5",
    "## Vibration Tests 2.3.5\n\nThe equipment shall be subjected to the test conditions as specified in RTCA/OO-16OC, Section \n8.0, and the following requirements of this standard shall be met: \n\na. \nParagraph 2.2.1 - Automatic Termination of Transmissions \nb. \nParagraph 2.2.2 - Resetting of Transmission Timer \n\n## Explosion Proofness Test (When Required) 2.3.6",
    "## Explosion Proofness Test (When Required) 2.3.6\n\nThe equipment shall be subjected to the test conditions as specified in RTCNDO-16OC, Section \n9.0. During this test the equipment shall not cause detonation of the explosive mixture within the test chamber. \n\n## Waterproofness Tests (When Required) 2.3.7 Drip Proof Test 2.3.7.1\n\nThe equipment shall be subjected to the test conditions as specified in RTCA/OO-I6OC, paragraph \n10.3.1, and the following requirements of this standard shall be met:",
    "a. \nParagraph 2.2.1 - Automatic Termination of Transmissions \nb. \nParagraph 2.2.2 - Resetting of Transmission Timer \n\n## Spray Proof Test 2.3.7.2\n\nThe equipment shall be subjected to the test conditions as specified in RTCA/DO-16OC, paragraph \n10.3.2, and the following requirements of this standard shall be met:",
    "a. \nParagraph 2.2.1 - Automatic Termination of Transmissions \nb. \nParagraph 2.2.2 - Resetting of Transmission Timer \nNote: \nThis test shall be conducted with the spray directed perpendicular to the equipment. \n\n## Continuous Stream Proof Test 2.3.7.3\n\nThe equipment shall be subjected to the test conditions as specified in RTCA/DO-160C, paragraph \n10.3.3, and the following requirements of this standard shall be met:",
    "a. \nParagraph 2.2.1 - Automatic Termination of Transmissions \nb. \nParagraph 2.2.2 - Resetting of Transmission Timer \nNOTE: This test shall be conducted with the stream directed perpendicular to the equipment. \n\n## Fluids Susceptibility Tests (When Required) 2.3.8\n\nThe following subparagraphs contain the applicable test conditions specified in Section 11.0 of RTCA/DO-16OC. \n\n## Spray Test 2.3.8.1",
    "## Spray Test 2.3.8.1\n\nThe equipment shall be subjected to the test conditions as specified in RTCA/DO-160C, paragraph \n11.4.1, and the following requirements of this standard shall apply: \n\na. \nAt the end of the 24-hour operational period, the equipment shall function. \nb. \nFollowing the two-hour operational period at ambient temperature, after the 1OO-hour \nexposure period at elevated temperature, the following requirements of \nthis standard shall \nbe met:",
    "| (1)    | Paragraph 2.2.1 - Automatic Termination    |\n|--------|--------------------------------------------|\n| of     | Transmissions                              |\n| (2)    | Paragraph 2.2.2 - Resetting                |\n| of     | Transmission Timer                         |\n\n## Immersion Test 2.3.8.2\n\nThe equipment shall be subjected to the test conditions as specified in RTCA/DO-I6OC, paragraph \n11.4.2, and the following requirements of this standard shall apply:",
    "a. \nAt the end of the 24-hour immersion period, the equipment shall function. \nb. \nFollowing the two-hour operational period at ambient temperature, after the 1OO-hour \nexposure period at elevated temperature, the following requirements of \nthis standard shall \nbe met:",
    "| (1)    | Paragraph 2.2.1 - Automatic Termination    |\n|--------|--------------------------------------------|\n| of     | Transmissions                              |\n| (2)    | Paragraph 2.2.2 - Resetting                |\n| of     | Transmission Timer                         |\n\n## Sand And Dust Test (When Required) 2.3.9",
    "## Sand And Dust Test (When Required) 2.3.9\n\n--``,`,,`,`,`,,```,`,,,```,`,,,-`-`,,`,,`,`,,`---\nThe equipment shall be subjected to the test conditions as specified in RTCNDO-16OC, Section \n12.0, and the following requirements of this standard shall be met: \n\na. \nParagraph 2.2.1 - Automatic Termination of Transmissions \nb. \nParagraph 2.2.2 - Resetting of Transmission Timer \n\n## Fungus Resistance Test (When Required) 2.3.10",
    "## Fungus Resistance Test (When Required) 2.3.10\n\nThe equipment shall be subjected to the test conditions as specified in RTCNDO-I6OC, Section \n13.0, and the following requirements of this standard shall be met: \n\n| a.    | Paragraph 2.2.1 - Automatic Termination    |\n|-------|--------------------------------------------|\n| b.    | Paragraph 2.2.2 - Resetting                |\n| of    | Transmission Timer                         |\n\n## 2.3.11 Salt Spray Test (When Required)",
    "## 2.3.11 Salt Spray Test (When Required)\n\nThe equipment shall be subjected to the test conditions as specified in RTCA/DO-I6OC, Section \n14.0, and the following requirements of this standard shall be met: \n\na. \nParagraph 2.2.1 - Automatic Tennination of Transmissions \nb. \nParagraph 2.2.2 - Resetting of Transmission Timer \n\n## 2.3.12 Magnetic Effect Test",
    "## 2.3.12 Magnetic Effect Test\n\nThe equipment shall be subjected to the test conditions as specified in RTCA/OO-I6OC, Section \n15.0, and the equipment shall meet the requirements of the appropriate instrument or equipment class specified therein. \n\n## Power Input Tests 2.3.13 Normal Operating Conditions 2.3.13.1",
    "## Power Input Tests 2.3.13 Normal Operating Conditions 2.3.13.1\n\nThe equipment shall be subjected to the test conditions as specified in RTCA/OO-160C, paragraphs 16.5.1 and 16.5.2, as appropriate, and the following requirements of this standard shall be met:",
    "a. \nParagraph 2.2.1 - Automatic Tennination of Transmissions \nb. \nParagraph 2.2.2 - Resetting of Transmission Timer \nAny timers in the equipment may be reset by momentary power interruptions of durations less than those defined in subparagraphs 16.5.1.4 and 16.5.2.3 of RTCA/DO-160C. The equipment is not required to operate during these power interrupts but must automatically recover to nonnal operation after them. \n\n## Abnormal Operating Conditions 2.3.13.2",
    "## Abnormal Operating Conditions 2.3.13.2\n\nThe application of the low voltage conditions (dc) (Category B equipment) test may result in damage to the equipment under test; therefore, this test may be conducted after the other tests have been completed. Paragraph 2.1.7, \"Effects of Test,\" does not apply.",
    "The equipment shall be subjected to the test conditions as specified in RTCA/DO-I6OC, paragraph \n16.5.3 and 16.5.4, as appropriate, and the following requirements of this standard shall be met: \n\na. \nParagraph 2.2.1 - Automatic Tennination of Transmissions \nb. \nParagraph 2.2.2 - Resetting of Transmission Timer \n\n## 2.3.14 Voltage Spike Tests\n\nThe following subparagraphs contain the applicable test conditions specified in Section 17.0 of RTCNDO-160C.",
    "## Category *'A'* Requirements (If Applicable) 2.3.14.1\n\nThe equipment shall be subjected to the test conditions as specified in RTCA/OO-160C, Subsection 17.3, and the following requirements of this standard shall be met \n\na. \nParagraph 2.2.1 - Automatic Tennination of Transmissions \nb. \nParagraph 2.2.2 - Resetting of Transmission Timer \n\n## Category 'B' Requirements (If Applicable) 2.3.14.2",
    "## Category 'B' Requirements (If Applicable) 2.3.14.2\n\n--``,`,,`,`,`,,```,`,,,```,`,,,-`-`,,`,,`,`,,`---\nThe equipment shall be subjected to the test conditions as specified in RTCA/DO-160C, paragraphs 17.4.1, \"Intennittent Transients,\" and 17.4.2, \"Repetitive Transients,\" and the following requirements of this standard shall be met:",
    "| a.    | Paragraph 2.2.1 - Automatic Termination    | of    | Transmissions      |\n|-------|--------------------------------------------|-------|--------------------|\n| b.    | Paragraph 2.2.2 - Resetting                | of    | Transmission Timer |\n\n## 2.3.15 Audio Frequency Conducted Susceptibility Test\n\nThe equipment shall be subjected to the test conditions as specified in RTCNDO-160C, Section \n18.0, and the following requirements of this standard shall be met:",
    "| a.    | Paragraph 2.2.1 - Automatic Termination    | of    | Transmissions      |\n|-------|--------------------------------------------|-------|--------------------|\n| b.    | Paragraph 2.2.2 - Resetting                | of    | Transmission Timer |\n\n## Induced Signal Susceptibility Test 2.3.16\n\nThe equipment shall be subjected to the test conditions as specified in RTCA/DO-16OC, Section \n19.0, and the following requirements of this standard shall be met:",
    "| a.    | Paragraph 2.2.1 - Automatic Termination    |\n|-------|--------------------------------------------|\n| b.    | Paragraph 2.2.2 - Resetting                |\n| of    | Transmission Timer                         |\n\n## Radio Frequency Susceptibility Test <Radiated And Conducted) 2.3.17\n\nThe equipment shall be subjected to the test conditions as specified in RTCNDO-I6OC, Section \n20.0, and the following requirements of this standard shall be met:",
    "| a.    | Paragraph 2.2.1 - Automatic Termination    |\n|-------|--------------------------------------------|\n| of    | Transmissions                              |\n| b.    | Paragraph 2.2.2 - Resetting                |\n\nNote: \nThe radiated and conducted RF test signal should exclude the frequency to which the receiver is tuned and all frequencies within the receiver's resonant passband. \n\n## Emission Of Radio Frequency Energy Test 2.3.18",
    "## Emission Of Radio Frequency Energy Test 2.3.18\n\nThe equipment shall be subjected to the test conditions as specified in RTCA/DO-16OC, Section \n21.0. \n\n## Lighbling Induced Transient Susceptibility Test (When Required) 2.3.19\n\nThe equipment shall be subjected to the test conditions as specified in RTCNDO-I6OC, Section \n22.0, and the following requirements of this standard shall be met:",
    "| a.    | Paragraph 2.2.1 - Automatic Termination    | of    | Transmissions      |\n|-------|--------------------------------------------|-------|--------------------|\n| b.    | Paragraph 2.2.2 - Resetting                | of    | Transmission Timer |\n\n## 2.3.20 Lighbling Direct Effects Test (If Applicable)\n\nThe equipment shall be subjected to the test conditions as specified in RTCA/DO-16OC, Section \n23.0.",
    "2.3.21 \nIcing Test (When Required) \nThe equipment shall be subjected to the test conditions as specified in RTCA/DO-I6OC, Section \n24.0. \n\n## Equipment Test Procedures 2.4 Definitions Of Terms And Condition Of Test 2.4.1\n\nThe following are defmitions of terms and conditions under which the following tests should be conducted.",
    "a. \nPower Input Voltage \nUnless otherwise specified, all tests shall be conducted with the power input voltage adjusted to design voltage plus or minus two percent. The input voltage shall be measured at the input terminals of the equipment under test.",
    "b. \nPower Input Frequency \n(1) \nIn the case of \nequipment designed for operation from an ac source of essentially \nconstant frequency (e.g., 400Hz), the input frequency shall be adjusted to design \nfrequency plus or minus two percent. \n(2) \nIn the case of equipment designed for operation from an ac source of variable \nfrequency (e.g., 300 to 1000 Hz), unless otherwise specified, the test shall be \nconducted with the input frequency adjusted to within five percent of a selected",
    "conducted with the input frequency adjusted to within five percent of a selected \nfrequency and within the range for which the equipment is designed. \nc. \nAdjustment of Equipment - The circuits of the equipment under test shall be properly \naligned and otherwise adjusted in accordance with the manufacturer's recommended \npractices prior to application of the specified tests. \nd. \nTest Equipment - All equipment used in the performance of the tests should be identified",
    "d. \nTest Equipment - All equipment used in the performance of the tests should be identified \nby make, model and serial number where appropriate, and its latest calibration date. \nWhen appropriate, all test equipment calibration standards should be traceable to national \nand/or international standards. \ne. \nTest Instrument Precautions - Due precautions shall be taken during the tests to prevent \nthe introduction of errors resulting from the connection of voltmeters, oscilloscopes and",
    "the introduction of errors resulting from the connection of voltmeters, oscilloscopes and \nother test instruments across the input and output impedances of the equipment under \ntest. \nf. \nAmbient Conditions - Unless otherwise specified, all tests shall be made within the \nfollowing ambient conditions: \n(1) \nTemperature: +15 to +35 degrees C \n(+59 to +95 degrees F) \n(2) \nRelative Humidity: Not greater than 85% \n--``,`,,`,`,`,,```,`,,,```,`,,,-`-`,,`,,`,`,,`---",
    "(3) \nAmbient Pressure: 84 to 107 kPa (equivalent \nto + 5000 to -1500 feet) (+ 1525 to -460 meters) \nWhen tests are conducted at ambient conditions that differ from the above values, allowances shall be made and differences recorded. \n\ng. \nConnected Loads - Unless otherwise specified, all tests shall be performed with the \nequipment connected to loads having the impedance values for which it is designed.",
    "## Detailed Test Procedures 2.4.2 Automatic Termination Of Transmissions (Paragraph 2.2.1) 2.4.2.1 Equipment Required\n\nWattmeter (Bird Electronics Model 611 or equivalent). \n\nStopwatch. \n\n## Measurement Procedure\n\nKey the associated transmitter. Determine the length of time required for automatic termination of output power.",
    "If a bypass switch is incorporated, activate switch and determine that transmitter output power resumes. Release bypass switch and verify that transmitter RF output ceases. \n\n## Resetting Of Transmission Timer (Paragraph 2.2.2) 2.4.2.2 Equipment Required\n\nWattmeter (Bird Electronics Model 611 or equivalent). \n\nOscilloscope (Tektronix Model 453 or equivalent). \n\n## Measurement Procedure",
    "Oscilloscope (Tektronix Model 453 or equivalent). \n\n## Measurement Procedure\n\nKey the associated transmitter. After the transmitter output has been automatically terminated, interrupt the keyed condition or the primary power or both (one at a time) depending upon equipment configuration. Determine that transmitter RF output resumes. \n\n## Installed Equipment Performance 3.0",
    "This section states the minimum acceptable level of performance for the equipment when installed in the aircraft. For the most part, installed performance requirements are the same as those contained in Section 2.0, which were verified through bench and environmental tests. However, certain requirements may be affected by the physical installation (e.g., antenna patterns, receiver sensitivity, etc.) and can only be verified after installation. The installed performance limits stated below take",
    "and can only be verified after installation. The installed performance limits stated below take into consideration these situations.",
    "## Equipment Installation 3.1\n\nThe equipment shall be installed in accordance with the manufacturer's installation instructions. \n\n## Accessibility 3.1.1.\n\nControls and monitors, if provided for in-flight operation, shall be readily accessible from the pilot's normal seated position. \n\nThe appropriate operator/crew member(s) shall have an unobstructed view of displayed data when in the normal seated positon. \n\n## Aircraft Environment 3.1.2",
    "## Aircraft Environment 3.1.2\n\nEquipment shall be compatible with the environmental conditions present in the specific location in the aircraft where the equipment is installed. \n\n## Display Visibility (If Applicable) 3.1.3\n\nDisplay intensity shall be suitable for data interpretation under all cockpit ambient light conditions ranging from total darkness to reflected sunlight. \n\n## Dynamic Response 3.1.4",
    "## Dynamic Response 3.1.4\n\nOperation of the equipment shall not be adversely affected by aircraft maneuvering or changes in attitude encountered in normal flight operations. \n\n## Failure Protection 3.1.5\n\nAny probable failure of the equipment shall nqt degrade the normal operation of equipment or systems connected to it. Likewise, the failure of interfaced equipment or systems shall not degrade normal operation of this equipment. \n\n## 3.1.6 Interference Effects",
    "## 3.1.6 Interference Effects\n\nThe equipment shall not be the source of harmful conducted or radiated interference nor be adversely affected by conducted or radiated interference from other equipment or systems installed in the aircraft.",
    "Note: \nElectromagnetic compatibility problems noted after installation of this equipment may \nresult from such factors as the design characteristics of previously installed systems or \nequipment and the physical installation itself. It is not intended that the equipment \nmanufacturer design for all installation environments. The installing facility will be responsible for resolving any incompatibilty between this equipment and previously",
    "installed equipment in the aircraft. The various factors contributing to the incompatibility \nshall be considered.",
    "## Inadvertent Turnoff 3.1.7\n\nAppropriate protection shall be provided to avert the inadvertent turnoff of the equipment. \n\n## Aircraft Power Source 3.1.8\n\nThe voltage and voltage tolerance characteristics of the equipment shall be compatible with the aircraft power source. \n\n## Installed Equipment Performance Requirements 3.2\n\nThe installed equipment shall meet the requirements of Subsections 2.1 and 2.2. \n\n## Conditions Of Test 3.3",
    "## Conditions Of Test 3.3\n\nThe following paragraphs define conditions under which tests, specified in Subsection 3.4, shall be conducted. \n\n## Power Input 3.3.1\n\nUnless otherwise specified, tests shall be conducted with the equipment powered by the aircraft's electtical power generating system. \n\n## Associated Equipment Or Systems 3.3.2\n\nUnless otherwise specified, all aircraft electrically operated equipment and systems shall be turned on before conducting interference tests.",
    "## Environment 3.3.3\n\nDuring test, the equipment shall not be subjected to environmental conditions that exceed those specified by the equipment manufacturer. \n\n## Adjustment Of Equipment 3.3.4\n\nCircuits of the equipment under test shall be properly aligned and otherwise adjusted in accordance with the manufacturer's recommended practices prior to application of the specified tests. \n\n## Warm-Up Period 3.3.5",
    "## Warm-Up Period 3.3.5\n\nUnless otherwise specified, tests shall be conducted after a warm-up (stabilization) period of not more than fifteen minutes. \n\n## Test Procedures For Installed Equipment Performance 3.4\n\nThe following test procedures provide one means of determining installed equipment performance.",
    "Although specific test procedures are cited, it is recognized that other methods may be preferred by the installing activity. These alternate procedures may be used if they provide at least equivalent information. In such cases, the procedures cited herein should be used as one criterion in evaluating the acceptability of the alternate procedures. The equipment shall be tested to demonstrate compliance with the minimum requirements stated in Subsection 2.2. In order to meet this requirement,",
    "with the minimum requirements stated in Subsection 2.2. In order to meet this requirement, test results supplied by the equipment manufacturer or other proof of conformity may be accepted in lieu of bench tests performed by the installing activity.",
    "## Ground Test Procedures 3.4.1 Conformity Inspection\n\n3.4.1.1 \nVisually inspect the installed equipment to determine the use of acceptable workmanship and engineering practices. Verify that proper mechanical and electrical connections have been made and that the equipment has been located and installed in accordance with the manufacturer's recommendations. \n\n## Equipment Function 3.4.1.2",
    "## Equipment Function 3.4.1.2\n\nVary all controls of the equipment through their full range to determine that the equipment is operating according to the manufacturer's instructions and that each control performs its intended function. \n\n## Interference Effects 3.4.1.3",
    "With the equipment energized, individually operate each of the other electrically operated aircraft equipment and systems to determine that significant conducted or radiated interference does not exist. Evaluate all reasonable combinations of control settings and operating modes. Operate communication and navigation equipment on the low, high and at least one but preferably four mid-band frequencies. Make note of systems or modes of operation that should also be evaluated during flight. If",
    "Make note of systems or modes of operation that should also be evaluated during flight. If appropriate, repeat tests using emergency power with the aircraft's batteries alone and the inverters operating.",
    "## Power Supply Fluctuations\n\n3.4.1.4 \nUnder normal aircraft conditions, cycle the aircraft engine (s) through all normal power settings and verify proper operation of the equipment as specified by the equipment manufacturer. \n\n## Equipment Accessibility 3.4.1.5\n\nDetermine that all equipment controls and displayed data are readily accessible and easily interpreted. \n\n## Functional Tests 3.4.1.6",
    "## Functional Tests 3.4.1.6\n\na. \nWith aircraft transceiver \"on\" and tuned to an appropriate test frequency, e.g., company \ngate frequency, with no incoming receiver signal, transmit in normal manner. \nb. \nTransmit a test frequency and continue in transmit mode until automatic cutoff (35 \nseconds maximum). \nc. \nTest any optional features in accordance with manufacturer's instructions.",
    "## Special Committee 163 Minimum Operational Performance Standards For Devices That Prevent Blocked Channels Used In Two-Way Radio Communications Due To Unintentional Transmissions Chainnan\n\n| Pan    |\n|--------|\n| J.     |\n| Raia   |\n\n## Secretary\n\nJ. \nLohr \nRadio Technical Commmission for Aeronautics \n\n## Members",
    "| International       | Air                     | Transport      | Association    |\n|---------------------|-------------------------|----------------|----------------|\n| Federal             | Aviation                | Administration |                |\n| ABD                 |                         |                |                |\n| United              | States Coast            | Guard          |                |",
    "| United              | States Coast            | Guard          |                |\n| American            | Airlines,               | Inc.           |                |\n| Air                 | Line Pilots Association |                |                |\n| Federal             |                         |                |                |\n| Aviation            | Administration          |                |                |",
    "| Aviation            | Administration          |                |                |\n| Honeywell,          | Inc.                    |                |                |\n| Teledyne            | Controls                |                |                |\n| Civil               | Aviation                | Authority      |                |\n| (UK)                |                         |                |                |",
    "| (UK)                |                         |                |                |\n| Air                 |                         |                |                |\n| Transport           | Association             | of             | America        |\n| British             | Embassy                 |                |                |\n| Bang-Campbell       | Associates              |                |                |",
    "| Bang-Campbell       | Associates              |                |                |\n| Federal             |                         |                |                |\n| Aviation            | Administration          |                |                |\n| United              |                         |                |                |\n| Air                 |                         |                |                |",
    "| Air                 |                         |                |                |\n| Lines,              | Inc.                    |                |                |\n| Federal             | Aviation                | Administration |                |\n| Pipercross          |                         |                |                |\n| Communications      |                         |                |                |",
    "| Communications      |                         |                |                |\n| United              |                         |                |                |\n| Air                 |                         |                |                |\n| Lines,              | Inc.                    |                |                |\n| Global-             | Wulfsburg               | Systems        |                |",
    "| Global-             | Wulfsburg               | Systems        |                |\n| American            | Airlines,               | Inc.           |                |\n| Federal             | Aviation                | Administration |                |\n| Civil Aviation      |                         |                |                |\n| Authority           |                         |                |                |",
    "| Authority           |                         |                |                |\n| (UK)                |                         |                |                |\n| Civil               | Aviation                | Authority      |                |\n| (UK)                |                         |                |                |\n| Civil Aviation      | Authority               |                |                |",
    "| Civil Aviation      | Authority               |                |                |\n| (UK)                |                         |                |                |\n| Telex               | Communications,         | Inc.           |                |\n| Foster Airdata      | Systems,                | Inc.           |                |\n| Aircraft            |                         |                |                |",
    "| Aircraft            |                         |                |                |\n| Owners              | and Pilots              | Association    |                |\n| Federal             | Aviation                | Administration |                |\n| International Civil |                         |                |                |\n| Aviation            | Organization            |                |                |",
    "| Aviation            | Organization            |                |                |\n| United              |                         |                |                |\n| Air                 |                         |                |                |\n| Lines,              | Inc.                    |                |                |\n| Civil Aviation      | Authority               |                |                |",
    "| Civil Aviation      | Authority               |                |                |\n| (UK)                |                         |                |                |\n| V. Adam             |                         |                |                |\n| P. AkelS            |                         |                |                |\n| A.                  |                         |                |                |",
    "| A.                  |                         |                |                |\n| Arndt               |                         |                |                |\n| P.                  |                         |                |                |\n| Arnstein            |                         |                |                |\n| W.                  | Aronow                  |                |                |",
    "| W.                  | Aronow                  |                |                |\n| W.                  |                         |                |                |\n| Baker               |                         |                |                |\n| F.                  |                         |                |                |\n| Barron              |                         |                |                |",
    "| Barron              |                         |                |                |\n| H.                  | BeDingfield             |                |                |\n| A.                  | Bennett                 |                |                |\n| K.                  |                         |                |                |\n| B1ake-Robezts       |                         |                |                |",
    "| B1ake-Robezts       |                         |                |                |\n| R.                  | BOWelS                  |                |                |\n| V.                  | Brennan                 |                |                |\n| R.                  |                         |                |                |\n| Campbell            |                         |                |                |",
    "| Campbell            |                         |                |                |\n| W.                  | Chapman                 |                |                |\n| R.                  |                         |                |                |\n| Chiinera            |                         |                |                |\n| G.                  |                         |                |                |",
    "| G.                  |                         |                |                |\n| Chittum             |                         |                |                |\n| N.                  |                         |                |                |\n| Corrigan            |                         |                |                |\n| W.                  | Cotton                  |                |                |",
    "| W.                  | Cotton                  |                |                |\n| W.                  | Crawford                |                |                |\n| T.                  | Degner                  |                |                |\n| F.                  | Etherton                |                |                |\n| A.                  | Evans                   |                |                |",
    "| A.                  | Evans                   |                |                |\n| D.                  | Famcombe                |                |                |\n| N.                  |                         |                |                |\n| Ferrett             |                         |                |                |\n| D.                  | Flygstad                |                |                |",
    "| D.                  | Flygstad                |                |                |\n| G.                  | Foster                  |                |                |\n| B.                  | Funk                    |                |                |\n| M.                  |                         |                |                |\n| Garelick            |                         |                |                |",
    "| Garelick            |                         |                |                |\n| E.                  | Godberson               |                |                |\n| T.                  | Graff                   |                |                |\n| J.                  |                         |                |                |\n| Griffiths           |                         |                |                |",
    "| Griffiths           |                         |                |                |\n| G.                           | Gromov                         | All-Union Scientific Research Institute of    | Radio                  | Equipment    |\n|------------------------------|--------------------------------|-----------------------------------------------|------------------------|--------------|",
    "| (USSR)                       |                                |                                               |                        |              |\n| K.                           |                                |                                               |                        |              |\n| Hanneman                     |                                |                                               |                        |              |",
    "| Bendix/King                  |                                |                                               |                        |              |\n| B.                           | Hassell                        | AT&T                                          | Bell Laboratories      |              |\n| L.                           |                                |                                               |                        |              |",
    "| Heckler                      |                                |                                               |                        |              |\n| NARCO                        | Avionics,                      | Inc.                                          |                        |              |\n| R.                           |                                |                                               |                        |              |",
    "| Henderson                    |                                |                                               |                        |              |\n| General Aviation Electronics |                                |                                               |                        |              |\n| T.                           |                                |                                               |                        |              |",
    "| Hitt                         |                                |                                               |                        |              |\n| Teledyne                     | Controls                       |                                               |                        |              |\n| T.                           |                                |                                               |                        |              |",
    "| Hoole                        |                                |                                               |                        |              |\n| Boeing Commercial            | Airplane                       | Group                                         |                        |              |\n| M.                           | Hope                           | American Airlines,                            | Inc.                   |              |",
    "| 1.                           |                                |                                               |                        |              |\n| Howell                       |                                |                                               |                        |              |\n| Honeywell,                   | Inc.                           |                                               |                        |              |",
    "| W.                           | Hunter                         | Bendix                                        | Avionics/Allied Signal | Aerospace    |\n| 1.                           |                                |                                               |                        |              |\n| Ihasz                        |                                |                                               |                        |              |",
    "| Litton Industries            |                                |                                               |                        |              |\n| L.                           |                                |                                               |                        |              |\n| lames                        |                                |                                               |                        |              |",
    "| Trans World Airlines,        | Inc.                           |                                               |                        |              |\n| V.                           | likharev                       | Au-Union Scientific                           | Research               | Institute of |\n| (USSR)                       |                                |                                               |                        |              |",
    "| K.                           | King                           |                                               |                        |              |\n| ARINC/SIT                    | A Joint                        | Venture                                       |                        |              |\n| J.                           | Knight                         | Civil Aviation                                | Authority              | (UK)         |",
    "| F.                           | Koepke                         |                                               |                        |              |\n| Air Line Pilots Association  |                                |                                               |                        |              |\n| T.                           |                                |                                               |                        |              |",
    "| Kmuner                       | Air                            | Line Pilots Association                       |                        |              |\n| P.                           | Kreider                        | Kreider Associates,                           | Inc.                   |              |\n| C.                           |                                |                                               |                        |              |",
    "| Lane                         |                                |                                               |                        |              |\n| Consultant                   |                                |                                               |                        |              |\n| D.                           | Martinec                       | Aeronautical Radio,                           | Inc.                   |              |",
    "| R.                           | Matthews                       | Federal Aviation Administration               |                        |              |\n| J.                           | McDonnell                      | Douglas Aircraft                              | Co.                    |              |\n| M.                           | O'Rourke                       | National Transportation                       | Safety                 | Board        |",
    "| M.                           | Parkes                         |                                               |                        |              |\n| British Embassy              |                                |                                               |                        |              |\n| P.                           | Payne                          | E-Systems,                                    | ECI                    | Division     |",
    "| T.                           | Pearsall                       |                                               |                        |              |\n| Eventide                     |                                |                                               |                        |              |\n| Inc.                         |                                |                                               |                        |              |",
    "| B.                           | Perret                         | EUROCAE                                       |                        |              |\n| L.                           | Poradowski                     | Roanwell Corporation                          |                        |              |\n| R.                           | Powell                         |                                               |                        |              |",
    "| NARCO                        | Avionics,                      | Inc.                                          |                        |              |\n| G.                           |                                |                                               |                        |              |\n| Quinby                       | Airline Operators              | and                                           | Pilots                 | Association  |",
    "| N.                           | Rasch                          | National                                      | Aeronautics            | and          |\n| I.                           | Reese                          |                                               |                        |              |\n| Boeing                       | Commercial                     | Airplane                                      | Group                  |              |",
    "| A.                           | Reiner                         |                                               |                        |              |\n| JFK                          |                                |                                               |                        |              |\n| International                |                                |                                               |                        |              |",
    "| Airport                      |                                |                                               |                        |              |\n| L.                           | Riechel                        |                                               |                        |              |\n| Boeing                       | Commercial                     | Airplane                                      | Group                  |              |",
    "| W.                           | Rountree                       |                                               |                        |              |\n| Teledyne                     | Controls                       |                                               |                        |              |\n| W.                           | Russel                         | Air                                           | Transport              | Association  |",
    "| M.                           | Russo                          | Aeronautical Radio,                           | Inc                    | .            |\n| P.                           |                                |                                               |                        |              |\n| Rutkowski                    | Roanwell                       | Corporation                                   |                        |              |",
    "| J.                           |                                |                                               |                        |              |\n| Rutty                        | ABD                            |                                               |                        |              |\n| M.                           | Shuey                          | Aircraft                                      | Owners                 | and          |",
    "| D.                           | Smedsrud                       | Telex                                         | Communications         | Inc.         |\n| M.                           |                                |                                               |                        |              |\n| Snow                         | Boeing                         | Commercial                                    | Airplane               | Group        |",
    "| R.                           |                                |                                               |                        |              |\n| Steinacker                   | Trans World                    | Airlines,                                     | Inc.                   |              |\n| R.                           |                                |                                               |                        |              |",
    "| Striegel                     | Air                            | Line Pilots                                   | Association            |              |\n| F.                           |                                |                                               |                        |              |\n| Studenberg                   |                                |                                               |                        |              |",
    "| Rockwell International       |                                |                                               |                        |              |\n| D.                           |                                |                                               |                        |              |\n| Tangney                      | United                         | Air                                           | Lines,                 | Inc.         |",
    "| T.                           | Teetor                         |                                               |                        |              |\n| DCA,                         | Inc.                           |                                               |                        |              |\n| J.                           |                                |                                               |                        |              |",
    "| Thornton                     |                                |                                               |                        |              |\n| Collins A                    | vionics/Rockwell International |                                               |                        |              |\n| A.                           |                                |                                               |                        |              |",
    "| Tone                         | Teledyne                       | Controls                                      |                        |              |\n| Y.                           |                                |                                               |                        |              |\n| Toshitsuna                   | Electronic Industries          | Association                                   | of                     | Japan        |",
    "| C.                           |                                |                                               |                        |              |\n| Tromborg                     |                                |                                               |                        |              |\n| Telex                        | Communications,                | Inc                                           | .                      |              |",
    "International Air Transport Association A \nvtech Corporation Telex Communications, Inc. \n\nCollinsAvionicsIRockweli International National Transportation Safety Board Honeywell, Inc. \n\nK. Van der Boogaard K. Van der Putten B. Walters \n1. \n\nWashburn R. Wentworth F. White \n\n \n                                  This Page Intentionally Left Blank \n                                                      \n\n--``,`,,`,`,`,,```,`,,,```,`,,,-`-`,,`,,`,`,,`---"
  ]
}