{
  "source": "RTCA DO-210D Chg 1.md",
  "chunks": [
    "RTCA, Inc. \n\n1140 Connecticut Avenue, NW, Suite 1020 \nWashington, DC 20036-4008 USA \n \nCHANGE NO. 1 \n \n-TO- \n \nRTCA/DO-210D \n \nMinimum Operational Performance Standards for Geosynchronous Orbit Aeronautical Mobile Satellite Services (AMSS) Avionics © RTCA, Inc.  2000 December 14, 2000 \nCopies of this document may be obtained from RTCA, Inc.",
    "1140 Connecticut Avenue, NW, Suite 1020 \nWashington, DC  20036-4008 USA \n \nTelephone:  202-833-9339 \nFacsimile:  202-833-9434 \nInternet:  www.rtca.org Please contact RTCA for price and ordering information.",
    "DO-210D Change No. 1 \n1. \nPage 5, Section 1.2.3.  In the 1st paragraph of text, last sentence, delete the two instances of the word \"shall\". \n2. \nPage 18.  Add a new Section 2.1.9 and Figure 2-00 as follows: \n2.1.9 \n \nInterference Susceptibility",
    "2.1.9 \n \nInterference Susceptibility \n \nReceivers meeting the requirements of this document operate satisfactorily in the presence of interference at RF levels at the receiver's input port not exceeding the following tabulated levels. The RF levels in the frequency ranges near the SATCOM receive band are also illustrated in \nFigure 2-00. \n \n \nFrequency Range \n \nMaximum Interference Level \n \n \n470 to 1450 MHz \n \n+3 dBm \n \n \n1450 to 1529 MHz \n \nDecreases linearly in decibels",
    "from +3 dBm at 1450 MHz to –72 dBm at 1529 MHz \n \n \n1529 to 1560 MHz \n \n-163.2 dBm \n \n \n1560 to 1626.5 MHz \n \nIncreases linearly in decibels \n\n\nfrom –72 dBm at 1560 MHz \n\n\nto +3 dBm at 1626.5 MHz \n\n\n1626.5 to 1660.5 MHz \n \n+47.8 dBm \n \n \n1660.5 to 18000 MHz \n \n+3dBm",
    "FIGURE 2-00.   RECEIVER SUSCEPTIBILITY \n \n \n3. \nPage 21, Section 2.2.3.2.1.  Delete the 3rd paragraph of text and insert the following:",
    "The coverage volume, as declared by the antenna manufacturer, shall comprise not less than 75 percent of the solid angle of the upper hemisphere above five degrees elevation (to the horizon during normal cruise attitude of the aircraft).  This gain value shall include all (1) effects of installation on a surface representative of the mounting surface on which it is intended to operate the antenna, (2) beam-pointing errors within the antenna subsystem including those due to",
    "implementation of the beam-steering algorithm, and \n (3) effects of a radome and/or other \nprotective surfaces.",
    "This gain value shall be met while meeting the pattern discrimination requirements in Section 2.2.3.4.1. \n4. \nPage 21, Section 2.2.3.2.2.  Delete the 2nd paragraph and insert the following:",
    "The coverage volume as declared by the antenna manufacturer shall comprise not less than 85 percent of the solid angle of the upper hemisphere above five degrees elevation.  This gain value shall include all (1) effects of installation on a surface representative of the mounting surface on which it is intended to operate the antenna, and (2) effects of a radome and/or other protective surfaces.  The coverage volume may include a volume corresponding to a cone of 20 degrees half-angle at the",
    "The coverage volume may include a volume corresponding to a cone of 20 degrees half-angle at the aircraft zenith (when in normal cruise attitude) in straight and level flight.  The gain within this cone must not be less than -2 dBic.",
    "The remaining 15 percent shall be not less than -5 dBic. \n5. \nPage 22, Section 2.2.3.2.3.  Delete the 4th and 5th paragraphs and insert the following:",
    "The coverage volume, as declared by the antenna manufacturer, shall comprise not less than 85 percent of the solid angle of the upper hemisphere above 5 degrees elevation (relative to the horizon during normal cruise attitude of the aircraft).  This gain value shall include all (1) effects of installation on a surface representative of the mounting surface on which it is intended to operate the antenna, (2) beam-pointing errors within the antenna subsystem including those due to implementation",
    "(2) beam-pointing errors within the antenna subsystem including those due to implementation of the beam-steering algorithm, and (3) effects of a radome and/or other protective surfaces. The coverage volume may include a volume corresponding to a cone of 20 degrees half-angle at the aircraft zenith in straight and level flight.  The gain within this cone must be not less than 4 dBic.",
    "6. \nPage 23, Section 2.2.3.4.2.  Delete paragraphs 2.2.3.4.2.1 and 2.2.3.4.2.2 in their entirety and insert the following: \n \nThe discrimination requirements in this section shall be independent of the antenna manufacturer's declared coverage volume (as defined in Section 2.2.3.2.3). The radiation pattern shall discriminate by not less than 7 dB between wanted and 85% of",
    "unwanted satellite positions for all antenna steering angles above 5 degrees elevation.  In addition, the transmit radiation pattern shall be such that the gain in any direction shall not exceed that in the direction of the wanted satellite by more than 5 dB over 95% of the antenna steering angles above 5 degrees elevation. These requirements assume that (1) satellites are in geostationary orbits, (2) unwanted satellites are not less than 80 degrees longitude away from the wanted satellite, and",
    "(2) unwanted satellites are not less than 80 degrees longitude away from the wanted satellite, and (3) the aircraft is in straight and level flight.",
    "7. \nPage 29, Section 2.2.4.1.7.1.  Delete the existing one sentence of text and insert the following: \n \nThe receiver shall tune within the frequency range 1530-1559 MHz in 2.5 kHz increments. \nNOTE: The channel center frequencies near the allocated band boundaries are restricted to",
    "NOTE: The channel center frequencies near the allocated band boundaries are restricted to \ncontain the sideband energy within the allocated bands.  The center frequencies of high data rate channels are spaced farther from band boundaries than low data rate channels. The ranges of the transmit channel center frequencies for some channel rates are given in the following table. Channel Modulation \n \nCarrier Tuning Ranges (MHz) \n   Rate    \n     Type      \n \n(Tuning Increment = 2.5 kHz)",
    "Carrier Tuning Ranges (MHz) \n   Rate    \n     Type      \n \n(Tuning Increment = 2.5 kHz) \n \n0.60 kbps \nA-BPSK \n \n1530.0025 to 1558.9975 \n1.20 kbps \nA-BPSK \n \n1530.0025 to 1558.9975 \n8.4 kbps \nA-QPSK \n \n1530.0050 to 1558.9950 \n10.5 kbps \nA-QPSK \n \n1530.0075 to 1558.9925 \n21.0 kbps \nA-QPSK \n \n1530.0125 to 1558.9875 \n \nNOTE: While the lower edge of the assigned frequency band in the space-to-earth (AES",
    "NOTE: While the lower edge of the assigned frequency band in the space-to-earth (AES \nreceive) direction is 1525 MHz, the lower edge frequency of the operational band is limited to 1530 MHz.  See Section 2.2.4.2.10.1, Note 2. \n8. \nPage 29, Section 2.2.4.1.7.2.  The equation dividing line should be centered (moved to the right). \n9. \nPage 30, Section 2.2.4.1.11.1.  In the 1st line, the hyphen in \"P-channel\" should not be underlined. \n10.",
    "10. \nPage 32, Section 2.2.4.1.12.1.1.  In the table, there are two misalignments of text in the third row of the column headers:  \"Present\" should be aligned under \"Rician Fading\", and \"(Hz)\" should be aligned under \"Fading Bandwidth\". \n11. \nPage 33, Section 2.2.4.2.1.  In the table, there is a misalignment of \"47.6 ppm\" in the 10.5 kbps row - it should be aligned under the \"Channel Rate Tolerances\" column. \n12.",
    "12. \nPage 35, Section 2.2.4.2.5.  Delete the table and Table Notes in the entirety and insert the following. (The Notes beginning at the bottom of the page, following the Table Notes, are to be retained.) \n \nComposite Harmonic, Discrete Spurious and Noise Density Levels \n \nFrequency (MHz) \n \nPower Density \n0.01 to 15251 \n-135 dBc/4 kHz \n1525 to 1559 \n-203 dBc/ 4kHz \n1559 to 1585 \n-155 dBc/MHz \n1585 to 1605 \n-143 dBc/MHz \n1605 to 1610 \n-117 dBc/MHz \n1610 to 1610.6 \n  -95 dBc/MHz",
    "1585 to 1605 \n-143 dBc/MHz \n1605 to 1610 \n-117 dBc/MHz \n1610 to 1610.6 \n  -95 dBc/MHz \n1610.6 to 1613.8 \n  -80 dBW/MHz5,7 \n1613.8 to 1614 \n  -95 dBc/MHz \n1614 to 1626.5 \n  -70 dBc/4 kHz \n1626.5 to 1660 \n  -70 dBc/4 kHz2,3,4,5,6 \n1660 to 1660.5 \n-49.5 dBW/20 kHz2,3,4,5,6,7 \n1660.5 to 1670 \n-49.5 dBW/20 kHz4,5,7 \n1670 to 1735 \n  -60 dBc/4 kHz \n1735 to 12000 \n-105 dBc/4 kHz \n12000 to 18000 \n  -70 dBc/4 kHz",
    "1670 to 1735 \n  -60 dBc/4 kHz \n1735 to 12000 \n-105 dBc/4 kHz \n12000 to 18000 \n  -70 dBc/4 kHz \n \nTABLE NOTES: 1. AMSS operations are permitted in the MMS (maritime) band which has been extended to \ninclude 1525-1530 MHz. \n \n2. Within the transmit band, excluding the frequency band within ±35 kHz of the carrier. \n \n3. The –55 dBc/4kHz spectrum level in this table is equivalent to –55 - 10 log10(4000/SR) dBe",
    "3. The –55 dBc/4kHz spectrum level in this table is equivalent to –55 - 10 log10(4000/SR) dBe \n(relative to the maximum envelope) under the definitions in Section 2.2.4.2.16. 4. For wide band spurious the limit is –39.5 dBW/MHz. \n5. This level is not applicable for intermodulation products. 6. The upper limit for the excess power for any narrow-band spurious emission (excluding",
    "intermodulation products) within a 30 kHz measurement bandwidth shall be 10 dB above the power limit in this table. 7. Note that the power density is expressed in terms of absolute power (dBW) in some \ninstances, and in terms relative to carrier power (dBc) in other instances. \n \n \n13. \nPage 36, Section 2.2.4.2.6, table of \"Maximum Intermodulation Product Levels\".  Delete the table contents in their entirety, and replace with the following: \n \n \nFrequency (MHz) \n \n IM Level \n \nBelow 1610",
    "Frequency (MHz) \n \n IM Level \n \nBelow 1610  \n<-70  dBc \n \n1610 to 1614 \n-64  dBc \n \n1614 to 1671.25 \n-24  dBc \n \n1671.25 to 1711 \n-29  dBc \n \n1711 to 1735 \n-34  dBc \n \n1735 to 18000 \n<-70  dBc \n14. \nPage 36, Section 2.2.4.2.6 (at bottom of the page).  Delete the sentence beginning with \"The transceiver shall not transmit on a newly-assigned frequency...\" in its entirety,  and replace with:",
    "In multi-channel operation, the spacing between RF carriers that are operating simultaneously shall not exceed 10.75 MHz. \n15. \nPage 37, in Section 2.2.4.2.6 (at top of the page), immediately following \"*NOTES:*\".  Add the following note: \n \n \n0. The immediately preceding requirement ensures that neither 3rd nor 5th order \nintermodulation products can occur below 1610 MHz. \n16. \nPage 37, Section 2.2.4.2.8, 1st paragraph of text.  The 2nd line of text has an unwanted hanging indent. \n17.",
    "17. \nPage 37, Section 2.2.4.2.8, 1st paragraph of text.  At end of the second line of text following the words \"under the stated conditions\" and before the colon, insert the phrase \"(see also Section 2.2.2)\". \n18. \nPage 38, in Section 2.2.4.2.10.1.  In the Note (second block of text), add \"1\" following the word \"*NOTE*\", so as to read \"*NOTE 1:*\". \n19. \nPage 39, in Section 2.2.4.2.10.1.  Delete the existing table in its entirety and insert the following: \n \nChannel  \nModulation",
    "Channel  \nModulation \n \nCarrier Tuning Ranges (MHz) \n   Rate    \n \n     Type      \n \n(Tuning Increment = 2.5 kHz) 0.60 kbps \n \nA-BPSK \n \n1631.5075 to 1660.4925 \n1.20 kbps \n \nA-BPSK \n \n1631.5075 to 1660.4925 \n8.4   kbps \n \nA-QPSK \n \n1631.5100 to 1660.4900 \n10.5 kbps \n \nA-QPSK \n \n1631.5125 to 1660.4875 \n21.0 kbps \n \nA-QPSK \n \n1631.5175 to 1660.4825",
    "20. \nPage 39, in Section 2.2.4.2.10.1.  In the Note following the table, add \"2\" following the word \"*NOTE:*\", so as to read \"*NOTE 2:*\". \n21. \nPage 39, in Section 2.2.4.2.10.1.  Following \"*NOTE 2:*\" and its text as changed above, add the following: \n \nNOTE 3: While the lower edge of the assigned frequency band in the earth-to-space (AES",
    "transmit) direction is 1626.5 MHz, the lower edge frequency of the operational band is limited to 1631.5 MHz due to frequency management constraints necessary for protection of other services (e.g., GNSS).  This limit corresponds with the paired space-to-earth (AES receive) lower band edge frequency of 1530 MHz (see Section 2.2.4.1.7).  Consequently, performance requirements and their verification are limited to the operational frequencies contained in the above table. \n22.",
    "22. \nPage 39, Section 2.2.4.2.10.2.  The equation dividing line should be centered (moved to the right). \n23. \nPage 44, Section 2.2.6.  In the first list for Reference Document \"A\", for the last entry \"Figure 46\" the version number \"1.45\" should be aligned to the 3rd column. \n24. \nPage 54, Section 2.2.7.4.2.  Under the Reference Document \"A\", Appendix 3 list, in the row for \"3.4\", remove the underline from the hyphen in \"T-Channel\". \n25.",
    "25. \nPage 61, in Section 2.2.7.5.2.1.  Following the existing two Notes, insert the following new Note: \n \n \n3. \nReceipt of a request for any optional facility not specified above and not implemented shall result in the connection being cleared, indicating diagnostic code 65 (facility code not allowed). \n26. \nPage 61, Section 2.2.7.5.2.3, 2nd paragraph.  In the 1st sentence, delete the words \"facility registration protocols (if used)\". \n27.",
    "27. \nPage 65, Table 2-4.  In the 1st column, 3rd row (including header) starting with \"Any packet, except...\", \ndelete the words \", REGISTRATION (if supported)\". \n28. \nPage 65, Table 2-4.  In the 1st column, 5th row (including header) starting with \"RESTART REQUEST, \nRESTART CONFIRMATION...\", delete entire entry and replace with the following: \n \nRESTART REQUEST or RESTART CONFIRMATION Packet with a Logical Channel identifier not = 0. \n \n29.",
    "RESTART REQUEST or RESTART CONFIRMATION Packet with a Logical Channel identifier not = 0. \n \n29. \nPage 65, Table 2-4.  In the 3rd (\"r2\") column, 7th row (including header) starting with \"Packets \nhaving a Packet Type Identifier shorter than...\",  following the existing entries, add \"(See Note 3)\". \n30. \nPage 65, Table 2-4.  In the 4th (\"r3\") column, 10th row (including header) starting with \"RESTART",
    "Page 65, Table 2-4.  In the 4th (\"r3\") column, 10th row (including header) starting with \"RESTART \nREQUEST OR RESTART CONFIRMATION Packet... \",  following the existing entries, add \"(See Note 3)\". \n31. \nPage 65, Table 2-4.  In the 1st column, 10th row (including header; last row on the page), change \"OR\" to \n\"or\" (lower case). \n32. \nPage 66, Table 2-4 (continued).  Delete the 2\nnd and 3\nrd rows, both starting with \"REGISTRATION \nREQUEST Packets...\". \n33.",
    "nd and 3\nrd rows, both starting with \"REGISTRATION \nREQUEST Packets...\". \n33. \nPage 66, Table 2-4 (continued).  In the 3rd (\"r2\") column of the last row (identified in the left column as \n\"Call Setup, Call Clearing, DATA...\"), following the existing entries, add \"(See Note 3)\". \n34. \nPage 66, in the Notes.  Delete the text of Note 1 in its entirety, and replace with the following: \n \nNOTES: \n1.",
    "NOTES: \n1. \nThe AES Subnetwork has no restart states.  Receipt of a RESTART REQUEST causes the DCE to respond with a RESTART CONFIRMATION.  The RESTART REQUEST packet is forwarded to the SSNIW, which responds by executing a connection release procedure for each VC associated with the DTE/DCE interface (reference Figure 2-2). This is the equivalent of the originating DTE separately issuing a CLEAR REQUEST for each VC; i.e., the equivalent of a RESTART REQUEST. \n35.",
    "35. \nPage 66, in the Notes.  Delete the text of Note 2 in its entirety, and replace with \"(Reserved)\". \n36. \nPage 66, in the Notes.  Delete the text of Note 5 in its entirety, and replace with the following: \n \n \n5. \nThe DCE, upon entering the r3 state, checks for the completion of r2 processing.  If the",
    "r3 state is entered via the r2 state, the DCE discards the received packet and indicates a restart by transmitting to the DTE a RESTART INDICATION, with the cause \"Local procedure error\" and the appropriate diagnostic code.  If the r3 state is not entered via the r2 state, the DCE performs all of the actions normally performed when entering r2 and issues a RESTART INDICATION to the DTE, and sends a RESTART REQUEST to the SSNIW. \n37.",
    "37. \nPage 67, Table 2-5.  In the 1st column, 4th row  (starting with \"RESTART REQUEST OR RESTART \nCONFIRMATION Packet...\") delete the existing entry in its entirety and replace with: RESTART REQUEST or RESTART CONFIRMATION Packet with Logical Channel Identifier not = 0. \n38. \nPage 69, Table 2-6.  In 1st column, 4th row, delete the existing entry in its entirety and replace with: \n \nRESTART REQUEST or RESTART CONFIRMATION Packet with Logical Channel Identifier not = 0. \n39.",
    "RESTART REQUEST or RESTART CONFIRMATION Packet with Logical Channel Identifier not = 0. \n39. \nPage 69, Table 2-6.  Delete the last row (starting with \"REJECT...\") in its entirety. \n \n \n40. \nPages 71-72, Table 2-8.  Make the following changes to the lower (\"g1\" & \"g2\") half of Table 2-8 and its notes: \n \na. In the \"DCE FLOW CONTROL TRANSFER STATES\" header column, delete \"(See Notes 1, 3 \nand 4)\" in its entirety and replace with: \n \n \n(See Notes 1, 2 and 3)",
    "and 4)\" in its entirety and replace with: \n \n \n(See Notes 1, 2 and 3) \n \nb. In the 2nd row,  delete the entry \"RR, RNR, or REJECT...\" in its entirety and replace with: \n \n \nRR or RNR packet with an invalid PR \n \nc. Delete the entire 5th row (beginning with \"REJECT packet with a valid PR (optional)\"). \n41. \nPage 72, in the Notes to Table 2-8, make the following changes: \n \na. In Note 1.  Delete the comma following \"RR\"; insert the word \"and\"; and delete the subsequent",
    "a. In Note 1.  Delete the comma following \"RR\"; insert the word \"and\"; and delete the subsequent \nwords \"*, and REJECT*\". b. In Note 5.  Delete the word \"octal\" and replace with \"octet\". \nc. In Note 6, 5th line.  After the opening parenthesis, delete the symbol \"#\" that immediately \nprecedes the number \"0\". \n \nd. In Note 7, 1st line.  Delete the comma following \"RR\"; insert the word \"or\"; and delete the",
    "d. In Note 7, 1st line.  Delete the comma following \"RR\"; insert the word \"or\"; and delete the \nsubsequent words \"*or REJECT*\". e. In Note 7, last line.  Change \"*Note 5*\" to read \"*Note 4*\". \n42. \nPage 78, in Section 2.2.8.1.  At the end of the 2nd paragraph, in the parenthetical reference, delete \n\"2.2.4.2.8\" and replace with \"2.2.2\". \n \n43. \nPage 117, in Section 2.4.4.1.  Delete Item i. in its entirety, and replace with the following: \n \ni.",
    "i. \nTest Frequencies - Unless otherwise specified, the following tests shall be conducted at the following frequencies: \n \nTest Frequency  \n \n    Receive    \n \n   Transmit \n \nLower Band-Edge \n \n1530.5  MHz \n \n1632.0  MHz \n \n \nMid-Band \n \n \n1544.5  MHz \n \n1646.0  MHz \n \n \nUpper Band-Edge \n \n1558.5  MHz \n \n1660.0  MHz \n44. \nPage 142, in Section 2.4.4.3.6.  Delete Steps 4 through 8 in their entirety, and replace with the following: \n \nStep 4.",
    "Step 4. \nTurn on the first channel unit again so that both units are operating.  This establishes an operating condition with two active transmit carriers operating at maximum output power, each 3 dB below the maximum single carrier output power.  Use the spectrum analyzer to measure the intermodulation products resulting from the two signals with the measured single carrier power level as a reference. Step 5.",
    "Repeat Steps 1 through 4 for reduced commanded output levels in 5 dB steps to 15 dB below maximum allowable output. Step 6. \nRepeat Steps 1 through 5 for channel frequency separations of 100 kHz and 10 kHz and \nat the other transmit test frequencies specified in Section 2.4.4.1, Item i., at all three \nfrequency separations. Step 7.",
    "frequency separations. Step 7. \nRepeat Steps 1 through 5 with one carrier tuned to 1660.4 MHz and the other carrier tuned to the lowest frequency that can be transmitted within the constraint of Section 2.2.4.2.6 for simultaneously operating RF carriers. Step 8. \nRepeat Steps 1 through 4 with a carrier spacing that would exceed the spacing between simultaneously operating RF carriers defined in Section 2.2.4.2.6.  Verify that the \ntransceiver meets the requirement. \n45.",
    "transceiver meets the requirement. \n45. \nPage 168, in the Section 2.4.6.3 header.  Delete the parenthetical reference \"(Section 2.2.6)\" and replace with \"(Section 2.2.6-A-5.6.2)\". \n46. \nPage 196.  Immediately preceding Section 2.4.7.3.4, add a new Section 2.4.7.3.3.6 as follows: \n \n2.4.7.3.3.6 \nResponse to Requests for Non-Supported Facilities",
    "2.4.7.3.3.6 \nResponse to Requests for Non-Supported Facilities \n \n \nThis test verifies the transceiver's ability to clear a call request containing an ISO 8208 optional facility that is not supported by the transceiver. \nStep 1 - Call Request from the Test Set",
    "Step 1 - Call Request from the Test Set \n \n \nProgram the test set to send a CALL REQUEST Packet to the transceiver with the Facility Code field encoded for a facility code that is not supported by the transceiver, with the Facility Parameter field encoded as appropriate for the selected facility. \nStep 2 - Virtual Call cleared by transceiver",
    "Step 2 - Virtual Call cleared by transceiver \n \n \nUse the test set to verify that the transceiver clears the Virtual Call by sending a CLEAR CONFIRMATION Packet with a diagnostic code 65 (facility code not allowed). \n47. \nPage 200, Section 2.4.7.4.  In the header and in the 1st sentence of text, delete \"Section 2.2.7.5.3\" and \nreplace with \"Section 2.2.7.6\". \n48. \nPage 200, Section 2.4.8.  Under \"Measurement Procedure\", in the 3rd paragraph of text, 2nd line, delete",
    "'Document \"B\", V1.20' and replace with: \n \nDocument \"D\" Annex 1 Section 10. \n49. \nPage 201, in Section 2.4.8.  In the list of references under \"Reference Document \"D\" Annex 1 Section 6\", add \"1.22\" (under the \"Version\" column) in the row \"6.3.2.2  CM111 Test Cases\". \n50. \nPage 202, in Section 2.4.8.  Immediately before the entry for \"10.1\", delete the row starting with \"6.3.2.2\".  (This row is a duplicate and out-of-sequence instance of the entry referencing 6.3.2.2.) \n51.",
    "51. \nPage 202, in Section 2.4.8.  In the list of references under \"Reference Document \"D\" Annex 1 Section 6\", segregate the nine line entries beginning with \"10.1\" through \"10.3.2.1\", and precede them with their own underlined sub-title \"\nReference Document \"D\" Annex 1 Section 10:\".  (Use vertical leading \nconsistent with that done elsewhere for such reference lists in this section.) \n52.",
    "consistent with that done elsewhere for such reference lists in this section.) \n52. \nPage 202, in Section 2.4.8.  In the listing subtitled \"Reference Document \"D\" Annex 2 Section 5\", underline the sub-title, and change \"Annex 2\" to \"Annex 3\". \n53. \nPage 203, in Section 2.4.8.  In the caption for Table 2-20, delete the parenthetical phrase, \"(9.6 kbps Vocoder)\". \n54. \nPage 214, in Section 3.4.5.  Delete the underlines from the hyphens in line 3.3  \"Log-On\" and line 3.4  \"P- Channel\". \n \n \n55.",
    "55. \nPage 219, in the membership list.  Correct the misalignments in the two instances of \"CTA, Inc.\" (for T. Dehel). \n56. \nAppendix C (indicated pages).  Make the following changes: \n \na. Page 1.  For the \"PERFORMANCE\" column reference to \"2.2.1\", delete the \"VERIFICATION\" \ncolumn references and replace with \"2.4.5, 2.4.7.3.3.5, 2.4.8.1\". \n \nb. Page 1.  For the \"PERFORMANCE\" column reference to \"2.2.2\", change the \"VERIFICATION\" \nreference from \"2.4.8.1\" to \"2.4.4.3.8\".",
    "reference from \"2.4.8.1\" to \"2.4.4.3.8\". \n \nc. Page 1.  For the \"PERFORMANCE\" column reference to \"2.2.2.1\", delete \"2.4.8.1\" from the \n\"VERIFICATION\" column. \n \nd. Page 3.  For the \"PERFORMANCE\" column reference to \"2.2.4.2.4\", add \"2.4.4.3.4\" in the \n\"VERIFICATION\" column. \n \ne. Page 3.  For the \"PERFORMANCE\" column reference to \"2.4.4.3.4\", delete the entire row. \n \nf.",
    "e. Page 3.  For the \"PERFORMANCE\" column reference to \"2.4.4.3.4\", delete the entire row. \n \nf. \nPage 5.  For the \"PERFORMANCE\" column reference to \"2.2.6-A-5.6.2\", add \"2.4.6.3\" as an additional \"VERIFICATION\" reference. \n \ng. Page 9. For the \"PERFORMANCE\" column reference to \"2.2.7.5.2.1\", add \"Tested throughout 2.4.7, \nincluding 2.4.7.3.2.1, 2.4.7.3.2.2, 2.4.7.3.3.1, 2.4.7.3.3.2, 2.4.7.3.3.3, 2.4.7.3.3.4\" in the \"VERIFICATION\" column.",
    "h. Page 10.  For the \"PERFORMANCE\" column, delete the entry \"2.2.7.5.3\" and replace with \"2.2.7.6\". \n \ni. \nPage 11.  For the \"PERFORMANCE\" column reference to \"2.2.8.1\", add \"2.4.8.1\" in the \"VERIFICATION\" column. \n57. \nAt end of the DO-210D document, insert a new Appendix D, as attached hereto. 58. \nAt end of the DO-210D document, insert a new Appendix E, as attached hereto. \n \n \nA P P E N D I X  D",
    "A P P E N D I X  D \nRecommendations for Non-Safety SATCOM Systems This Page Intentionally Left Blank Recommendations for Non-Safety SATCOM Systems",
    "This appendix provides guidance on the applicability of the MOPS requirements to AMSS avionics equipment that do not provide AMS(R)S (safety services). This is intended to include all avionics equipment that provide only non-safety AMSS services, whether via satellite systems otherwise in compliance with these MOPS or not.  Even though such avionics equipment might not utilize the RF or electrical signal characteristics and functionality required by these MOPS, the necessity of protecting other",
    "signal characteristics and functionality required by these MOPS, the necessity of protecting other CNS systems on-board the same aircraft and within the same airspace, as well as the possible provision of AMS(R)S by terminals operating within the same satellite subnetwork, make it desirable that all non-safety-only AMSS equipment be held to a subset of the minimum standards established for AMS(R)S. Table D-1 specifies which sections of the MOPS should apply to non-safety-only AMSS avionics",
    "Table D-1 specifies which sections of the MOPS should apply to non-safety-only AMSS avionics equipment. Sections are not listed beyond the fifth level of numbering (lower-level sections have been deleted for brevity).  In cases where a higher-level requirement applies to non-safety AMSS, it is to be understood that all lower-level unlisted requirements also apply to non-safety AMSS; conversely, where a higher-level requirement does not apply to non-safety AMSS, then it is to be understood that",
    "a higher-level requirement does not apply to non-safety AMSS, then it is to be understood that no lower-level unlisted requirements apply.  In cases where some lower-level requirements apply to non-safety AMSS and some do not, those which do apply are explicitly listed, and those which do not apply are omitted for brevity. Manufacturers of non-safety AMSS equipment are urged to consider all of the antenna (Section 2.2.3), receiver (Section 2.2.4.1) and transmitter (Section 2.2.4.2) requirements",
    "antenna (Section 2.2.3), receiver (Section 2.2.4.1) and transmitter (Section 2.2.4.2) requirements as guidance in their design.",
    "PROVIDE NO SAFETY SERVICES MOPS Section",
    "MOPS Section Title \nApply \nto \nNon-Safety AMSS Comments \n1.0 \nPURPOSE AND SCOPE  \nN/A \nSection 1 contains no requirements \nN/A \nSections containing no requirements are listed as not applicable (\"N/A\") \n2.0 \nEQUIPMENT PERFORMANCE REQUIREMENTS AND TEST PROCEDURES \n2.1 \nGeneral Requirements \nN/A \n \n2.1.1 \nAirworthiness \nYES \n \n2.1.2 \nIntended Function \nYES \n \n2.1.3 \nFederal Communications Commissions Rules \nYES \n \n2.1.4 \nFire Protection \nYES \n \n2.1.5 \nOperation of Controls \nYES \n \n2.1.6",
    "YES \n \n2.1.4 \nFire Protection \nYES \n \n2.1.5 \nOperation of Controls \nYES \n \n2.1.6 \nAccessibility of Controls \nYES \n \n2.1.7 \nEffects of Tests \nYES \n \n2.2 \nEquipment Performance Requirements - Standard Conditions \nN/A \n \n2.2.3 \nAntenna Subsystem Requirements \nN/A \n \n2.2.3.1 \nGeneral \nN/A \n \n2.2.3.13 \nRadiated Antenna Intermodulation Products \nYES \n \n2.2.4 \nSatellite Subnetwork Physical Layer Requirements \nN/A MOPS Section MOPS Section Title \nApply \nto \nNon-Safety AMSS Comments \n2.2.4.2",
    "N/A MOPS Section MOPS Section Title \nApply \nto \nNon-Safety AMSS Comments \n2.2.4.2 \nTransmitter Requirements \nN/A \n \n2.2.4.2.5 \nHarmonics, Discrete Spurious and Noise Density \nYES \n \n2.2.4.2.6 \nIntermodulation Products \nYES \n \n2.2.4.2.7 \nCarrier Off Level \nYES \n \n2.3 \nEquipment Performance - Environmental Conditions \nYES \nThe sections marked \"YES\" above that appear in Table 2-15 should meet DO- 160C \nrequirements \nto \nensure \nthat",
    "requirements \nto \nensure \nthat \ninterference to safety services do not occur under the specified environmental conditions. \n2.3.1 \nGeneral Requirements \nYES \n \n2.3.2 \nEquipment Configurations \nYES \n \n2.3.3 \nConfiguration Control \nYES \n \n2.3.4 \nSpecific Environmental Test Conditions \nYES \n \n2.4 \nEquipment Performance Verification Procedures \nPARTIAL \nReference Appendix C for the sections marked \"YES\" above for applicable subsections of Section 2.4. \n3.0 \nINSTALLED EQUIPMENT PERFORMANCE \nN/A",
    "3.0 \nINSTALLED EQUIPMENT PERFORMANCE \nN/A \n \n3.1 \nEquipment Installation \nN/A \n \n3.1.2 \nAircraft Environment \nYES \n \n3.1.5 \nFailure Protection \nYES \n \n3.1.6 \nInterface Interference Effects \nYES \n \n3.1.7 \nAircraft Power Source \nYES \n \n3.2 \nInstalled Equipment Performance Requirements \nYES \nFor the Radiated Antenna Intermodulation Products \nin \nAMS(R)S \nBands, \nthe \nrequirements should apply with the AMSS-only equipment as the source and the AMS(R)S system as the victim.  The",
    "complementary requirement need not apply. \n3.3 \nConditions of Test \nYES \n \n3.3.1 \nPower Input \nYES \n \n3.3.2 \nEnvironment \nYES \n \n3.3.3 \nAdjustment of Equipment \nYES \n \n3.3.4 \nWarm-up Period \nYES \n \n3.4 \nTest Procedures for Installed Equipment Performance \nYES \n \n3.4.1 \nConformity Inspection \nYES \n \n3.4.2 \nInterference Tests \nYES",
    "A P P E N D I X  E",
    "Diplexer Historical Development and Performance Characteristics This Page Intentionally Left Blank Diplexer Historical Development and Performance Characteristics The transmitter Harmonics, Spurious, and Noise (HSN) and the Intermodulation (IM) Product requirements in Section 2.2.4.2.5 and Section 2.2.4.2.6 of this MOPS are predicated on performance characteristics of the transmit filter in the diplexer that is used in the ARINC Characteristic 741 AES system configuration and the HSN and IM",
    "diplexer that is used in the ARINC Characteristic 741 AES system configuration and the HSN and IM levels allowed to be generated in the signal generation and amplification processes. Since the first versions of DO-210 and ARINC Characteristic 741, several different diplexer specifications have been developed.  There are currently four versions of diplexer filter specifications which were pertinent to the deliberations of SC-165 WG-1 and the AEEC Air/Ground Communications Systems (AGCS)",
    "pertinent to the deliberations of SC-165 WG-1 and the AEEC Air/Ground Communications Systems (AGCS) Subcommittee.  These are known as \"Type A\", \"Modified Type A\", \"Type B\" and \"Type C\" (previously called by the nickname \"Jane\"). These different diplexer designs were developed to meet changing requirements to protect services outside the Inmarsat SATCOM transmit band, 1626.5 to 1660.5 MHz.  The services to be protected have included GPS, GLONASS, Radio Astronomy, and Iridium. The original",
    "The services to be protected have included GPS, GLONASS, Radio Astronomy, and Iridium. The original diplexer design was the Type A model and it offered sufficient protection only to GPS.  The Modified Type A diplexer design was developed to give more protection to GLONASS as well as protecting GPS. At about the same time that the Modified Type A diplexer specification was being developed, there was concern about protection for the TFTS system.  TFTS operates in the spectrum above the SATCOM",
    "was concern about protection for the TFTS system.  TFTS operates in the spectrum above the SATCOM transmit band.  The \"Type B\" diplexer design specification was developed for ARINC Characteristic 741 to offer protection to GPS, GLONASS and TFTS.  The \"Type B\" diplexer specifications were not involved in derivation of the specifications in the MOPS. The \"Type C\" diplexer specification was developed to provide additional protection for AMS(R)S services operating in the 1610 MHz to 1626.5 MHz",
    "to provide additional protection for AMS(R)S services operating in the 1610 MHz to 1626.5 MHz bands.  It does not address TFTS.  In particular it was developed to provide an additional 10 dB of protection for the Iridium system at 1624.5 MHz.  Along with the \"Type C\" diplexer design, a pre-HPA filter was designed to further reduce the broadband noise and spurious signals in the Iridium frequency band generated prior to the HPA in the AES system. The Type A and modified Type A diplexers are",
    "band generated prior to the HPA in the AES system. The Type A and modified Type A diplexers are currently available.  The Type A diplexer is by far the more prevalent in aircraft installations.  The \"Type B\" diplexer, the pre-HPA filter, and the \"Type C\" diplexer have not been commercially developed or qualified.  It is expected that these devices will not be qualified until after the ongoing deliberations within the ITU and ETSI have been completed. The \"Type C\" diplexer can be used in",
    "deliberations within the ITU and ETSI have been completed. The \"Type C\" diplexer can be used in conjunction with the pre-HPA filter to provide additional HSN outof-band filtering.  The pre-HPA filter does not provide significant additional attenuation of any intermodulation products because those products primarily originate in the HPA which follows the pre- HPA filter in the system configuration. The development of characteristics of the \"Type C\" diplexer took due account of ITU Study Group 8",
    "The development of characteristics of the \"Type C\" diplexer took due account of ITU Study Group 8 activity post WRC2000.  The applicability of this diplexer, and whether it is needed to adequately protect all NGSS systems below 1626.5 MHz, is currently unknown. The following Type A and Modified Type A diplexer characteristics are taken from ARINC Characteristic 741 Part 1 Supplement 10, Section 2.2.4.3.  The HSN and IM characteristics of the other AES",
    "transceiver system components (i.e., SDU/RFU), as taken from ARINC Characteristic 741 Part 1, follow the diplexer characteristics tables. \nType A Diplexer - For Protection of GPS Only \n \nTransmit Port-to-Antenna Port The path from the transmit port to the antenna port should have the following characteristics: \n \nFrequency (MHz) \n \nRejection \n \n      0.0 to 1525.0 \n \n>   80  dB \n \n1525.0 to 1559.0 \n \n> 120  dB \n \n1559.0 to 1565.0 \n \n>   80  dB \n \n1565.0 to 1585.0 \n \n> 100  dB",
    "1525.0 to 1559.0 \n \n> 120  dB \n \n1559.0 to 1565.0 \n \n>   80  dB \n \n1565.0 to 1585.0 \n \n> 100  dB \n \n1585.0 to 1605.0 \n \n>   50  dB \n \n1605.0 to 1610.0 \n \n>   30  dB \n \n1610.0 to 1626.5 \n \nDecreases \n \n1626.5 to 1660.5 \n \nInsertion loss < 0.8  dB \n \n1660.5 to 1735.0 \n \nIncreases \n \n1735.0 to 12000 .0 \n \n>   50  dB \n \n12000.0 to 18000.0 \n \n>   15  dB \n \nModified Type A Diplexer - For Protection of GPS and GLONASS Transmit Port-to-Antenna Port",
    "Modified Type A Diplexer - For Protection of GPS and GLONASS Transmit Port-to-Antenna Port \nThe path from the transmit port to the antenna port should have the following characteristics: \n \nFrequency (MHz) \n \nRejection \n \n      0.0 to 1525.0 \n \n>   80  dB \n \n1525.0 to 1559.0 \n \n> 120  dB \n \n1559.0 to 1585.0 \n \n> 100  dB \n \n1585.0 to 1605.0 \n \n>   88  dB \n \n1605.0 to 1610.0 \n \n>   62  dB \n \n1610.0 to 1614.0 \n \n>   40  dB \n \n1614.0 to 1626.5 \n \nDecreases \n \n1626.5 to 1631.5",
    "1610.0 to 1614.0 \n \n>   40  dB \n \n1614.0 to 1626.5 \n \nDecreases \n \n1626.5 to 1631.5 \n \nInsertion loss < 2.3  dB \n \n1631.5 to 1660.5 \n \nInsertion loss < 0.8  dB \n \n1660.5 to 1735.0 \n \nIncreases \n \n1735.0 to 12000 .0 \n \n>   50  dB \n \n12000.0 to 18000.0 \n \n>   15  dB \nType \"Type C\" Diplexer - For Protection of GNSS and Iridium \n \nTransmit Port-to-Antenna Port \nFrequency (MHz) \n \nRejection \n \n      0.0 to 1525.0 \n \n>   80  dB \n \n1525.0 to 1559.0 \n \n> 120  dB \n \n1559.0 to 1585.0 \n \n> 100  dB",
    ">   80  dB \n \n1525.0 to 1559.0 \n \n> 120  dB \n \n1559.0 to 1585.0 \n \n> 100  dB \n \n1585.0 to 1610.0 \n \n>   88  dB \n \n1610.0 to 1614.0 \n \n>   70  dB \n \n1614.0 to 1624.5 \n \n>   10  dB \n \n1624.5 to 1631.5 \n \nDecreases \n \n1631.5 to 1640.0 \n \nInsertion loss < 1.3  dB \n \n1640.0 to 1658.0 \n \nInsertion loss < 0.8  dB \n \n1658.0 to 1660.5 \n \nInsertion loss < 0.9  dB \n \n1660.5 to 1670.0 \n \nIncreases \n \n1670.0 to 1700.0 \n \n>   10  dB \n \n1700.0 to 1735.0 \n \n>   40  dB \n \n1735.0 to 12000 .0 \n \n>   50  dB",
    ">   10  dB \n \n1700.0 to 1735.0 \n \n>   40  dB \n \n1735.0 to 12000 .0 \n \n>   50  dB \n \n12000.0 to 18000.0 \n \n>   15  dB \n \nPre-HPA Filter - For Reduction of Spurious and Noise \n \n \nFrequency (MHz) \n \nRejection \n \n      0.0 to 1610.0 \n \nNot defined \n \n1610.0 to 1614.0 \n \n>     5  dB \n \n1614.0 to 1626.5 \n \n>   10  dB \n \n1626.5 to 1631.5 \n \nDecreases \n \n1631.5 to 1660.5 \n \nDon't care \n \n1660.5 to 1665.0 \n \nIncreases \n \n1665.0 to 1670.0 \n \n>     5  dB \n \n1670.0 to 1700.0 \n \n>   15  dB",
    "Increases \n \n1665.0 to 1670.0 \n \n>     5  dB \n \n1670.0 to 1700.0 \n \n>   15  dB \n \n1700.0 to 18000 .0 \n \nNot defined \n \nTransmitter Output Characteristics The system RF characteristics are determined by both the diplexer transmit filter and the HSN and IM generated prior to the diplexer in the transmit RF chain. \nFrom ARINC Characteristic 741, Part 1, Section 2.2.5.1: \n \nHarmonics, Discrete Spurious and Noise \n \nFrequency (MHz) \n \nPower Density \n \n \n0.0 to 1525.0 \n \n \n-55  dBc/ 4 kHz",
    "Frequency (MHz) \n \nPower Density \n \n \n0.0 to 1525.0 \n \n \n-55  dBc/ 4 kHz \n \n \n1525.0 to 1559.0 \n \n-83  dBc/ 4 kHz \n \n \n1559.0 to 1614.0 \n \n-55  dBc/ 1 MHz \n \n \n1614.0 to 1660.0 \n \n-55  dBc/ 4 kHz* \n \n \n1660.0 to 1670.0 \n \n-55  dBc/ 20 kHz \n \n \n1670.0 to 1675.0 \n \n-55  dBc/ 1 MHz \n \n \n1675.0 to 18000  \n-55  dBc/ 4 kHz \n \n* \nExcluding the carrier frequency ±35 kHz. HPA IM levels taken from the table in ARINC Characteristic 741, Part 1, Section 2.2.5 for a Linear Type \n2 HPA:",
    "2 HPA: \n \n \nIM Product Level Limits \nOrder",
    "IM Level \n \n3rd \n\n\n-25  dBc \n \n5th \n\n\n-25  dBc \n \n7th (carriers spaced 13.5 to 14.5 kHz) \n \n-30  dBc \n \n7th (carriers spaced less than13.5 kHz) \n \n-33  dBc \n \nGreater than 7th and less than 12 GHz \n \n-35  dBc \n \nGreater than 7th and from 12 to 18 GHz \n \n-70  dBc \nExamples HSN Example \n\n\nModified \n\nType A \nFrequency (MHz) \n HPA Output \n \nDiplexer \n       MOPS \n \n1559 to 1585 \n \n-55  dBc/MHz \n \n 100  dB \n-155 dBc/MHz \nIM Example - 3rd Order \n\n\nModified",
    "Modified \n\nType A \nFrequency (MHz) \nHPA Output \n \nDiplexer \n  MOPS \n1610 to 1614 \n \n  -25  dBc \n \n  40  dB  \n-64  dBc \nIM Example - 7th  Order (Carriers Spaced less than 13.5 kHz) \n\n\nModified \n\nType A \nFrequency (MHz) \nHPA Output \n \nDiplexer \n MOPS  \n1610 to 1614 \n \n  -33  dBc \n \n  40  dB  \n-72  dBc Note that the IM limits in DO-210D give 1 dB margin compared to the ARINC Characteristic 741 HPA and diplexer values."
  ]
}