{
  "source": "RTCA DO-228.md",
  "chunks": [
    "RTCA, Incorporated\n1140 Connecticut Avenue, NW, Suite 1020\nWashington, DC  20036\n\n# Minimum Operational Performance Standards For Global Navigation Satellite System (Gnss) Airborne Antenna Equipment\n\nCopies of this document may be obtained from RTCA, Incorporated\n1140 Connecticut Avenue, NW, Suite 1020\nWashington, DC  20036-4001  USA\ntelephone: 202-833-9339\nfacsimile: 202-833-9434\nPlease contact RTCA for price and ordering information.\n\n## Foreword",
    "This document was prepared by RTCA Special Committee 159 (SC-159) and approved by the RTCA Technical Management Committee on October 20, 1995. RTCA, Inc.,  is a not-for-profit corporation formed to advance the art and science of aviation and aviation electronic systems for the benefit of the public.  The organization functions as a Federal Advisory Committee and develops consensus based recommendations on contemporary aviation issues.  RTCA's objectives include but are not limited to:",
    "! \ncoalescing aviation system user and provider technical requirements in a manner that helps government and industry meet their mutual objectives and responsibilities;\n! \nanalyzing and recommending solutions to the system technical issues that aviation faces as it continues to pursue increased safety, system capacity and efficiency;\n!",
    "! \ndeveloping consensus on the application of pertinent technology to fulfill user and provider requirements, including development of minimum operational performance standards for electronic systems and equipment that support aviation; and\n! \nassisting in developing the appropriate technical material upon which positions for the International Civil Aviation Organization and the International Telecommunication Union and other appropriate international organizations can be based.",
    "The organization's recommendations are often used as the basis for government and private sector decisions as well as the foundation for many Federal Aviation Administration Technical Standard Orders. Since RTCA is not an official agency of the United States Government, its recommendations may not be regarded as statements of official government policy unless so enunciated by the U. S. government organization or agency having statutory jurisdiction over any matters to which the recommendations",
    "organization or agency having statutory jurisdiction over any matters to which the recommendations relate.",
    "2.4.2.4 Gain Test (Section 2.2.1.4) .................................................................23\n2.4.2.5 Axial Ratio Test (Section 2.2.1.5) .......................................................24 2.4.2.6 Polarization Test (Section 2.2.1.6) .....................................................24\n2.4.3 GNSS Antenna - With Preamplifier (optional tests) ..........................................25\n2.4.3.1 RF Gain and Noise Figure Test (Section 2.2.2.1).................................25",
    "2.4.3.2 Preamplifier Gain Compression Test (Section 2.2.2.2).........................26 2.4.3.3 Preamplifier Stability Test (Section 2.2.2.3).........................................26 2.4.3.4 Preamplifier Selectivity Test (Section 2.2.2.4) .....................................27 2.4.3.5 Burnout Protection Test (Section 2.2.2.5)...........................................28 2.4.3.6 Pulse Power Operation Test (Section 2.2.2.6) .....................................29",
    "3.0 INSTALLED EQUIPMENT PERFORMANCE .................................................................33\n4.0 EQUIPMENT OPERATIONAL PERFORMANCE CHARACTERISTICS........................35\nMembership...............................................................................................................................37",
    "## 1.0 Purpose And Scope 1.1 Introduction",
    "This document contains minimum operational performance standards (MOPS) for GNSS airborne antenna equipment designed to use GPS or GLONASS augmented by other systems/equipment/techniques as appropriate to meet the performance requirements for primary means of navigation for en route, terminal, non-precision, and precision approach phases of flight. The airborne navigation system can be used as a primary means navigation system in an aircraft when approved and an operational GNSS navigation",
    "a primary means navigation system in an aircraft when approved and an operational GNSS navigation satellite system is available.  Incorporated within these standards are equipment characteristics that should be useful to users, designers, manufacturers, and installers of the equipment.",
    "This document defines the antenna performance for antennas that will be used with GNSS receiver equipment. Section 1.0 of this document provides information and assumptions needed to understand the rationale for equipment characteristics and requirements stated in the remaining sections.  It describes typical equipment applications and operational goals, and forms the basis for the standards stated in Sections 2.0 through 4.0. Section 2.0 contains the minimum performance standards for the",
    "stated in Sections 2.0 through 4.0. Section 2.0 contains the minimum performance standards for the equipment.  These standards define required performance under standard operating conditions and stressed physical environmental conditions.  It also details the recommended bench test procedures necessary to demonstrate compliance. Section 3.0 describes the performance required of the installed equipment.  Tests for the installed equipment are included when performance cannot be adequately",
    "equipment.  Tests for the installed equipment are included when performance cannot be adequately determined through bench testing. Section 4.0 describes the operational characteristics for equipment installations, and defines conditions that will assure the operator that operations can be conducted safely and reliably in the expected operational environment. Compliance with these standards by manufacturers, installers, and users is recommended as one means of assuring that the equipment will",
    "installers, and users is recommended as one means of assuring that the equipment will satisfactorily perform its intended function(s) under conditions normally encountered in routine aeronautical operations. The word \"equipment\" as used in this document includes all components or units necessary (as determined by the equipment manufacturer or installer) for the equipment to properly perform its intended function.",
    "It is recognized that any regulatory application of these standards is the responsibility of appropriate government agencies.\n\nInasmuch as the measured values of equipment performance characteristics may be a function of the measurement method, standard test conditions and methods of test are recommended in this document.\n\n## 1.2 System Characteristics",
    "The GNSS is a world-wide position, velocity, and time determination system that includes one or more satellite constellations, receivers, and system integrity monitoring, augmented as necessary to support the required navigation performance for the actual phase of operation.  The GNSS includes ground control and monitoring stations, satellites, and avionics including antenna(s), and currently consists of the United States Global Positioning System (GPS) and the Russian Federation Global",
    "consists of the United States Global Positioning System (GPS) and the Russian Federation Global Orbiting Navigation Satellite System (GLONASS).",
    "## 1.3 Operational Applications\n\nThe GNSS antenna equipment is intended to be used in all phases of aircraft operation, including on the surface, approach and landing, departure, terminal, and en route.\n\n## 1.4 Operational Goals",
    "## 1.4 Operational Goals\n\nThe operational goal for the GNSS antenna is to provide adequate GNSS satellite signals under a wide range of environmental conditions and installations that will assure safe flight operations.  The requirements of this document provide the minimum requirements for antennas designed for GNSS service and employing either passive or active designs. \n\n## 1.5 Assumptions",
    "## 1.5 Assumptions\n\nIt is assumed that the GNSS antenna will be used with GNSS receiver equipment defined in appropriate MOPS.\n\n## 1.6 Test Procedures",
    "The test procedures specified in this document are intended to be used as one means of demonstrating compliance with the performance requirements.  Although specific test procedures are cited, it is recognized that other methods may be preferred.  These alternate procedures may be used if they provide at least equivalent information.  In such cases, the procedures cited herein should be used as one criterion in evaluating the acceptability of the alternate procedures. The order of tests",
    "as one criterion in evaluating the acceptability of the alternate procedures. The order of tests specified suggests that the antenna be subjected to a succession of tests as it moves from design, and design qualification, into operational use.  For example, compliance with the requirements of Section 2.0 shall have been demonstrated as a precondition to satisfactory completion of the installed systems tests of section 3.0. Four types of test procedures are specified.  These include:",
    "a.\nEnvironmental Tests",
    "Environmental test requirements are specified in Section 2.3.  The procedures and their associated limit requirements are intended to provide a laboratory means of determining the electrical and mechanical performance of the antenna under environmental conditions expected to be encountered in actual operations. Unless otherwise specified, the environmental conditions and test procedures contained in RTCA/DO-160C, Environmental Conditions and Test Procedures for Airborne Equipment, will be used",
    "in RTCA/DO-160C, Environmental Conditions and Test Procedures for Airborne Equipment, will be used to demonstrate antenna compliance.",
    "b.\nBench Tests\nBench Test procedures are specified in Section 2.4.  These tests provide a laboratory means of demonstrating compliance with the requirements of Section 2.2.  Test results may be used by antenna manufacturers as design guidance, for monitoring compliance, and, in certain cases, for obtaining formal approval of antenna design.",
    "c.\nInstalled Equipment Tests",
    "The installed equipment test procedures and their associated limits are specified in Section 3.0.  Although bench and environmental test procedures are not included in the installed antenna tests, their successful completion is precondition a to completion of the installed tests.  In certain instances, however, installed antenna tests may be used in lieu of bench test simulation of such factors as power supply characteristics, interference from, or to, other antenna installed on the aircraft,",
    "as power supply characteristics, interference from, or to, other antenna installed on the aircraft, etc.  Installed tests are normally performed under two conditions:",
    "(1) With the aircraft on the ground and using simulated or operational system\ninputs.\n(2) With the aircraft in flight using operational system inputs appropriate to the\nantenna under test.\nTest results may be used to demonstrate functional performance in the intended operational environment.\n\n## D. Operational Tests",
    "## D. Operational Tests\n\nThe operational tests are specified in Section 4.0.  These test procedures and their associated limits are intended to be conducted by operating personnel as one means of ensuring that the equipment is functioning properly, and can be reliably used for its intended function(s).\n\n## 1.7 Definition Of Terms",
    "| Axial Ratio                                                        | The ratio of the major axis to the minor axis of the polarization   |\n|--------------------------------------------------------------------|---------------------------------------------------------------------|\n| ellipse.                                                           |                                                                     |",
    "| dBic                                                               | dB relative to an isotropic antenna with circular polarization      |\n| dBm                                                                | dB relative to one milliwatt.                                       |\n| VSWR                                                               | Voltage Standing Wave Ratio.                                        |",
    "| Elevation Angle                                                    | The angle between the axis of the measurement line and the          |\n| installed antenna horizontal plane.                                |                                                                     |\n| Polarization                                                       | That property of a radiated electromagnetic wave describing the     |",
    "| time-varying direction and amplitude of the electric field vector; |                                                                     |\n| specifically, the figure traced as a function of time by the       |                                                                     |\n| extremity of the vector at a fixed location in space, as observed  |                                                                     |",
    "| along the direction of propagation.                                |                                                                     |",
    "## 2.0 Equipment Performance Requirements And Test Procedures 2.1 General Requirements 2.1.1 Airworthiness\n\nThe design, manufacture, and installation of the antenna shall not impair the airworthiness of the aircraft.\n\n## 2.1.2 Intended Function\n\nThe antenna shall perform its intended function(s), as defined by the manufacturer, and its proper use shall not create a hazard to other users of the National Airspace System.\n\n## 2.1.3 Federal Communications Commission Rules",
    "## 2.1.3 Federal Communications Commission Rules\n\nAll equipment shall comply with the applicable rules of the Federal Communications Commission.\n\n## 2.1.4 Fire Protection\n\nAll materials used shall be self-extinguishing except for small parts (e.g. seals, grommets) that would not contribute significantly to the propagation of a fire.\n\nNOTE:\nOne means of showing compliance is contained in Federal Aviation Regulations (FAR), Part 25, Appendix F.\n\n## 2.1.5 Effects Of A Test",
    "## 2.1.5 Effects Of A Test\n\nThe antenna shall be designed so that the application of specified test procedures shall not be detrimental to equipment performance following the application of these tests, except as specifically allowed.\n\n## 2.2 Equipment Performance Standard Conditions\n\nEquipment performance is specified for two different antenna configurations: a passive antenna and an antenna integrated with a preamplifier.  These two configurations are illustrated in Figure 2-1.",
    "## 2.2.1 Gnss Antenna - Passive\n\nThe output of the passive antenna is the antenna port (point A in Figure 2-1).\n\n## 2.2.1.1 Gps Operating Frequency\n\nThe antenna shall operate over the minimum frequency range of 1575.42 MHz +10 MHz.  The gain shall not vary more than 3 dB over the frequency range.\n\n## 2.2.1.2 Glonass Operating Frequency (Optional)\n\nThe antenna shall operate over the minimum frequency range of 1597 to 1605 MHz. The gain shall not vary more than 3 dB over the frequency range.",
    "NOTE: GLONASS satellites may operate between 1597 and 1610 MHz between the years 1998 and 2005.  Up to 1998, GLONASS may also have satellites operating between 1613.8 and 1616 MHz.\n\n## 2.2.1.3 Passive Antenna Vswr And Impedance\n\nThe VSWR for a dry antenna shall not exceed 1.5:1 over the operating frequency range when interfaced with a nominal 50 ohm impedance transmission line.\n\nThe VSWR for an antenna exposed to rain, or an ice accumulation of 0.5 inches, shall not exceed 2.0:1.",
    "## 2.2.1.4 Antenna Gain\n\nThe minimum gain shall not be less than the following for the specified elevation angle, at the operating frequency, above the horizon at any azimuth:\n\n| Elevation Angle    | Minimum Gain   |\n|--------------------|----------------|\n| >15 degrees        | -2 dBic        |\n| 10 degrees         | -3 dBic        |\n| 5 degrees          | -4.5 dBic      |\n| 0 degrees          | -7.5 dBic      |",
    "The maximum gain shall not exceed -2 dBic at 0 degrees elevation angle and 7 dBic above 5 degrees. The gain of an antenna exposed to rain, or an ice accumulation of 0.5 inches, shall not exceed an average gain-loss of 4.5 dB from dry conditions when measured at an angle of 30 degrees above the horizon. The antenna gain shall not vary more than 1 dB over the full temperature range for which the antenna is specified.\n\n## 2.2.1.5 Axial Ratio",
    "## 2.2.1.5 Axial Ratio\n\nThe Axial Ratio shall not exceed 3.0 dB for all operating frequencies at elevation angles greater than 10 degrees, nor exceed 6 dB for all operating frequencies at elevation angles between 5 and 10 degrees.\n\n## 2.2.1.6 Polarization\n\nThe polarization shall be nominally right-hand (clockwise) circularly polarized.\n\n## 2.2.2 Gnss Antenna - With Integrated Preamplifier (Optional)",
    "## 2.2.2 Gnss Antenna - With Integrated Preamplifier (Optional)\n\nThe GNSS antenna, as defined in Section 2.2.1 above, integrated with a preamplifier, as illustrated in Figure 2-1, includes the antenna, cabling between the antenna and preamplifier, burnout protection, selective filtering, and a low-noise-amplifier (LNA).\n\nNOTE:\nThese preamplifier requirements are defined for GPS only.  The requirements for GLONASS are under study.\n\n## 2.2.2.1 Preamplifier Gain And Noise Figure",
    "## 2.2.2.1 Preamplifier Gain And Noise Figure\n\nThe preamplifier shall provide additional gain of 26.5 dB, minimum, to that specified in Section 2.2.1.4, with a maximum 4 dB noise figure, including all circuitry in the integrated antenna/preamplifier.  This additional gain is applicable to points A and B in Figure 2-1, and does not include cabling between the preamplifier and the GNSS receiver at point C.",
    "NOTE:\n No maximum gain is specified.  Thus, the total gain of the preamplifier and GNSS receiver combination may be installation dependent.\n\n## 2.2.2.2 Preamplifier Gain Compression",
    "## 2.2.2.2 Preamplifier Gain Compression\n\nThe preamplifier shall have a 1 dB gain compression point not less than the values shown in Figure 2-2 defined at the antenna port.  The CW interference levels below\n1500 MHz increases linearly to 25.5 dBm at 1315 MHz, and above 1640 MHz, the levels increase linearly to 21.5 dBm at 2 GHz, accounting for High Intensity Radiation Fields (HIRF).\n\n## 2.2.2.3 Preamplifier Stability",
    "## 2.2.2.3 Preamplifier Stability\n\nThe preamplifier shall be unconditionally stable for any source or load impedance.\n\n## 2.2.2.4 Preamplifier Selectivity\n\nThe preamplifier with antenna shall have the frequency selectivity specified in Figure 2-3.\n\n## 2.2.2.5 Burnout Protection\n\nThe preamplifier shall withstand a CW input carrier of 30 dBm without damage.\n\n## 2.2.2.6 Pulse Power Operation",
    "## 2.2.2.6 Pulse Power Operation\n\nThe antenna preamplifier shall resume normal operation within 10 Fs of the trailing edge of a pulse with a width of up to 1 ms, a peak power of 30 dBm, and a duty cycle of 10%.\n\n## 2.3 Equipment Performance - Environmental Conditions",
    "The environmental tests and performance requirements described in this subsection are intended to provide a laboratory means of determining the overall performance characteristics of the antenna under conditions representative of those that may be encountered in actual operations. Some of the environmental tests contained in this subsection need not be performed unless the manufacturer wishes to qualify the equipment for that particular environmental condition. These tests are identified by the",
    "the equipment for that particular environmental condition. These tests are identified by the phrase \"When Required.\" If the manufacturer wishes to qualify the equipment to these additional environmental conditions, then these \"When Required\" tests shall be performed. Unless otherwise specified, the test procedures applicable to a determination of antenna performance under environmental test conditions are set forth in RTCA Document DO-160C, Environmental Conditions and Test Procedures for",
    "conditions are set forth in RTCA Document DO-160C, Environmental Conditions and Test Procedures for Airborne Equipment.  General information on the use of DO-160C is contained in Sections 1.0 through 3.0 of that document.  Also, a method of identifying which environmental tests are conducted and other amplifying information on the conduct of the tests is contained in Appendix A of DO-160C. Some of the performance requirements in Section 2.2 are not required to be tested to all of the conditions",
    "the performance requirements in Section 2.2 are not required to be tested to all of the conditions contained in RTCA/DO-160C. If judgment and experience indicate that these particular performance parameters are not susceptible to certain environmental conditions, and that the level of performance specified in Section 2.2 will not be measurably degraded by exposure to these particular environmental conditions, such tests may be omitted. In addition to the exceptions above, certain environmental",
    "conditions, such tests may be omitted. In addition to the exceptions above, certain environmental tests contained in this section are not required for minimum performance equipment unless the manufacturer wishes to qualify the antenna for additional environmental conditions.  If the manufacturer wishes to qualify the antenna to these additional conditions, then these tests shall be performed.",
    "## 2.3.1 Specific Environmental Test Conditions\n\nThe equipment shall be subjected to the test conditions as specified in RTCA/DO- 160C as indicated below.  Categories are for locations external to the aircraft.",
    "|                                                                      | RTCA/DO-160C Section           | Category   |\n|----------------------------------------------------------------------|--------------------------------|------------|\n| 4                                                                    | Temperature and Altitude       | D2         |\n| 5                                                                    | Temperature Variation          | A          |",
    "| 6                                                                    | Humidity                       | B          |\n| 8                                                                    | Vibration                      | C          |\n| 9                                                                    | Explosion                      | E          |\n| 10                                                                   | Waterproofness                 | S          |",
    "| 11                                                                   | Fluids (1)                     | F          |\n| 12                                                                   | Sand and Dust                  | D          |\n| 13                                                                   | Fungus                         | F          |\n| 14                                                                   | Salt Spray                     | S          |",
    "| 15                                                                   | Magnetic Effect                | A or B     |\n| 16                                                                   | Power Input                    | A          |\n| 17                                                                   | Voltage Spike                  | A          |\n| 19                                                                   | Induced Signal Susceptibility  | Z          |",
    "| 20                                                                   | Radio Frequency Susceptibility | W          |\n| 21                                                                   | Spurious Radio Frequencies     | Z          |\n| 22                                                                   | Lightning Induced Effects      | L          |\n| 23                                                                   | Lightning Direct Effects       | 2A         |",
    "| 24                                                                   | Icing (2)                      | C          |\n| NOTES:                                                               |                                |            |\n| 1. Fluid susceptibility for solvents, cleaning, and de-icing fluids. |                                |            |",
    "2. The antenna requires operation with an ice coating of 0.5 inches.\n\n## 2.3.2 Temperature And Altitude Tests (Do-160C, Section 4.0)\n\nRTCA/DO-160C contains several temperature and altitude test procedures that are specified according to the category specified in the preceding Section 2.3.1. The following Sections contain the applicable test conditions specified in Section 4.0 of DO-160C.\n\n## 2.3.2.1 Low Operating Temperature Test",
    "## 2.3.2.1 Low Operating Temperature Test\n\nThe equipment shall be subjected to the test conditions as specified in RTCA/DO- 160C, Section 4.5.1, and the following requirements of this standard shall be met:",
    "1.\nSection 2.2.1.1 - GPS Operating Frequency\n2.\nSection 2.2.1.2 - GLONASS Operating Frequency (optional)   \n3.\nSection 2.2.1.3 - Passive Antenna VSWR and Impedance (optional)\n4.\nSection 2.2.1.4 - Antenna Gain\n5.\nSection 2.2.2.1 - Carrier and Noise (optional)\n6.\nSection 2.2.2.2 - Preamplifier Gain (optional)\n\n## 2.3.2.2 High Short-Time Operating Temperature Test",
    "## 2.3.2.2 High Short-Time Operating Temperature Test\n\nThe equipment shall be subjected to the test conditions as specified in RTCA/DO- 160C, Section 4.5.2, and the following requirements of this standard shall be met:",
    "1.\nSection 2.2.1.1 - GPS Operating Frequency\n2.\nSection 2.2.1.2 - GLONASS Operating Frequency (optional)   \n3.\nSection 2.2.1.3 - Passive Antenna VSWR and Impedance (optional)\n4.\nSection 2.2.1.4 - Antenna Gain\n5.\nSection 2.2.2.1 - Carrier and Noise (optional)\n6.\nSection 2.2.2.2 - Preamplifier Gain (optional)\n2.3.2.3\nHigh Operating Temperature Test\nThe equipment shall be subjected to the test conditions as specified in RTCA/DO-",
    "The equipment shall be subjected to the test conditions as specified in RTCA/DO-\n160C, Section 4.5.3, and the following requirements of this standard shall be met:",
    "1.\nSection 2.2.1.1 - GPS Operating Frequency\n2.\nSection 2.2.1.2 - GLONASS Operating Frequency (optional)   \n3.\nSection 2.2.1.3 - Passive Antenna VSWR and Impedance (optional)\n4.\nSection 2.2.1.4 - Antenna Gain\n5.\nSection 2.2.2.1 - Carrier and Noise (optional)\n6.\nSection 2.2.2.2 - Preamplifier Gain (optional)\n7.\nSection 2.2.2.4 - Burnout Protection\n8.\nSection 2.2.2.5 - Pulse Protection and Recovery Time\n\n## 2.3.2.4 Altitude Test",
    "## 2.3.2.4 Altitude Test\n\nThe equipment shall be subjected to the test conditions as specified in RTCA/DO- 160C, Section 4.6.1, and the following requirements of this standard shall be met:",
    "1.\nSection 2.2.1.3 - Passive Antenna VSWR and Impedance (optional)\n2.\nSection 2.2.1.4 - Antenna Gain\n3.\nSection 2.2.2.2 - Preamplifier Gain (optional)\n2.3.3\nTemperature Variation Test (DO-160C, Section 5.0)\nThe equipment shall be subjected to the test conditions as specified in RTCA/DO- 160C, Section 5.0, and the following requirements of this standard shall be met:\n\n1.\nSection 2.2.1.3 - Passive Antenna VSWR and Impedance (optional)\n2.\nSection 2.2.2.2 - Preamplifier Gain (optional)",
    "## 2.3.4 Humidity Test (Do-160C, Section 6.0)\n\nThe equipment shall be subjected to the test conditions as specified in RTCA/DO- 160C, Section 6.0, and the following requirements of this standard shall be met:\n\n1.\nSection 2.2.1.3 - Passive Antenna VSWR and Impedance (optional)\n2.\nSection 2.2.2.2 - Preamplifier Gain (optional)\n\n## 2.3.5 Shock Tests (Do-160C, Section 7.0) 2.3.5.1 Operational Shocks",
    "## 2.3.5 Shock Tests (Do-160C, Section 7.0) 2.3.5.1 Operational Shocks\n\nThe equipment shall be subjected to the test conditions as specified in RTCA/DO- 160C, Section 7.2, and the following requirements of this standard shall be met:",
    "1.\nSection 2.2.1.3 - Passive Antenna VSWR and Impedance (optional)\n2.\nSection 2.2.2.2 - Preamplifier Gain (optional)\nThe equipment shall be subjected to the test conditions as specified in RTCA/DO- 160C, Section 7.2, and shall meet the requirements specified therein.\n\n## 2.3.5.2 Crash Safety Shocks",
    "## 2.3.5.2 Crash Safety Shocks\n\nThe application of Crash Safety Shock tests may result in damage to the antenna under test.  Therefore this test may be conducted after the other tests have been completed.  In this case, Section 2.1.9 \"Effects of Test\" does not apply.\n\n## 2.3.6 Vibration Test (Do-160C, Section 8.0)\n\nThe equipment shall be subjected to the test conditions as specified in RTCA/DO- 160C, Section 8.0, and the following requirements of this standard shall be met:",
    "1.\nSection 2.2.1.3 - Passive Antenna VSWR and Impedance (optional)\n2.\nSection 2.2.2.2 - Preamplifier Gain (optional)\n2.3.7 \nExplosion Test (DO-160C, Section 9.0) (When Required)\nThe equipment shall be subjected to the test conditions as specified in RTCA/DO- 160C, Section 9.0. During these tests, the equipment shall not cause detonation of the explosive mixture within the test chamber.\n\n## 2.3.8 Waterproofness Tests (Do-160C, Section 10.0) 2.3.8.1 Drip Proof Test (When Required)",
    "## 2.3.8 Waterproofness Tests (Do-160C, Section 10.0) 2.3.8.1 Drip Proof Test (When Required)\n\nThe equipment shall be subjected to the test conditions as specified in RTCA/DO- 160C, Section 10.3.1, and the following requirements of this standard shall be met:\n\n1.\nSection 2.2.1.3 - Passive Antenna VSWR and Impedance (optional)\n2.\nSection 2.2.2.2 - Preamplifier Gain (optional)\n\n## 2.3.8.2 Spray Proof Test (When Required)",
    "## 2.3.8.2 Spray Proof Test (When Required)\n\nThe equipment shall be subjected to the test conditions as specified in RTCA/DO- 160C, Section 10.3.2, and the following requirements of this standard shall be met:\n\nNOTE:\n      This test shall be conducted with the spray directed perpendicular to\n      the most vulnerable area(s) as determined by the equipment\n      manufacturer.\n\n1.\nSection 2.2.1.3 - Passive Antenna VSWR and Impedance (Optional)\n2.\nSection 2.2.2.2 - Preamplifier Gain (optional)",
    "## 2.3.8.3 Continuous Stream Proof Test (When Required)\n\nThe equipment shall be subjected to the test conditions as specified in RTCA/DO- 160C, Section 10.3.3, and the following requirements of this standard shall be met:\n\n1.\nSection 2.2.1.3 - Passive Antenna VSWR and Impedance (optional)\n2.\nSection 2.2.2.2 - Preamplifier Gain (optional)\nNOTE: This test shall be conducted with the spray directed perpendicular to the most vulnerable area(s) as determined by the equipment manufacturer.",
    "## 2.3.9 Fluids Susceptibility Tests (Do-160C, Section 11.0)\n\nThe following sections contain the applicable test conditions specified in Section 11.0 of DO-160C.\n\n## 2.3.9.1 Spray Test\n\nThe equipment shall be subjected to the test conditions as specified in RTCA/DO- 160C, Section 11.4.1, and the following requirements of this standard shall be met:",
    "1.\nAt the end of the 24-hour exposure period, the equipment shall operate at a level of performance that indicates that no significant failures of\ncomponents or circuitry have occurred.\n2.\nFollowing the 2 hour operational period at ambient temperature, after the 160-hour exposure period at elevated temperature, the following requirements of this standard shall be met:\n1.\nSection 2.2.1.3 - Passive Antenna VSWR and Impedance (optional)\n2.\nSection 2.2.1.4 - Antenna Gain\n3.",
    "2.\nSection 2.2.1.4 - Antenna Gain\n3.\nSection 2.2.2.2 - Preamplifier Gain (optional)",
    "## 2.3.9.2 Immersion Test (When Required)\n\nThe equipment shall be subjected to the test conditions as specified in RTCA/DO- 160C, Section 11.4.2, and the following requirements of this standard shall be met:",
    "1.\nAt the end of the 24-hour immersion period, the equipment shall operate at\na level of performance that indicates that no significant failures of components or circuitry have occurred.\n2.\nFollowing the 2-hour operational period at ambient temperature, after the 160-hour exposure period at elevated temperature, the following requirements of this standard shall be met: 1.\nSection 2.2.1.3 - Passive Antenna VSWR and Impedance (optional)\n2.\nSection 2.2.1.4 - Antenna Gain\n3.",
    "2.\nSection 2.2.1.4 - Antenna Gain\n3.\nSection 2.2.2.2 - Preamplifier Gain (optional)",
    "## 2.3.10 Sand And Dust Test (Do-160C, Section 12.0) (When Required)\n\nThe equipment shall be subjected to the test conditions as specified in RTCA/DO- 160C, Section 12.0, and the following requirements of this standard shall be met:",
    "1.\nSection 2.2.1.3 - Passive Antenna VSWR and Impedance (optional)\n2.\nSection 2.2.1.4 - Antenna Gain\n3.\nSection 2.2.2.2 - Preamplifier Gain (optional)\n2.3.11\nFungus Resistance Test (DO-160C, Section 13.0) (When Required)\nThe equipment shall be subjected to the test conditions as specified in RTCA/DO- 160C, Section 13.0, and the following requirements of this standard shall be met:",
    "1.\nSection 2.2.1.3 - Passive Antenna VSWR and Impedance (optional)\n2.\nSection 2.2.1.4 - Antenna Gain\n3.\nSection 2.2.2.2 - Preamplifier Gain (optional)\n\n## 2.3.12 Salt Spray Test (Do-160C, Section 14.0) (When Required)\n\nThe equipment shall be subjected to the test conditions as specified in RTCA/DO- 160C, Section 14.0, and the following requirements of this standard shall be met:",
    "1.\nSection 2.2.1.3 - Passive Antenna VSWR and Impedance (optional)\n2.\nSection 2.2.1.4 - Antenna Gain\n3.\nSection 2.2.2.2 - Preamplifier Gain (optional)\n\n## 2.3.13 Magnetic Effect Test (Do-160C, Section 15.0)\n\nThe equipment shall be subjected to the test conditions as specified in RTCA/DO- 160C, Section 15.0, and the equipment shall meet the requirements of the appropriate instrument or equipment class specified therein.",
    "## 2.3.14 Power Input Tests (Do-160C, Section 16.0) 2.3.14.1 Normal Operating Conditions\n\nThe equipment shall be subjected to the test conditions as specified in RTCA/DO- 160C, Sections 16.5.1 and 16.5.2, as appropriate, and the following requirements of this standard shall be met:\n\n1.\nSection 2.2.2.2 - Preamplifier Gain (optional)\n\n## 2.3.14.2 Abnormal Operating Conditions",
    "## 2.3.14.2 Abnormal Operating Conditions\n\nThe application of the low voltage conditions (DC) (Category B equipment) test may result in damage to the equipment under test. Therefore, this test may be conducted after the other tests have been completed. Section 2.1.9, \"Effects of Test,\" does not apply. The equipment shall be subjected to the test conditions as specified in RTCA/DO- 160C, Sections 16.5.3 and 16.5.4, as appropriate, and the following requirements of this standard shall be met:",
    "1.\nSection 2.2.2.2 - Preamplifier Gain (optional)\n\n## 2.3.15 Voltage Spike Conducted Test (Do-160C, Section 17.0)\n\nThe following Sections contain the applicable test conditions specified in Section 17.0 of RTCA/DO-160C.\n\n## 2.3.15.1 Category A Requirements (If Applicable)\n\nThe equipment shall be subjected to the test conditions as specified in RTCA/DO- 160C, Section 17.3, and the following requirements of this standard shall be met:\n\n1.\nSection 2.2.2.2 - Preamplifier Gain (optional)",
    "1.\nSection 2.2.2.2 - Preamplifier Gain (optional)\n\n## 2.3.15.2 Category B Requirements (If Applicable)\n\nThe equipment shall be subjected to the test conditions as specified in RTCA/DO- 160C, Section 17.4.1, \"Intermittent Transients\" and Section 17.4.2, \"Repetitive Transients,\" and the following requirements of this standard shall be met:\n\n1.\nSection 2.2.2.2 - Preamplifier Gain (optional)\n\n## 2.3.16 Audio Frequency Conducted Susceptibility Test (Do-160C, Section 18.0)",
    "## 2.3.16 Audio Frequency Conducted Susceptibility Test (Do-160C, Section 18.0)\n\nThe equipment shall be subjected to the test conditions as specified in RTCA/DO- 160C, Section 18.0, and the following requirements of this standard shall be met:\n\n1.\nSection 2.2.2.2 - Preamplifier Gain (optional)\n\n## 2.3.17 Induced Signal Susceptibility Test (Do-160C, Section 19.0)",
    "## 2.3.17 Induced Signal Susceptibility Test (Do-160C, Section 19.0)\n\nThe equipment shall be subjected to the test conditions as specified in RTCA/DO- 160C, Section 19.0, and the following requirements of this standard shall be met:\n\n1.\nSection 2.2.2.2 - Preamplifier Gain (optional)\n\n## 2.3.18 Radio Frequency Susceptibility Test (Radiated And Conducted) (Do-160C, Section 20.0)",
    "## 2.3.18 Radio Frequency Susceptibility Test (Radiated And Conducted) (Do-160C, Section 20.0)\n\nThe equipment shall be subjected to the test conditions as specified in RTCA/DO- 160C, Section 20.0, and the following requirements of this standard shall be met:\n\n1.\nSection 2.2.2.2 - Preamplifier Gain (optional)\n\n## 2.3.19 Emission Of Radio Frequency Energy Test (Do-160C, Section 21.0)",
    "## 2.3.19 Emission Of Radio Frequency Energy Test (Do-160C, Section 21.0)\n\nWhen the equipment is subjected to the test conditions as specified in RTCA/DO- 160C, Section 21.0, it shall meet the requirements specified therein.\n\n## 2.3.20 Lightning Induced Transient Susceptibility (Do-160C, Section 22.O)\n\nThe equipment shall be subjected to the test conditions as specified in RTCA/DO- 160C, Section 22.0, and the following requirements of this standard shall be met:",
    "1.\nSection 2.2.1.3 - Passive Antenna VSWR and Impedance (optional)\n2.\nSection 2.2.1.4 - Antenna Gain\n3.\nSection 2.2.2.2 - Preamplifier Gain (optional)\n2.3.21\nLightning Direct Effects (DO-160C, Section 23.0)\nWhen the equipment is subjected to the test conditions as specified in RTCA/DO- 160C, Section 23.0, it shall meet the requirements specified therein.\n\n## 2.3.22 Icing (Do-160C, Section 24.0)",
    "## 2.3.22 Icing (Do-160C, Section 24.0)\n\nThe equipment shall be subjected to the test conditions as specified in RTCA/DO- 160C, Section 24.0, and the following requirements of this standard shall be met:\n\n1.\nSection 2.2.1.3 - Passive Antenna VSWR and Impedance (optional)\n2.\nSection 2.2.1.4 - Antenna Gain\n\n## 2.4 Equipment Test Procedures",
    "The test procedures in this section constitute a satisfactory method of determining that the GNSS antenna meets the required performance stated in Section 2. Although specific test procedures are cited, it is recognized that other methods may be preferred.  Such alternative methods may be used if the manufacturer can demonstrate equivalent test procedures.  In this case, the test procedures cited herein must be used as one set of criteria in evaluating the acceptability of the alternate",
    "cited herein must be used as one set of criteria in evaluating the acceptability of the alternate procedures. Table 2-4 indicates the correspondence between the equipment performance requirements in Section 2.2 and the tests in this section.",
    "|  Requirement         |         Subject               |      Tests   |\n|----------------------|-------------------------------|--------------|\n| 2.2.1.1              | GPS Operating Frequency       | 2.4.2.1      |\n| 2.2.1.2              | GLONASS Operating             |              |\n| Frequency (Optional) |                               |              |\n| 2.4.2.2              |                               |              |",
    "| 2.4.2.2              |                               |              |\n| 2.2.1.3              | VSWR and Impedance            | 2.4.2.3      |\n| 2.2.1.4              | Gain                          | 2.4.2.4      |\n| 2.2.1.4.1            | Frequency Stability           | 2.4.2.4      |\n| 2.2.1.4.2            | Frequency Selectivity         | 2.4.2.4      |\n| 2.2.1.5              | Axial Ratio                   | 2.4.2.5      |",
    "| 2.2.1.5              | Axial Ratio                   | 2.4.2.5      |\n| 2.2.1 6              | Polarization                  | 2.4.2.6      |\n| 2.2.2.1              | Carrier and Noise (optional)  | 2.4.3.1      |\n| 2.2.2.2              | Preamplifier Gain (optional)  | 2.4.3.2      |\n| 2.2.2.3              | Preamplifier Stability        |              |\n| (optional)           |                               |              |",
    "| (optional)           |                               |              |\n| 2.4.3.3              |                               |              |\n| 2.2.2.4              | Preamplifier Selectivity      |              |\n| (optional)           |                               |              |\n| 2.4.3.4              |                               |              |\n| 2.2.2.5              | Burnout Protection (optional) | 2.4.3.5      |",
    "| 2.2.2.5              | Burnout Protection (optional) | 2.4.3.5      |\n| 2.2.2.6              | Pulse Power Protection        |              |\n| (optional)           |                               |              |\n| 2.4.3.6              |                               |              |",
    "## 2.4.1 Test Conditions\n\nThe following tests conditions are applicable to the tests specified in this document:\n\n## 2.4.1.1 Power Input Voltage\n\nUnless otherwise specified, all tests shall be conducted with the input voltage adjusted to design voltage \"2%.\n\n## 2.4.1.2 Power Frequency\n\nIn the case of equipment designed for operation from an AC power source of essentially constant frequency (e.g. 400 Hz), the input frequency shall be adjusted to design frequency \"2%.",
    "## 2.4.1.3 Antenna Installation\n\nThe antenna test installation shall include any adapter plates, where used, or other hardware used to interface the antenna to the fuselage.  The Antenna Subsystem under test shall include any electronics considered part of the installed Antenna Subsystem.  If a radome forms part of the antenna, this shall also be installed during the measurements.\n\n## 2.4.1.4 Ambient Conditions",
    "## 2.4.1.4 Ambient Conditions\n\nUnless otherwise specified, all tests shall be conducted under conditions of ambient room temperature, pressure, and humidity.\n\n## 2.4.1.5 Warm-Up Period\n\nUnless otherwise specified, all tests shall be conducted after the manufacturer's specified warm-up period.\n\n## 2.4.1.6 Connected Loads\n\nUnless otherwise specified, all tests shall be performed with the equipment connected to loads having the impedance values for which it was designed.",
    "## 2.4.1.7 Antenna Ground Plane\n\nAn antenna ground plane shall be used to simulate  the conductive mounting surface on the intended aircraft.  The ground plane shall be flat and extend at least\n3λ at the test frequency beyond any active portion of the antenna under test, and extend beyond any radome used.\n\n## 2.4.1.8 Antenna Measurement Range",
    "Testing shall be performed in accordance with the Institute of Electrical and Electronic Engineers (IEEE) Standard Test Procedures for Antennas, IEEE-STD- 149-1979 .  A suitable test range shall be used having a reflectivity level less than -25 dB within a quiet zone containing the antenna under test and the ground plane, and meet the 2D2/λ criterion.  Figure 2-4 shows a representative test configuration for the test range.  \"Compact ranges\" and/or near-field probing techniques may also be",
    "for the test range.  \"Compact ranges\" and/or near-field probing techniques may also be employed if analysis shows that an equivalent accuracy may be obtained. Other items of standard test equipment are:",
    "Range instrumentation including a 2-axis (minimum) positioner, positioner controller, L-band transmitter, receiver, pattern recorder, and polarization measurement instrumentation. Reference RHCP or linearly-polarized, standard-gain antenna, with gain calibration traceable to National Institute for Standards and Technology (NIST), or other national standards. Antenna test set providing power and, if necessary, other signals to the antenna such that it can operate normally.",
    "For an antenna that is purely passive, there is no requirement for an antenna test set and associated electronics.\n\n## 2.4.1.9 Test Frequencies\n\nAntenna Subsystem measurements shall be performed at a minimum of six frequencies to include:\n\n| Test Frequency      | Receive     |\n|---------------------|-------------|\n| GPS Lower Band-edge | 1565.42 MHz |\n| GPS Mid-Band        | 1575.42 MHz |\n| GPS Upper Band-edge | 1585.42 MHz |\n\nNOTE:\nFrequency accuracy shall be within +/- 0.5 MHz.",
    "NOTE:\nFrequency accuracy shall be within +/- 0.5 MHz.\n\n## 2.4.2 Gnss Antenna - Passive 2.4.2.1 Gps Operating Frequencies (Section 2.2.1.1)\n\nAntenna measurements in Sections 2.4.2.3, 2.4.2.4, 2.4.2.5, and 2.4.2.6 shall use the frequencies defined in 2.4.1.9.\n\n## 2.4.2.2 Glonass Operating Frequencies (Optional Section 2.2.1.2)",
    "## 2.4.2.2 Glonass Operating Frequencies (Optional Section 2.2.1.2)\n\nIf the antenna is designed to work with GLONASS, then in addition to the requirement of Section 2.4.2.1, antenna measurements in Sections 2.4.2.3, 2.4.2.4 2.4.2.5, and 2.4.2.6  shall be conducted with the following frequencies:  1597, 1601, and 1605 MHz.\n\n## 2.4.2.3 Passive Antenna Vswr And Impedance Test (Section 2.2.1.3)",
    "Equipment Required: Ground Plane - refer to Section 2.4.1.7. Automatic Network Analyzer (Hewlett-Packard 8753, 8720, 8510, or equivalent). Antenna Test Set (needed for Active Antenna only). Measurement Requirements: Connect the equipment as shown in Figure 2-5.  For all antennas, measure the VSWR at the RF port of the antenna subsystem in an anechoic chamber or reflectionless environment. GAIN - Section 2.2.1.4 AXIAL RATIO - Section 2.2.1.5 POLARIZATION - Section 2.2.1.6",
    "## 2.4.2.4 Gain Test (Section 2.2.1.4)",
    "Equipment Required: Antenna Measurement Range - refer to Section 2.4.1.8. Ground Plane - refer to Section 2.4.1.7. Automatic Network Analyzer (Hewlett-Packard 8753, 8720, 8510, or equivalent). Antenna Test Set (needed for Active Antenna only). Gain Standard Antenna, RHCP source antenna. Measurement Requirements: Connect the equipment as shown in Figure 2-4.  Measure the antenna gain, per IEEE Standard 149-1979, for azimuth angles of 0, 90, 180 and 270 degrees, and elevation angles of 0, 5, 10,",
    "149-1979, for azimuth angles of 0, 90, 180 and 270 degrees, and elevation angles of 0, 5, 10, 15, 30, 60 and 90 degrees.  Check that for all combinations of azimuth and elevation angles, the antenna meets the requirements of Section 2.2.1.4.  Measure the gain at the frequencies defined in Section 2.4.1.9.",
    "## 2.4.2.5 Axial Ratio Test (Section 2.2.1.5)\n\nEquipment Required: Antenna Measurement Range - refer to Section 2.4.1.8. Antenna Ground Plane - refer to Section 2.4.1.7. Automatic Network Analyzer (Hewlett-Packard 8753, 8720, 8510, or equivalent). Antenna Test Set (needed for Active Antenna only). Transmit polarization positioner, or RHCP and LHCP gain standards.",
    "Measurement Requirements:\nConnect the equipment as shown in Figure 2-4A. Measure the axial ratio, per IEEE Standard 149-1979, for each of the points designated during the tests in Section 2.4.2.4 for elevation angles defined in Section 2.2.1.5, and the axial ratio at the frequencies defined in Section 2.4.1.9.\n\n## 2.4.2.6 Polarization Test (Section 2.2.1.6)\n\nEquipment Required: Antenna Measurement Range - refer to Section 2.4.1.8.\n\nAntenna Ground Plane - refer to Section 2.4.1.7.",
    "Gain Standard RHCP antenna - refer to Section 2.4.1.8. Gain Standard LHCP antenna Automatic Network Analyzer (Hewlett-Packard 8753, 8720, 8510, or equivalent). Antenna Test Set (needed for Active Antenna only). Measurement Requirements: Connect the equipment as shown in Figure 2-4.  Using the Gain Standard RHCP and Gain Standard LHCP antennas, verify the antenna under test meets the requirements as defined in Section 2.2.1.6 at the frequencies defined in Section 2.4.1.9.  The antenna under test",
    "defined in Section 2.2.1.6 at the frequencies defined in Section 2.4.1.9.  The antenna under test is RHCP if the received signals are significantly greater when using the Gain Standard RHCP source antenna when compared to the Gain Standard LHCP antenna.  Other methods of determining polarization sense of an unknown antenna are discussed in IEEE Standard 149-1979.",
    "## 2.4.3 Gnss Antenna - With Preamplifier (Optional Tests)\n\nFor the tests required by Sections 2.4.3.1, 2.4.3.2, 2.4.3.3, 2.4.3.4, and 2.4.3.5 the preamplifier input shall be separated from the antenna element.  Proper care shall be taken so that the performance of the preamplifier shall not be changed.\n\n## 2.4.3.1 Rf Gain And Noise Figure Test (Section 2.2.2.1)",
    "## 2.4.3.1 Rf Gain And Noise Figure Test (Section 2.2.2.1)\n\nEquipment Required: Antenna Test Set (to provide power as required by the manufacturer to the preamplifier). Automatic Network Analyzer (Hewlett-Packard 8753, 8720, 8510, or equivalent). Automatic Noise Figure Meter (Hewlett-Packard 8970A or equivalent)\nMeasurement Requirements:\nAny loss in the RF cables connecting the antenna and the test equipment shall be properly taken into account.\n\nRF Gain:",
    "RF Gain:\n\n1.\nConnect the RF output of the network analyzer to the preamplifier input.\n2.\nConnect the preamplifier output to the network analyzer input.\n3.\nSet the network analyzer to sweep from 1565.42 MHz to 1585.42 MHz, and set the output level to -30dBm.\n4.\nVerify that the gain is at least 26.5 dB over the entire swept frequency band.\nNoise Figure Test:",
    "1.\nConnect the RF output of the noise figure meter to the preamplifier input.\n2.\nConnect the preamplifier output to the noise figure meter input.\n3.\nVerify that the noise figure is no more than 4 dB over the frequency band of 1565.42 MHz to 1585.42 MHz.\n\n## 2.4.3.2 Preamplifier Gain Compression Test (Section 2.2.2.2)",
    "## 2.4.3.2 Preamplifier Gain Compression Test (Section 2.2.2.2)\n\nEquipment Required: Antenna Test Set (to provide power as required by the manufacturer to the preamplifier) Two Synthesized Signal Generators (Hewlett-Packard 8662A or equivalent)\nTwo-Way Power Splitter/Combiner (Mini-Circuits ZSC-2-1 or equivalent)\nRF Spectrum Analyzer (Hewlett-Packard 8568B or equivalent)\nMeasurement Requirements:",
    "1.\nConnect each of the signal generators to the power splitter/combiner.\n2.\nConnect the output of the power splitter/combiner to the preamplifier.\n3.\nConnect the output of the preamplifier to the spectrum analyzer.\n4.\nAdjust the signal generator frequencies and levels to produce the signals as\na function of frequency as described in Figure 2-2.\n5.\nVerify that the output signal meets the specifications as stated in Section 2.2.2.2\n\n## 2.4.3.3 Preamplifier Stability Test (Section 2.2.2.3)",
    "## 2.4.3.3 Preamplifier Stability Test (Section 2.2.2.3)\n\nEquipment Required:\nSpectrum Analyzer (Hewlett-Packard 8568B, or equivalent).\n\nAntenna Test Set. Antenna Test Set (to provide power as required by the manufacturer to the preamplifier). 50 Ohm RF Terminator. Bridge-T.\n\n## Measurement Requirements:\n\nThe stability of the amplifier shall be tested in 7 steps:",
    "1.\nConnect the preamplifier output to the spectrum analyzer.  Set the spectrum\nanalyzer to measure signals at least as low as -110 dBm,  and with as wide\na frequency range as practical.\n2.\nConnect the preamplifier input to a 50 ohm terminator.\n3.\nApply power to the preamplifier and verify that the preamplifier does not generate any detectable signals.\n4.\nRemove the RF terminator from the preamplifier input. Verify that the preamplifier does not generate any detectable signals.\n5.",
    "5.\nApply a short across the preamplifier input. Verify that the preamplifier does not generate any detectable signals.\n6.\nConnect the preamplifier input to the spectrum analyzer.  Set the spectrum\nanalyzer to measure signals at least as low as -110 dBm, and with as wide\na frequency range as practical.  Connect a 50 ohm terminator to the preamplifier output.  Using a bridge-T to supply power to the preamplifier",
    "as necessary, verify that the preamplifier does not generate any detectable signals at the preamplifier input.\n7.\nConnect an RF short circuit to the amplifier output.",
    "NOTE:\n      One acceptable method of applying an RF short circuit to the amplifier\n      while providing power through the same terminals is to use an open-\n      ended cable of 1/4 wavelength (at 1575.42 MHz) connected to the\n      preamplifier output.  Power can be supplied by a normal T or bridge-T\n      connection to the preamplifier output.\n\nVerify that the preamplifier does not generate any signals at the preamplifier\ninput.",
    "Verify that the preamplifier does not generate any signals at the preamplifier\ninput.\n\n8.\nApply an RF open circuit at the preamplifier output terminals.  Verify that the preamplifier does not generate any detectable signals at the preamplifier\ninput.\n\n## 2.4.3.4 Preamplifier Selectivity Test (Section 2.2.2.4)\n\nEquipment Required: Antenna Test Set (to provide power as required by the manufacturer to the preamplifier). Automatic Network Analyzer (Hewlett-Packard 8753, 8720, 8510, or equivalent).",
    "Synthesized Signal Generator (Hewlett-Packard 8662A or equivalent).\n\nMeasurement Requirements:",
    "Measurement Requirements:\n\n1.\nConnect the RF output of the network analyzer to the preamplifier input.\n2.\nConnect the preamplifier output to the network analyzer input.\n3.\nAdjust the network analyzer to provide a constant, linearly swept signal level of  -60 dBm, or as appropriate, over the frequency range of 1500 MHz to 1660 MHz.\n4.\nVerify that the displayed signal meets the levels specified in Figure 2-3,\nrelative to the input signal level.",
    "## 2.4.3.5 Burnout Protection Test (Section 2.2.2.5)\n\nEquipment Required: Antenna Test Set (to provide power as required by the manufacturer to the preamplifier).\n\nSynthesized Signal Generator (Hewlett-Packard 8662A or equivalent).\n\nSpectrum Analyzer (Hewlett-Packard 8568B, or equivalent).\n\nRF Amplifier (Hewlett-Packard 8347A, or equivalent). Measurement Requirements:",
    "1.\nConnect the RF Amplifier between the signal generator and the preamplifier.\n2.\nSet the RF generator to a frequency of 1575.42 MHz and adjust the level to obtain a signal of +30 dBm at the preamplifier input.\n3.\nApply power to the preamplifier, and subject the preamplifier input to a test signal of +30 dBm at 1575.42 MHz for 5 minutes.\n4.\nRepeat the tests described in Sections 2.4.3.1, 2.4.3.2, and 2.4.3.3.  Verify",
    "4.\nRepeat the tests described in Sections 2.4.3.1, 2.4.3.2, and 2.4.3.3.  Verify\nthat the preamplifier still meets the Gain, Noise Figure, and Stability requirements of those Sections.\n5.\nRe-connect the equipment as stated in steps 1 and 2.\n6.\nWith power removed from the preamplifier, subject the preamplifier input to a test signal of +30 dBm at 1575.42 MHz for 5 minutes.\n7.",
    "7.\nRepeat the tests described in Sections 2.4.3.1, 2.4.3.2, and 2.4.3.3.  Verify that the preamplifier still meets the Gain, Noise Figure and Stability\nrequirements of those Sections.",
    "## 2.4.3.6 Pulse Power Operation Test (Section 2.2.2.6)",
    "Equipment Required: Antenna Test Set (to provide power as required by the manufacturer to the preamplifier) Two Synthesized Signal Generators (Hewlett-Packard 8662A or equivalent) Spectrum Analyzer (Hewlett-Packard 8568B, or equivalent) Modulator (Hewlett-Packard 11665B, or equivalent) Pulse Generator (Fluke 5712, or equivalent) Linear RF Power Amplifier (500 W peak, minimum) 20 dB Directional Coupler Variable Attenuator (0-40 dB) 3 dB Power Splitter Adjustable Phase Delay Line Phase Detector",
    "Variable Attenuator (0-40 dB) 3 dB Power Splitter Adjustable Phase Delay Line Phase Detector Oscilloscope Measurement Requirements:",
    "1.\nConnect the equipment as shown in Figure 2-6.  Any attenuation of the pulsed RF signal through cable losses, connector losses, losses in the 20 dB directional coupler, etc. shall be taken into account when setting the power of signal generator #1, such that the peak power listed in Table 2-1A shall be present at the preamplifier input.\n2.",
    "2.\nTemporarily disable the pulse power signal from generator #1.  Set the signal generator #2 to an output level of 0 dBm and a frequency of 1575.42 MHz.  Adjust the variable attenuator such that the preamplifier produces an output power of -10 dB below its 1 dB compression point,  with a minimum power of -10 dBm.  If the phase detector used will work reliably with a",
    "lower output power, a lower value may be used.  Finally, adjust the phase delay line such that the oscilloscope shows a phase difference between the preamplifier output and the delayed signal generator #2 signal of 0N.",
    "3.\nSet the pulse generator and signal generator #1 to produce the pulsed signal\nrequired for test #1 in Table 2-1A.\n4.\nVerify that the preamplifier meets all criteria set forth in Section 2.2.2.6. The recovery time shall be measured as the time needed by the preamplifier to return to a phase difference between its output signal and the delayed signal generator #2 signal of less that +30E, as shown by the oscilloscope.\n5.\nRepeat steps 3 and 4 for tests 2 through 8 using the appropriate settings",
    "5.\nRepeat steps 3 and 4 for tests 2 through 8 using the appropriate settings\nshown in Table 2-1A for each test.",
    "|   Test | RF Frequency   | Pulse Width   | PRF     | RF Peak Power   |\n|--------|----------------|---------------|---------|-----------------|\n|      1 | 1315.00 MHz    | 1 ms          | 22 pps  | +30 dBm         |\n|      2 | 1525.00 MHz    | 1 ms          | 100 pps | +30 dBm         |\n|      3 | 1565.42 MHz    | 1 ms          | 100 pps | +30 dBm         |\n|      4 | 1575.42 MHz    | 1 ms          | 100 pps | +30 dBm         |",
    "|      4 | 1575.42 MHz    | 1 ms          | 100 pps | +30 dBm         |\n|      5 | 1585.42 MHz    | 1 ms          | 100 pps | +30 dBm         |\n|      6 | 1610.00 MHz    | 1 ms          | 100 pps | +30 dBm         |\n|      7 | 1626.50 MHz    | 1 ms          | 100 pps | +30 dBm         |\n|      8 | 2000.00 MHz    | 1 ms          | 56 pps  | +30 dBm         |",
    "This page intentionally left blank\n\n## 3.0 Installed Equipment Performance\n\nThe installed performance of the GNSS antenna shall be evaluated in conjunction with the installed GNSS receiver equipment to ensure that GNSS performance is met in accordance with the appropriate MOPS.\n\nThis page intentionally left blank\n\n## 4.0 Equipment Operational Performance Characteristics",
    "This page intentionally left blank\n\n## 4.0 Equipment Operational Performance Characteristics\n\nThe operational performance of the GNSS antenna shall be evaluated in conjunction with the operational tests of the GNSS receiver equipment to ensure that GNSS performance is met in accordance with the appropriate MOPS. Operational tests of GNSS antennas may be conducted as part of normal preflight tests.\n\nThis page intentionally left blank",
    "This page intentionally left blank\n\n## Membership Special Committee 159 Minimum Operational Performance Standards For Airborne Navigation Equipment Using Global Positioning System (Gps) Chairman Larry Chesto Arinc Secretary\n\nYoung Lee The MITRE Corp.\n\n## Members",
    "Young Lee The MITRE Corp.\n\n## Members\n\nHamza Abdusclan TRW/SETA\nKenneth Akerley Com Adams-Russell Gerard Alcouffe Sextant Avionique Frank Alexander Northwest Air Lines Donald Allyn Boeing Commercial Airplane Group David Anderson NTIA\nTatiana Anodina Russian Ministry of Civil Aviation Robert Anoll SAIC-SCT Group Mark Asplund AlliedSignal Eric Augstman Transport Canada Aviation Paul Bankit Embry-Riddle Aeronautical University Melvin Barmat Jansky/Barmat Telecom, Inc.",
    "Larry Barnett Aviation Management Associates Richard Barnett TRW\nEd Bayliss MIT Lincoln Lab Michael Beamish Pelorus Navigation Systems Inc.",
    "Craig Beard Federal Aviation Administration Martin Beckmann Trimble Navigation August Beining bei/GA/EAA\nSteve Bellingham Transport Canada Vincent Bencivenga VLB Associates Barry Billman Federal Aviation Administration Peter Boulton Nortel Limited\n8\nRoger Boyell Computer Sciences Corporation Michael Braasch Ohio University Soo Braasch Ohio University Jerry Bradley SRC, Inc.\n\nSuzanne Bradley The MITRE Corp.\n\nPaul Braisted Trimble Navigation Mats Brenner Honeywell, Inc.",
    "Suzanne Bradley The MITRE Corp.\n\nPaul Braisted Trimble Navigation Mats Brenner Honeywell, Inc.\n\nMike Broussalian Magellan Systems Juergen Bruckner Rockwell-Collins Charlie Bucher Motorola Steve Bullard Delta Air Lines Mike Burkle Rockwell-Collins Hank Cabler Federal Aviation Administration Susan Cabler Federal Aviation Administration W.R. Cairns US Coast Guard Gene Cangiani ITT\nMartin Capozzoli AlliedSignal Communications Eric Carr Harris Corporation David Carroll Motorola, Inc.",
    "Jim Carroll DOT/Volpe Center David Carter Helicopter Association International Chris Carver Magellan Systems Corporation Rick Cassell Rannoch Corp.\n\nRebecca Casswell US Coast Guard Mark Cato Crown Communications Inc.\n\nGeorge Chang Federal Aviation Administration John Chuang Litton Aero Products Howard Clark Jet Aviation Kim Class Honeywell, Inc.",
    "Richard Climie Consultant George Cobley Collins Clark Cohen Stanford University Glenn Colby US Navy Rich Cole Federal Aviation Administration Robert Conker MITRE/CAASD\nDavid Correia Federal Aviation Administration Edward Cortez DCS Inc.\n\nGlenn Courtney Wilcox Electric Brian Cox Ball Aerospace Michael Cramer Smith Industries Jim Danaher\n3S Navigation Chris Daskalakis DOT/VOLPE Center John Daughtry AFFSA Instrument Flight Center James Davis Universal Avionics Systems Jerry Davis Foxfire, Inc.",
    "Keith Davis JC Air Gilles De Cevins Aerospatiale Bruce DeCleene Federal Aviation Administration Michael DeJonge Smiths Industries A.J. Delange Zieta Associates Don Dement NOVACOM, Inc John Diesel Litton Aero Products Jim Dill ITT\nBrent Disselkoen Rockwell-Collins Dwight Divine Loral John Dobyne ARINC\nEugene Donaldson Federal Aviation Administration Chip Dorman Federal Aviation Administration-SETA\nT.M. Dorpinghaus bd Systems Inc.",
    "David Doyle NOAA, National Geographic Survey Dale Dunford NASA Langley Research Center Newt Durboraw Motorola GSTG\nPaul Dyer Federal Aviation Administration James Earl Consultant Paul Ebert Adsystech, Inc.\n\nBakry El-Arini MITRE/CAASD\nRick Ellerdrock Jeppesen Sanderson Bryant Elrod Stanford Telecommunications Per Enge Stanford University Robert Erikson Federal Aviation Administration Robert Erlandson Rockwell-Collins Tom Ernst ITT\nRichard Evans American Mobile Stellite Corp.",
    "Seymour Everett Consultant - Wilcox Carl Evers Rannoch Corporation Sohel Fares Canadian Marconi Co.\n\nJames Farrell NaVigil Kimberly Faunce MITRE/CAASD\nScott Feairheller FASTC/TASS\nCecelia Feit Sierra Research Tobias Felhauer Daimler-Benz Aerospace James Fernow The MITRE Corp.",
    "Richard Ferranti MIT Lincoln Lab Wassim Ferzali Mayflower Communications Harold Fletcher Tel-Instrument Electronics Co Victor Foose Federal Aviation Administration Thomas Foster Rockwell International Michael Fox US Air Force Faye Francy AERA, Inc.\n\nBob Frazier Federal Aviation Administration James Freidell Daedalian Technologies Ltd.",
    "Bob Frazier Federal Aviation Administration James Freidell Daedalian Technologies Ltd.\n\nBob Friedman Tel-Instrument Technologies Walter Fried Hughes Aircraft Company David Frostbutter JHU/APL\nGerald Frost RAND\nPeter Fyfe ARINC Research Corporation Ian Gallimore Naval Air Warfare Center Michael Gallistel Booz Allen & Hamilton Julie Garcia Federal Communications Commission Bill Garner American Mobile Satellite Corp.",
    "Jim Garoutte Federal Aviation Administration Robert Geary System Resource Corporation Jeff Geier Motorola Alcouffe Gerard Sextant Avionique Michael Geyer TASC\nGlen Gibons GPS World Bob Gille Honeywell, Inc.\n\nDavid Girts Honeywell, Inc.\n\nDavid Givens Honeywell, Inc.\n\nRocky Gmeiner Raytheon Fred Goodrich Cardion Francois Goudenove Aerospatiale Edward Grenning ENG Associates Francis Grimal EUROCAE\nG.N. Gromov AUSRIRE\nRobert Grove II Morrow, Inc.\n\nBrett Gundlach BFGoodrich Flight Systems, Inc.",
    "Brett Gundlach BFGoodrich Flight Systems, Inc.\n\nGeorge Gunther US Coast Guard Adriana Guy Amtech Technologies Lin Haas Stanford Telecommunications Bob Hall Air Line Pilots Association Richard Hambly ARINC\nSteven Hammond Rockwell International John Hannon E-Systems, Inc.\n\nDamon Hart CNS Outlook Joseph Hart Federal Aviation Administration Randolph Hartman Honeywell, Inc.",
    "Thomas Hauer ARINC\nCarol Head National Academy of Public Administration Gerry Headley US Air Force Christopher Hegarty MITRE/CAASD\nSteve Heppe Telenergy Walter Hett Walter Hett and Associates Willie Hicks Joint Spectrum Center Marc Hinck Federal Aviation Administration Don Hiorth ERI\nHau Ho Odyssey/TRW\nHarry Hodges Crown Communications, Inc.\n\nRobert Hoech Rockwell International Herbert Hoffman System Resources Corp.\n\nPhilip Holmer SRC\nJames Howell Raytheon Co.\n\nLarry Huffman E-Systems, Inc.",
    "Philip Holmer SRC\nJames Howell Raytheon Co.\n\nLarry Huffman E-Systems, Inc.\n\nRoger Hughes US Coast Guard Warren Hundley Wilcox Electric, Inc.",
    "Robert Huston BFGoodrich Avionics Systems Tom Imrich Federal Aviation Administration Nicolay Ivanov Russian Institute of Space Device Engineering Thomes Jacob Deutsche Aerospace Len Jacobson GSAM (Intermetrics)\nRobert Jeans United Kingdom Civil Aviation Authority V.P. Jikharev All-Union Scientific Research Institute of Radio Equipment Robert Johns AlliedSignal ATA",
    "Brian Johnson Stanford Telecom Mark Johnson Rockwell International Jean-Louis Jonquiere French Civil Aviation Authority Greg Joyner Federal Aviation Administration John Jubin Rockwell International Allen Judkiewicz SAIC-SCT Group Rudy Kalafus Trimble Elliott Kaplan The MITRE Corp.",
    "Nick Karanasos GEC Marconi Thomas Katri Federal Aviation Administration Nelson Keeler Stanford Telecommunications Jon Keeneth Federal Aviation Administration Robert Kelly Kelly Systems Engineering James Kendrick ARINC\nDarrel Killham Rockwell-Collins George Kinal INMARSAT\nDennis King E-Systems Inc.-Montek Division Claude Kitchens BD Systems Liz Knoblauch US Navy Karl Kovach ARINC\nJohn Kraemer DOT/Volpe Center E.F.C. LaBerge AlliedSignal, Communications Division Jon Ladd Ashtech, Inc.",
    "Marie Lage Stanford Telecommunications Thomas Laginja Federal Aviation Administration Larkin Lake NCCOSC RDT&E\nRicardo Layton US Air Force Brian Leininger Paramax Systems Corp.\n\nDave Lewis Delco Electronics George Ligler ARINC\nRobert Lilley Ohio University Sylvain Loddo Thompson-CSF\nBrandy Lohse Federal Aviation Administration George Lyddane Federal Aviation Administration Frank Mackowick SkyComm, Inc.",
    "Brian Mahoney Federal Aviation Administration Aziz Makhani Advanced Hardware Architecture Steve Malik FAA Technical Center Paul Manning Volpe National Transportation System Center Kelly Markin The MITRE Corp.\n\nAnthony Martelli ARINC\nEdward Martin Rockwell Paul Massatt Aerospace Corp.\n\nJon Mathis bd Systems Inc.\n\nDaryl McCall Rockwell/Collins Gerry McCartor Federal Aviation Administration David McCollum AMTECH, Inc.\n\nKeith McDonald Sat Tech Systems Ed McGann Megapulse Inc.",
    "Keith McDonald Sat Tech Systems Ed McGann Megapulse Inc.\n\nGary McGraw Rockwell-Collins Terry McGurn US Government David McIntyre Ashtech, Inc.",
    "Gary McGraw Rockwell-Collins Terry McGurn US Government David McIntyre Ashtech, Inc.\n\nErwin Mercado Stanford Telecommunications William Michalson Worchester Polytechnic Institute Kevin Milton Rockwell International Pratap Misra MIT Lincoln Lab Dgnus-Jan Moelker Delft University of Technology Neal Molloy Boeing Commercial Airplane Group Michael Moore Aero Consultants Michael Morrel Aero Consultants Mike Morris US Air Force Pete Morris TASC, Inc.\n\nKim Mortensen System Resources Corp.",
    "Kim Mortensen System Resources Corp.\n\nHal Moses RTCA\nWilliam Moyer Qualcomm, Inc.\n\nHeinz Mueller Federal Aviation Administration Prem Munjal The Aerospace Corporation Tim Murphy Boeing Commercial Airplane Group Michael Mussler Ball Corporation Mark Mykityshyn Booz, Allen & Hamilton Gary Naden Wilcox Electric Jim Nagle INMARSAT\nPrasad Nair Project Management Enterprises, Inc.\n\nRussell Nakamura Loral Federal Systems Bill Nedell Wyndemere Inc.",
    "Russell Nakamura Loral Federal Systems Bill Nedell Wyndemere Inc.\n\nAndrew Nelson Booz, Allen & Hamilton Andrew Neustadter CTA, Inc.\n\nHarold Ng FCC/CCB\nRay Nickla AMTECH\nPeter Nicolaides Mayflower Communications Co. Inc.",
    "Harold Ng FCC/CCB\nRay Nickla AMTECH\nPeter Nicolaides Mayflower Communications Co. Inc.\n\nDave Nolte AlliedSignal Aerospace Stefan Ochs DASA\nPatti O=Donnell MITRE/CAASD\nTim O=Grady ARINC\nMike Peace Federal Aviation Administration Terry Pearsall Aircraft Electronics Associates Walt Perron US Army - ASA\nBill Petruzel Federal Aviation Administration Jeffrey Pettijohn Wilcox Electric William Phaneuf Air Line Pilots Association Woody Phlong Stanford Telecommunications Andrew Pickens AvCom, Inc.",
    "Jim Pigg New Bedford Panoramex Corp.\n\nLois Pilley DSDC\nBob Plley DSDC\nAnthony Ploski ITT Aerospace Vander Pluym National Defence Headquarters Elias Polendo ARINC\nWalter Poor The MITRE Corp.\n\nLester Prosser SRC, Inc.\n\nJean Provenzano Alcatel Aerospace Bill Pryor Ultra Nav Gilbert Quinby G.F.Quinby Associates B. Rabillier STNA\nSrini Raghavan The Aerospace Co.",
    "John Rajan ITT\nJay Ramasastry Loral Qualcomm Satellite Services Jerry Reider Interstate Electronics Tim Rider Delta Air Lines Alan Riemer Wilcox Electric Inc.\n\nGary Rixman Federal Aviation Administration Si Robin Sensor System, Inc.\n\nGlyn Romrell E-Systems-Montek Div.\n\nCharles Rosario Federal Aviation Administration Linn Roth LOCUS, Inc.",
    "Charles Rosario Federal Aviation Administration Linn Roth LOCUS, Inc.\n\nSteve Rowson Wilcox Electric Rudolph Ruana Jeppesen Sanderson Bill Ruhl Com Air William Russell Air Transport Associaiton Fintan Ryan INMARSAT\nTimothy Ryan Logistics Development Corp.",
    "Mitch Sams Wilcox Electric Edward Sayadian Stanford Telcommunications Robert Scheel Japan Radio Company, Limited Dave Scull Interanational Assoc.-Institutes of Navigation Itchy Sell ARINC Research James Semler Figgle International Steven Senter Northern Telecom Europe Dinyar Sepai Raytheon Ralph Sexton Innovative Solutions International John Shaw Airport Systems International Richard Shin NAWC\nHeywood Shirer DOT",
    "Heywood Shirer DOT\nTimothy Shorts Loral Federal Systems Clay Showen Airport System International Martin Shuey Aircraft Owners and Pilots Association Keith Sketchley Universal Avionics Trent Skidmore Ohio University Bernald Smith Soaring Society of America Michael Smith US Navy Steven Smith Federal Aviation Administration Sonya Smith ATC\nJimmy Snow Federal Aviation Administration Yedidiah Solowiejclyic ITT",
    "Jimmy Snow Federal Aviation Administration Yedidiah Solowiejclyic ITT\nGeorge Sotolongo Boeing Commercial Airplane Group Roger Soucy Boeing Commercial Airplane Group Jim Spayd Delta Air Lines Donald Spencer Overlook System Technologies Richard Stratton Transport Canada Robert Striegel Air Line Pilots Association Bob Stuckert Federal Aviation Administration John Studenny Canadian Marconi Abdul Tahir Litton Aero Products Donald Taylor Experimental Aircraft Association & Cumulus Consultants, Inc.",
    "Stewart Teasley Rockwell Telecommunications Tom Teetor DCA, Inc.\n\nRon Testa BFGoodrich David Thompson Federal Aviation Administration James Treacy Federal Aviation Administration Wai Tsang SAIC\nMaarten Uijt de Haag Ohio University David Underwood Canadian Marconi Triveni Upadhyay Mayflower Communications Bruce Vacey Honeywell, Inc.",
    "A.J. Van Dierendonck AJ Systems Karen Van Dyke DOT/Volpe Center Frank Van Graas Ohio University Antony Vaudrey British Embassy, Civil Air Attache Doug Vickers Ohio University Stefan Viewig Technical University Braunschweig Chris Villani NORCOM\nBill Vollestadt DCS, Inc.",
    "Jim Waid E-Systems-Montek Division Scott Wallis US Air Force Alan Waltho ADGA\nRick Walton COMSAT Mobile Communications William Wanner Federal Aviation Administration Tim Ward Speedwing-British Airways Wallace Ward Airspace Systems Consultants Nicolas Warinsuo French CAA\nMichael Webb US Air Force Robert Weber Sensor Systems, Inc.\n\nWilliam Wellons Naval Air Warfare Center Joel Wichgers Rockwell-Collins Jim Wichmann MIT Lincoln Lab Lawrence Wiederholt Intermetrics, Inc.",
    "James Williams Federal Aviation Administration Henry Willis Sierra Research Company Greg Wilson Interstate Electronics Corp.",
    "Mark Wilson Federal Aviation Administration Robert Wilson Harris Corporation Wilburn Wilson Litton Aero Products Bette Winer Volpe Center Eric Wiswell TRW\nLarry Witmer Rockwell-Collins Robert Witulski ARINC\nChris Wolf Federal Aviation Administration K.T. Woo The Aerospace Corporation John Wright Wright=s Landing Avionics Services Victor Wullshleger Federal Aviation Administration Sidney Ying Rockwell-Collins William Young Nav Air Sys Com Tom Zalesak US Navy Mel Zeltser MITRE/CAASD",
    "Dennis Zvacek American Air Lines"
  ]
}