{
  "source": "SAE AS404B 1991.md",
  "chunks": [
    "400 Commonwealth Drive Warrendale, PA 15096-0001\n\n## Electric Techometer: Magnetic Drag (Indicator & Generator)",
    "1.\nPURPOSE: To specify minimum requirements for Electric Tachometers primarily for use in reciprocating \nengine powered civil transport aircraft, the operation of which may subject the instruments to the environmental conditions specified in Section 3.3.\n2.\nSCOPE: This Aeronautical Standard covers magnetic drag tachometers with or without built-in \nsynchroscopes.\n3.\nGENERAL REQUIREMENTS:\n3.1\nMaterials and Workmanship:\n3.1.1",
    "synchroscopes.\n3.\nGENERAL REQUIREMENTS:\n3.1\nMaterials and Workmanship:\n3.1.1\nMaterials: Materials shall be of a quality which experience and/or tests have demonstrated to be \nsuitable and dependable for use in aircraft instruments.\n3.1.2\nWorkmanship: Workmanship shall be consistent with high-grade aircraft instrument manufacturing \npractice.\n3.2\nIdentification: The following information shall be legibly and permanently marked on the instrument or \nattached thereto:\na.\nName of Instrument\nb.",
    "attached thereto:\na.\nName of Instrument\nb.\nSAE AS 404B\nc.\nManufacturer's Part Number.\nd.\nManufacturer's Serial number or date of manufacture.\ne.\nManufacturer's name and/or trade mark.\nf.\nRange.\n3.3\nEnvironmental Conditions: The following conditions have been established as minimum design \nrequirements. Tests shall be conducted as specified in Sections 5, 6 and 7.\n3.3.1\nTemperature: When installed in accordance with the instrument manufacturer's instructions, the",
    "Temperature: When installed in accordance with the instrument manufacturer's instructions, the \ninstrument shall function over the range of ambient temperatures shown in Column A below and shall not be adversely affected by exposure to the range of temperatures shown in Column B below:",
    "| Instrument Location                   | A          | B            |\n|---------------------------------------|------------|--------------|\n|                                       |            |              |\n| Powerplant Accessory Compartment      | -30 to 70C | -65 to 100C  |\n| Heated Areas (temperature controlled) | -30 to 50C | -65 to   70C |",
    "engaged in industry or trade is entirely voluntary. There is no agreement to adhere to any SAE standard to recommended practice, and no commitment to conform to or be guided by any technical report. In formulating and approving technical reports, the board and its committees will not investigate or consider patents which may apply to the subject matter.\n\nProspective users of the report are responsible for protecting themselves against liability for infringement of patents.\"",
    "3.3.2\nHumidity: The instrument shall function and shall not be adversely affected when exposed to any \nrelative humidity in the range from 0 to 95% at a temperature of approximately 32C.\n3.3.3\nVibration: When installed in accordance with the instrument manufacturer's instructions, the instrument \nshall function and shall not be adversely affected when subjected to vibrations of the following characteristics:",
    "Max. Double\nInst. Location in Airframe\nCycles Per Sec.\nAmplitude (Inches)\nMax. Accel.\nPower Plant Mounted \n5-150 \n.100 20 g.\nFuselage \n5-500 \n.036 \n5 g.\nPanel or Rack (Vibration Isolated) \n5-50 \n.020 \n1.5 g.",
    "3.3.4\nAltitude: The instrument shall function and shall not be adversely affected when subjected to a pressure \nand temperature range equivalent to -1000 to 40,000 feet standard altitude, per NACA Report 1235, except as limited by the application of paragraph 3.3.1. The Instrument shall not be adversely affected following exposure to an ambient pressure of 50 in. Hg absolute.\n3.4\nRadio Interference: The instrument shall not be the source of objectionable interference, under operating",
    "conditions at any frequencies used on aircraft either by radiation or feed-back, in electronic equipment installed in the same aircraft as the instrument.\n3.5\nMagnetic Effect: The magnetic effect of the indicator shall not adversely affect the operation of other\n         instruments installed in the same aircraft.",
    "## 4. Detail Requirements:",
    "4.1\nIndicator:\n4.1.1\nIndication: Engine speed shall be indicated by means of one or more moving pointers or dials. Relative \nmovement of the pointer with respect to the dial shall be clockwise for increasing RPM.\n4.1.2\nDial Visibility: The pointers and all dial markings shall be visible from any point within the frustum of a",
    "cone whose side makes an angle of not less than 30° with the perpendicular to the dial and whose small diameter is the aperture of the instrument case. The distance between the dial and the cover glass shall be a practical minimum and shall not exceed 0.200.\n4.1.3\nDial Markings:\n4.1.3.1\nFinish: Unless otherwise specified by the user, matte white material should be applied to all major \ngraduations, numerals, and pointers. Non-functional surfaces should be a durable dull black.\n4.1.3.2",
    "4.1.3.2\nGraduations: All graduations shall be multiples of 10 RPM. The increment between graduations shall \nnot exceed 2-1/2% of full scale, above 600 RPM.\n4.1.3.3\nNumerals: Sufficient numerals shall be marked to identify positively and quickly all graduations.\n4.1.3.4\nInstrument Name: The designation \"RPM\", plus such other nomenclature as may be necessary, shall \nbe legibly marked on the dial and may be of the same finish as the numerals.\n4.1.3.5",
    "be legibly marked on the dial and may be of the same finish as the numerals.\n4.1.3.5\nSealing: The indicator case may be either gasket sealed or hermetically sealed.\n4.2\nGenerator: The generator shall be designed to operate in either direction of rotation and in any position.",
    "## 5. Test Conditions:",
    "5.1\nAtmospheric Conditions: Unless otherwise specified all tests required by this Aeronautical Standard shall \nbe conducted at an atmospheric pressure of approximately 29.92 inches of mercury and at an ambient temperature of approximately 25C and a relative humidity not greater than 85%. When tests are conducted   with the atmospheric pressure or the temperature substantially different from these values, allowances shall be made for the variation from the specified conditions.\n5.2",
    "5.2\nVibration (to minimize friction): Unless otherwise specified all tests for performance may be made with the \ninstrument subjected to a vibration of 0.002 to 0.005 inch double amplitude at a frequency of 1500 to 2000 cycles per minute. The term double amplitude as used herein indicates total displacement from positive maximum to negative maximum.\n5.3\nVibration Equipment: Vibration equipment shall be used which will provide frequencies and amplitudes",
    "consistent with the requirements of Section 3.3.3 with the following characteristics.\n5.3.1\nLinear Motion Vibration: Vibration equipment for airframe structure-mounted or powerplant-mounted \ninstruments or equipment shall be such as to allow vibration to be applied along each of three mutually perpendicular axes of the instrument.\n5.3.2\nCircular Motion Vibration: Vibration equipment for instruments located on the panel or rack (with",
    "Circular Motion Vibration: Vibration equipment for instruments located on the panel or rack (with \nshockmounts) shall be such that a point on the instrument case will describe a circle, in a plane inclined 45 degrees to the horizontal plane, the diameter of which is equal to the double amplitude specified.\n5.4\nPosition: Unless otherwise specified, all tests shall be conducted with the instrument mounted in its \nnormal operating position.\n6.",
    "normal operating position.\n6.\nINDIVIDUAL PERFORMANCE REQUIREMENTS: All instruments or components of such shall be \nsubjected to whatever tests the manufacturer deems necessary to demonstrate specific compliance with this Aeronautical Standard, including the following requirements when applicable.\n6.1\nScale Error at Room Temperature: The tachometer indicator shall be connected to its generator and the",
    "generator operated at the shaft speeds within the ranges specified in Table I. The scale error at any speed shall not exceed the values specified in Table I with the speed increasing or decreasing. When the speed is held constant at any point on the scale, the pointer shall not oscillate over a range greater than 20 RPM from 600 RPM to full-scale indication",
    "Gen.\nDrive Shaft\n Speed\n   RPM\n Correct\nIndicated\n Speed\n   RPM\nScale Error\n Tolerance\n    RPM\n 300 - 1400\n 600 - 2800\n25\n1500 - 2250\n3000 - 4500\n40",
    "6.2\nDielectric: Ungrounded instruments or grounded instruments prior to connection of the internal ground \nwire shall be tested by either the method of inspection of paragraph 6.2.1 or 6.2.2.\n6.2.1\nInsulation Resistance: The insulation resistance measured at 200 volts D.C. for five seconds between",
    "all electrical circuits connected together and the metallic case shall not be less than 5 megohms. Insulation resistance measurements shall not be made to circuits where the potential will appear across elements such as windings, resistors, capacitors, etc., since this measurement is intended only to determine adequacy of insulation.\n6.2.2\nOverpotential Tests: Equipment shall not be damaged by the application of a test potential between",
    "electrical circuits, and between electrical circuits and the metallic case. The test potential shall be a sinusoidal voltage of a commercial frequency with an RMS value of five times the maximum circuit voltage or per paragraphs 6.2.2.1 or 6.2.2.2 whichever applies. The potential shall start from zero and be increased at a uniform rate to its test value. It shall be maintained at this value for five seconds, and then reduced at a uniform rate to zero.",
    "Since these tests are intended to insure proper electrical isolation of the circuit components in question, these tests shall not be applied to circuits where the potential will appear across elements such as winding, resistors, capacitors, etc.",
    "6.2.2.1\nHermetically sealed instruments shall be tested at 200 volts RMS.\n6.2.2.2\nCircuits that operate at potentials below 15 volts and contain low voltage elements such as \ntransistors, doides, capacitors and special signal generators are not to be subjected to overpotential tests.\n6.3\nPosition Error: The change in pointer indication with change in instrument position from normal position",
    "shall not exceed 25 RPM.\n                                                                                          \n6.4\nSealing: This test shall apply to hermetically sealed instruments only. The indicator shall be immersed in \na suitable liquid, such as water. The absolute pressure of the air above the liquid shall then be reduced to",
    "approximately 1 inch of mercury and maintained for 1 minute, or until air bubbles substantially cease to be given off by the liquid, whichever is longer. The absolute pressure shall then be increased to 2-1/2 inches Hg. Any bubbles coming from within the Indicator case shall be considered as leakage and shall be cause for rejection. Bubbles which are the result of entrapped air in the various exterior parts of the case shall not be considered as a leak.",
    "A helium leak detector or other means of test equal or superior in sensitivity to the immersion method described above, may be used. Where a leak detector is employed for conducting the test, the leak rate shall not exceed 1 micro-cubic foot per hour at a pressure differential of approximately 1 atmosphere. If the indicator incorporates non-hermetically sealed attachments, such as a case extension, these components may be removed prior to the Sealing test.",
    "7.\nQUALIFICATION TESTS: As many instruments as may be deemed necessary to demonstrate that all \ninstruments will comply with the requirements of this section shall be tested in accordance with the manufacturer's recommendations.\n7.1\nLow Temperature: The instrument shall be subjected to -30C for three hours. The change in indication",
    "from the reading obtained at room temperature shall not exceed one percent of full scale. The instrument may be operated at 2000 RPM or half scale, whichever is higher, for a period of 10 minutes before making this scale error test. The force required to turn the generator shaft while and after it has been subjected to a temperature of minus 55C for two hours, shall not exceed 8 pound inches. No damage to \nthe generator shall result from this test.\n7.2",
    "the generator shall result from this test.\n7.2\nHigh Temperature: The instrument shall be subjected to a temperature of 70C for a period of three hours. \nThe change in indication from the readings obtained at room temperature shall not exceed one percent of full scale for the range 600-2800 RPM and shall not exceed one and one-half percent of full scale for the range from 3000 to 4500 RPM.\n7.3\nExtreme Temperature Exposure: The instrument shall, after alternate exposure to ambient temperatures",
    "specified in Column B of Section 3.3.1 for a period of 24 hours each and a delay of 3 hours at room temperature following completion of the exposure, meet the requirements of Section 6.1. During the high temperature exposure, the generator shall be operating at a shaft speed equivalent to half-scale indicator reading and shall be supplying full-rated electrical load for that speed. There shall be no evidence of damage as a result of exposure to the extreme temperatures specified herein.",
    "7.4\nMagnetic Effect: The magnetic effect of the indicator shall be determined in terms of the deflection of a \nfree magnet, approx. 1-1/2 inches long, in a magnetic field with a horizontal intensity of 0.19 ± 0.01 gauss when the indicator is held in various positions on an east-west line with its nearest part 12 inches from the",
    "center of the magnet. This test shall first be made with the indicator not operating and then shall be repeated with the indicator in normal operation. The maximum deflection of the free magnet shall not exceed 5 degrees for any pointer or dial position.\n7.5\nVibration:\n7.5.1\nResonance: The instrument, while operating and with Various pointer settings throughout the range,",
    "Resonance: The instrument, while operating and with Various pointer settings throughout the range, \nshall be subjected to a resonant frequency survey of the appropriate range specified in Section 3.3.3 in order to determine if there exists any resonant frequencies of the parts. The amplitude used may be of any convenient value that does not exceed the maximum double amplitude and the maximum acceleration specified in Section 3.3.3.",
    "The instrument shall then be subjected to vibration at the appropriate double amplitude or maximum acceleration specified in Section 3.3.3 at the resonant frequency for a period of one hour in each axis or with circular motion vibration whichever is applicable. When more then one resonant frequency is encountered with vibration applied along any one axis, a test period may be accomplished at the most severe resonance, or the period may be divided among the resonant frequencies, whichever shall",
    "most severe resonance, or the period may be divided among the resonant frequencies, whichever shall be considered most likely to produce failure. The test period shall not be less than one-half hour at any resonant mode. When resonant frequencies are not apparent within the specified frequency range, the instrument shall be vibrated for two hours in accordance with the vibration requirements schedule, Section 3.3.3, at the maximum double amplitude and the frequency to provide the maximum",
    "schedule, Section 3.3.3, at the maximum double amplitude and the frequency to provide the maximum acceleration.",
    "While the instrument is being vibrated, the pointer oscillation shall not exceed one percent of full scale indication. The average pointer variation during vibration shall not exceed one percent of full scale indication. After these observations have been made, the vibration stand shall be set as indicated above and operated for the remainder of the two hour test period with the pointer position changed every twenty to thirty minutes.",
    "7.5.2\nCycling: The instrument, while operating shall be tested with the frequency cycled between the limits \nspecified in Section 3.3.3 in 15 minute cycles for a period of one hour in each axis at an applied double amplitude specified in Section 3.3.3, or an acceleration specified in 3.3.3 whichever is the limiting value, or a total of three hours for circular motion vibration, whichever is applicable. The pointer position shall be changed every twenty to thirty minutes during this test.",
    "After the completion of this vibration test the \"Scale Error at Room Temperature\" test in Section 6 shall be repeated. No damage shall be evident and the change in indication between this test and the initial room temperature scale error test shall not exceed one percent of full scale indication.",
    "7.6\nHumidity: This test shall not apply to hermetically sealed indicators. The indicator and generator shall be",
    "mounted in the normal operating position and maintained at a temperature of 70 ± 2C and a relative humidity of 95 ± 5% for a period of 6 hours. After this period the heat shall be shut off and the instrument shall be allowed to cool for a period of eighteen hours in this atmosphere in which the humidity rises to 100% as the temperature decreases to not more than 38C. This complete cycle shall be conducted:",
    "a. Five times for instruments located in uncontrolled temperature areas. b. Once for instruments located in controlled temperature areas.\nImmediately after cycling, the indicator shall be subjected to the \"Scale Error Test at Room Temperature\" of Section 6. The change in reading between this test and the original scale error at room temperature test shall not exceed 10 RPM.",
    "The performance of the generator shall not be adversely affected as a result of this humidity cycling.",
    "7.7\nAcceleration Endurance: The generator drive shaft and rotor shall be subject to a uniform acceleration of \n400 revolutions per second per second for a period of at least five seconds. The generator shall be subjected to this acceleration for 500 applications. No damage to any part of the generator shall result from this test.\n                                                                                          \n7.8",
    "7.8\nThermal Shock: This test shall apply to hermetically sealed instruments only. The indicator shall be \nsubjected to four cycles of exposure to water at 85 ± 2C and 5 ± 2C without evidence of moisture",
    "penetration or damage to coating or enclosure. Each cycle of the test shall consist of immersing the indicator in water at 85 ± 2C for a period of 30 minutes, and then within 5 seconds of removal from the bath, the indicator shall be immersed for a period of 30 minutes in the other bath maintained at 5C. This cycle shall be repeated continuously, one cycle following the other until four cycles have been completed. Following this test, the indicator shall be subjected to the Sealing test",
    "have been completed. Following this test, the indicator shall be subjected to the Sealing test specified in 6.4. No indicator leakage shall occur as a result of this test."
  ]
}