{
  "source": "SAE AIR1662A 2013.md",
  "chunks": [
    "## Air1662 Aerospace Information Report\n\n| Issued              | 1984-10    |\n|---------------------|------------|\n| Revised             | 1998-09    |\n| Reaffirmed          | 2013-08    |\n|                     |            |\n| Superseding AIR1662 |            |\n\nMinimization of Electrostatic Hazards in Aircraft Fuel Systems \n\n## Rationale\n\nAIR1662A has been reaffirmed to comply with the SAE five-year review policy. \n\n## Introduction",
    "The prevention of fires and explosions resulting from electrostatic discharges in aircraft fuel systems is of special concern to aircraft designers and operators.  The purpose of this SAE Aerospace Information Report (AIR) is to assist in reducing the hazard by a review of the physics of electrostatic phenomena, a brief survey of electrostatic incidents and accidents, and a recounting of design practices which reduce the hazard.  This document is not a complete design guide; extensive research",
    "which reduce the hazard.  This document is not a complete design guide; extensive research and testing will be required to produce a successful design. An excellent review of the literature by Leonard (Reference 1) and a record of experiences and practices by the American Petroleum Industry (API, Reference 2) are useful supplements.  The API has summarized the conditions necessary for an incendiary electrostatic discharge as follows:",
    "a.\nThere must be a mechanism to generate electrostatic charge\nb.\nThere must be a means to accumulate electrostatic charge in enough quantity to produce an incendiary spark\nc.\nThere must be a means of discharging the accumulated electrostatic charge in the form of an \nincendiary spark, that is, a spark gap\nd.\nThere must be a combustible vapor in the spark gap\nThe hazard, then, may be eliminated by designing to prevent one or more of these necessary conditions.",
    "__________________________________________________________________________________________________________________________________________ SAE Technical Standards Board Rules provide that: \"This report is published by SAE to advance the state of technical and engineering sciences. The use of this report is entirely voluntary, and its applicability and suitability for any particular use, including any patent infringement arising therefrom, is the sole responsibility of the user.\"",
    "All rights reserved. No part of this publication may be reproduced, stored in a retrieval system or transmitted, in any form or by any means, electronic, mechanical, photocopying, recording, or otherwise, without the prior written permission of SAE.",
    "SAE values your input. To provide feedback on this Technical Report, please visit http://www.sae.org/technical/standards/AIR1662A \n\nTO PLACE A DOCUMENT ORDER: \nTel:        877-606-7323 (inside USA and Canada) \n \nTel:        +1 724-776-4970 (outside USA) \n \nFax:       724-776-0790 \n \nEmail:    CustomerService@sae.org \nSAE WEB ADDRESS: \n\n\nhttp://www.sae.org \n\n## Table Of Contents",
    "| 1.                         | SCOPE 3                                                      |\n|----------------------------|--------------------------------------------------------------|\n| 2.                         | REFERENCES 3                                                 |\n| 3.                         | PHYSICS OF ELECTROSTATIC CHARGE GENERATION AND ACCUMULATION  |\n| IN AIRCRAFT FUEL SYSTEMS 4 |                                                              |",
    "| IN AIRCRAFT FUEL SYSTEMS 4 |                                                              |\n| 4.                         | INCENDIVITY OF ELECTROSTATIC DISCHARGES 8                    |\n| 5.                         | CRITERIA FOR IGNITION 8                                      |\n| 5.1                        | Metal-to-Metal Discharge - Ignition Criteria 10              |\n| 5.2                        | Dielectric-to-Metal Discharge - Ignition Criterion 14        |",
    "| 5.2                        | Dielectric-to-Metal Discharge - Ignition Criterion 14        |\n| 5.3                        | Influence of Temperature 14                                  |\n| 5.4                        | Effects of Fuel Mists 17                                     |\n| 6.                         | CAUSE AND PREVENTION OF ELECTROSTATIC HAZARDS IN AIRCRAFT 17 |\n| 6.1                        | Causes of Electrostatic Hazards 18                           |",
    "| 6.1                        | Causes of Electrostatic Hazards 18                           |\n| 6.2                        | Techniques to Prevent Charge Accumulation 20                 |\n| 6.3                        | Other Techniques to Prevent Incendiary Discharges 22         |\n| 7.                         | DESIGN AND OPERATING RECOMMENDATIONS 23                      |",
    "## 1. Scope:\n\nThis SAE Aerospace Information Report (AIR) provides background information, technical data and related technical references for minimization of electrostatic hazards in aircraft fuel systems. Techniques used to minimize the electrostatic hazard include:",
    "a.\nReducing fueling rate into tank bays including use of multiple refueling inlet nozzles.\nb.\nReducing refuel plumbing flow velocities.\nc.\nIntroducing fuel into the tank at a low velocity near the bottom and directing it to impinge upon a \ngrounded conducting surface.\nd.\nAvoiding electrically isolated conductors in the fuel tank.\ne.\nUsing conductivity additives in the fuel.\n\n## 2. References:",
    "1.\nLeonard, J. T., \"Generation of Electrostatic Charge in Fuel Handling Systems:  A Literature \nSurvey,\" Naval Research Laboratory Report 8484, September 1981.\n2.\n\"Recommended Practice for Protection Against Ignition Arising Out of Static, Lightning and Stray \nCurrents,\" American Petroleum Institute RP2003, Washington, DC, Fourth Edition, 1982.\n3.\nLewis, B. and von Elbe, G., \"Combustion, Flames and Explosions of Gases,\" 2nd Edition, \nAcademic Press, New York, NY, 1961.\n4.",
    "Academic Press, New York, NY, 1961.\n4.\nBridges, J. E., et al, \"Gap Energy, a More Accurate Criterion for Ignition Threshold of Flammable \nMixtures,\" 1975 IEEE Electromagnetic Compability Symposium Record, San Antonio, TX, October 1975.\n5.\nLyle, A. R. and Strawson, H., \"Estimation of Electrostatic Hazards in Tank Filling Operation,\" in \"Static Electrification, 1971,\" Institute of Physics, London, 1971.\n6.",
    "6.\nGrenich, A. F. and Tolle, F. F., \"Electrostatic Safety with Explosion Suppressant Foam,\" AFWAL-TR-83-2015, Wright-Patterson Air Force Base, OH.\n7.\nEggers, D. F., et al, \"Physical Chemistry,\" Wiley and Sons, New York, NY, 1964.\n8.\nDesmarais, L. A. and Tolle, F. F., \"Integrated Aircraft Fuel Tank Inerting and Compartment Fire Suppression System,\" Vol. I, AFWAL-TR-83-2021.\n9.\nKuchta, J. M., \"Fire and Explosion Manual for Aircraft Accident Investigators,\" AFAPL-TR-73-74, August 1973.",
    "10. \"Procedures for the Use of Fuels for Turbine Powered Aircraft,\" Department of Transportation \nOrder No. 8110.34A, March 1980.",
    "## 3. Physics Of Electrostatic Charge Generation And Accumulation In Aircraft Fuel Systems:",
    "When a hydrocarbon liquid such as jet fuel flows past a surface, positive and negative electrostatic charges can be separated along the surface.  While the precise nature of the charging mechanism is not known, it appears to be associated with the presence of minute quantities of ionic impurities in the hydrocarbon.  Ionic impurity mechanisms for charge generation on either metallic or non-metallic surfaces have been proposed by Leonard and others (Reference 1); whatever the actual mechanism,",
    "surfaces have been proposed by Leonard and others (Reference 1); whatever the actual mechanism, it is an observed fact that a hydrocarbon liquid flowing over a surface can acquire a charge, with the contact surface acquiring the opposite charge.  Figure 1 shows a pipe wall with an affinity for negative charge, resulting in a net positive charge in the body of the fuel.  If the fuel is set into motion and charge is separated, the immediate re-association of the separated charges is hindered by",
    "and charge is separated, the immediate re-association of the separated charges is hindered by the very low electrical conductivity of highly refined hydrocarbon fuels.  Charge is, therefore, convected away by the liquid flow, in opposition to the electric field between the liquid and its surroundings, creating a potentially hazardous condition.  Whether the fuel becomes positively charged (as shown in Figure 1)",
    "or negatively charged depends on the combination of fuel, impurities, and containers involved.",
    "One of the main charge generators during aircraft refueling is the ground refueling equipment dirt filter/ water coalescer-separator unit (Figure 2); the separator may add to the charge produced by the filtercoalescer (Figure 2A) or tend to neutralize it (Figure 2B); with another fuel, the net charge produced might be of opposite sign.  In general, any filter has the potential to be a prolific charge generator because of the very large surface areas involved.",
    "As charged fuel flows through refueling hoses and pipes and enters the aircraft tanks (Figure 3), charges have an opportunity to be eliminated by migrating to the walls and re-associating with the opposite charge, a process described as relaxation.  The process of the recombination of charges can be described as a function of time.  If the fuel flows into a grounded container, and if the flow is terminated after a total charge Qo has been accumulated in the container, experiments show that the",
    "terminated after a total charge Qo has been accumulated in the container, experiments show that the mutual repulsion of the like charges in the fuel tends to cause them to migrate in the direction of the liquid fuel boundaries which are the normally grounded container walls and the electrically isolated fuel-air interface.  The charge remaining in the container after a time τ from the start of an observation interval can be approximated as shown in Equation 1:",
    "3.  (Continued):\nwhere:\nε = Relative dielectric constant compared to vacuum (for hydrocarbons, ε ~ 2)\nεo = Dielectric constant of vacuum (8.854 x 10-12 ampere seconds/volt meter)\nIt is customary to quote a characteristic \"relaxation\" time for electrical charges, normally the time required for the original charges to be reduced by a factor 1/e as they flow to the grounded walls. Defining the relaxation time as ζ, it follows that:",
    "(Eq. 2) ζk k - - - - - - - - - - - - - - - - - - - - - - - - - - = = k - - - - - - - - ~ 18 x 10 12 - εoε - - - - - - - - 1      or      ζ εoε\nIt is also customary to describe the electrical conductivity of fuel in terms of conductivity units (CU):",
    "1 AU = 1 picoSiemn/meter (ps/m) = 10${}^{-12}$ Siemn/meter = [10${}^{-12}$ ohm meter]${}^{-1}$",
    "Jet fuel electrical conductivity without antistatic additive normally ranges from 0.1 to 20 CU (Reference 1), so that typical relaxation times range from 180 to 0.9 s according to Equation 2.  In actuality, the relaxation time for fuels of very low conductivity is shorter than the prediction of the equation, and accepted practice is that 30 s is sufficient to remove most of the charge from fuel after the end of a filtering operation (Reference 2). During fuel flow into a receiver such as an",
    "after the end of a filtering operation (Reference 2). During fuel flow into a receiver such as an aircraft fuel tank, charge may be introduced with the fuel at the same time that the charge already present is relaxing.  If the charging rate is more rapid than the rate of relaxation, then charge will continue to accumulate in the tank and create potentially hazardous situations.  As shown in Figure 4, the residual charge which migrates toward the fuel-air interface tends to produce a charged",
    "4, the residual charge which migrates toward the fuel-air interface tends to produce a charged region near the surface, causing strong electric fields which can lead to discharges to nearby grounded objects.",
    "In some military aircraft which contain explosion suppressant foam in their tanks, charge may also be produced within the fuel tank depending on how the refueling flow is introduced into the tank.  Even though the fuel may not be charged as it enters the tank, if the incoming fuel impinges on the foam with substantial flow rate or velocity, the foam presents a very  large surface area on which charges can be separated.  One charge type will reside on the foam, while the opposite charge will be",
    "can be separated.  One charge type will reside on the foam, while the opposite charge will be convected away as the fuel percolates through the foam.  In this case, the charge residing on the foam is the principal hazard, and can be of either polarity depending on the type of foam used.",
    "## 4. Incendivity Of Electrostatic Discharges:",
    "The strength of the electric field produced in the vapor space (ullage) above a fuel is roughly proportional to the quantity of charge present.  If the electric field strength reaches a critical value, called \"the breakdown value\", a discharge will occur. In case a discharge occurs from a dielectric surface (such as fuel explosion suppressant foam, or a convenient experimental analogue such as plexiglas) to a grounded metal object in the vapor space, only the charge on or near the dielectric",
    "plexiglas) to a grounded metal object in the vapor space, only the charge on or near the dielectric surface will be involved, and further, only limited areas on the charged surface will participate (Figure 5); the reason is that the mobility of charge in the dielectric is very low because of the low conductivity of the dielectric and because of the short duration of discharges.  It has also been observed that the discharge at its origin at the dielectric surface is diffuse, tending to coalesce",
    "observed that the discharge at its origin at the dielectric surface is diffuse, tending to coalesce into a bright filament in the vicinity of the metal object.  In a number of instances, simultaneous multiple discharges have been observed in experiments with plexiglas; indirect measurements suggest the same phenomenon occurs in discharges from fuel.",
    "Under some circumstances, a dielectric can discharge to a metal object with little hazard.  In these circumstances, a design which prompts a low intensity discharge or discharges which can relax the electric field may be beneficial.  Under other consequences the discharge may be incendiary.  The difference between the circumstances may be due to more than a single variable in practical fuel system designs.",
    "Discharges in fuel tanks may also be from one metal surface to another.  If a fuel or foam surface comes in contact with an ungrounded metal object in the fuel tank, some of the charge contained in the fuel or foam will migrate into the metal object (Figure 6).  If the accumulation of charge on the ungrounded metal object causes its voltage to reach a sufficient value, it can in turn discharge to a grounded metal object; a tight arc will result and all of the charge collected will be",
    "to a grounded metal object; a tight arc will result and all of the charge collected will be transferred in a very short time.  Because of the length and temperature of the arc, this situation can be very hazardous.",
    "## 5. Criteria For Ignition:\n\nThe probability of an electrostatic ignition event depends on whether the discharge occurs between metal objects, or between a dielectric (e.g., fuel, explosion suppressant foam) and a meal object, and on the flammability of the ullage, the energy of the discharge, and the energy density (energy per unit volume) of the discharge.\n\n## 5.1 Metal-To-Metal Discharge - Ignition Criteria:",
    "This situation can arise in fuel tanks when a discharge occurs between an ungrounded object in contact with fuel (or explosion suppressant foam) and a grounded metal object in the ullage space;",
    "such discharges have high energy density.  It is possible to measure the voltage (VB) at the time of this discharge, and to measure the capacitance (C) of the system comprised of the metal objects. With this data, the energy (E) stored in the system immediately prior to discharge can be calculated as shown in Equation 3:",
    "$\\epsilon=\\frac{1}{2}\\,{\\rm CV}_{\\rm B}^{\\ 2}$ (Eq. 3)\nBy varying fuel-air ratio and the configuration of the metal objects, the minimum ignition energy and most easily ignited (optimum) fuel-air ratio could be found, at least in principle (Figure 7). In actuality, the experiment just described has not been performed, and instead tests have been made using the configuration of Figure 8.",
    "A reaction vessel containing two electrodes is filled with a fuel-air mixture.  The electrodes are connected through a switch to a capacitor which can be charged to various voltages.  Equation 3 is used to compute the energy stored in the capacitor, and this energy is assumed to be dissipated in the gap between the electrodes during the discharge.  As the result of measurements of this type, the minimum ignition energy that has been calculated is 0.26 mJ for glass flanged metal electrodes with",
    "minimum ignition energy that has been calculated is 0.26 mJ for glass flanged metal electrodes with a 0.5 cm gap and the optimum hydrocarbon fuel-air ratio (Reference 3).  If the gap distance, mixture ratio or electrode geometry are changed, the ignition energy will also change.  The cited value (0.26 mJ) is usually taken as the minimum ignition energy, and any configuration in a fuel tank with values of C and VB which cannot exceed this energy value is usually regarded as safe.",
    "However, the assumption that all the capacitor's stored energy is dissipated in the gap is questionable.  By measuring the extremely short discharge times from an oscilloscope trace (Figure 9), it is clear that very high frequency phenomena are involved, and that substantial amounts of energy can be expected to be radiated by the wires carrying the capacitor energy to the gap. Estimates are that between 10 and 50% of the capacitor energy can be radiated (Reference 4); thus the actual energy",
    "between 10 and 50% of the capacitor energy can be radiated (Reference 4); thus the actual energy dissipated in the gap at the minimum ignition condition may be less.  A series of experiments using the first proposed configuration would go far to resolve this uncertainty.",
    "## 5.2 Dielectric-To-Metal Discharge - Ignition Criterion:",
    "This situation applies to the case of discharges from a foam or fuel surface to a grounded metal object in the ullage space.  In such discharges, the energy density is low near the dielectric, and high near the metal object.  Measurement of the voltage and capacitance of a dielectric surface relative to a metal object is essentially impossible, so the techniques of 4.1 are not useful in making minimum ignition energy determinations.  Discharge energy could also be calculated if the product of",
    "ignition energy determinations.  Discharge energy could also be calculated if the product of current and voltage could be integrated over the time of discharge; while the current can be measured (Figure 9), as already noted the voltage cannot.  Some estimates of spark energy have been made using a photomultiplier to observe incendiary sparks; these estimates show that an energy of 4.7 mJ is sufficient for ignition, but this value is not necessarily the minimum ignition energy (Reference 5).",
    "As an alternative to spark energy, the total charge transferred during an event has been proposed as a measure of spark incendivity for dielectric-metal discharges.  The total charge transferred is easily computed by integrating current versus time during the discharge event; this calculation involves finding the area under the curve of Figure 9.  In measurements of discharges from explosion suppressant foams separated from a 1 in (2.5 cm) diameter metal sphere by a 1/2 in (1.2 cm) air gap, the",
    "foams separated from a 1 in (2.5 cm) diameter metal sphere by a 1/2 in (1.2 cm) air gap, the minimum ignition charge transfer for an optimum propane/air mixture was approximately",
    "45 nC, and for JP-4 vapor/air was 70 nC (Reference 6); no lower values have been reported in the literature.",
    "## 5.3 Influence Of Temperature:",
    "The influence of temperature on minimum ignition energy has been investigated.  The preponderant effect of temperature is traceable to its effect on the fuel-air ratio in the ullage space of fuel tanks.",
    "For situations in which the fuel is at equilibrium with its vapor, an increase in temperature increases the fuel vapor pressure and thus the fuel/air ratio (Figure 10).  The flammability limits of common fuels (including aviation gasoline and diesel fuel marine) are shown in Figure 11; evidently the vapor space is not flammable when the fuel/air ratio is below the lean limit or above the rich limit, independent of spark ignition energy.  Within the flammable zone, there is an optimum fuel/air",
    "independent of spark ignition energy.  Within the flammable zone, there is an optimum fuel/air ratio at which the fuel is most easily ignited, and above or below which the ignition energy required increases.  Figure 12 shows the decrease in minimum ignition energy with increased temperature for a fuel-air spray.",
    "## 5.4 Effects Of Fuel Mists:",
    "In the event that the fuel is not in equilibrium with its vapor, the usual temperature-vapor pressure expression for fuels does not apply.  This is of special concern at temperatures where equilibrium relations would indicate the fuel-air ratio is too lean to burn.  For example, in high speed fueling when mists can be created in the vapor space, the fuel mist can produce a flammable condition even at very low temperatures.  This is because the vapor pressure in proximity to a fuel droplet can",
    "at very low temperatures.  This is because the vapor pressure in proximity to a fuel droplet can be significantly higher than the vapor pressure of the bulk fuel.  The effect is given, at least approximately, by Equation 4 (Reference 7):",
    "$$\\ln\\left(\\frac{\\rho}{\\rho_{0}}\\right)=\\frac{2M\\gamma}{RT\\rho r}$$ (Eq. 4)\nwhere:\nM = Droplet mass p = Droplet vapor pressure po = Bulk fuel vapor pressure R = Gas constant (for air to the accuracy of the equation)\nT = Temperature (absolute) r = Droplet radius\nρ = Fuel density",
    "T = Temperature (absolute) r = Droplet radius\nρ = Fuel density\nγ = Fuel surface tension This increase in vapor pressure in mist filled ullages accounts for the flammability of fuel mists of otherwise room temperature safe fuels such as kerosene.  Figure 12 shows that kerosene-air sprays can be ignited at temperatures well below the commonly accepted flash point.",
    "## 6. Cause And Prevention Of Electrostatic Hazards In Aircraft:",
    "A number of mechanisms have been identified which can introduce electrostatic charge into fuel tanks. As soon as charge is introduced, there is a tendency (because of the resultant electric fields) for the charges to separate from each other, and to migrate toward grounded metal surfaces.  For a given electric field, the mobility of the charges varies directly as the fuel conductivity.  If the rate of introduction of charge exceeds the rate at which charge either migrates to the walls or is",
    "rate of introduction of charge exceeds the rate at which charge either migrates to the walls or is otherwise neutralized, charge will accumulate, the resultant electric fields will intensify, and a discharge will result.  If there are flammable vapors present and if the discharge has sufficient energy, an ignition may occur.",
    "## 6.1 Causes Of Electrostatic Hazards:\n\nThe cause of electrostatic hazards is traceable to mechanisms to generate charge and to permit the charge to accumulate.  These mechanisms are not always obvious.",
    "a.\nFuel flowing through a pipe at high velocity will acquire a net charge.  If the pipe is metal and grounded, the opposite charge which is left on the pipe surface will flow to ground.  If the pipe is a non-conductor such as nylon or teflon, not only is charge carried off by the fuel, but in addition the opposite charge will build up on the surface of the pipe, and can accumulate to the point that \npinhole electrostatic discharge punctures of the pipe itself are produced.\nb.",
    "pinhole electrostatic discharge punctures of the pipe itself are produced.\nb.\nIn aircraft ground refueling systems, the filter-separators used to remove dirt and water present \nlarge surface areas over which charge can separate in flowing fuel.  In hydrant or tank truck \nrefueling systems, the filter separator can create up to 200 times the charging rate that would otherwise occur in the refueling lines (Reference 2).\nc.",
    "c.\nSome military aircraft use explosion suppressant foam in their fuel tanks to reduce combat vulnerability.  These foams are a sponge-like material composed of skeletal networks of tiny \nlightweight strands of polyester-polyurethane or polyether-polyurethane.  Unless precautions are \ntaken, entering fuel can impinge on the foam and depending on the porosity of the foam, the impingement velocity, and the surface area impinged upon, can constitute a potent charge",
    "generator.  In such a case, as with plastic pipes, one charge is left on the foam, and charge of the \nopposite sign is convected away by the fuel.  The charge which resides on the foam (which is a good insulator) cannot easily migrate to ground, and so can quickly accumulate to levels where \nan incendiary discharge can occur.  Incidents traceable to the presence of explosion suppressant \nfoam began to surface in 1974 (Figure 13) and continue to be a problem for the military services.",
    "foam began to surface in 1974 (Figure 13) and continue to be a problem for the military services.\nWhen incendiary events induced by discharges occur in foam protected tanks, the foam prevents explosion, and prevents large scale fire spreading; however, the charred foam must be replaced which is an expensive, time consuming task.  Subtle problems with explosion suppressant foam found in the past have included the following:\n6.1    (Continued):",
    "1.\nPortions of some fuel tank vent systems are filled with foam to prevent fires which could feed \nback into the fuel system.  When high velocity streams of fuel mists and air were passed through the vent system and impinged on the foam, incendiary discharges were observed.\n2.\nAir bubbling through fuel and foam has produced incendiary discharges.\n3.\nHoles are sometimes cut in the foam to save weight and to reduce the amount of fuel",
    "3.\nHoles are sometimes cut in the foam to save weight and to reduce the amount of fuel \nretained by the foam.  If the holes are too large, or if large pieces of foam are not installed due to improper maintenance procedures, the fuel may acquire enough relative velocity \nbecause of sloshing to create incendive discharges when slosh induced fuel waves strike the \nfoam.  The results are inconclusive as to the maximum permissible void size.",
    "## 6.2 Techniques To Prevent Charge Accumulation:\n\nBecause of the nature of fuel and fuel systems, charge generators are always present.  Once charge has been separated, the only way to dispose of it is to permit it to migrate to ground before it accumulates to a hazardous level.  The primary means of reducing the rate of charge generation (and hence accumulation) are by one or more of the following:",
    "a.\nreducing fuel flow rate into a tank by using multiple orifice (Figure 14) or diffuser inlet nozzles\nb.\navoiding fuel system materials which have high charging tendencies\nc.\neliminating fuel impurities or additives which have high charging tendencies\nd.\navoiding impingement of fuel streams on explosion suppressant foam\ne.\navoiding large void volumes in foam to prevent slosh induced charge generation",
    "e.\navoiding large void volumes in foam to prevent slosh induced charge generation\nAssuming that charge is nonetheless generated, it may be possible to provide enough time to bleedoff the charge before the fuel enters the aircraft fuel tanks where it can come into contact with air.",
    "For example, the fuel exiting a filter-separator may be highly charged, but if its arrival at the airplane can be delayed in a plenum, or in refueling lines downstream of the filter, much of the charge may have enough time to migrate to ground, minimizing the rate at which charge enters the aircraft tanks. In this regard, the American Petroleum Institute (API) has established a criterion for refinery and transportation filling operations using metal piping of",
    "VD < 0.5 (Eq. 5)\nwhere:\n\nV = Fuel velocity (m/s)",
    "D = Pipe diameter (m) (Reference 2)",
    "The purpose of the criterion is to allow sufficient relaxation time in the metal pipes to prevent unacceptable charges accumulation in fuel storage tanks or fuel transporters.  The criterion applies to situations where filter and other charge generators are remote from the filling operation; in aircraft refueling where filter separators are located close to the filling operations, a case could be made for a more restrictive criterion.  The API also suggests that the linear flow velocity not",
    "be made for a more restrictive criterion.  The API also suggests that the linear flow velocity not exceed 7 m/s, in the interest of reducing charge generation in the pipes.  Aerial refueling specifications (MIL-F-38363B) permit fuel velocities up to 9.1 m/s in the interest of reducing refueling time.  No filter separators are involved in these procedures, and many years of safe operation indicate that the procedure is safe.",
    "A second technique to dispose of charge is to direct fuel entering the tank against a grounded conducting surface such as a tank wall.  Charge entering the tank is thereby permitted to flow to ground in minimum time, reducing the rate of accumulation.  It is also desirable to locate the fuel tank inlet nozzle as low as possible in the tank (so that it is quickly covered by liquid fuel) and to reduce the entrance velocity; both of these actions will prevent mist formation. A third technique to",
    "the entrance velocity; both of these actions will prevent mist formation. A third technique to dispose of charge is to increase the fuel conductivity by using an additive.  This approach was adopted by the Air Force for JP-4 and JP-8 fuels after the explosion suppressant foam problem surfaced; here the charge is generated inside the fuel tank and none of the above mentioned techniques were of utility.  Recalling that the relaxation time varies inversely with fuel conductivity, the relaxation",
    "Recalling that the relaxation time varies inversely with fuel conductivity, the relaxation time can be substantially reduced by increasing the conductivity by several orders of magnitude.  The specification for JP-4 and JP-8 fuels was changed to require a conductivity of 200 to 600 CU as the fuel entered bulk storage, and a minimum of 100 CU as the fuel entered the aircraft.  The additive technique is not without its drawbacks, since the additive sometimes acts as a pro-static agent (i.e., an",
    "is not without its drawbacks, since the additive sometimes acts as a pro-static agent (i.e., an impurity which increases the rate of charge generation).  The utility of the additive thus depends on the ratio of charge generation to charge dissipation, which can only be determined by test and experience.",
    "## 6.3 Other Techniques To Prevent Incendiary Discharges:\n\nA conservative approach to preventing electrostatic problems would be to assume that charge accumulation will take place and to seek means to insure that discharges which might occur are nonincendive.",
    "a.\nIf the fuel tank ullage were non-flammable, either because of insufficient fuel vapor or oxygen, ignition would not be a concern.  Low vapor pressure kerosene fuels would give non-flammable \nullages at all but the highest refueling temperatures if mists could be avoided.  Alternatively, if the",
    "oxygen content of the ullage air can be reduced to below 9% by volume, the inert ullage cannot be ignited by electrostatic discharges.  Various inerting schemes using either pure nitrogen or oxygen-depleted air are available (Reference 8) to reduce the ullage oxygen content, but have not thus far been incorporated to protect against lightning or electrostatic ignitions.",
    "Since electrically isolated conductors in fuel tanks are hazardous, they should be avoided: if they cannot be avoided, they should be designed and installed to insure that the energy in discharges from them will not be incondary. This can be done by measuring their capacitance (C) and the voltage (V${}_{\\rm B}$) at which electrical breakdown occurs, and calculating the potential discharge energy:",
    "$$\\rm E=\\frac{1}{2}\\,CV_{\\rm B}^{\\ 2}$$ (Eq. 6)\nThe method of calculation and the safe energy limit depends on the specifics of the design.\n\n## 7. Design And Operating Recommendations:\n\nThe following recommendations provide means to reduce electrostatic hazards in aircraft fueling operations:",
    "a.\nIntroduce fuel at low velocity near the bottom of fuel tanks, directing it to impinge on a grounded \nconducting surface.\nb.\nUse a fuel distribution system to insure that all aircraft fuel tank bays are filled to equal levels to \nassist in reducing fuel velocity.  This maximizes relaxation time and minimizes mist formation.\nc.\nConsider using conductivity additives.\nd.",
    "c.\nConsider using conductivity additives.\nd.\nUse special precautions (Reference 10) when switching from low vapor- to high vapor-pressure fuels.  During \"switch\" loading, the fuel-air ratio in the ullage is almost certain to pass through the \npoint of minimum ignition energy for incendive sparks.\ne.\nIf electrically isolated conductors must be used in fuel tanks, limit their capacitance and breakdown \nvoltage to keep maximum stored energy below the ignition threshold.\nf.",
    "voltage to keep maximum stored energy below the ignition threshold.\nf.\nWhen dealing with explosion suppressant foam: 1.\nAvoid passing high velocity air containing fuel mists or vapors through the foam or bubbling air through fuel and foam\n2.\nAvoid direct or indirect impingement of fuel on foam\n3.\nUse the lowest possible tank fill rate, filling from the bottom\n4.\nGive special consideration to the use of conductivity improvers\n5.\nAvoid large void volumes in which sloshing could induce discharges",
    "5.\nAvoid large void volumes in which sloshing could induce discharges\ng.\nAttempt to limit the product of fuel velocity and pipe diameter to less than 0.5 m2/s in aircraft \nrefueling networks, and to 3 m/s at fuel tank inlet nozzles.\nh.\nBe aware that the use of non-conducting pipes in fuel systems can lead to large electrostatic charge accumulation on the pipe surface, with the possibility of pipe perforation.\ni.",
    "i.\nAvoid electrically isolated conductors, or limit the energy which can be stored to a safe level.\nj.\nConsider fuel tank inerting as a final solution."
  ]
}