{
  "source": "SAE AMS2770A 1975.md",
  "chunks": [
    "# Superseding Ams 2770\n\nSociety of Automotive Engineers, Inc. S P EC I FICATI O N \n~ssued \n6-1-74 \n400 COMMONwEAITH DRIVE, WARRENDALE, PA. 15096 \t\nR@VIS@d \t\n6-15-75 \n\n# Heat Treatment Of Aluminum And Aluminum Alloys\n\n## 1, Scope:\n\n1.1 Purpose: This specification covers the engineering requirements for the thermal treatment of aluminum and aluminum alloy parts. \n\nb~ V \nm d \nA~~ \nm \nd ~ \nC~ N \nd ~ d \nd mL \n~d~ \n~a ~ ~o~, \n~on \na ° \nE 10 \nd r \n~~~ \n~cE \n~ u u",
    "b~ V \nm d \nA~~ \nm \nd ~ \nC~ N \nd ~ d \nd mL \n~d~ \n~a ~ ~o~, \n~on \na ° \nE 10 \nd r \n~~~ \n~cE \n~ u u \n\n1.2 Application: To produce conditions favorable to the forxning of parts by annealing or by solution heat \ntreating, quenching, and refrigerating; or to strengthen parts by solution and precipitation heat treatment. \n\nF'rOL \n;, \n~ 3 \n~v~ \noEc \n~, « d \n,°~En",
    "F'rOL \n;, \n~ 3 \n~v~ \noEc \n~, « d \n,°~En \n\n2. APPLICABLE DOCUMENTS: The following publications form a part of this specification to the extent \nspecified herein. The latest issue of Aerospace Material Specifications (AMS) shall apply. The applicable issue of other documents shall be as specified in AMS 2350. \n2.1 SAE Publications: Available from Society of Automotive Engineers, Inc~ , 400 Commonwealth Drive, \nWarrendale, Pennsylvania 15096. \n2.1.1 Aerospace Material Specifications:",
    "A VL \no'~ \n: « \nA~g_ \n~~ ~ \nd~o~ \n~ddd \n~ ~ d~A \nE~m \nE':~o \no n;•- \n` ~ C y \n~v~m \n-~=c \nna~c \nv d?_' `o \nE~ \nAMS 2350 - Standards and Test Methods \nA O q \nQcU_ \nA~~~ \n\n2. 2 ASTM Publications: Available from American Society for Testing and Materials, 1916 Race Street, \nPhiladelphia, Pennsylvania 19103. \nASTM B557 - Tension Testing Wrought and Cast Aluminum and Magnesium Alloy Products \n\n## 3. Technical Requirements: 3.1 Equipment: 3.1,1 Furnaces:",
    "## 3. Technical Requirements: 3.1 Equipment: 3.1,1 Furnaces:\n\nva~°~° \nN \nN \nA ~ \nD TDN \nC C A ~ \nAAa~ \nN Om ~n oo\" w E \nC d L \n W \nL~~r L \numCc \n[ Y \nOa~, u N~'LN \n~` \nod~° \naE~n d a+ c \n~dt~ \nAmdd u ~° .- a \n- ~ ~ m N \nL ~ C C \n« N'j O \nd ~ N \nny \n_ ~",
    "3.1.1.1 \nGeneral: Furnaces shall be of an acceptable type such as air, molten salt bath, oil bath, or fluidized bed. Temperature in the furnace sha11 be controlled as in 3.1.1. 2. The products of \ncombustion or superheated steam should be excluded from contact with the material in the charge, \nElectrical heating elements and radiant tubes shall be shielded to prevent direct radiation from",
    "Electrical heating elements and radiant tubes shall be shielded to prevent direct radiation from \nstriking any part of the furnace charge. Salt baths sha11 be of a composition and maintained in such condition as to prevent attack of the alloys in the charge. \na F m m aA \n.t.~q0 \n~ma w c y \n~ _ :. . ~,o~\" \no>,~ \nN ` E.~ \n0 \nN'~+ ~ N \n` d C N \nN \nV ~ ~ ~ \nAdo; \nm°A d~ \n~ u W \nU O V N \n.~`_o L « `a t d;; : \n~~.,~ \nW .=\n_ \n ~.A \n~`\na E",
    "N \nV ~ ~ ~ \nAdo; \nm°A d~ \n~ u W \nU O V N \n.~`_o L « `a t d;; : \n~~.,~ \nW .=\n_ \n ~.A \n~`\na E \nCAUTION: Salt baths containing mixtures of nitrates are hazardous under certain conditions. E~losive reactions with magnesium may occur if alloys such as 5056, \n5456, and 520.0 (220), containing appreciable amounts of magnesium, are placed in the molten bath. Aluminum alloy parts lost or allowed to remain in the sludge in the bottom of the ta.nk may start a thermit reaction and overheat the bath. Above",
    "1100° F(593° C), either at locally overheated points or throughout the bath, the salt begins to decompose with emission of corrosive and toxic fumes and at higher temperatures may detonate. Contamination with soot, graphite, cyanide, oil, and other oxidizable substances may cause similar reactions. Therefore, salt baths sha11 be operated below 1050° F(566° C) and sludge accumulation sha11 be removed frequently to keep the bath free of contamination and loose parts.",
    "3.1.1.2 Thermocouples: At least one therxnocouple sha11 be located in~ each control zone. Each furnace \nshall have a minimum of two load thermocouples, one each at the hottest and coldest locations in the \nwork zone as determined by furnace survey. Each container of rivets or small parts shall have a thermocouple buried in the center of the load. Load thermocauples shall be attached to the heaviest",
    "section in the load, or peenea into a load test block of the sam.e thicl~ess. Other thermocouples \nshall be located as required to control uniformity of heating. \n3.1, 2 Temperature Controllers: Furnace temperature shall be control:Led by potentiometric control and recording instruments accurate to +2° F(± 1.1° C). Multipoint recarders shall show the temperature of",
    "each therxnocouple by clearly legible indications at least once ea<;h 5 min. , or six times during each heating period, whichever requires the faster printing speed. Cantrol thermocoupies sha11 be located as close as practicable to the work zone. The controls shall maintain a11 points in the work zone within",
    "the specified temperature range after recovery of the coldest therxnocouple to the minimum of the speci fied range following charging of the work load, without overshooting the maximum specified temperature during the heat-up period. For repetitive loads qualified in accordance with 3. 4.1, 5, load thermo• \ncouples may be omitted. \n3.1. 3 Quenching Tanks: Shall be of sufficient capacity and adequate circulation so that the temperature of the",
    "quenchant is not raisedabove the allowable range specified in 3.4. 3. 7. Means shall be provided for circulation, heating, and cooling as necessary. A concentration of dissolved salts above a level that \nleaves a visible deposit on parts after drying shall be reduced by inflow of fresh water during use.",
    "Tanks shall be located as near as practical to the furnace and facilities arranged to allow a rapid transfer of heated parts. Each tank shali be equipped with a temperat~zre indicator accurate to +2° F (-rl, l° C). Racks and containers sha11 be of light and open construction to afford minixnum heat transfer to the work load and quenchant. \n3.1. 4 Refrigeration Units: Sha11 be equipped with temperature recording instruments having an accuracy of \n+2° F (+1,1° C).",
    "+2° F (+1,1° C). \n3.2 Qualification and Calibration of Equipment: Facilities and equipment sha11 be qualified to the requirements of this specification prior to processing of parts. Alteratior.i of equipment or procedures shall \nrequire requalification. \n3.2. 1 Recovery Time: The interval between the closing of the furnace door, or immersion of the load in the \nheating medium, and the first indication that a11 thermocouples ha.ve  reached the specified temperature",
    "range shall be defined as recovery time. Loads shall be arranged in the furnace in such a manner that \nthe combined characteristics of furnace heating and load arrangement allow recovery within the time \nshown in Table I for the thinnest material in the load.",
    "Recovery Time \nminutes max \nMaterial Thiclrness \nInch \t\n(Millimetres) \n15 \n20 25 \nUp to 0. 021, excl \t\n(Up to 0. 53, excl) \n0.021 to 0. 063, incl (0. 53 to 1. 60, incl) \nOver 0.063 to 0.125, incl (Over 1. 60 to 3. 18, incl) \nOver 0.125 to 0. 500, incl (Over 3.18 to 12.70, incl) Over 0. 500 \t\n(Over 12. 70) \n30 \n30 + 10 min. for each additional 0.5 in. (13 mm) \n\n## 3.2.2 Qualification Of Equipment:",
    "3.2. 2.1 Furnace Temperature Survey: The temperature distribution in each furnace sha11 be surveyed for \nuniformity in compliance with applicable technical requirement;s prior to initial production use, after \nany changes that might affect operational characteristics prior to further use, and at not longer than , \nsix month intervals thereafter. \n3. 2. 2.1.1. Test Locations: There shall be at least one test location for each 25 cu ft (0. 70 m 3) of air furnace",
    "working zone or for each 40 cu ft (1.12 m3} of salt bath volume. Each furnace shall have a minimum of nine test locations but the tota.l number need be no more than 40. Test positions for rectangular furnaces shall be at the corners and the center of the working zone with the balance space \nat regular intervals through the remaining space. Test positions for cylindrical furnaces shall be \nat three locations each, spaced regularly around the top and bottom circumferences of the working",
    "at three locations each, spaced regularly around the top and bottom circumferences of the working \nzone, and one each at the top, center, and bottom of the furnace axis, with the balance distributed \nuniformly through the remaining space. \n3. 2. 2.1, 2 Soak Test: Temperature distribution shall be surveyed at one solution heat treating range and one \nprecipitation heat treating range for which each furnace is to be used and at the highest annealing",
    "temperature range at which the furnace will be used. Test thermocouples sha11 be installed in all \nof the test locations in the same manner that a load is charged in the furnace so as to reflect the \nnormal operating characteristics of the furnace. Readings of each thermocouple shall be taken at \nintervals of not longer than 2 min. until the temperature stabilizes and at no longer than 5 min. intervals thereafter until the recurrent temperature pattern is established, but not less than 30",
    "min, after stabilization. \n3.2.2.1. 3 Radiation Test: In addition to the soak test, air furnaces sha11 have three or more radiation panels \nlocated near the center and the ends of the long dimension of the working zone. The panels shall \nbe made of 6061-T4 or -T6 bare alloy sheet nominally 0. 050 in. (1. 27 mm) thick by at least 12 in. \n(305 mm) square with a thermocouple peened into the center. The radiation test may be performed",
    "(305 mm) square with a thermocouple peened into the center. The radiation test may be performed \nas a part of the soak test with the radiation panels used in the place of thermocouples at three of \nthe required test locations. The rolled surfaces of the sheet sha11 be placed normal to the directio~ of the nearest heating element or heated wa11. \n3. 2.3 Accuracy of Furnace Pyrometer Systems: The accuracy of temperature measuring systems sha11 be",
    "determined weekly by comparison with a calibrated probe ,  unless the furnace is operating with two or \nmore potentiometer measuring systems checked daily against each other. Test thermocouple potentiometer instrumentation shall be calibrated against a Bureau of Standards primary or secondary standard \nsystem at intervals of not longer than three months to an accuracy of +2° F(+1.1° C). All furnace systems shall be checked at least once each three months.",
    "3. 3 Preparation: Dirt, welding flux, shot peening residues, die pick-up, and similar contamination shall be \nremoved from parts before placing in the furnace charge. Cleaners shall be compatible with the alloy and surface condition. Organic residues such as cutting oils and rubber mallet marks that burn off \ncleanly do not require cleaning. Salt bath residues sha11 be removed by thorough washing in water.",
    "## 3.4 Procedure: 3.4. 1 General Requirements:",
    "3.4.1. 1 Solution treatment is permissible only for parts which -T42, -T6, -T61, -T62 or -T7X tempers are \nspecified as the final temper. Solution heat treated parts that yield the unstable \"W\"' condition \n(Table V) shall be precipitation heat treated. \n3.4.1. 2 Parts either made from material as supplied by the producer or as solution heat treated in accordance with this specification may be precipitation heat treated, but sha.11 be so treated only in the",
    "starting temper corresponding to the final temper shown in Table VI. Solution heat treated parts in \nthe \"W\" condition may require two precipitation heat treatment steps to obtain the final temper \nspecified for the parts. The interval between solution heat treatment and precipitation heat treatment or between precipitation heat treat steps is not restricted except that 5 days shall elapse be- \t\ni",
    "i \ntween solution heat treatment of 7079 alloy and precipitation heat treatment, and 2 days for 7049 alloy. \n3. 4.1. 3 Annealing, where permissible, shall be followed by solution heat treatment and aging or precipitationl \nheat treatment, unless the \"O\" temper is specified as the final condition. \n3. 4.1. 4 Heat treating operations shall be performed on the whole part, never on a portion only, and in a \nmanner that will produce ma.ximum uniformity.",
    "manner that will produce ma.ximum uniformity. \n3. 4. 1. 5 Heating Time: Shall be based on bath temperatures or load th~~rmocouple readings. Heating, or \nsoaking, time encompasses the time all thermocouples are wi~hin the specified temperature range. For identical or nearly identical loads, the heating time for solution heat treating or precipitation",
    "heat treating is required to be determined by load thermocouples only for the first load of each identical group after each furnace survey. Subsequent loads in a group may be accepted on the basis of \nsimilarity of controller records provided both the indicated recovery time and total of recovery plus \nheating time are within +5 min, of the time indicated by the controller record of the first of the identical loads conforming to load thermocouple control requireme+nts.",
    "3.4.1. 6 Load Arrangement: Material and parts sha11 be racked or sup:ported so as to permit free access of ~ \nthe heating and quenching media to a11 portions of the work load. Very sma11 parts such as washers \nand spacers may be handled like rivets. It is recommended th.at  other parts be separated by at least \n2 in. (51 mm) for solution treating and 1 in. (25 mm) for precipitation heat treatment, and at greater",
    "distances as necessary to prevent blocking of heat flow to other parts or to decrease recovery time. Only aluminim a11oy wire and rod shall be used to support part.s on the racks. Load arrangement and heating time control for identical loads shall be verified beforf: charging the load. \n3.4. 1. 7 Solution and Precipitation Heat Treatments: The work load shall be charged into furnaces that have \nbeen stabilized at the specified temperature. After recovery in conformance with 3. 2.1 the charge",
    "been stabilized at the specified temperature. After recovery in conformance with 3. 2.1 the charge \nshall be heated within the specified temperature range without interruption for the required time as \ndefined in 3. 4.1. 5. The part numbers, material sizes, alloy, quantity of parts or pieces in the work \nload, furnace number, and date of heat treatment shall be rec~rded on the controller cha.rt.",
    "load, furnace number, and date of heat treatment shall be rec~rded on the controller cha.rt. \n3.4. 2 Annealin~: Loads may be charged into furnaces at any temperatu~°e below the ma7cimum permissible \nannealing temperature (3.4. 2. 1), Control of recovery in accordance with 3.2. 1 sha11 apply only to clad \nproducts annealed at temperatures above 700° F(371° C). Heating time begins when the controller recorder reaches the control setting.",
    "3. 4. 2. 1 Only material or parts in the \"O\" or \"F\" condition, or which will subsequently be reheat treated, ma \nbe annealed. Parts shall be annealed as specified in Table II. Annealing of ciad sheet under 0.125 in: \n(3. 18 mm) thick above 700° F(371° C) is not permitted. Clad sheet and plate 0.125 in. (3.18 mm) thick and over may be annealed above 700° F(371° C) once.",
    "## Annealing Of Wrought Aluminum And Alumipnm Alloys",
    "Full Anneal for Removal of Work \nHardening ~uid Previous Heat Treatment from :EIeat Treata.ble Alloys \nFor Removal of Work-Hardening from \nAluminum and Non-Heat Treatable Alloys \nand Heat Treatable Alloy Sheet and Thin \nSections \nOption 1: H[eat to 775~F + 25 (412. 8 C \n+ 14) then cool in fixrnace at uniform \nrate not to c~xceed 50 F(28 C) deg per \nhour to belaw 500°F (260~C). \nOption 1: Heat to 650°F + 25 (343. 3~C \n+ 14) and air cool. For 3003 alloy \nheat to 750°F + 25 (398. 9°C + 14).",
    "+ 14) and air cool. For 3003 alloy \nheat to 750°F + 25 (398. 9°C + 14). \n2024 alloy may be heated to 700°F + 25 \n(371. 1°C + 14) and water quenched \nOption 2: ~hzick dip (not to exceed \n30 sec) in salt bath at 920°F + 10 \n(493. 3°C + 5. 8).",
    "Option 2: For maximum formability, heat to ?75°F + 25 (412. 8~C + 14) and hold 1 hr for each 0.5 in. (13 mm) of thickness of the heaviest section in the load, fuxnace cool to 450°F + 25 \n(232. 2°C + 14), hold at 450°F + 25 \n(232. 2°C +:l4) for not less than 6 hr, and cool in air.",
    "3. 4. 3 Solution Heat Treatment: The charge shall be heated within the temperature range specified in Table V \nfor the applicable alloy, held at temperature for the soak time specified in Table IV for the applicable thickness, and quenched into water in accordance with 3.4. 3. 7. The controlling thicl~ess shall be the \nsmallest dimension of the largest section in the load. \n3. 4, 3.1 Maximum Thicl~ess: Unless otherwise specified, the thicl~ess at the time of heat treatment of the",
    "materials listed in Table III sha11 not exceed the maximum shown. Parts made from plate over 2 in. \n(51 mm), forgings over 3 in. (76 mm), and extrusions over 4 in. (102 mm), shall be machined to \nwithin 0. 5 in. (13 mm) of final thicl~ess before heat treatment. No thiclaiess limits apply to materials not listed in Table III.",
    "Maximum Thickness \nAlloy \t\nFina1 Temper \t Inch \t(Millimetres) \n2014, 2024, 2219 2017, 6061 \n4 \t\n(102) \n8 \t\n(203) \n3 \t\n( 76) \n6 \t\n(152) \n2 \t\n( 51) \n3 \t\n( 76) \n7075 \n7049, 7075 7178 7178 7079 \n7 \t\n(178) \nAll \nAll \nT6, T62, T76, T762 \nT73 T 62 T76 T6, T62",
    "3. 4. 3. 2 Sa1t Baths: Shall not be used for parts in which molten salt could be retained. Rivets shall be \nplaced in a tube closed at one end to prevent contact with the salt and the salt level maintained at least 6 in. (152 mm) above the level of the rivets during heating. \n3. 4.3. 3 Clad Material: The ma~cimum time of heating clad material shall not exceed 2 min. longer than the",
    "minimum time at temperature for thicl~esses under 0. 017 in. (0.43 mm), 5 min. longer than the minimum time for thicl~esses 0. 017 in. (0. 43 mm) to 0. 019 in. (0.48 mm), incl, or 10 min. longer \nthan the minimum time for thicker material. Clad material tha.t has been heat treated in accordance \nwith this specification sha11 not be reheat treated unless authorized by the purchaser. \n3. 4. 3. 4 ftivets: Recovery time for rivet loads shall not exceed 30 min. and in rio case shall the m~imum",
    "effective thicl~ess of the load exceed 3 in. (76 mm). \n3. 4. 3. 5 T411 Temper: When specified as a conditioning treatment for machining or nondestructive testing, \nmaterial in \"F\" or \"O\" temper may be put in the T411 temper by heating to the solution treating \ntemperature and then cooling in air. Material in this condition is considered to be equivalent to \"O\" temper for the purpose of determining the applicability of subsequent heat treatments.",
    "3. 4.3. 6 Air Furnace Atmosphere: Fluoborate compounds may be used to prevent high temperature oxidation \nor blisters. Discoloration res .ulting from heat treatment is acceptable. \n3. 4.3. 7 \t\nuenchin : The solution heat treated load shall be transferred from the working zone of the furnace \nwhile the load is still at the soaking temperature into the quenc:hant, which shall be water, with the \nleast possible delay. The maz~imum time of delay permissible for the thinnest material in the load",
    "least possible delay. The maz~imum time of delay permissible for the thinnest material in the load \nshall be as shown in Table IV. The delay period sha.11 be the ti:me from complete opening of a fizrnace \ndoor or the sta.rt of removal of the charge from a salt bath to c~~mplete immersion in the quenching \nwater. Regardless of time, however, the transfer operation is accepta.ble if it is determined that the",
    "temperature of the thinnest part in the load, when measured at the instant of quenching, is above 775° \nF(413°C). Rivets, fasteners, fastener components, washers, spacers, and other sma.11 parts heated \nin tubes shall be quenched by dumping into water. The quench ~~ater temperature shall be maintained \nbelow 100°F (38°C) during the entire quenching operation, except for forgings and castings and for ,",
    "product to be heat treated to the T61 temper. Castings shall bE: quenched into water maintained \nbetween 150° - 212°F (65. 6° - 100°C), except that alloy 242. 0(142) castings shall be cooled in still \nair for T77 temper. Forgings of 2000 series alloys shall be quenched in water mainta.ined at 150° - \n180°F (65. 6° - 82. 2°C), and all other forgings in water mainta.xned at 140° - 160°F (60° - 71.1°C). \nProducts to be heat treated to the T61 temper shall be quenchecl in boiling water.",
    "## Solution Heat Treat Soak Time ~~Nd Permissible Quench Delay",
    "| Minimum                    | \t                         | Soak                      | \t   |\n|----------------------------|-------------------------|---------------------------|---|\n| Thicl~ess                  |                         |                           |   |\n|                            |                         |                           |   |\n| Maximum Quench             |                         |                           |   |",
    "| Maximum Quench             |                         |                           |   |\n| Time, Minutes              |                         |                           |   |\n| Inches                     |                         |                           |   |\n| (Millimetres)              |                         |                           |   |\n|                            |                         |                           |   |",
    "|                            |                         |                           |   |\n| Delay, sec                 |                         |                           |   |\n| 10                         |                         |                           |   |\n| 0.010 - 0.012, incl        |                         |                           |   |\n| (0.25 - 0.34 incl)         |                         |                           |   |",
    "| (0.25 - 0.34 incl)         |                         |                           |   |\n|                            |                         |                           |   |\n| 4                          |                         |                           |   |\n| 10                         |                         |                           |   |\n|                            |                         |                           |   |",
    "|                            |                         |                           |   |\n| Over 0. 012 - 0.015, incl  |                         |                           |   |\n|                            | (Over 0.30 - 0.39 incl) |                           |   |\n| 5                          |                         |                           |   |\n| 10                         |                         |                           |   |",
    "| 10                         |                         |                           |   |\n| Over 0.015 - 0.019, incl   |                         |                           |   |\n|                            |                         |                           |   |\n| (Over 0.38 - 0.4~ incl)    |                         |                           |   |\n|                            |                         |                           |   |",
    "|                            |                         |                           |   |\n| 6                          |                         |                           |   |\n| 15                         |                         |                           |   |\n| Over 0.019 - 0.030, incl   |                         |                           |   |\n|                            |                         |                           |   |",
    "|                            |                         |                           |   |\n| (Over 0.48 - 0. 76 incl)   |                         |                           |   |\n|                            | 7                       |                           |   |\n| 20                         |                         |                           |   |\n| Over 0. 030 - 0. 063, incl |                         |                           |   |",
    "| Over 0. 030 - 0. 063, incl |                         |                           |   |\n|                            |                         |                           |   |\n| (Over 0. 76 - 1, 60 incl)  |                         |                           |   |\n|                            | 10                      |                           |   |\n| 25                         |                         | Over 0. 063 - 0.090, incl |   |",
    "| 25                         |                         | Over 0. 063 - 0.090, incl |   |\n| (Over 1.60 - 2.2t3 incl)   |                         |                           |   |\n|                            |                         |                           |   |\n| 10                         |                         |                           |   |\n| 30                         |                         |                           |   |",
    "| 30                         |                         |                           |   |\n| Over 0. 090 - 0.125, incl  |                         |                           |   |\n| (Over 2.29 - 3.18 incl)    |                         |                           |   |\n|                            | 15                      |                           |   |\n| 35                         |                         |                           |   |",
    "| 35                         |                         |                           |   |\n| Over 0.125 - 0.250, incl   |                         |                           |   |\n| (Over 3.18 - 6.3:i incl)   |                         |                           |   |\n| 15                         |                         |                           |   |\n| 45                         |                         |                           |   |",
    "| 45                         |                         |                           |   |\n| Over 0.250 - 0.500, incl   |                         |                           |   |\n| (Over 6.35 - 12. 71) incl) |                         | 25                        |   |\n| Q                          |                         |                           |   |\n|                            |                         |                           |   |",
    "|                            |                         |                           |   |\n| Over 0.500                 |                         |                           |   |\n| (Over 12.70)               |                         | 25                        |   |",
    "1~ 45 min. plus 20 min. for each 0. 5 in. (13 mm) over 0. 5 i.n. (13 mm) thiclrness or fraction thereof.",
    "3. 4. 3. 8 Refrigeration of Freshly Quenched Parts: The fresh \"W\" condit:ion may be preserved up to 170 hr by \ncooling below 0° F(-18° C), or up to 30 days by cooling below -1~0° F(-23° C). When material or parts \nare specified to be refrigerated, cool below 0° F(18° C) within 1 hr and maintain refrigeration such that excursions above 0° F(-18° C) to a maximum of 30° F(-1° C) are limited to 100 F deg-hr",
    "(56 C deg-hr) per day, until required for further processing. Parts or material may be immersed in liquified gas or refrigerant to a.id cooling of thick sections. All 2024 rivets shall be refrigerated, \nand 3/32 in. (2. 38 mm) diameter 2117 rivets may be refrigerate~d when specified by the purchaser, \nuntil driven. Other 2117 and 2017 rivets shall be aged 96 hr at ambient temperature before driving.",
    "## 3. 4.4 Aging And Precipita.Tion Heat Treatment:\n\n3.4.4. 1 Room Temperature Aging: After quenching, the 2000 and 6000 ~,eries alloys attain the T42 temper in \nabout 4 days at ambient temperature. No further heat treatment: is permissible for parts for which T42 temper is specified as the final condition, except reheat treatment of bare material and parts. \nAeheat treatment shall consist of optional annealing and then re-solution heat treating. \n\n## Solution Heat Treatment",
    "Alloy \n(Any temper and product) \nSolution Heat \nTreatin~ Temperature \t\nTemper After \n° F \t (° C) \t Heat Treatment \n2014 \n2017 2018 \n2117 2024 2025 2218 \n2219 \n2618 \n925 - 945 \n(496.1 - 507. 2) \nT42 \n925 - 950 \n(496.1 - 510) \nT42 \n940 - 970 \n(504.4 - 521.1) \nT4 \n925 - 950 \n(496.1 - 510) \nT42 \n910 - 930 \n(487. 8- 498. 9) \nT42 \n950 - 970 \n(510 \t\n- 521.1) \nT4 \n940 - 960 \n(504.4 - 515.6) \nT4 & T41 \n985 - 1005 \n(529.4 - 540. 6) \nT42 \n975 - 995 \n(523.9 - 535) \nT4 \n940 - 960 \n(504.4 - 515.6) \nT4",
    "985 - 1005 \n(529.4 - 540. 6) \nT42 \n975 - 995 \n(523.9 - 535) \nT4 \n940 - 960 \n(504.4 - 515.6) \nT4 \n960 - 1000 \n(515.6 - 537.8) \nT42 \n960 - 980 \n(515.6 - 526.7) \nT42 \n865 - 885 \n(462. 8- 473. 9) \nW \n910 - 930 \n(487. 8- 498.9) \nW \n4032 \n6061 6063 7049 \n7075 \nUp to 0. 050 in. \n(12.7 mm), incl \nOver 0. 050 in. (12. 7 mm) to 1.000 in. \n(25.4 mm) incl. \nOver 1.000 in. (25.4 mm) \n7079 \n7178 (sheet) \n7178 (plate) \n7178 (extrusions) \nA201.0 (KO-1) Q \n242.0 (142) 2~ \n295.0 (195) \n355.0 (355)",
    "7178 (plate) \n7178 (extrusions) \nA201.0 (KO-1) Q \n242.0 (142) 2~ \n295.0 (195) \n355.0 (355) \n~ C355.0 (C355) \n356.0 (356) \n865 - 930 \n(462.8 - 498.9) \nW \n865 - 885 \n(462. 8-~k73. 9) \nW \n820 - 870 \n(437.8 - 465.6) \nW \n860 - 930 \n(460 \t\n- 498.9) \nW \n860 - 910 \n(460 \t\n- 487. 8) \nW \n860 - 880 \n(460 \t\n- 471.1) \nW \n930 - 950 \n(498.9 - 510) \n+950 - 970 \n(510 \t\n- 521.1) \n+970 - 990 \n(521.1 - 532.2) \nT4 \n950 - 980 \n(510 \t\n- 526. 7) \nT4 \n940 - 970 \n(504.4 - 521.1) \nT4 \n960 - 990 \n(515.6 - 532.2) \nT4",
    "950 - 980 \n(510 \t\n- 526. 7) \nT4 \n940 - 970 \n(504.4 - 521.1) \nT4 \n960 - 990 \n(515.6 - 532.2) \nT4 \n960 - 990 \n(515. 6- 532.2) \nT4 \n980 - 1010 \n(526. 7- 543.3) \nT4 \n980 - 1010 \n(526. 7- 543.3) \nT4 \n980 - 1010 \n(526. 7- 543.3) \nT4 \nA356.0 (A356) \nA357.0 (A357)",
    "Three step operation: soak at each temperature ~- 9 hr starting with lowest range. \n\n2 \t\nFor 242, 0-T77, air cool and precipita.tion lieat treat.",
    "3. 4, 4. 2 Precipitation Heat Treatment; Pa.rts bo be precipita.tion heat treated shall be heated bo the temperature \nand for the time specified in Ta.ble VI for the applicable staxiing condition and fina.l temper, followed \nby cooling in air. Segregated lots of alloys or tempers requiring different heating times at the same \ntemperature may be processed together if the furnace door is opened for not longer than 2 min. to",
    "temperature may be processed together if the furnace door is opened for not longer than 2 min. to \nremove the lot requiring the shorter heating time. Under no circumstances shall cold material be \nintroduced to a furnace containing other material being precipitation heatireated. After precipitation \nheat treaiment, no further heating of parts is permissible except for reheat treating of bare material",
    "or parts or overaging to the T7X tempers. Reheat trea.tment shall consist of optional annealing and \nthen both re-solution heat treatment and precipitation heat treatment. \n3.4.4, 3 Sfxess Relief of 5000 Seriess When specified, 5083, 5086, and 5456 alloy parts shall be heated for at \nleast 30 min. at 450 F+ 10 (232. 2°C + 5. 6) and cooled in air. Welded assemblies shall be heated for at least 15 min. at 550~F + 10 (287. 8~C + 5. 6).",
    "3. 5 Properties: Heat treatment sha11 produce properties in the par~ts conforming to the values specified \nfor the final heat treated temper of the parts by the specification for the material from which the parts were made, including conductivity and corrosion resistance for the T7X tempers, unless otherwise \nspecified by the drawing or purchase order.",
    "## 4. Quality Assurance Provisions:",
    "4.1 Responsibility for Inspection: The vendor of heat treated produ<:ts sha11 supply all samples and shall be \nresponsible for performing a11 required tests. Results of such tests sha11 be reported to the purchaser as required by 4. 6. Purchaser reserves the right to perform sx~ch confirmatory testing as he deems \nnecessary to assure that the product conforms to the requireme:nts of this specification.",
    "necessary to assure that the product conforms to the requireme:nts of this specification. \n4. 2 Classification of Tests: Tests to determine conformance to a11 technical requirements of this specification are classified as acceptance or routine controltests. \n4. 3 Sampling: Sha11 be in accordance with the following; material u;~ed as test specimens shall conform to \napplicable material specifications.",
    "applicable material specifications. \n4. 3.1 Qualification: For qualification of equipment, not less than nine 7075 or 2024 alloy tensile test specimens sha11 be solution and precipitation heat treated in accord,~.nce with the use of each furnace at the test locations specified in 3. 2. 2.1.1. The specimens may be ]heat treated concurrent with the temper \nture uniformity survey, separately, or with a production load. Tensile tests shall be performed in \naccordance with ASTM B557.",
    "accordance with ASTM B557. \n4. 3.2 Production: When specified, one or more specimens representing the thickest and thinnest sections \nof the parts and of the same alloy and product as the parts, sha11 be distributed through the load and \nprocessed with the parts.",
    "processed with the parts. \n4.4 Approval: Processor shall submit results of qualification tests and surveys for approval of the purchaser before parts for production use are supplied, unless sucli approval be waived. If necessary to make any change or repair for which requalification is required, no production parts shall be processed \nprior to receipt of reapproval. \n4. 5 Heat Treatment Lo~: A log for each heat treat load sha11 be maintained to verify conformance to the",
    "requirements of this specification of the following: qualification. of equipment, a11oy and temper, arrangement of load, recovery time, furnace temperature control, time at temperature, quench delay \ntime, and temperature of quenchant for solution heat treatment, and the date of heat treatment. The \t\n, \nlog shall be traceable to a11 furnace records and recorder chart:a and shall be retained for inspection for \nat least two years.",
    "at least two years. \n4. 6 Re orts: The vendor of heat treated products shall furnish with. each shipment three copies of a report \nshowing the heat treat log entry reference for each furnace charp;e of heat treated parts, the results of \ntests to determine conformance to the requirements of this specification, and a statement that the charge was processed in conformance to the requirements of this specification. This report shall include the",
    "purchase order number, this specification number and its revisi.on letter, material specification number \nand its revision letter if any, part numbers, alloy, and quantity. \n4. 7 R.esampling and Retesting: Shall be as agreed upon by purchasex -  and vendor.",
    "## 5. Preparation Foa Delivery:",
    "5.1 Identification: When specified, parts sha11 be identified as agreed upon by purchaser and vendor. 5.2 Packaging: Parts shall be handled and transported so as to preserve the required physical characteristics and properties. \n6.\nACKNOWLEDGMENT: A vendor shall mention this specification number and its revision letter in all \nquotations and when acknowledging purchase orders. \n7. REJECTIONS: Parts and material not heat treated in accordance with this specification or with authorized \n\"'",
    "\"' \t\nmodifications will be subject to rejection. Evidence of eutectic melting, intergranular-corrosion susceptibility, or high-temperature oxidation, or failure of any test specimen to meet specified requirements shall be cause for rejection of parts and requalification of equipment. \n8. NOTES• \n \n8.1 Margina,l Indicia; The phi (¢) symbol is used to indicate technical changes from the previous issue of this \nspecification.",
    "specification. \n8. 2 Overaged (T7X) Material Properties: Each lot of 7000 series material intended to be heat treated to any of \nthe T7X tempers as the final condition should be_ sampled for capability of ineeting specified mechanical \nproperty and corrosion resistance requirements when processed in accordance with this specification, or \nthe purchaser should require as a condition of acceptance the capability of the material to meet the specifie",
    "properties when heat treated in accordance with the requirements of this specification to the T7X tempers. \n8. 3 Sixnilar Specification: MIL-H-6088 is listed for information only and shall not be construed as an acceptable alternate unless all requirements of this specification are met.",
    "## Precipitation Heat Treatment",
    "| Temper           | \t           |\n|------------------|-----------|\n| Temperature      |           |\n| Before           |           |\n| Time             |           |\n| Fina1            |           |\n| Alloy            |           |\n|                  |           |\n| Product          |           |\n| Treatment        |           |\n|                  |           |\n| ° F              |           |\n|                  |           |\n| (° C)            |           |\n|                  |           |",
    "|                  |           |\n| (° C)            |           |\n|                  |           |\n| Hours            |           |\n|                  |           |\n| Temper           |           |\n| Sheet, Plate     |           |\n| T3               |           |\n| T6               |           |\n| 310 - 330        |           |\n|                  |           |\n| (154.4 - 165.6)  |           |\n|                  |           |\n| 18 - 20          |           |\n| T62              |           |",
    "|                  |           |\n| 18 - 20          |           |\n| T62              |           |\n| T42              |           |\n| T451             |           |\n| T651             |           |\n| Wire, Rod        |           |\n| T4               |           |\n| T6               |           |\n| 2014             |           |\n|                  | Bar, Tube |\n| T42              |           |\n| T62              |           |\n| Extrusions       |           |\n| T451             |           |",
    "| T62              |           |\n| Extrusions       |           |\n| T451             |           |\n| 340 - 360        |           |\n| (171.1 - 182.2)  |           |\n| 8- 10            |           |\n| T651             |           |\n| T4510            |           |\n| T6510            |           |\n| T4511            |           |\n| T6511            |           |\n| Forgings         |           |\n| T4               |           |\n| T6               |           |\n| Rolled Rings     |           |",
    "| T4               |           |\n| T6               |           |\n| Rolled Rings     |           |\n| T42              |           |\n| 330 - 350        |           |\n|                  |           |\n| (165.6 - 176. 6) |           |\n|                  |           |\n| 10 - 12          |           |\n| T6               |           |\n| T452             |           |\n| T652             |           |\n| 2018             |           |\n| Forgings         |           |\n| T4               |           |",
    "| 2018             |           |\n| Forgings         |           |\n| T4               |           |\n| 330 - 350        |           |\n| (165.6 - 176. 7) |           |\n| 10 - 12          |           |\n| T6               |           |\n| Sheet, Plate     |           |\n| T3               |           |\n| T81              |           |\n| Wire, Rod        |           |\n| T351             |           |\n| T851             |           |\n| Bar, Tube        |           |\n| T4               |           |",
    "| T851             |           |\n| Bar, Tube        |           |\n| T4               |           |\n| 370 - 380        |           |\n| (187.8 - 193.3)  |           |\n| 9. 5- 10.5       |           |\n| T6               |           |\n| T42              |           |\n| T62              |           |\n| Sheet, Plate     |           |\n| T36              |           |\n| 370 - 380        |           |\n| (187. 8- 193. 3) |           |\n| 5. 5- 6. 5       |           |\n| T86              |           |",
    "| (187. 8- 193. 3) |           |\n| 5. 5- 6. 5       |           |\n| T86              |           |\n| 2024             |           |\n|                  |           |\n| Wire, Rod        |           |\n| T361             |           |\n| T861             |           |\n| Bar              |           |\n| Sheet            |           |\n| T4               |           |\n| 370 - 380        |           |\n| (187. 8- 193. 3) |           |\n| 15 - 17          |           |\n| T72              |           |",
    "| (187. 8- 193. 3) |           |\n| 15 - 17          |           |\n| T72              |           |\n| T42              |           |\n| T72              |           |\n| Extrusions       |           |\n| T4               |           |\n| T S 1            |           |\n| Forgings         |           |\n| T42              |           |\n| T62              |           |\n| T3510            |           |\n| 370 - 380        |           |\n| (187. 7- 193. 3) |           |\n| 9. 5- 10. 5      |           |",
    "| 370 - 380        |           |\n| (187. 7- 193. 3) |           |\n| 9. 5- 10. 5      |           |\n| T8510            |           |\n| T3511            |           |\n| T8511            |           |\n| 2025             |           |\n| Forgings         |           |\n| T4               |           |\n| 330 - 350        |           |\n| (165. 6- 176. 7) |           |\n| 10 - 12          |           |\n| T6               |           |",
    "## Precipitation Heat Treatment",
    "Temper \nTemperature \nBefore \nTime \nFinal \nAlloy \t\nProduct \nTreatment \n° F \n(° C) \nHours \nTemper \n2218 \t\nForgings Q \nT4 \n330 - 350 \n(165. 5- 176. 7) \n10 - 12 \nT61 \nT41 \n450 - 470 \n(232.2 - 243. 3) \n5. 5- 6. 5 \nT72 \nSheet \nT31 \n340 - 360 \n(171.1 - 182. 2) \n17 - 19 \nT81 \nT37 \n315 - 335 \n(157.2 - 168. 3) \n23 - 25 \nT87 \nWire, Rod \nT3510 \nT8510 \n2219 \t\nBar Extrusions \nT3511 \n340 - 360 \n(171.1 - 182.2) \n17 - 19 \nT8511 \nT37 \nT87 \nAll, Except \nT42 \n365 - 385 \n(185 - 196.1) \n35 - 37 \nT62 \nForgings",
    "17 - 19 \nT8511 \nT37 \nT87 \nAll, Except \nT42 \n365 - 385 \n(185 - 196.1) \n35 - 37 \nT62 \nForgings \nForgings \nT4 \n365 - 385 \n(185 \t\n- 196.1) \n25 - 27 \nT6 \nRolled Rings \nT352 \n340 - 360 \n(171. 1- 182.2) \n17 - 19 \nT852 \nHand For 'n s \n2618 \t\nFor~ings \nT4 \n380 - 400 \n(193.3 - 204.4) \n19 - 21 \nT61 \n4032 \t\nForgings \nT4 \n330 - 350 \n(165. 6- 176. 7) \n9- 11 \nT6 \nSheet, Plate \nT4 \nT6 \nRod, Bar \nT42 \n310 - 330 \n(154.4 - 165. 6) \n18 - 20 \nT62 \nTube \nT451 \nT651 \n6061 \t\nExtrusions \t\nT4 \t\nT6 \nForgings \tT42",
    "(154.4 - 165. 6) \n18 - 20 \nT62 \nTube \nT451 \nT651 \n6061 \t\nExtrusions \t\nT4 \t\nT6 \nForgings \tT42 \t\nT6, T61Q \nRolled Rings \t\nT4510 \t\n340 - 360 \t\n(171.1 - 182. 2) 7. 5- 8. 5 \t\nT6510 \nT4511 \t\nT6511 \nT452 \t\nT 652 \n6063 \t\nAll \nTl \nT4 \nT42 \n390 - 410 \n340 - 360 \n(198. 9- 210) \n(171, 1- 182. 2) \n0. 75 - 1.25 \n7. 5- 8. 5 \nT5 \nT6 \nT62 \n7049 \t\nForgings \nW \n240 - 260 \n(115. 6- 126. 7) \n24 - 25 \nT6 \nT6 \nAmbient \n48 min \nUp to 4 in. (102 mm) +330 - 340 \n(165. 6- 171. 1) \n12 - 14 \nT73",
    "24 - 25 \nT6 \nT6 \nAmbient \n48 min \nUp to 4 in. (102 mm) +330 - 340 \n(165. 6- 171. 1) \n12 - 14 \nT73 \nOver 4 in. (102 mm) +325 - 335 \n(162. 8- 168. 3 \n12 - 14 \nT73 \nAll Products \nW \n240 - 260 \n(115. 6= 126. 7) \n22 - 26 \nT6 \n7075 \t\nSheet \nT6 \n320 - 330 \n(160 - 165.6) \n24 - 25 \nT73 \nPlate \nT651 \nT7351 \nExtrusions \nT6 \nT73 \nT6510 \n345 - 355 \n(173.9 - 179.4) \n7- 7. 5 \nT73510 \nT6511 \nT73511 \nForgings \nT6 \n345 - 355 \n(173.9 - 179.4) \n8- 8. 5 \nT73 \nBar, Rod \nT651 \n345 - 355 \n(173. 9- 179.4) \n7- 7. 5",
    "T6 \n345 - 355 \n(173.9 - 179.4) \n8- 8. 5 \nT73 \nBar, Rod \nT651 \n345 - 355 \n(173. 9- 179.4) \n7- 7. 5 \nT7351 \nT652 \nT7352 \nSheet \nT6 \n320 - 330 \n(160 - 165.6) \n16 - 17 \nT76 \nPlate \nT651 \nT7651 \nExtrusions \nT6 \nT76 \nT6510 \n315 - 325 \n(157.2 -:162. 8) \n19 - 20 \nT76510 \nT6511 \nT76511 \n1Q Boiling Water Quenched",
    "2~ Forgings which were quenched in boiling water will be :in the T61 temper after this treatment. \n\n## Pftecipitation Heat Treatment",
    "| Temper                             | \t               |\n|------------------------------------|---------------|\n| Temperature                        |               |\n| Before                             |               |\n|                                    |               |\n| Time                               |               |\n|                                    |               |\n| Final                              |               |\n| Alloy                              |               |",
    "| Alloy                              |               |\n| Product                            |               |\n|                                    |               |\n| Treatment                          |               |\n| Hours                              |               |\n|                                    |               |\n| Temper                             |               |\n| 7079                               |               |\n|                                    | All           |",
    "|                                    | All           |\n| W                                  | Ambient       |\n| +230 - 250                         |               |\n| (110 - 121.1)                      |               |\n|                                    |               |\n| 48 - 50                            | T6            |\n| All                                |               |\n| W                                  |               |\n| 240 - 260                          |               |",
    "| 240 - 260                          |               |\n| (115. 6- 126. 7)                   |               |\n|                                    |               |\n| 22 - 26                            | T6            |\n| Sheet                              |               |\n| T6                                 |               |\n| 320 - 330                          | (160 - 165.6) |\n| Plate                              |               |\n| T651                               |               |",
    "| T651                               |               |\n| T7351                              |               |\n| 7178                               |               |\n|                                    |               |\n| Extrusions                         |               |\n|                                    |               |\n| T65                                |               |\n|                                    |               |\n| T73                                |               |",
    "| T73                                |               |\n| T6510                              |               |\n|                                    |               |\n| 345 - 355 (173. 9- 179. 4)         |               |\n| 7- 7.5                             |               |\n|                                    | T73510        |\n| T6511                              |               |\n|                                    |               |\n| T73511                             |               |",
    "| T73511                             |               |\n| Sheet                              |               |\n|                                    |               |\n| T6                                 |               |\n|                                    |               |\n| 320 - 330 (160 - 165.6)            |               |\n|                                    | 16 - 17       |\n| T76                                |               |\n| Plate                              |               |",
    "| Plate                              |               |\n|                                    |               |\n| T651                               |               |\n|                                    |               |\n| T7651                              |               |\n| Extrusions                         |               |\n|                                    | T6510         |\n| 315 - 325 (157.2 - 162. 8) 19 - 20 |               |\n| T6511                              |               |",
    "| T6511                              |               |\n|                                    |               |\n| T76511                             |               |\n| A201.0 (KO-11 Castings             |               |\n|                                    |               |\n| T4                                 |               |\n|                                    |               |\n| 12 - 24                            |               |\n| +300 - 320                         |               |",
    "| +300 - 320                         |               |\n| (148. 9- 160)                      | 18 - 20       |\n| T6                                 |               |\n| 242.0 (142)                        | Castings      |\n| T4                                 |               |\n| 640 - 660                          |               |\n| (337.8 - 348.9)                    |               |\n| 1- 3                               |               |\n| T77                                |               |",
    "| T77                                |               |\n| A242. 0(A142)                      |               |\n| Castirigs                          |               |\n| T4                                 |               |\n| 540 - 560                          |               |\n| (282.2 - 293. 3)                   | 2- 5          |\n| 295. 0(195)                        | Castings      |\n|                                    |               |\n| ^                                  | 300 - 320     |",
    "| ^                                  | 300 - 320     |\n| (148.9 - 160)                      |               |\n| 12 - 20                            | T62           |\n| F                                  |               |\n| 430 - 450                          |               |\n| (221.1 - 232. 2)                   |               |\n| 7- 9                               |               |\n| T51                                |               |\n| 355. 0(355)                        | Castings      |",
    "| 355. 0(355)                        | Castings      |\n| (148. 9- 160)                      | 3- 5          |\n| T4                                 | 465 - 485     |\n| 4- 6                               |               |\n| T71                                |               |\n| C355. 0(C355)                      |               |\n| Castings                           | T4            |\n| (148, 9- 160)                      |               |\n| 10 - 12                            |               |",
    "| 10 - 12                            |               |\n| T61                                |               |\n| 356. 0(356)                        |               |\n| Castings                           |               |\n| F                                  |               |\n| 430 - 450                          |               |\n| (221, 1- 232.2)                    |               |\n| 7- 9                               |               |\n| T51                                |               |",
    "| T51                                |               |\n| T4                                 |               |\n| 300 - 320                          |               |\n| (148. 9- 160)                      |               |\n| 3- 5                               |               |\n| T6                                 |               |\n| T4                                 |               |\n| 390 - 410                          |               |\n| (198. 9- 210)                      |               |",
    "| (198. 9- 210)                      |               |\n| 3- 5                               | T7            |\n| T4                                 | 465 - 485     |\n| (240. 6- 251. 7)                   | 2- 4          |\n| T71                                |               |\n| A356. 0(A356)                      |               |\n| Castings                           |               |\n| T4                                 |               |\n| 300 - 320                          |               |",
    "| 300 - 320                          |               |\n| (148.9 - 160)                      |               |\n| 6- 10                              |               |\n| T61                                |               |\n| A357.0 (A357)                      | Castings      |\n| T4                                 | 300 - 320     |\n| (148. 9- 160)                      | 10 - 12       |\n| T61                                |               |\n| T4                                 | 330 - 350     |",
    "| T4                                 | 330 - 350     |\n| (165. 6- 176. 7)                   |               |\n| 6- 10                              | T62           |\n| 850.0 (750)                        |               |\n| A850. 0(A750)                      | Castings      |\n| 420 - 440                          |               |\n| (215. 6- 226. 7)                   | 7- 9          |\n| T5                                 |               |\n| B850.0 (B750)                      |               |"
  ]
}