{
  "source": "SAE AS8021 1981.md",
  "chunks": [
    "(b) \nHigh Temperature - The instrument shall be subjected to the tests of DO-160, \nparagraph 4.5.1 and 4.5.2. \nDuring the test, paragraph 4.5.1, the instrument shall \noperate electrically and mechanically and there shall be no evidence of materials such \nas potting and sealing compounds exuding or dripping from the instrument. \nWhen \nsubjected to the tests of paragraph 4.5.2, the instrument shall operate electrically",
    "When \nsubjected to the tests of paragraph 4.5.2, the instrument shall operate electrically \nand mechanically and the requirements of paragraph 5.1 of this Standard shall be \nmet. \nFollowing the test, the requirements of paragarph 4,0 of this Standard shall \nbe met \nat standard conditions. \n(ce) \nAltitude \n- The instrument shall be subjected to the tests of DO-160, paragraphs 4.6.1, \n4.6.2, and 4.6.3. \nDuring the test, paragraph 4.6.1, the instrument shall operate",
    "4.6.2, and 4.6.3. \nDuring the test, paragraph 4.6.1, the instrument shall operate \nelectrically and mechanically and the requirements of paragraph 5.1 of this Standard \nshall be met. \nAfter being subjected to the tests of paragraph 4.6.2, \nthe requirements \nof paragraph 4.0 of this \nStandard shall be met \nat standard conditions, and after being \nsubjected to the tests of paragraph 4.6.3, the requirements of paragraph 4,0 shall be \nmet. \n(d) \nHumidity",
    "met. \n(d) \nHumidity \n- The instrument shall be subjected to the tests of DO-160, paragraph 6.0. \nAfter the instrument \nis subjected to the appropriate tests of paragraph 6.0, \nit shall \nmeet the requirements of paragraph 4.0 of this Standard at standard conditions. \n5.3 \nShock: \nThe instrument shall be subjected to the tests of DO~-160, paragraphs \n7.1 and \n7.2. \n(a) \nAfter the instrument \nis subjected to the tests of paragraph 7.1, \nit shall meet the",
    "7.2. \n(a) \nAfter the instrument \nis subjected to the tests of paragraph 7.1, \nit shall meet the \nrequirements of paragraph 4.0 of this Standard under standard conditions. \n(b) \nFollowing the tests of paragraph 7.2, the instrument or dummy load shall have remained in its mounting and no parts of the instrument or its mounting base become \ndetached and free of the shock tested equipment. \n5.4 \nVibration: \nThe instrument shall be subjected to the tests of DO-160, paragraph 8.2. \nDuring \nthe test,",
    "The instrument shall be subjected to the tests of DO-160, paragraph 8.2. \nDuring \nthe test, \nit shall operate electrically and mechanically and the requirements of paragraph 5.1 \nshall be met. \nFollowing the test, \nthe requirements of paragraph 4.0 of this Standard shall be \nmet, at standard conditions.",
    "## 5.5 Power Input:",
    "(a) \nNormal Electrical Input Varaition Test \n1. \nThe instrument shall be subjected to the tests.of DO-160, paragraph 16.3.1. \nDuring the test, \nit shall meet the requirements of paragraph 5.1 of this \nStandard. \n2,. \nThe instrument shall be subjected to the tests of DO-160, paragraph 16.3.2. \nDuring the test, \nit shall meet the requirements of paragraph 5.1 of this Standard, \n(b) \nAbnormal Electrical Input Variations Test \n1.",
    "(b) \nAbnormal Electrical Input Variations Test \n1. \nThe instrument shall be subjected to the tests of DO-160, paragraph 16.3.3. \nDuring the test, \nit shall operate electrically and mechanically, and degradation \nof performance is permissible. \nThere shall be no evidence of the presence of \nfire \nor smoke during the test of paragraph 16.3.3.2. \nAfter returning to normal \ninput \nit shall meet the requirements of paragraph 4.0 of this Standard."
  ]
}