{
  "source": "SAE AMS3804C 1984.md",
  "chunks": [
    "## Cloth, Airplane, Cotton, Mercerized 65 Lb (290 N) Breaking Strength 1. Scope:",
    "l.l Form: This specification covers one strenqth and one weave of inercerized \ncotton known as \"airplane cloth.\" \n1.2 Application: Primarily for covering aircraft surfaces, such as wings, \nfuselage, ailerons, elevators, and other airfoil surfaces. \n2.\nAPPLICABLE DOCUMENTS: The following publications fo ml a part of this \nspecification to the extent specified herein. The latest issue of Aerospace \nMaterial Specifications (AMS) shall apply. The applicable issue of other",
    "Material Specifications (AMS) shall apply. The applicable issue of other \ndocuments shall be as specified in AMS 2350. \n2.1 SAE Publications: Available from SAE, 400 Commonwealth Drive, Warrendale, \nPA 15096. \n2.1.1 Aerospace Material Specifications: \nAMS 2350 - Standards and Test Methods",
    "2.2 ASTM Publications: Available from American Society for Testing and \nMaterials, 1916 Race Street, Philadelphia, PA 19103. \nASTM D629 - Quantitative Analysis of Textiles ASTM D1682 - Breaking Load and Elongation of Textile Fabrics ASTM D1910 - Construction Characteristics of Woven Fabrics",
    "2.3 U.S. Government Publications: Available from Commanding Officer, Naval \nPublications and Forms Center, 5801 Tabor Avenue, Philadelphia, PA 19120. \n2.3.1 Military Standards:",
    "2.3.1 Military Standards: \nMIL-STD-794 - Parts and Equipment, Procedures for Packaging and Packing of SAE Technical Board Rules provide that: \"This report is published by SAE to advance the state of technical and engineering sciences. The use of this report is entirely voluntary, and its applicability and suitability for any particular use, including any patent infringement arising therefrom, is the sole responsibility of the user.\"",
    "## 3. Technical Requirements:",
    "3:1 Material: \n3.1.1 Mercerization: The cloth shall be piece mercerized or the yarn may be \nmercerized under tension. \n3.1.2 Yarn: The cloth shall be woven from 1- or 2-ply, combed cotton yarn. \n3.1.3 Weave: The weave shall be plain (one up and one down). \n3.1.4 Finishing: The cloth shall be uniformly finished in accordance with the \nbest practice for high-grade airplane cloth. Finishing shall consist of \nwashing, framing, and calendering. The calendering shall be sufficient to",
    "washing, framing, and calendering. The calendering shall be sufficient to \nlay any nap present and shall provide a smooth, even surface. Nap may be removed by singeing. \n3.2 Properties: The cloth shall conform to the following requirements; tests \nshall be performed on the cloth supplied and in accordance with specified \ntest methods:",
    "3.2.1 Weight: \t\nASTM D1910 \noz per sq yd, max \n(g/m2 , max) \n4.0 \n(135) \n3.2.2 Thread Count, ends per in. (25.4 mm): \nWarp and Fill, each, max \nASTM D1910 \n80 to 94 \n3.2.3 Breaking Strength, each direction: \nlbf per in. width, min \n(N/25 mm width, min) \nASTM D1862, \nRavelled strip \n65 \t\nmethod \n(290) \n3.2.4 Elongation: \t\nWarp \t\nFill \t\nASTM D1862, \n(See 4.5.1) \nAt 57 lb (255 N) load, max \t\n13$ \t\n11~ \n3.2.5 Sizing, Finishing, and Other \t\nASTM D629, \nNon-Fibrous Materials, max: \t\n2.5$",
    "13$ \t\n11~ \n3.2.5 Sizing, Finishing, and Other \t\nASTM D629, \nNon-Fibrous Materials, max: \t\n2.5$ \t\nEquation 3",
    "3.2.5.1 A desizing operation may be performed to reduce the sizing content to \nthe maximum specified. \n3.3 Quality: The cotton fibers shall be evenly spun into yarns of proper and \nuniform yarn count, twist, and diameter to produce the texture and weight \nrequired. The yarn shall be reasonably free from nap breaks, broken ends, \nuneven threads, and knots. Yarns shall be closely woven into fabric uniform \nin body and appearance, and which shall be reasonably free from striations",
    "in body and appearance, and which shall be reasonably free from striations \ndue to variable weaving operations. \n3.4 Tolerances: Unless otherwise specified, the following tolerances apply: 3.4.1 Width:",
    "Nominal Width Tolerance, Inches Nominal Width Tolerance, Millimetres \nInches \t\nplus and minus \t\nMillimetres \t\nplus and minus \n~ \n36 \n1/2 \n915 \n13 \n42 \n5/8 \n1065 \n16 \n60 \n1 \n1525 \n25 \n69 \n1 \n1750 \n25 \n90 \n1-1/2 \n2285 \n38",
    "3.4.2 Length of Cut: The length of a single cut shall be not less than 40 yd \n(36.5 m) except that 10~ of the total yardaqe of one width under any \ncontract or order may be in short lengths of 10 to 25 yd (9 to 23 m). \nHowever, short lengths shall be rolled together and the roll properly labeled to indicate that it is composed of short lengths. \n3.4.3 Length of Roll: The cloth shall be furnished on rolls containing the \nfollowing lengths:",
    "Nominal Width \nInches \nRoll Length \nYards \nNominal Width \nMillimetres \nRoll Length \nMetres \n36 and 42 \n60 and 69 \n90 \n500 to 600 \n250 to 300 175 to 200 \n915 and 1065 \n1525 and 1750 \n2285 \n457 to 548 \n229 to 274 160 to 183 \n\n## 4. Quality Assurance Provisions:",
    "## 4. Quality Assurance Provisions:\n\n4.1 Responsibility for Inspection: The vendor of cloth shall supply all \nf~ samples for vendor's tests and shall be responsible for performing all \nrequired tests. Results of such tests shall be reported to the purchaser as \nrequired by 4.6. Purchaser reserves the right to sample and to perform any \nconfirmatory testing deemed necessary to ensure that the cloth conforms to \nthe requirements of this specification. \n\n## 4.2 Classification Of Tests:",
    "4.2.1 \nAcceptance Tests: \nTests to determine conformance to requirements for \n~! \t\nweight (3.2.1), thread count (3.2.2), breaking strength (3.2.3), elongation (3.2.4), quality (3.3), and tolerances (3.4) are classified as \nacceptance tests and shall be performed on each lot. \t\n~~ \n4.2.2 Preproduction Tests: Tests to determine conformance to all technical \n~ \t\nrequiremen~s of this specification are classified as preproduction tests \n-",
    "~ \t\nrequiremen~s of this specification are classified as preproduction tests \n- \t\nand shall be performed prior to or on the initial shipment of cloth to a \npurchaser, when a change in material or processing, or both, requires \nreapproval as in 4.4.2, and when purchaser deems confirmatory testing to \nbe required. \n4.2.2.1 For direct U.S. Military procurement, substantiating test data and, when \n~ \t\nrequested, preproduction test material shall be submitted to the",
    "~ \t\nrequested, preproduction test material shall be submitted to the \ncognizant agency as directed by the procuring activity, the contracting \nofficer, or the request for procurement.",
    "## 4.3 Sampling: Shall Be As Follows:",
    "4.3.1 For Acceptance Tests: Each lot of cloth shall be 100$ visually examined \n~ \t\nfor quality (3.3). Sufficient cloth shall be taken at random from each \nlot to perform all required tests; the number of determinations for each \nrequirement shall be as specified in the applicable test procedure or, if not specified therein, not less than three, ~aken from the full width of \nthe cloth. \n4.3.1.1 A lot shall be all cloth produced in a single production run under the \n~",
    "the cloth. \n4.3.1.1 A lot shall be all cloth produced in a single production run under the \n~ \t\nsame conditions and presented for vendor's inspection at one time. An inspection lot shall not exceed 5000 yd (4600 m). A lot may be packaged in small quantities under the basic lot approval provided the lot identification is maintained. \n4.3.1.2 When a statistical sampling plan and acceptance quality level (AQL) have \n~ \t\nbeen agreed upon by purchaser and vendor, sampling shall be in",
    "~ \t\nbeen agreed upon by purchaser and vendor, sampling shall be in \naccordance with such plan in lieu of sampling as in 4.3.1 and the report \nof 4.6.1 shall state that such plan was used. \n4.3.2 For Preproduction Tests: As agreed upon by purchaser and vendor. \n~",
    "## 4.4 Approval:",
    "4.4.1 Sample cloth shall be approved by purchaser before cloth for production \nuse is su~plied, unless such approval be waived by purchaser. Results of \ntests on production cloth shall be essentially equivalent to those on the approved sample. \n4.4.2 Vendor shall use ingredients, manufacturing procedures, processes, and \n~ \t\nmethoda of inspection on production cloth which are essentially the same \nas those used on the approved samp~e cloth. If necessary to make any",
    "as those used on the approved samp~e cloth. If necessary to make any \nchange in ingredients, in type of equipment for processing, or in \nmanufacturing procedures, vendor shall submit for reapproval a statement \nof the proposed changes in material or processing, or both, and, when \nrequested, sample cloth. Production cloth made by the revised procedure shall not be shipped prior to receipt of reapproval.",
    "## 4.5 Test Methods:\n\n4.5.1 Elongation: Shall be measured from a base line on the chart to a point at \nwhich the curve intersects 57 lb (255 N) load ordinate with the base line \npassing through the point where the curve leaves the zero ordinate. \n\n## 4.6 Reports:",
    "4.6.1 The vendor of cloth shall furnish with each shipment three copies of a \n~ \t\nreport showing the results of tests to determine conformance to the \nacceptance test requirements and stating that the cloth conforms to the \nother technical requirements of this specification. This report shall \ninclude the purchase order number, AMS 3804C, vendor's material \ndesignation, lot number, width, and quantity. \n4.6.2 The vendor of finished or semi-finished parts shall furnish with each \n~",
    "4.6.2 The vendor of finished or semi-finished parts shall furnish with each \n~ \t\nshipment three copies of a report showing the purchase order number, \nAMS 3804C, contractor or other direct supplier of cloth, supplier's \nmaterial designation, and quantity. When cloth for making parts is \nproduced or purchased by the parts vendor, that vendor shall inspect each \nlot of cloth to determine conformance to the requirements of this",
    "lot of cloth to determine conformance to the requirements of this \nspecification and shall include in the report either a statement that the \ncloth conforms or copies of laboratory reports showing the results of \ntests to determine conformance. \t\n~ \n4.7 Resampling and Retesting: If any specimen used in the above tests fails to \nQ~ meet the specified requirments, disposition of the cloth may be based on the",
    "Q~ meet the specified requirments, disposition of the cloth may be based on the \nresults of testing three additional specimens for each original nonconforming specimen. Failure of any retest specimen to meet the \nspecified requirements shall be cause for rejection of the cloth represented \nand no additional testing shall be permitted. Results of all tests shall be \nreported.",
    "## 5. Preparation For Delivery:\n\n5.1 Identification: The cloth shall incorporate a continuous marking to show \nnot less than the manufacturer's name or trade mark and AMS 3804C. This \nmarking may be along the selvage. \n\n## 5.2 Packaging:",
    "5.2.1 Packaging shall be accomplished in such a manner as to ensure that the \ncloth, during shipment and storage, will not be permanently distorted and \nwill be protected against damage from exposure to moisture, weathering, or any other normal hazard. \n5.2.2 Each package shall be permanently and legibly marked to show not less than \ng \t\nthe following information; characters shall be of such size as to be \n. \t\nlegible and shall not be obliterated by normal handling:",
    ". \t\nlegible and shall not be obliterated by normal handling: \nCLOTH, AIRPLANE, COTTON, MERCERIZED, 65 lb BREAKING STRENGTH \nAMS 3804C \nYARDAGE \nWIDTH \nDATE OF MANUFACTURE \nLOT NUMBER \nMANUFACTURER'S IDENTIFICATION \nPURCHASE ORDER NUMBER",
    "5.2.3 Packages shall be prepared for shipment in accordance with commercial \nQ~ \t\npractice and in compliance with applicable rules and regulations \npertaining to the handling, packaging, and transportation of the cloth to \nensure carrier acceptance and safe delivery. Packaging shall conform to \ncarrier rules and regulations applicable to the mode of transportation. \n5.2.4 For direct U.S. Military procurement, packaging shall be in accordance \n~",
    "5.2.4 For direct U.S. Military procurement, packaging shall be in accordance \n~ \t\nwith MIL-STD-794, Level A or Level C, as specified in the request for \nprocurement. Commercial packaging as in 5.2.1 and 5.2.3 will be \nacceptable if it meets the requirements of Level C. \n6.\nACIQ~IOWLEDGMENT: A vendor shall mention this specification number and its \nrevision letter in all quotations and when acknowledging purchase orders. \n7.",
    "revision letter in all quotations and when acknowledging purchase orders. \n7.\nREJECTIONS: Cloth not conforming to this specification or to modification \nauthorized by purchaser will be subject to rejection. \n8.\nNOTES: \n8.1 Marginal Indicia: The phi (~) symbol is used to indicate technical \nchanges from the previous issue of this specification. \n8.2 Dimensions and properties in inch/pound units are primary; dimensions and \nproperties in SI units are shown as the approximate equivalents of the",
    "properties in SI units are shown as the approximate equivalents of the \ninch/pound units and are presented only for information. \n8.3 For direct U.S. Military procurement, purchase documents should specify not \nless than the following:",
    "Title, number, and date of this specification \nWidth of cloth desired \nQuantity of cloth desired \nApplicable level of packaging (See 5.2.4) \n\n8.4 Cloth meeting the requirements of this specification has been classified \nunder Federal Supply Classification (FSC) 8305. \nThis specification is under the jurisdication of AMS Committee \"C\" (NOMETCOM)."
  ]
}