{
  "source": "SAE AS245B 2000 (R 2008).md",
  "chunks": [
    "Issued\n1948-11\n\n## Aerospace Standard\n\nReaffirmed        2008-01 Revised\n2000-04\n\nSuperseding AS245A\n\n## Water Solution Type Hand Fire Extinguisher Foreword\n\nChanges in this revision are format/editorial only.\n\n## 1. Scope:\n\nThis specification covers the following types and classes of extinguishers:",
    "| Type I                                     | Stored pressure type    |\n|--------------------------------------------|-------------------------|\n| Category A - Temperature range -40 to +140 |                         |\n| Category B - Temperature range +35 to +140 |                         |\n| Type II                                    | Cartridge operated type |\n| Category A - Temperature range -40 to +140 |                         |",
    "| Category A - Temperature range -40 to +140 |                         |\n| Category B - Temperature range +35 to +140 |                         |",
    "1.1\nPurpose:\nTo specify minimum requirements for a water solution type hand fire extinguisher which shall be suitable for use on incipient fires which may occur in an airplane cabin interior.  The type of fire for which these units are intended is one involving combustible materials such as paper, textiles and similar materials.\n\n## 2. References:\n\nMIL-C-5499 AN-C-105\n\nTel:        877-606-7323 (inside USA and Canada) \nTel:        724-776-4970 (outside USA) Fax:       724-776-0790",
    "## 3. General Requirements:\n\n3.1\nMaterial and Workmanship:\n3.1.1\nMaterials: Materials shall be of a quality which experience or tests have demonstrated to be \nsuitable and dependable for use in aircraft equipment manufacturing practice.\n3.1.2\nWorkmanship: Workmanship shall be consistent with high-grade aircraft equipment manufacturing \npractice.\n3.2\nIdentification:\nThe following information shall be legibly and permanently marked on the extinguisher:",
    "a.\nName of extinguisher.\nb.\nSAE Aeronautical Standard AS245A, Type ___, Category ___.\nc.\nCapacity.\nd.\nTest pressure of container.\ne.\nManufacturer's Part or Model Number.\nf.\nManufacturer's Name and/or Trade Mark.\ng.\nOperating and Maintenance instructions.\nh.\nCategory \"B\" units shall be marked \"Protect from freezing\".\n3.3\nEnvironmental Conditions:\nThe following conditions have been established as design requirements only.  Tests shall be conducted as specified in Sections 5 and 6.",
    "3.3.1\nTemperature: Category \"A\" extinguishers shall withstand, without deterioration, temperatures from \n-40 to +140 °F and shall operate satisfactorily within that temperature range.  Category \"B\" extinguishers shall withstand, without deterioration, temperatures from +35 to +140 °F and shall operate satisfactorily within that temperature range.\n3.3.2\nHumidity: The extinguisher shall function and shall not be adversely affected when exposed to any",
    "Humidity: The extinguisher shall function and shall not be adversely affected when exposed to any \nrelative humidity in the range of from 0 to 95% at a temperature of approximately 90 °F.\n3.3.3\nAltitude: The extinguisher shall function and not be adversely affected when subjected to a \npressure and temperature range equivalent to -1000 feet to +40,000 feet standard altitude, except as limited by the application of 3.3.1.\n3.3.4",
    "3.3.4\nVibration: When mounted in accordance with the extinguisher manufacturer's instructions, the unit \nshall not be adversely affected when subjected to a vibration of 2400 cycles per minute with a total excursion of 3/32 inch, and when subjected to a vibration of 3000 cycles per minute with a total excursion of .015 inches.\n--`,`,,,,,`,,,`,`,`,`,```,```,``-`-`,,`,,`,`,,`---",
    "## 4. Detail Requirements:\n\n4.1\nDesign:\n4.1.1\nThe extinguisher shall consist of:\nType I - A container having a dischargeable capacity of at least 1-3/8 quarts, a connection for pressurizing the unit and a means of controlling the discharge of the liquid content.\n\nType II - A container having a dischargeable capacity of at least 1-3/8 quarts, a suitable holder and releasing means for the cartridge, and a means of controlling the discharge of the liquid content.",
    "4.1.2\nThe container shall be designed for a minimum burst pressure of 500 psi.\n4.1.3\nThe Type I unit shall be fitted with an AN connection in accordance with MIL-C-5499 or equivalent, \nfor pressurizing the unit.  A pressure gage to indicate the stored pressure shall also be provided. The gage range shall be at least 100 pounds above the charged pressure of the unit at 70 °F.\n4.1.4\nType II units shall use as a pressurizing means a carbon dioxide filled cartridge made in",
    "accordance with Specification AN-C-105 or equivalent, but in addition suitably winterized to insure proper operation.  A means shall be provided to readily release the carbon dioxide from the cartridge immediately prior to the use of the units.  The torgue required to release the cartridge shall not exceed 15 inch pounds and the releasing device shall have a minimum diameter of 1 inch. The cartridge holder shall be designed so that it cannot be assembled if the cartridge is in the wrong",
    "cartridge holder shall be designed so that it cannot be assembled if the cartridge is in the wrong position.  The cartridge holder shall be designed so that a simple visual inspection will indicate whether a cartridge is in the holder.",
    "4.1.5\nThe extinguisher shall be provided with a valve which will control the liquid discharge.  The \nextinguisher shall be designed so that after the unit has been placed in operation it shall be",
    "completely controllable with one hand, including starting, stopping and directing the discharge stream.  The force to operate the valve shall not exceed 3 pounds if the lever type is used.  If a rotary type is used the torque required shall not exceed 15 inch pounds and the releasing device shall have a minimum diameter of 1 inch.  For Type II extinguishers, with the unit mounted in its bracket, it shall not be possible to operate the valve controlling the discharge.\n4.1.6",
    "4.1.6\nType I units shall be designed so that the maximum stored pressure at 70 °F when the cartridge is \nreleased into a filled unit shall not exceed 200 psig.\n4.1.7\nThe extinguisher shall be designed so that it cannot be overfilled with extinguisher medium.\n4.1.8\nThe extinguisher shall be provided with a satisfactory seal to indicate tampering and/or operation.\n4.2\nLiquid Charge:\n4.2.1\nThe liquid used with either Category \"A\" or Category \"B\" extinguishers shall be water base",
    "4.2.1\nThe liquid used with either Category \"A\" or Category \"B\" extinguishers shall be water base \nsolutions suitable for service over the temperature range for the category intended.\n4.2.2\nThe liquid used as the extinguishing medium shall be as free from corrosive effects as practicable \nand shall not adversely affect the operating mechanism of the extinguisher.\n4.2.3\nThe fire extinguishing liquid shall be essentially non-toxic and non-injurious to personnel and shall",
    "not form injurious toxic fumes when discharged on a fire.\n4.2.4\nThe fire extinguishing liquid shall not deteriorate or lose its efficiency over a one year period.\n4.2.5\nThe fire extinguishing liquid shall have extinguishing qualities equal to or better than an equal \nquantity of water when used at 70 °F.\n4.2.6\nA wetting agent may be used provided the resulting solution complies with all requirements of the \nspecification.\n4.3\nDischarge Characteristics:\n4.3.1",
    "specification.\n4.3\nDischarge Characteristics:\n4.3.1\nAt 70 °F the time of effective discharge for a full extinguisher shall be not less than 30 nor more \nthan 45 seconds.\n4.3.2\nAt 70 °F, with the extinguisher nozzle approximately 4 feet above the floor, it shall throw a stream a \nhorizontal distance of not less than 12 feet and maintain this range for at least three-quarters of the contents.\n4.3.3",
    "4.3.3\nThe extinguisher at 70 °F shall be capable of discharging three-quarters of its contents by directing \nthe stream in any desired direction.\n4.3.4\nThe discharge tests shall be conducted using the appropriate liquid charge for the extinguisher.\n4.4\nBracket:\n4.4.1\nA bracket shall be furnished from which the extinguisher can be quickly and easily removed.  The \nbracket shall be designed to hold the charged extinguisher against an acceleration force of 10 g applied in any direction.",
    "## 5. Individual Performance Requirements:\n\nAll extinguishers, or components of same, shall be subjected to whatever tests the manufacturer deems necessary to demonstrate specific compliance with this specification, including the following requirements:\n\n5.1\nHydrostatic Tests:\nEach container shall be hydrostatically tested to 300 psi minimum for a one-minute period and shall show no leakage or detrimental effects.\n\n## 6. Qualification Tests:",
    "As many extinguishers as deemed necessary by the manufacturer to demonstrate that all extinguishers will comply with the requirements of this section shall be tested.  The tests of each extinguisher shall be conducted consecutively and after the tests have been initiated, no servicing (except recharging and repressurizing) or adjustments shall be permitted.  For both types of extinguishers, these tests shall be conducted with a fully charged unit.  The Type I units shall be pressurized to the",
    "tests shall be conducted with a fully charged unit.  The Type I units shall be pressurized to the recommended pressure at 70 °F.  The Type II units shall have the cartridge inserted in the holders.",
    "## 6.1 High Temperatures:\n\nBoth categories of extinguishers shall be subjected to a temperature of 140 °F for a period of 6 hours and then discharged.  The discharge time shall not decrease more than 25% from the figures in Section 4.3.1.  The range shall not vary more than 25% from the figures in Section 4.3.2.  These tests shall be conducted using the appropriate liquid charge for the extinguisher.",
    "6.2\nLow Temperatures:\nCategory \"A\" extinguishers shall be subjected to a temperature of -40 °F for a period of 6 hours and then discharged.  The discharge time shall not increase more than 40% from the figures in Section 4.3.1.  The range shall not vary more than 25% from the figures in Section 4.3.2.  These tests shall be conducted using the appropriate liquid charge for the extinguisher.\n\n## 6.3 Vibration:",
    "The extinguisher shall be placed in its bracket which shall be attached to a vibration stand.  The vibration tests shall be conducted at 2400 cycles per minute with a total excursion of 3/32 inch and at 3000 cycles per minute with a total excursion of .015 inch.  The assembly shall be vibrated for a three-hour period with its major axis vertical and for a similar period with its major axis horizontal.  At the completion of the vibration tests, the extinguisher and bracket shall be examined to",
    "At the completion of the vibration tests, the extinguisher and bracket shall be examined to determine that no looseness in the units nor damage to a part has resulted.  The extinguisher shall be discharged to determine compliance with the discharge characteristics of Section 4.3.",
    "## 6.4 Fire Tests:\n\nThe extinguishing medium shall be tested to determine compliance with requirements of paragraph 4.2.5.\n\n--`,`,,,,,`,,,`,`,`,`,```,```,``-`-`,,`,,`,`,,`---"
  ]
}