{
  "source": "SAE AS 8004 转弯侧滑仪表最低性能标准.md",
  "chunks": [
    "SAE Technical Standards Board Rules provide that: \"This report is published by SAE to advance the state of technical and engineering sciences.  The use of this report is entirely voluntary, and its applicability and suitability for any particular use, including any patent infringement arising therefrom, is the sole responsibility of the user.\" SAE reviews each technical report at least every five years at which time it may be reaffirmed, revised, or cancelled.  SAE invites your written comments",
    "years at which time it may be reaffirmed, revised, or cancelled.  SAE invites your written comments and suggestions.",
    "Copyright © 2008 SAE International All rights reserved. No part of this publication may be reproduced, stored in a retrieval system or transmitted, in any form or by any means, electronic, mechanical, photocopying, recording, or otherwise, without the prior written permission of SAE. \n\n## To Place A Document Order: Tel:        877-606-7323 (Inside Usa And Canada)\n\n \nTel:        724-776-4970 (outside USA) \n \nFax:       724-776-0790 \n \nEmail:    CustomerService@sae.org",
    "SAE WEB ADDRESS: \n                              \n                             http://www.sae.org",
    "3.7\nVisibility: Turn and slip indications must be visible from any point within the frustum of a cone the side of \nwhich makes an angle of at least 30 degrees with the perpendicular to the dial and the small diameter of which is the aperture of the instrument case.\n    \n3.8\nPower Malfunction Indication: For Types II and III instruments, means must be incorporated in the",
    "Power Malfunction Indication: For Types II and III instruments, means must be incorporated in the \ninstrument to indicate the loss of adequate power to the rate-of-turn gyro and primary signal voltages to the pointer in remote instruments. The indicating means must indicate a failure or malfunction in a positive manner. 3.9\nReflectance, Cover Glass: The total reflectance of the instrument cover glass including the integral",
    "lighting wedge, if applicable, shall not exceed 10% of the incident light. This reflectance applies over the visible light spectrum from 450 milli-microns to 600 milli-microns, and over an incident solid angle of 60º perpendicular to the viewing plane. 4.\nPERFORMANCE STANDARDS UNDER STANDARD CONDITIONS",
    "PERFORMANCE STANDARDS UNDER STANDARD CONDITIONS\nThe test conditions applicable to a determination of the performance of turn and slip instruments are set forth in Appendix A of this standard. All instruments shall be tested in accordance with the manufacturers recommendations. The manufacturer shall conduct sufficient tests to prove compliance with these Minimum Performance Standards. 4.1\nTurn Indicator Starting: Instrument performance must be achieved within three (3) minutes after",
    "normal rated power is applied for both air and electric operated instruments. By application of 50% of rated suction of air operated indicators and 80% of rated voltage for electrically operated indicators, the gyro must start, continue to rotate, and provide an adequate indication of turning motions. However, under the reduced power conditions, the turn indicator sensitivity and damping requirements do not apply. If the instrument incorporates a gyro speed monitoring device which provides a",
    "do not apply. If the instrument incorporates a gyro speed monitoring device which provides a positive indication when the gyro speed is below that necessary to meet instrument performance, the starting time may exceed three minutes. 4.2",
    "Turn Indicator Characteristics:\n    \n(a)\nSensitivity When the instrument is operating under rated power and subjected to the turning rates \nspecified about the vertical axis, the turn instrument deflection, in inches or millimetres, must be within the limits of either Column A or B. The indicator movement must be smooth.",
    "Rate of Turn \n(Degrees per \nMinute)\nDeflection of Indicator\nColumn A \nColumn B\nInches \nmm \nInches \nmm\n   0 36 90\n180 360\n0 ± 0.015\n1/32 ± 1/64 5/64 ± 1/32 5/32 ± 1/32 5/16 ± 1/16\n0 ± 0.4\n0.8 ± 0.4\n2.0 ± 0.8\n4.0 ± 0.8\n7.9 ± 1.6\n0 ± 0.015\n1/16 ± 1/64\n5/32 ± 1/32\n5/16 ± 1/16\n9/16 ± 1/8\n0 ± 0.4\n1.6 ± 0.4\n4.0 ± 0.8\n7.9 ± 1.6\n14.3 ± 3.2",
    "Column A values pertain to instruments set to indicate a standard rate of turn (180º per minute) with one indicator unit deflection. Column B provides double this displacement for indicators providing increased sensitivity.",
    "For instruments possessing display features such that the dimensional characteristics prescribed by Columns A and B do not apply, the applicant may demonstrate that the indicator can reliably indicate the prescribed rates of turn with clarity and accuracy equivalent to that specified in Column A or B.\n(b)\nDamping  The time for the turn indicator or index to return to the zero mark without crossing the",
    "Damping  The time for the turn indicator or index to return to the zero mark without crossing the \nzero mark must be at least two but not more than four seconds, when the instrument is suddenly stopped after being rotated about its vertical axis at a rate that causes full-scale pointer or index \ndeflection. 4.3\nSlip Indicator Characteristics: The slip indicator must operate freely when the instrument is rotated",
    "about its longitudinal axis with the dial vertical. The range of slip indicators must be at least 7 degrees either side of vertical. With the instrument in its normal position for mounting, the position of the indicator must be zero (0) ± 1/32 inch (0 ± 0.8 mm).\n    \n (a)\nDamping. The time for the slip indicator to move from the zero position of the slip indication to the",
    "test position must not be less than 0.2 seconds following a sudden rotation of the instrument from a position of 12 degrees bank through the vertical to 12 degrees of opposite bank.\n    \n(b)\nSlip Indicator Filling. Instruments using a liquid as a damping medium for the slip indicator must be",
    "so designed and filled that no part of an air bubble will be visible from a point 12 inches (30.5 cm) directly in front of the instrument when the instrument is rotated to an angle of roll of 45 degrees. 5.\nPERFORMANCE STANDARDS UNDER ENVIRONMENTAL CONDITIONS",
    "Unless otherwise specified herein, the measurement procedures applicable to a determination of the performance of turn and slip instruments under environmental conditions are set forth in Radio Technical Commission for Aeronautics (RTCA) Document No. DO-138, entitled \"Environmental Conditions and Test Procedures for Airborne Electronic/Electrical Equipment and Instruments\" dated 27 June 1968. Performance tests which must be made after subjection to test environments may be made after exposure",
    "tests which must be made after subjection to test environments may be made after exposure to several environmental conditions. The order of tests must be in accordance with DO-138. The test procedures specified or referenced are satisfactory for use in determining the performance of turn and slip instruments under normal and extreme environmental conditions. Alternate approved test procedures that provide equivalent results may be used. 5. 1",
    "Temperature:\n    \n(a)\nLow temperature. When subjected to the tests of DO-138, the instrument must operate electrically \nand mechanically and the requirements of paragraphs 4.1 through 4.3 of this standard must be met. The time required for the slip indicator to come to the rest position must not exceed four \nseconds as required by paragraph 4.3(a).\n    \n(b)\nHigh temperature.  When subjected to the tests of DO-138, the instrument must operate",
    "(b)\nHigh temperature.  When subjected to the tests of DO-138, the instrument must operate \nelectrically and mechanically and the requirements of paragraph 4.1 through 4.3 of this standard must be met. 5.2\nAltitude: When subjected to the tests of DO-138, the instrument must operate electrically and \nmechanically and the requirements of 4.1 through 4.3 of this standard must be met. 5.3\nHumidity: When subjected to the tests of DO-138, standard humidity environment, the requirements of",
    "4.1 through 4.3 of this standard must be met. 5.4\nVibration: When the instrument is tested in accordance with DO-138, standard vibration requirements, \nit must operate electrically and mechanically and the requirements of 4.1 through 4.3 must be met. After subjection to this test, the requirements of 4.1 through 4.3 of this standard must be met.\n5.5\nPower Input:\n    \n(a)\nElectrical input variation test\n    \n(1)",
    "5.5\nPower Input:\n    \n(a)\nElectrical input variation test\n    \n(1)\nWhen the instrument is subjected to the tests in DO-138, it must meet the requirements of 4.1 \nthrough 4.3 of this standard.\n    \n(b)\nLow voltage test\n    \n(1)\nWhen the instrument is subjected to the tests in DO-138, it must operate electrically and \nmechanically and degradation of performance is permissible. The degree of performance degradation shall be specified by the manufacturer.\n    \n(c)",
    "(c)\nHydraulic/pneumatic input variation test\n    \n(1)\nWhen the instrument is subjected to the tests in DO-138, it must operate and degradation of \nperformance is permissible. The degree of performance degradation shall be specified by the manufacturer. 5. 6\nConducted Voltage Transients:\n.\n    \n(a)\nIntermittent transients - The instrument shall be subjected to the tests of DO-138, and shall meet \nthe requirements of 4.1 through 4.3 of this standard.\n    \n(b)",
    "the requirements of 4.1 through 4.3 of this standard.\n    \n(b)\nRepetitive transients - The instrument shall be subjected to the tests of DO-138, and shall meet the \nrequirements of 4. 1 through 4.3 of this standard.\n    \n(c)\nInterconnecting wiring induced transients - The instrument shall be subjected to the tests of\nDO-138, and shall meet the requirements of 4.1 through 4.3 of this standard.\n    \n(d)",
    "DO-138, and shall meet the requirements of 4.1 through 4.3 of this standard.\n    \n(d)\nInstruments operated from AC power - The instrument shall be subjected to the tests of DO-138, \nand shall meet the requirements of 4.1 through 4.3 of this standard. 5.7\nConducted Audio Frequency Suseptibility Test: The instrument shall be subjected to the tests of \nDO-138, and shall meet the requirement of 4.1 through 4.3 of this standard. 5.8",
    "DO-138, and shall meet the requirement of 4.1 through 4.3 of this standard. 5.8\nAudio Frequency Magnetic Field Susceptibility: The instrument shall be subjected to the tests of \nDO-138, and shall meet the requirements of 4.1 through 4.3 of this standard.\n    \n5.9\nRadio Frequency Susceptibility: The instrument shall be subjected to the tests of DO-138, and shall \nmeet the requirements of 4.1 through 4.3 of this standard. 5.10",
    "meet the requirements of 4.1 through 4.3 of this standard. 5.10\nEmission of Radio Frequency Energy and Magnetic Effect: The instrument shall be tested in \naccordance with radio frequency interference and magnetic effect requirements of DO-138, for the category to which the instrument is designed. As applicable, the instrument shall be tested in accordance with the magnetic effect paragraph. 5.11\nExplosion: Instruments which are to be marked Explosion Category E must be tested in accordance",
    "Explosion: Instruments which are to be marked Explosion Category E must be tested in accordance \nwith DO-138. 5.12\nWaterproofness: Instruments which are to be marked Waterproofness Category W must be tested in \naccordance with DO-138. Following this test, the instrument must meet the requirements of 4.1 through 4.3 of this standard.\n5.13\nHydraulic Fluid: Instruments which are to be marked Hydraulic Fluid Category H must be tested in",
    "Hydraulic Fluid: Instruments which are to be marked Hydraulic Fluid Category H must be tested in \naccordance with DO-138. Following this test, the instrument must meet the requirements of 4.1 through 4.3 of this standard. 5.14\nSand and Dust: Instruments which are to be marked Sand and Dust Category D must be tested in \naccordance with DO-138. Following this test, the instrument must meet the requirements of 4.1 through 4.3 of this standard. 5.15",
    "Fungus Resistance: Instruments which are to be marked Fungus Resistance Category F must be \ntested in accordance with DO-138. Following this test, the instrument must meet the requirement of 4.1 through 4.3 of this standard. 5.16\nSalt Spray: Instruments which are to be marked Salt Spray Category S must be tested in accordance \nwith DO-138. Following this test, the instrument must meet the requirements of 4.1 through 4.3 of this \nstandard.\n    \nSAE COMMITTEE A-4, AIRCRAFT INSTRUMENTS",
    "## Appendix A Standard Test Conditions",
    "The following conditions of tests are applicable to the instrument tests specified herein:",
    "Atomopheric Conditions Unless otherwise specified, all tests required by this standard must be conducted at an atmospheric pressure of approximately 29.92 inches (760 mm) of mercury, an ambient temperature of approximately +77ºF (+25ºC), and a relative humidity of not greater than 85 percent. When tests are conducted with the atmospheric pressure of temperature substantially different from these valves, allowance must be made for the variation from the specified conditions.",
    "Vibration to Minimize Friction Unless otherwise specified, all tests for performance may be conducted with the instrument subjected to a vibration of 0.002 to 0.005 inches (0.05 to 0.13 mm) double amplitude at a frequency of 25 to 33 Hertz. The term double amplitude as used herein indicates the total displacement from positive maximum to negative maximum.\n\n    \nPower Conditions Unless otherwise specified, all tests must be conducted at the power rating recommended by the manufacturer.",
    "Mounting Position Unless otherwise specified, all tests must be made with the instrument (indicator, gyroscope, etc.) mounted in their normal operating position."
  ]
}