{
  "source": "SAE AS398A 1958.md",
  "chunks": [
    "## (Magnetic Compass)\n\n1. PURPOSE: \nTo. specify minimum requirements fO.r non-stabilized magnetic directioJ;l \ninstruments for use in aircraft, the operation of which m~ \nsubject the instrument to the environmental conditions specified in Paragraph 3.3. \n2. \nSCOPE: \nThis Aeronautical Standard covers two basic types of instruments as \nfollows: \n\nType I \nType II \n-\nDirect Reading \n.. Remote Indicating \n\n## . 3. General Requirements:",
    "3.1 Material and Workmanship: \n--`,,```````,`,,`,``,``,,,,`,`-`-`,,`,,`,`,,`---\n3.1.1 Materials: Materials shall be of a quality which experience and/or tests \nhave demonstrated to be suitable and dependable for use in aircraft i~stru­\nments. \n3.1.2 Workmanship: Workmanship shall be cQnsistent with high-grade aircraft \ninstrument manufacturing practice. \n3.2 Identification: The following information shall be legibly and permanently \nmark \ned on the instrument or at \ntached thereto: . \n(a)",
    "mark \ned on the instrument or at \ntached thereto: . \n(a) \nName of Instrument \n(b) Aeronautical Standard AS 398A \n(c) Manufacturer's part number \n- \n(d) Manufacturer's seriai number or date of manufacture \n(e) Manufacturer's name and/or trademark \n(f) Rating, if applicable (Electrical, Vacuum, etc.) \nThe following conditions have been established as Tests shall be conducted as specified in Sections",
    "3.3 Environmental Conditions: \naesign requirements only. \n5, 6 and 7. \n3.3.1 Tempe!ature: When installed in accordance with the instrument manufacturer's \ninstructions, the instrmnent shall function over the range of ambient temperature shown in Column It. belm'l and shall not be adversely affected by \nexposure to the range of temperature shown in Column B below:",
    "| Instrument                  | Location      |\n|-----------------------------|---------------|\n| A                           |               |\n| B                           |               |\n| Heated Areas (Temperature   | Controlled)   |\n| Unheated Areas (Temperature | Uncontrolled) |\n| -                           | 30            |\n| to                          |               |\n| 50c                         |               |\n| -                           | 55            |",
    "| 50c                         |               |\n| -                           | 55            |\n| to                          |               |\n| 70C                         |               |\n| -                           | 65            |\n| to                          |               |\n| 700                         |               |\n| -                           | 65            |\n| to                          |               |\n| 700                         |               |",
    "3.).2 Humiditl: The instrument shall function and shall not be adversely affected \nwhen exposed to any relative humidity in the range from 0 to 95% at a temperature of approximately 32C. \n3.3.3 Vibration: When installed in accordance with the instrument manufacturer's \ninstructrons, the instruments shall function and shall not be adversely affected when subjected to vibX'8.tiona of the following characteristics:",
    "| Instrument     | Location    |\n|----------------|-------------|\n| Cycles         |             |\n| Max.           |             |\n| Double         | Max.        |\n| in             | Airframe    |\n| Per            | Sec.        |\n| Amplitude      | (Inches)    |\n| Ac             | celer'ation |\n| --             |             |\n| Power          | Plant       |\n| 5 - 150        |             |\n| 0.100          |             |\n| 20g            |             |\n| Wings          | and         |",
    "| 0.100          |             |\n| 20g            |             |\n| Wings          | and         |\n| 5 - 500        |             |\n| 0.0)6          |             |\n| 109            |             |\n| Fuselage       |             |\n| 5 -            |             |\n| 500            |             |\n| 0.0)6          |             |\n| 5g             |             |\n| Panel          | or          |\n| 5 - 50         |             |\n| 0.020          |             |\n| 1.5g           |             |",
    "| 5 - 50         |             |\n| 0.020          |             |\n| 1.5g           |             |\n| Shoclanounts ) |             |",
    "3.3.4 Altitude: \nThe instrument shall function and shall not be adversely affected \nwhen subjected to a pressure and temperature range equivalent from -1000 \nfeet to 40,000 feet standard altitude per NACA Report 1235, except as \nlimited b.1 application of Paragraph 3.3.1. The inst~nnent shall not be adversely affected when subjected to a pressure of 50 in. Hg. absolute. \n3.4 Radio Interference: The instrument shall not be the source of objectionable",
    "3.4 Radio Interference: The instrument shall not be the source of objectionable \ninterference, under operating conditions at any frequencies used on aircraft \neither qy radiation or feed-back, in radio equipment installed in the same \naircraft as the instrument. \n3.5 Magnetic Effect: \nThe magnetic effect of the instrument shall not adversely \naffect the operation of other instruments installed in the same aircraft.",
    "## 4. Detail Requirements: •\n\n4.1 Indicating Method: \nOne of the following methods of indication shall be \nemployed:",
    "|             |      |       |      |       | Method    | I     |\n|-------------|------|-------|------|-------|-----------|-------|\n| Horizontal  | drum | dial  | with | fixed | lubber's  | line. |\n| Graduations |      |       |      |       |           |       |\n| move        |      |       |      |       |           |       |\n| to          | the  | right | for  | right | turns.    |       |\n| Method      | II   |       |      |       |           |       |",
    "| Method      | II   |       |      |       |           |       |\n| Rotating    | vertical    | dial              | with      | fixed     | lubber's    | line.    |\n|-------------|-------------|-------------------|-----------|-----------|-------------|----------|\n| Dial        | rotates     | counter-clockwise | for       | right     | turns.      |          |\n| Method      | III         |                   |           |           |             |          |",
    "| Method      | III         |                   |           |           |             |          |\n| Rotating    | pointer     | with              | fixed     | graduated | dial.       |          |\n| Pointer     | rotates     | clockwise         | for       | right     | turns.      | Dial     |\n| position    | may         | be                | settable. |           |             |          |",
    "4.2 Operating Limits: \nDuring straight flight the instrument shall indicate \nmagnetic headings, throughout the 360 degree scale range, during dives, \nclimbs or banks up to at least 20 degrees displacement from level flight. \n4.3 Dial Markings: \n4.3.1 \nGraduations: \nThe indicators shall be provided with degree graduations at \nintervals not to exceed 5 degrees, with major graduations every 10 degrees \nand with numerical markings at intervals not greater than 30 degrees,",
    "and with numerical markings at intervals not greater than 30 degrees, \nexcept that the 0, 90, 180 and 210 degree positions shall be marked N, E, \nSand *\\01* respeciii \nvely \n- \nVisibility: Index and dial markings shall be visible from ~ \npoint within \n-the frustum of a cone the side of ,which'makes an angle of 30 degrees with the perpendicular to the dial and the small diameter of 'Hhich is the aTIOl'ture of the instrument case. At least two numerals shall be simult.aneot\\sly visible.",
    "4.3.3 Finish: Unless otherwise specified b,y the user, matte white material shall \nbe applied to major graduations, numerals and pointers. Non-functional surfaces shall be a durable dull black. \nh.!1 PO'ier Variations: All units shall properly' function with + 15% variation in \nn.c. voltage and/or + 10% variation in A.C. voltage and a '+ 5% frequency \nvariation. \n-\n-\n-",
    "n.c. voltage and/or + 10% variation in A.C. voltage and a '+ 5% frequency \nvariation. \n-\n-\n-\n4.5 ComPensation Provisions: Means shall be provided for compensating for semicirCular deviation. Compensating effect shall be between 15 and 40 degrees \nin each direction for each axis when adjusted for maximum effect. \n4.6 Power Malfunction Indication: Means shall be incorporated in the instrument \nto indicate When adequate power (VOltage and/or current) is not being made",
    "to indicate When adequate power (VOltage and/or current) is not being made \navailable to all phases required for the proper operation of the instrument. \nThe indicating means shall indicate a failure or a malfunction in a positive \nmanner.",
    "## 5. Test Condittons:",
    "Atmospheric Conditions: Unless otherwise speoified, all tests required b,y this Aeronautic81 Standard shall be conducted at an atmospheric pressure of approximately 29.92 inches of mercury, at an ambient temperature of approximately 250 and at a relative humidity of not greater than 85 percent. When tests are conducted with atmospheric pressure or temperature substantially different from these values, allowance shall be made for the variations from the specified conditions.",
    "Vibration (to minimize friction): Unless otherwise specified, all tests for performance may be conducted with the instrument subjected to a vibration of \n0.002 to 0.005 inch double amplitude at a frequency of 1500 to 2000 cycles per minute. \n\nThe term double amplitude as used herein indicates the total displacement from positive maximum to negative maximum.",
    "5.3 Vibration EquiE.ment~ Vibration equipment shall be used which will provide \nfrequencies and amplitudes consistent with the requirements of Paragraph 3.3.3 \nwith the following charac~eristics~ \n--`,,```````,`,,`,``,``,,,,`,`-`-`,,`,,`,`,,`---",
    "5.3.1 Linear Motio~ Vibration: Vibration equipment shall be such as to allow \nrlbi'ation to be applied along each of three mutually perpendicular axes \nof the instrument. \n5.3.2 Circular Motion Vibration: Vibration equipment shall be such that a point \non the instrument case will describe a circle ina plane inclined 45 degrees \nto the horizontal' plane, the diameter of which is equal to the double \namplitude speoified.",
    "to the horizontal' plane, the diameter of which is equal to the double \namplitude speoified. \n5.4 Power Conditionsr Unless otherwise speoified, all tests shall be oonducted \nat the power rating reoommended by the manufacturer. \n5.5 Position: Unless otherwise specified, all tests shall be made with the \ninstrument (indic \nators, amplifiers, transmitters, etc.) mounte4 in their \nnormal operating position. \n5.6 Magnetic Field Strength: Unless otherwise specified, all tests required b.1",
    "5.6 Magnetic Field Strength: Unless otherwise specified, all tests required b.1 \nthis Aeronautioal Standard shall be made with a horizontal field strength of \napproximately 0.18 gauss and a vertioal field strength of approximately 0.54 \ngauss., in the direction normal in the. \nnorthern hemisphere. When tests are \nmade with field strength values substantially different from these values, \nallowance shall be made for variations from the speoified tolerances.",
    "allowance shall be made for variations from the speoified tolerances. \n5.7 Compensators: Unless otherwise speoified, all tests shall be made with \nmagnetic compensators removed or adjusted to neu~ral position. \n6. \nINDIVIDUAL PERFORMANCE REQUIREMENTS: \nAll instruments shall be subjected to \nwhatever tests the manufaoturer deems necessary to demonstrate specified \ncompliance with this Aeronautical Standard inoluding the following requirements where applicable.",
    "compliance with this Aeronautical Standard inoluding the following requirements where applicable. \n6.1 Leakag,e: Liquid-filled indicators or transmitters shall not show evidence of \nleaKage after having been placed in a bell jar and subjected to a pressure \nequivalent to 40,000 feet standard altitude for a period of 1 hour. \n--`,,```````,`,,`,``,``,,,,`,`-`-`,,`,,`,`,,`---\n6.2 .Scale Error: \nWhen the magnetic-sensitive unit is placed on magnetic headings",
    "6.2 .Scale Error: \nWhen the magnetic-sensitive unit is placed on magnetic headings \nat 30 degree intervals starting from North the indioated headings shall corresp6nd to actual magnetic headings within 4 degrees. \nFriction: When the magnetic element has been defl~oted 5 degrees first to right and then to left, from its equilibrium position and then allowed to come to rest, the differenoe between the two indicator readings at rest shall not exoeed'l degree.",
    "Damping \nI \nWhen the magnetic element has been deflected 30 degrees first to the \n6.h \nright and to the left, from its 'equilibrium position, the time required for \nthe indicator dial (or pointer) to pass through the 25 degree angle toward the original indicated heading shall not exceed 5.0 seconds or be less than \n1.0 seconds. The maximum overawing past the original indicated heading shall \nnot exceed 15 degrees.",
    "L... \n    __ \n        !-----------.. \n                                                    ,. , \n                                                        ... ,., ............ \".,.,' ,~.-. -----------------1",
    "Heeling Error: When the magnetic-sensitive unit is tilted 20 degrees from the norm8l level position the magnetic element shall be free to rotate through 360 degrees. When the unit is tilted 10 degrees the indicated heading shall not differ from the indicated hea~ng with.the mag~etic-sensitive \n-unit in normal level position b.Y more than 4 degrees. The indicator dial \n(or pointer) shall still be visible as specified in Paragraph 4.).2.",
    "6.6 \nSwirl: '\\fuen the magnetic-sensitive unit is tilted 20 degrees from normal \nand rotated in azimuth, at a rate of 30 degrees per second, through 360 \ndegrees, stopping at N, S, E and W \nindication, the overswing of the indicator dial (or pointer) at each of these points shall not exceed 6 degrees.",
    "Compensation: With the magnetic-sensitive unit on N heading and the compensator adjusted for minimum effect, the scale error with the compensator shall not differ from the scale error without compensator qy more than 2 degrees.",
    "The maximum adjustable compensation effect shall be between 15 and 40 degrees in each direction for each axis. \n\nWhen the magnetic-se.nsitive unit is placed on any cardinal heading and t.he opposite axis compensator adjusted for maximum effect the indicated heading shall not change more than 2 degrees.",
    "6.8 Dielectric: Ungrounded instruments or grounded instruments prior to connection of internal ground wire, shall be tested by either the method of \ninspection of Paragraph 6.8.1 and 6.8.2. \n6.8.1 Insulation Resistance: \nThe insulation resistance measured at 500 volts D.C. \n(200 volts for hermetically sealed, inert gas filled instruments) between' \nall electrical circuits cormected together and the metallic case shall not \nbe less than 20 megohms.",
    "be less than 20 megohms. \n6.8.2 Dielectric Strength: The insulation shall withstand without evidence of \ndamage the application of a· sinusoid~ voltage at a commercial frequency \nbetween all electrical circuits cormeoted together and the metallic case, \nfor a period of five seconds. The RMS value of the sinusoidal voltage \napplied shall be either five (5) times the maximtnn instrument operating \nvoltage, or 500 volts, whichever is lower, except that on hermetically",
    "voltage, or 500 volts, whichever is lower, except that on hermetically \nsealed, (inert gas filled instruments) the test voltage shall be 200 \nvolts RMS. \n6.'8.2.1 Instruments having a permanent internal ground connection shall be \ntested as follows,",
    "6.'8.2.1 Instruments having a permanent internal ground connection shall be \ntested as follows, \nThe insulation shall withstand without evidence of dama.ge the application of a sinusoidal voltage at a commercial frequency between each electric circuit and the metallic case, for a period of five (5) seconds. The RMS value of the sinusoidal voltage applied shall be 1.25 times the maximum circuit operating voltage obtainable between the test points \n-",
    "7. \nQUALIFIOATION TESTS: \n.As marw instruments as deemed necessary to demonstrate \nthat Sl1 instruments Will oomply with the requirements of this seotion shall \nbe tested in aooordance with the manufacturer's reoommendations. \n7.1 Low T~erature: The instruments, or oomponents\" shall be subjeoted to the \ntemperatures indicated in the. following table in aocordance with their \nlocation in the airoraft. After exposure to these temperatures for 5 hours,",
    "location in the airoraft. After exposure to these temperatures for 5 hours, \n. rated performance shall be obtained in 15 minutes after application of rated \npower using themagneti~ field strength specified in Paragraph 5.6 except \nthe field strength tolerance shall be ! 20%.",
    "Temperature \nInstrument Location \nHeated Area (Temperature Controlled) \nUnheated Area (Temperature Uncontrolled) \n-30C \n-55c",
    "1.2 High Temperature: \nTh~ requirements of Paragraph 1.1 shall apply exoept that \nthe exposure temperatures shall be 50C for heated areas and 700 for unheated \nareas and rated performance. shall be obtained in 3 minutes after application \nof rated power. \n7.3 Extreme Temperature Exposure: \nThe instrument, or components, shall, after \nalternate exposures to ambient temperatures of -650 and 100 for periods of \n24 hours each and del~ \nof 3 hours at room temperature following completion",
    "24 hours each and del~ \nof 3 hours at room temperature following completion \nof the exposure, meet the requirements of Paragraph 6.1 and 6.2. There \nshall be no evidence of damage as a result of exposure to the extreme temperatures speoified.herein. \n--`,,```````,`,,`,``,``,,,,`,`-`-`,,`,,`,`,,`---",
    "1.4 Magnetic Effect: The magnetic effect of the Type II indicator shall be \ndetermined in terms of the deflection of a free magnet, approximately li inches \nlong in a magnetic field with a horizontal intensity of 0.18 (0.01) gauss \nwhen the indicator is held in various positions on an east-west line with its \n.nearest part ~2 inches from the center of the magn~t. This test B~all first \nbe made with the indicator not operating and then shall be repeated with the \nindicator in normal operation",
    "indicator in normal operation \n•. \nThe. maximum deflection of the free magnet \nshall not exceed 5 degrees for a~ \npointer or dial position. \nHumidity:",
    "shall not exceed 5 degrees for a~ \npointer or dial position. \nHumidity: \nThe instrument (indioator,transmitter, amplifier, eto.) shall be mounted in a chamber maintained at a temperature of 70 + 2 C and a relative humidity of 95 + 5% for a period of six hours. After tnis period 'the heat shall be shut olf and the instrument shall be allowed to cool for a period of 18 hours in this. atmosphere in which the humidity rises to 100% as the temperature decreases to not more than 38 C.",
    "This complete oycle. shall be conducted: \n\na. Five timeS for components located in uncontrolled temperature areae. \nb. Once for components located in controlled temperature areas. \nImmediately after recycling, there shall be no evidenoe of damage or corrosion . \n\nwhich affects performance, following this test, and the instrument shall meet the requirements of Section 6, except for Paragraph 6.8. \n\n## 7.6 Vibration:",
    "## 7.6 Vibration:\n\nResonanoe - The instrument, while operating, shall be subjeoted to a resonant frequency survey of the appropriate range specified in Paragraph 3.3.3 in order to determine if there exists any resonant frequenoies of the parts. \n\nThe amplitude used may be any oonvenient value that does not exoeed the maximum double amplitude and the maximum aooeleration·specified in . \n\nParagraph 3.3.3.",
    "The instrument shall then be subjected to a vibration at the appropriate maximum double amplitude or maximum acoeleration speoified in Paragraph 3.3.3 \nat the resonant frequency for a period of one hour. in each axis or with oircular motion vibration, whichever is applicable. \\ihen more than one resonant frequency is encountered with vibration applied along anyone axis, a test period may be accomplished at the most severe resonance, or the period m~",
    "be divided among resonant frequenoies, Whichever shall be considered most likely to produce failure. The test period shall not be less than one-half hour at any resonant mode. When resonant frequenoies are not apparent within the specified frequency range, the instrument shall be Vibrated for two hours in aocordance with the vibration requirements schedule (Paragraph 3.3.3) at the maximum double amplitude and the frequency to provide the maximum acceleration.",
    "Cycling - The instrument, while operating, shall be tested with the frequency cycled between limits specified in Paragraph 3.3.3 in 15 minute cycles for a period of one hour in each axis at an applied double amplitude specified in Paragraph 3.3.3, or an acceleration specified in Paragraph 3.3.3 \nWhichever is the limiting value or a total of three hours for circular motion vibration, whichever is applioable.",
    "The instrument shall be tested during vibration to determine that it is functioning properly. After the completion qf this vibration test, no dam~ge shall be evident and the instrument shall meet the requirements of S~ction 6 (other than Paragraph 6.8). \n\n.- .. ------------------' \n--`,,```````,`,,`,``,``,,,,`,`-`-`,,`,,`,`,,`---"
  ]
}