{
  "source": "SAE AS8007 1978.md",
  "chunks": [
    "# Of Automotive Orive. Warrendale. Engineers, Pa (5096 Inc.\n\n## Miniwm Safe Performance Over Speed Warning Instruments\n\n1\n,\n \nPURPOSE \nT\nh i s\n \nAerospace Standard (AS) establishes the minimum performance Standards for Over Speed Warning Instruments for use in subsonic aircraft. It is intended that this Over Speed Warning Instrument operate an aurai warning device to annunciate the attainment of a maximum permissible speed level.",
    "2\n.\n \nSCOPE \nThis A\nS",
    "defines instruments which use inputs of static and pitot pressure equhl to those which are utilized to establish the pressure aititude and speed of that aircraft. These pressures are applied to the instrument ports to provide means **for** generation of an aural warning whenever the aircraft reaches or exceeds the maximum operating limit speed. This Over Speed Warning Instrument function may be incorporated as part of an Air Data Computer, or an Air Speed Indicator, or an Air Speed/Mach Number",
    "as part of an Air Data Computer, or an Air Speed Indicator, or an Air Speed/Mach Number indicator, or other instruments. in those cases where the Over Speed Warning Instrument is par€",
    "of another instrument, the standards contained herein apply only to the Over Speed Warning Instrument function. Each aircraft type and model has a defined maximum operating limit speed curve or curves which are a part of the airframe manufacturer's type certification approval data; this limit speed data shall be available from the subject airframe manufacturer as published in the operating manual for the aircraft m e  \nand model number and configuration.",
    "3\n.\n GENERAL STANDARDS \n3\n.\n1\n \nCompatibility of Components: If components of the eqitipment require matching to meet the requirements of this standard, they shall be identified in a **manner** which will assure proper matching. Instaliation instructions issued by the Over Speed Warning Instrument manufacturer shall \nindicate matching requirements if any. \n3\n.\n2\n \nAccessibility of Controls: Controls which are not normally adjustable in flight shall not be readily",
    "accessible to flight personnel when the instrument is installed in \naccordance with the manufacturer's instructions. \n3\n.\n3\n \nInterchangeability: Instruments which are identified with the same manufacturer's part or model \nnumber shall be compleíx4y interchangeable.",
    "## 3 . 4 Over Speed Warning Circuit:",
    "3\n.\n4\n.\n1\n \nThe electrical circuit shall be such that should the aircraft exceed the defined maximum operating \nspeed, the internal circuit shall provide for a signai which shall operate an \naural warning device. \n3\n.\n4\n.\n2\n \nThe electrical circuit **shall** be designed so that no signal shall be present to operate the aural \nwarning device **for** speeds below the maximum operating speed range and a signal shall be present",
    "upon attaining the maximum operating speed and shall remain on above the maximum operating \nspeed.",
    "3\n.\n5\n Self-Test Provision: The instrument shall have test capabilities to confirm the operation of the electricd output signal to the aural warning device. \n\n## 3 . 6 Maximum Speed Signal Accuracy:",
    "3\n.\n6\n.\n1\n The instrument shall generate and maintain its output signal when the maximum operating speed is \nachieved or exceeded, and shall operate to the following tolerance relative to that maximum operating \nspeed curve. The output signal shall be removed when the speed falls below the maximum operating \nspeed curve to the same tolerance, \na) For curve sections based on airspeed in knots, Calibrated or equivalent, O to plus G knots \n(11 \nkm/hr) in excess of the limit speed value. \nb)",
    "(11 \nkm/hr) in excess of the limit speed value. \nb) \nPor curve sections based on Mach Number, O to plus , \nO10 \nMach in excess of the limit \nMach number value, \n3\n.\n \nG .  2 The above tolerances are applicable for a minimum environmental temperature range of +20\" \nC \nthrough +55\" \nC \n(+68\" \nF through 1131\" \nF) and in the mounting position defined in the manufacturer's \ninstallation ins \ntructions. \n3\n.\n6\n.\n3\n \nFor environmental temperatures fram c20\" to -30°C \nfrom 155°C \nto +71\"C",
    "tructions. \n3\n.\n6\n.\n3\n \nFor environmental temperatures fram c20\" to -30°C \nfrom 155°C \nto +71\"C \nthe tolerance of the output \nsignal shall not exceed: \na) \nPor curve sections based on airspeed in knots, calibrated or equivalent, O to plus 8 knots \n(15 \nkm/hr) of the maximum speed value. \nb) For curve section based on Mach number, O to plus O. O15 \nMach of the maximum Mach number \nvalue. \n3\n.\n6\n.\n4",
    "Mach of the maximum Mach number \nvalue. \n3\n.\n6\n.\n4\n \nIn those cases where the Over Speed Warning Instrument function is part of an air speed or an air \nspeed/Mach number indicator, the performance specified in 3\n.\n6\n.\n1\n,\n 3\n.\n6\n.\n2\n,\n and 3\n.\n6\n.\n3\n shall be applied \nto the indicated air speed or Mach number displayed relative to the maximum speed displayed by the \ninstrument, The performance tolerances specified in 3\n.\n6\n.\n1\n,\n 3\n.\n6\n.\n2\n,\n and 3\n.\n6\n.\n3\n shall not be exceeded",
    ".\n6\n.\n1\n,\n 3\n.\n6\n.\n2\n,\n and 3\n.\n6\n.\n3\n shall not be exceeded \nrelative to the maximum operating speed curve for the instrument.",
    "## 3 . 7 Operating Range:",
    "3\n,\n7\n.\n1\n The altitude range for all Over Speed Warning Instruments shall start at -1000 \nft (-305 \nm) pressure \naltitude and the upper pressure altitude limit shall be applicable to the aircraft and shall be indicated \non the nameplate. \n3.7.2 \nThe working airspeed range shall start at least 30 knots (\n5\n5\n.\n5\n6\n km/hr) below the lowest airspeed \nvalue defined in the maximum operating speed curve, and shall extend at least 50 \nknots (93 \nkm/hr)",
    "knots (93 \nkm/hr) \nabove the highest airspeed value defined in the maximum operating speed curve. \n3\n.\n8\n Aircraft Identification: The aircraft t\ny\np\ne\n,\n \nmodel number, and configuration for which the Over Speed \nWarning instrument has been calibrated and for which it performs its intended function, shall be clearly \nmarked on the instrument nameplate and in the manufacturer's installation instructions. Each aircraft",
    "type, model and configuration has a defined maximum operating limit speed curve.",
    "## 3 . 9 Power Loss:\n\n3\n.\n9\n.\n1\n \nI\nf\n electrical power is used as the means to operate any portion of the Over Speed Warning Instrument, \nprovisions shail be incorporated in the instrument to detect the loss of this power. An indication of \nthe loss of electrical operating power shall be provided in a positive manner. An output signal equivalent to a maximum speed limit warning is one acceptable means of indicating the loss of power. \n--`,,```````,`,,`,``,``,,,,`,`-`-`,,`,,`,`,,`---",
    "3.9.2 Power loss \nto the instrument from an external source, e.g. aural warning power, shall not require \na power loss signal from the instrument as in 3.9.1. \n3.10 Fire Hazard: Except for small parts (such as hobs, fasteners, seals, grommets, and small electrical \nparts) that would not contribute significantly to the propagation of a fire, all materials used must be \nself-extinguishing when tested in accordance with the requirements of Federal Aviation Regulation",
    "self-extinguishing when tested in accordance with the requirements of Federal Aviation Regulation \n25.1359 (d) and Appendix !IFTf \nthereto, with the exception that materials tested may be configured in \naccordance with paragraph (b) of Appendix 'Ttf \nor may be configured as used. \n4. \nPERFORMANCE UNDER STANDARD CONDITIONS \n4.1 \nStandard Atmospheric Conditions: Unless otherwise specified herein, all tests shall be conducted at \natmospheric conditions specified in paragraph 3.4 of DO-160.",
    "atmospheric conditions specified in paragraph 3.4 of DO-160. \n(Environmental Conditions and Test \nProcedures for Airborne Electronics/Electrical Equipment and Instruments, dated Feb. 28, 1975). \n4.2 \nAttitude: Unless otherwise specified herein, all tests shall be conducted with the instrument in its normal \noperating position as defined in the manufacturer's installation instructions. \n4.3 \nPower Conditions: Unless otherwise specified herein, all individual performance tests shall be conducted",
    "at the power ratings defined by the manufacturer in the installation instructions for the instrument. \n4.4 \nVibration to Minimize Friction: \n4.4.1 Reciprocating Engine Powered Aircraft: Unless otherwise specified, tests shall be conducted with the \nequipment subjected to a maximum vibration of 0.005 in. (0.127 mm) total excursion at any frequency \nfrom 20 to 35 Hertz, provided the equipment is mounted in its noimal operating pasition.",
    "from 20 to 35 Hertz, provided the equipment is mounted in its noimal operating pasition. \n4.4.2 Turbine Powered Aircraft: Unless otherwise specified, tests shall be conducted with the equipment \nsubjected to a maximum vibration of O. O01 in. (\nO\n.\n 025 mm) total excursion at any frequency from 10 to \n60 Hertz, provided the equipment is mounted in its normal operating position. \nNOTE: If vibration exceeding the values specified above is required during normal",
    "NOTE: If vibration exceeding the values specified above is required during normal \noperation in order to meet the accuracy requirements specified in this \nperformance standard, it shall be the responsibility of the equipment manufacturer to either provide such vibration internally to the equipment or \nnotify the user that such vibration is required to be applied to the equipment, \nwhen installed in an aircraft. \n4.5",
    "when installed in an aircraft. \n4.5 \nPer€ormance Tests: The instrument shall be tested to demonstrate compliance with 3.4, 3.5, 3.6, 3.9 \nof this standard. \n4.5.1 \nThe performance tests specified shall be conducted in accordance with the requirements specified by \nthe manufacturer, and at least three test points in each maximum allowable speed curve section shall",
    "be included to assure conformance to the curve sections. When the curve contains reversal in direction, e. g., airspeed transition to Mach No., the reversal point shall be tested to assure that the \ntransition occurs at the correct altitude level. \n4.6 \nBalance Error (Attitudel: If the instrument is subjected to Balance Error (Mechanical balance), the \ninstrument shall be tested in the following positions, and the performance as specified in 4.6.1 and \n4.6.1.1, \nshaU be met.",
    "4.6.1.1, \nshaU be met. \nNormal operating position (as specified by the instrument manufacturer) \n1) \nInstrument rotated clockwise around its X (longitudinal) axis, \n90\" from its normal position. \n2) \n--`,,```````,`,,`,``,``,,,,`,`-`-`,,`,,`,`,,`---\nInstrument rotated clocks&e around its X \n(longitudinal) axis, 180\" from its normal position. \n3) \n4\n.\n6\n \nContinued \n4) instrument rotated counter clockwise around its X (longitudinal) axis, 90\" \nfrom its normal \nposition.",
    "from its normal \nposition. \n5) instrument rotated about its Y (lateral) \naxis, 90\" \nup from its normal operating position. \n6) instrument rotated about its Y (lateral) axis, 90\" \ndown from its normaï operating position. \n4.6.1 With a \nstatic pressure of \napproximately 12 \nin. of mercury absolute (305 \nmm) approximately 23,000 \nf t  \n(7,000 m), applied to the static port and a differential pressure, approximately ,015 \nMach above the",
    "Mach above the \nmaxlmum'operating speed of the curve, applied to the total pressure port, the instrument shall have \ngenerated an \noutput signal. This signal shall be maintained for the attitudes defined in 4\n.\n6\n while the \ninstrument is being lightly vibrated. \n4\n.\n6\n.\n1\n.\n1\n \nFor aircraft with maximum operating speed curves not related to Mach number and for aircraft \naltitude limitations below 20,000 \nf t  \n(6,100 m) the applied static pressure should be 80%",
    "altitude limitations below 20,000 \nf t  \n(6,100 m) the applied static pressure should be 80% \nof the altitude limit for the aircraft and the differentid pressure applied shdl be 10 \nknots (18.5 \nkm/hr) above \nthe maximum speed limitation as defined by the maximum operating speed curve for the aircraft \nat the test altitude. The instrument shall have generated an output signal. This signal shall be \nmaintained for the attitudes defined in 4\n.\n6\n.\n1",
    "maintained for the attitudes defined in 4\n.\n6\n.\n1\n while the instrument is being lightly vibrated. \n4\n.\n7\n Electrical Insulation: \n4\n.\n7\n.\n1\n Insulation Resistance: The Insulation Resistance measured at 200 \nVDC for five seconds between all \nungrounded electrical connector terminals connected together and the instrument case (metallic) shall \nnot be less than 5 megaohms. \n4\n.\n7\n.\n2\n \nOverpotential: The instrument shall not be damaged by the application of a test potential between",
    "Overpotential: The instrument shall not be damaged by the application of a test potential between \nisolated electrical circuits and the metallic case. The test potential shall be a sinusoidal voltage of \ncommercial frequency with an R. M. S. vaiue of five times the maximum voltage defined for the instrument, not to exceed 500 \nvolts. For instruments which are hermetically sealed, the voltage shall not \nexceed **200** volts. \n4\n.\n7\n.\n2\n.\n1\n \nThe potential shall start",
    "exceed **200** volts. \n4\n.\n7\n.\n2\n.\n1\n \nThe potential shall start \nfrom zero and be increased at a uniform rate to its test value. It shali be \nmaintained at this value for five seconds, and then reduced at a ungorm \nrate to zero. \n--`,,```````,`,,`,``,``,,,,`,`-`-`,,`,,`,`,,`---\n4\n.\n7\n.\n3\n Limitations: The above tests are to insure adequate isolation and insulation and are not to be applied \nto elements such as windings, resistors, capacitors, semi-conductors, etc. Circuits which contain",
    "to elements such as windings, resistors, capacitors, semi-conductors, etc. Circuits which contain \nsolid state \ncomponents are not to be subjected to overpotential testing. \n4\n.\n7\n.\n3\n.\n1\n \nCircuits that operate at potentials below 30 \nvolts are not to be subjected to overpotential tests. \n4.8 \nCase Overpressure (Externair: A \npressure of 26 in. (660 \nmm) mercury differential (Gage) shall be",
    "Case Overpressure (Externair: A \npressure of 26 in. (660 \nmm) mercury differential (Gage) shall be \napplied to the case (exterior) for 5 min. with the pressure **ports** vented to ambient pressure. No damage o r  deformation shaíl result, nor shall \nthe instrument fail to meet the performance requirements \napecified in 4\n.\n5\n,\n 4\n.\n9\n,\n 4\n.\n1\n0\n.\n \n4\n.\n9\n \nCase Leakage: A \ntotal \nvolume of 25 \n(0.41 \nL) \nwithin the pressure system (case volume lines and",
    "Case Leakage: A \ntotal \nvolume of 25 \n(0.41 \nL) \nwithin the pressure system (case volume lines and \nother ecjpipment), shall be implemented and thermal equilibrium shall be maintained for these tests. \n4\n.\n9\n.\n1\n \nStatic Pressure (With the static and total \npressure ports tied together): The external pressure surrounding the case shall be approximately **29.921** in. (760 \nmm) of mercury absolute (sea \nlevel). Apply \n12 \nin. (304",
    "mm) of mercury absolute (sea \nlevel). Apply \n12 \nin. (304 \nmm) of mercury absolute to the pressure **ports.** The change in pressure at the static \nconnection shall not exceed **.O20** in. (O. 5 \nmm) of mercury per minute. The aame test shall be done \nby applying 38 \nin. (965 \nmm) of mercury absolute to the ports and the same leak rate shaïl apply.",
    "4.9.2 \nTotal Pressure (With the static port vented to ambient static pressure): A pressure equal to the maximum differential pressure plus the maximum static pressure that the instrument will be exposed to for \nthe maximum operating speed curve applicable to subject aircraft shall be applied to the total pressure \nport. With the total pressure source closed off, there shall be no \nindication of leakage on the total \npressure side after a one minute period.",
    "indication of leakage on the total \npressure side after a one minute period. \n4.10 Output Signal Generation: For a period of not less than 1 \nhr the instrument shall not have been exposed \nto pressures other than ambient (sea \nlevel). The instrument shall be tested at sufficient altitude levels, \nbut not at intervals greater than approximately 5,000 ft (1524 m); and at appropriate airspeed values to",
    "adequagly represent the maximum operating speed curve **for** the subject aircraft, as defined below. \n4.10.1 \nFor MOS curve sections based on \nair speed, at each specified altitude level the applied static pressure \nshall be held constant and the applied differential pressure varied. First by slowly increasing the \ndifferential pressure (airspeed) until an \noutput signal is generated. The output signal shall be generated within the requirements of 3.6.1 (a) or 3.6.1 (b)",
    "as applicable. Then the airspeed shall be \nincreased by 20 knots (37 km/hr) and the signal shall remain o\nn\n.\n The differential pressure shall then \nbe slowly decreased until the warning signal just goes off. The output signal shall have gone off for \nvalues below the nominal maximum speed as defined by the maximum operating limit speed curve. \n4.10.2 \nFor selected values of maximum operating Mach number and altitude, the altitude level shall be held",
    "constant and the differential pressure shall be increased until an output signal has just been generated. \nThe differential pressure shall be readjusted so that the output signal just goes off and the differential \npressure shall now be held at that point. T\nh\ne\n \naltitude level shall then be increased (pressure lowered) \nuntil the output signal just comes **on.** The requirements of 3.6.1 (b) shaU be met, The altitude level",
    "shall then be lowered (pressure increased) until the output signal just goes off. The output signal \nshall have remained on **for** the performance as defined by 3.6.1 (b).",
    "## 5. Performance Standard Under Environmental Conbitions",
    "5.1 \nWhen the Over Speed Warning Instrument forms part of an aircraft system, such as an Air Data Computer, the Over Speed Warning function shall meet the performance requirement specified in Sections 3 \nand 4 herein for the environmental conditions specified for that aircraft system. \n5.1.1 When the Over Speed Warning Instrument is independent of any aircraft system, the manufacturer shail \ndefine the exact. environmental conditions and/or categories of R. T. C. A. DO-160 Appendix \nunder",
    "define the exact. environmental conditions and/or categories of R. T. C. A. DO-160 Appendix \nunder \nwhich the equipment will perform to the requirements of this standard. The applicable environmental \ncondition and categories shail be specified in the manufacturer's installation instructions or on \nthe \nequipment nameplate. \n5.1.2",
    "the \nequipment nameplate. \n5.1.2 \nUnless otherwise specified by the manufacturer, the measurement procedures applicable to a determination of the performance of the instrument under environmental conditions shall be as \nset forth in \nR. T\n.\n \nC. A., Document DO-160, entitled llEnvironrnental Conditions and Test Procedures for Airborne \nElectronic/Electrical Equipment and Instruments, dated 28 February 1975. \n5.2",
    "Electronic/Electrical Equipment and Instruments, dated 28 February 1975. \n5.2 \nEnvironmental Categories: The environmental categories appropriate to the installation o\nf\n this instrument in' \nthe individual airframe shall be defined by the manufacturer in the installation instructions and/or \nas marked on \nthe instrument in accordance with R. T. C.A. , \nDO-160, Appendix \"A\" as applicable, and \nshall be the environmental categories to which the instrument shall have been tested and approved t\no",
    "o\n.\n \nEnvironmenhl conditions and categories which M e r  \nfrom those defined in Appendix \"A1' of DO-160 \nshall be clearly defined in the manufacturer's installation instructions. \n5.2.1 \nPerformance tests which are required after subjection to test environments may be conducted after \nexposure to several environmentd conditions. \n5.2.2 \nThe equipment shall be subjected to the specified environmental conditions as per the procedures defined in R.T. C.A.,",
    "DO-160, and shall not be damaged by being subjected to these environmental tests. \n--`,,```````,`,,`,``,``,,,,`,`-`-`,,`,,`,`,,`---",
    "[\ni\n,\n 2\n.\n3\n The following list of environmental test categories and conditions are considered as the minimum test \nrequirements: \nTemperature/Altitude Tests (DO-160 applicable categories, paragraph section 4. O). \na) \nTemperature Variation Tests (DO-160, paragraph section 5. O). \nb) \nc) Humidity Test (DO-160, paragraph section 6. O). \nd) \nShock Tests (DO-160, paragraph section 7. O). \ne) Vibration Tests (DO-160 Applicable categories, paragraph section 8. O). \nf)",
    "e) Vibration Tests (DO-160 Applicable categories, paragraph section 8. O). \nf) \nMagnetic Effect (DO-160 applicable class, paragraph section 15. O). \ng) Power input Test (DO-160 applicable categories, paragraph section 16. O). \nh) \nVoltage Spare Conducted Test (DO-160 applicable categories, paragraph section 17. O). \ni) Audio Frequency Conducted susceptibility Test (DO-160, paragraph section 18. O). \nj)",
    "i) Audio Frequency Conducted susceptibility Test (DO-160, paragraph section 18. O). \nj) \nInduced Signai Susceptibility Test (DO-160, applicable categories, paragraph section 19. O). \nir) \nDecompression (DO-160, paragraph section 4.6.2)."
  ]
}