{
  "source": "SAE AS8002A 1996.md",
  "chunks": [
    "# The Engineering Society For Advancing Mobility Land Sea Air And Space ® I N T E R N A T I O N A L Aerospace Standard\n\n400 Commonwealth Drive, Warrendale, PA 15096-0001\nIssued   1981-10\nRevised 1996-09\n\n# Submitted For Recognition As An American National Standard\n\n## Air Data Computer - Minimum Performance Standard Foreword\n\nChanges in the revision are format/editorial only.\n\n## 1. Scope:",
    "## 1. Scope:\n\nThis SAE Aerospace Standard (AS) covers air data computer equipment (hereinafter designated the computer) which when connected to sources of aircraft electrical power, static pressure, total pressure, outside air temperature, and others specified by the manufacturer (singly or in combination) provides some or all of the following computed air data output signals (in analog and/or digital form) which may supply primary flight instruments:",
    "Pressure Altitude Pressure Altitude, Baro-Corrected Vertical Speed Calibrated Airspeed Mach Number Maximum Allowable Airspeed Overspeed Warning Total Air Temperature\n\nIn addition, the computer may supply one or more of the following signals:\n\nPressure Altitude, Digitized\nEquivalent Airspeed True Airspeed Static Air Temperature Altitude Hold Airspeed Hold Mach Hold Angle of Attack Flight Control Gain Scheduling Others",
    "SAE Technical Standards Board Rules provide that: \"This report is published by SAE to advance the state of technical and engineering sciences. The use of this report is entirely voluntary, and its applicability and suitability for any particular use, including any patent infringement arising therefrom, is the sole responsibility of the user.\" SAE reviews each technical report at least every five years at which time it may be reaffirmed, revised, or cancelled. SAE invites your written comments",
    "years at which time it may be reaffirmed, revised, or cancelled. SAE invites your written comments and suggestions.",
    "## 1.1 Purpose:\n\nThis Standard defines minimum performance requirements under standard and environmental conditions for Air Data Computer equipment for use in Subsonic Aircraft.\n\n## 2. Applicable Documents:",
    "\"U.S. Standard Atmosphere, 1976\", NASA/USAF/USWB, Washington, 1976. (Notes 1 and 3) \"Tables of Airspeed, Altitude and Mach Number; Based on Latest International Values for Atmospheric Properties and Physical Constants\" Livingston and Gracey, Technical Note D-822, NASA, Washington, \n1961. (Note 1) \"Environmental Conditions and Test Procedures for Airborne Equipment\", Document No. RTCA/DO-160A, January, 1980. (Note 2) \"Federal Aviation Regulations, Vol. III, Part 25, Airworthiness Standards:",
    "Transport Category Airplanes\", FFA, Washington. (Note 1) \"The International System of Units; Physical Constants and Conversion Factors\", Mechtly, Special Publication 7012, NASA, Washington, 1964.",
    "NOTES:\n(1)\nAvailable from Superintendent of Documents, Government Printing Office, Washington \n20402.\n(2)\nAvailable from Radio Technical Commission for Aeronautics, 1717 H Street, N.W., \nWashington 20006.\n(3)\nIdentical to ICAO Standard Atmosphere for values within the scope of this AS.\n\n## 3. General Standards: 3.1 Operation Of Controls:",
    "## 3. General Standards: 3.1 Operation Of Controls:\n\nThe operation of controls intended for use during flight, if any, in all possible position combinations and sequences including OFF, shall not result in a condition whose presence or continuation would be detrimental to the continued performance of the computer.",
    "3.2\nAccessibility of Controls:\nControls which are not normally adjusted in flight shall not be readily accessible to flight personnel, when the computer is installed in accordance with the manufacturer's instructions.",
    "3.3\nCompatibility of Components:\nIf the computer consists of more than one component and these components are individually acceptable but require matching for proper operation, these individual components shall be identified on the equipment nameplate in a manner that will ensure proper matching.\n\n3.4\nInterchangeability:\nInstruments and components which are identified with the same manufacturer's part number shall be interchangeable.",
    "3.5\nFire Resistance:\nExcept for small parts (such as knobs, fasteners, seals, grommets, and small electrical parts) that would not contribute significantly to the propagation of a fire, all materials used must be self-extinguishing when tested in accordance with the requirements of Federal Aviation Regulation 25.1359 (d) and Appendix F thereto, with the exception that materials tested may be configured in accordance with paragraph (b) of Appendix F or may be configured as used.",
    "3.6\nAltitude Reference:\nCalibration of the static air sensing mechanism for pressure altitude outputs (including baro-corrected if supplied) shall be to the geopotential altitude tables of U.S. Standard Atmosphere, 1976.\n\n3.7\nCalibrated Airspeed and Mach Reference:\nCalibrated airspeed and mach outputs shall be calibrated per Tables in NASA Technical Note D-822 dated August 1961.\n\n## 3.8 Alarm Signal:",
    "## 3.8 Alarm Signal:\n\nA means shall be provided to activate a warning device when electrical power (voltage and/or current) is not supplied to the computer. If the equipment has a self-test capability, a malfunction in the self-test system which affects output accuracy of the computer shall be indicated in a positive manner.\n\n## 3.9 Self-Test Capability:",
    "If the computer contains integral arrangements to permit preflight and/or in-flight self-test checks on the operation of the equipment and/or in combination with other aircraft subsystems, a means shall be provided to permit deactivating a using subsystem which might be adversely affected during the self-test cycle. In-flight self-test activating controls shall provide a means to warn the pilot of this mode of operation and which subsystems, if any, are deactivated. The self test feature shall",
    "this mode of operation and which subsystems, if any, are deactivated. The self test feature shall be spring loaded or otherwise arranged to return automatically to the normal operating mode.",
    "## 3.10 Applied Pressures:",
    "The computer shall meet the accuracy requirements herein and shall not be damaged after having applied to its pressure fittings, (energized and unenergized):",
    "Static Pressure Fitting -- Approximately 1.4 inch (35.6 mm) Hg abs to 32 inch (813 mm) Hg abs. Total Pressure Fitting -- The computer shall withstand (a) a Total Pressure of 125% of the differential pressure corresponding to the maximum airspeed range plus 32 inch (813 mm) Hg abs when static pressure is 32 inch (813 mm), and (b) an excess of Static over Total Pressure of 2 inch (50.8) Hg.",
    "## 4. Minimum Performance Under Standard Conditions: 4.1 Accuracy:\n\nWithin the ranges specified by the manufacturer, the computer outputs shall meet the performance requirements of Tables 1 through 7 and other portions of this section, as applicable during room ambient operation. The tolerances include threshold, friction, hysteresis, and repeatability. Tolerances for intermediate values are a straight line interpolation.\n\n## 4.2 Static Source Error Correction (If Applicable):",
    "Unless otherwise noted, outputs may be corrected for static source errors of the specific aircraft model in which the instrument is intended to be used. The tolerances for the outputs as corrected may be increased by the sum of: 10% of the tolerance, plus the product of the allowed tolerances of the correcting parameter and the slope of the certified correction curve. Input pressures shall be adjusted from the values obtained using the references listed in paragraphs 3.6 and 3.7 by an amount",
    "from the values obtained using the references listed in paragraphs 3.6 and 3.7 by an amount corresponding to the static source error for each test point. Test points shall be selected by the vendor by combining test points shown in Tables 1, 3, and 4 in such a manner as to reflect minimum, zero, and maximum static source error correction and to reflect an intermediate value of static source error correction. Test points may be added to Tables 1, 3, and 4 to meet this requirement. If a parameter",
    "correction. Test points may be added to Tables 1, 3, and 4 to meet this requirement. If a parameter not shown in Tables 1, 3, and 4 is used for static source error correction, the input signal for the parameter shall be applied to the computer at appropriate test points to meet the requirements of this specification.",
    "--`,,```````,`,,`,``,``,,,,`,`-`-`,,`,,`,`,,`---",
    "Altitude\nFeet\nAltitude\nMeters\nTolerance\n± Feet\nTolerance\n± Meters\n 0.\n     0.\n25.\n 8.\n 1000.\n  305.\n 25.\n 8.\n 2000.\n  610.\n 25.\n 8.\n 3000.\n  914.\n 25.\n 8.\n 4000.\n 1219.\n 25.\n 8.\n 5000.\n 1524.\n 25.\n 8.\n 8000.\n 2438.\n 30.\n 9.\n11000.\n 3353.\n 35.\n11.\n14000.\n 4267.\n 40.\n12.\n17000.\n 5182.\n 45.\n14.\n20000.\n 6096.\n 50.\n15.\n30000.\n 9144.\n 75.\n23.\n40000.\n12192.\n100.\n30.\n50000.\n15240.\n125.\n38.\nBarometric\nSetting\nScale\ninch Hg\nBarometric\nSetting\nScale\nMB\nCorrection\nApplied\nFeet\nCorrection\nApplied\nMeters",
    "Setting\nScale\ninch Hg\nBarometric\nSetting\nScale\nMB\nCorrection\nApplied\nFeet\nCorrection\nApplied\nMeters\nBaro\nCorrection\nTolerance\n± Feet\nBaro\nCorrection\nTolerance\n± Meters\n22.00\n 745\n-8266\n-2519\n40\n12\n23.27\n 788\n-6794\n-2071\n35\n11\n23.92\n 810\n-6065\n-1849\n35\n11\n24.98\n 846\n-4907\n-1496\n30\n 9.0\n25.98\n 880\n-3850\n-1173\n30\n 9.0\n26.99\n 914\n-2825\n- 861\n25\n 7.5\n27.55\n 933\n-2265\n- 690\n25\n 7.5\n28.20\n 955\n-1630\n- 497\n25\n 7.5\n28.58\n 968\n-1264\n- 385\n25\n 7.5\n28.94\n 980\n-  920\n- 280\n25\n 7.5\n29.91\n1013\n-    10\n-   3",
    "25\n 7.5\n28.58\n 968\n-1264\n- 385\n25\n 7.5\n28.94\n 980\n-  920\n- 280\n25\n 7.5\n29.91\n1013\n-    10\n-   3\n25\n 7.5\n30.15\n1021\n 211\n   64\n25\n 7.5\n30.77\n1042\n 776\n  237\n25\n 7.5\n30.98\n1049\n 965\n  294\n25\n 7.5\nAirspeed\nKnots\nAirspeed\nkm/hour\nTolerance\n± Knots\nTolerance ± km/hour\n90\n5.0\n9.3\n50\n150\n3.0\n6.5\n80\n180\n2.0\n3.7\n100\n220\n2.0\n3.7\n120\n280\n2.0\n3.7\n150\n370\n2.0\n3.7\n200\n460\n2.4\n4.4\n250\n560\n2.8\n5.2\n300\n650\n3.2\n5.9\n350\n740\n3.6\n6.7\n400\n830\n4.0\n7.4\n450\nAltitude\nFeet\nAltitude\nMeters\nMach\nTolerance\n± Mach\n    0\n0",
    "5.9\n350\n740\n3.6\n6.7\n400\n830\n4.0\n7.4\n450\nAltitude\nFeet\nAltitude\nMeters\nMach\nTolerance\n± Mach\n    0\n0\n .3 .4\n .5 .6\n.012 .012\n.010 .0075\n10,000\n 3,048\n .4 .5 .6 .7\n.012 .010 .0075 .005\n20,000\n 6,096\n .4 .5 .6 .7\n.012 .010 .0075 .005\n30,000\n 9,144\n .6 .7\n .80 .90 .95\n.0075 .005 .005 .005 .0075\n40,000\n12,192\n .70 .80 .90\n .95\n.005 .005 .005\n.0075\n50,000\n15,240\n .75 .90 .95\n1.00\n.005 .005 .0075 .015\nVertical Speed\nFPM\nVertical Speed\nM/M\nTolerance\n± FPM\nTolerance\n± M/M\n20000. 6000.\n  4000.\n6096.",
    "Vertical Speed\nFPM\nVertical Speed\nM/M\nTolerance\n± FPM\nTolerance\n± M/M\n20000. 6000.\n  4000.\n6096.\n 1829.\n 1219.\n1000.\n 300.\n 200.\n305.\n 91.\n 61.\n  2000. 1000.\n   500.\n  610. 305. 152.\n 100.\n  50. 45.\n 30. 15. 14.\n   200. 100.\n    50.\n   61. 30. 15.\n  45. 45. 45.\n 14. 14. 14.\n     0.\n   -50.\n  -100.\n    0.\n  -15. -30.\n  45. 45. 45.\n 14. 14. 14.\n  -200. -500.\n -1000.\n  -61.\n -152. -305.\n  45. 45. 50.\n 14. 14. 15.\n -2000. -4000. -6000.\n -610.\n-1219. -1829.\n 100. 200. 300.\n 30. 61. 91.\n-20000.",
    "14. 14. 15.\n -2000. -4000. -6000.\n -610.\n-1219. -1829.\n 100. 200. 300.\n 30. 61. 91.\n-20000.\n-6096.\n1000.\n305.\nOverspeed\nWarning1\nOverspeed\nWarning1",
    "--`,,```````,`,,`,``,``,,,,`,`-`-`,,`,,`,`,,`---",
    "Maximum\nAllowable\nAirspeed\nTolerance\nKnots\nMaximum\nAllowable\nAirspeed\nTolerance\nkm/hour\nAltitude\nFeet\nAltitude\nMeters\nVmo/Mmo\nSpeed\nTolerance\nKnots\nToLerance\nkm/hour\n0\n0\n-0\n+7.5\n-0,\n+4\n-7.5,\n+0\n-4,\n+0\nAs specified by airframe builder\n1,500\n 5,000\n-0\n+7.5\n-0,\n+4\n-7.5,\n+0\n-4,\n+0\nAs specified by airframe builder\n3,000\n10,000\n-0\n+7.5\n-0,\n+4\n -7.5,\n+0\n-4,\n+0\nAs specified by airframe builder\n4,500\n15,000\n-0\n+7.5\n-0,\n+4\n -7.5,\n+0\n-4,\n+0\nAs specified by airframe builder\n6,000\n20,000\n-0\n+7.5\n-0,\n+4",
    "15,000\n-0\n+7.5\n-0,\n+4\n -7.5,\n+0\n-4,\n+0\nAs specified by airframe builder\n6,000\n20,000\n-0\n+7.5\n-0,\n+4\n -7.5,\n+0\n-4,\n+0\nAs specified by airframe builder\n7,500\n25,000\n-0\n+7.5\n-0,\n+4\n -7.5,\n+0\n-4,\n+0\nAs specified by airframe builder\n9,000\n30,000\n-0\n+7.5\n-0,\n+4\n -7.5,\n+0\n-4,\n+0\nAs specified by airframe builder\n10,500\n35,000\n-0\n+7.5\n-0,\n+4\n -7.5,\n+0\n-4,\n+0\nAs specified by airframe builder\n12,000\n40,000\n-0\n+7.5\n-0,\n+4\n -7.5,\n+0\n-4,\n+0\nAs specified by airframe builder\n13,500\n45,000\n-0\n+7.5\n-0,\n+4\n -7.5,",
    "+7.5\n-0,\n+4\n -7.5,\n+0\n-4,\n+0\nAs specified by airframe builder\n13,500\n45,000\n-0\n+7.5\n-0,\n+4\n -7.5,\n+0\n-4,\n+0\nAs specified by airframe builder\n15,000\n50,000\n-0\n+7.5\n-0,\n+4\n -7.5,\n+0\n-4,\n+0\nAs specified by airframe builder",
    "1If an overspeed warning switch is provided in the computer, the switch shall be \"off\" for values below  \nthe overspeed value and \"on\" above the overspeed value.\n\nTemperature\n°C\nTolerance\n± °C\n50\n1.5\n40\n1.5\n 30\n1.5\n|    20 |   1.5 |\n|-------|-------|\n|    10 |   1.5 |\n|     0 |   1.5 |\n|   -10 |   1.5 |\n|   -20 |   1.5 |\n|   -30 |   1.5 |\n|   -40 |   1.5 |\n|   -50 |   1.5 |\n|   -60 |   1.5 |\n|   -70 |   1.5 |\n\n## 4.3 Barometric Corrected Altitude (If Applicable):",
    "The computer may contain an altitude output(s) which is corrected for barometric pressure. This particular output(s) shall differ from Table 1 values by the amount shown in Table 2 for the barometric settings shown in Table 2. The tolerances shown in Table 2 are to be added to the Table 1 tolerances. If a remote device is used for the barometric setting, Table 2 tolerances shall be divided between the remote device and the computer as specified by the manufacturer. The barometric altitude",
    "the remote device and the computer as specified by the manufacturer. The barometric altitude feature shall not change other output parameters including the normal uncorrected altitude output(s).",
    "## 4.4 Additional Outputs:\n\nAdditional outputs that are normally used for scheduling purposes or performing minor functions in subsystems are not required to meet the accuracy requirements of this specification. The manufacturer's installation instructions shall clearly identify these additional outputs and shall specify the accuracy of these outputs.\n\n## 4.5 Threshold:",
    "## 4.5 Threshold:\n\nThe flight instrument outputs shall provide a signal change of discernible magnitude upon an interface readout device of the proper phase when the input is varied incrementally or in alternate directions by the following values:",
    "| Altitude:    |  ±0.003 inches (±0.08 mm) of mercury                                                    |\n|--------------|-----------------------------------------------------------------------------------------|\n| Airspeed:    | ±0.003 inches (±0.08 mm) of mercury or ±25% of tolerance shown in Table 3, whichever is |\n| greater      |                                                                                         |\n\n## 4.6 Leakage:",
    "The Leakage of the computer with static and pitot ports connected together shall not exceed 0.010 inches (0.25 mm) of mercury per minute with a pressure equivalent to 40,000 feet (5.54 inches or 140 \nmm of Hg abs) applied. With a pressure equivalent to 15,000 feet1 (16.88 inches or 429 mm of Hg abs) \napplied to the static port and pitot port open to the atmosphere, the leakage shall not exceed 0.010",
    "inches (0.25 mm) of mercury per minute. These leak rates shall be measured with total volume of both Ps and Pt pressure (trapped gas) in the computer and test equipment equal to 100 ± 10 cubic inches \n(1639 ± 164 cm3). Thermal equilibrium shall be maintained while performing this test.",
    "1If the applied pressure will exceed the total pressure fitting requirement of paragraph 3.10, the pressure for this portion of the test shall be increased to provide the differential pressure defined in paragraph 3.10.\n\n## 4.7 Attitude Tolerance:\n\nThe additional error in the output from the computer in the following positions, without a change in the inputs, shall not exceed 25% of the tolerances for the normal position, except that a 50% tolerance increase is allowed for sub-paragraph (b).",
    "a.\nComputers rotated clockwise around its longitudinal axis, 90° from its normal position.\nb.\nComputers rotated around its longitudinal axis, 180° from its normal position.\nc.\nComputers rotated counterclockwise around its longitudinal axis, 90° from its normal position.\nd.\nComputers rotated about its lateral axis, 90° from its normal position so that the front end is up.\ne.\nComputers rotated about its lateral axis, 90° from its normal position so that the front end is down.",
    "## 5. Minimum Performance Under Environmental Conditions: 5.1 Test Procedures:",
    "Unless otherwise specified herein, the procedures applicable to a determination of the performance of air data computers under environmental conditions are set forth in Radio Technical Commission for Aeronautics, RTCA, document number DO-160A, entitled \"Environmental Conditions and Test Procedures for Airborne Electronic/Electrical Equipment and Instruments\", dated January, 1980. Performance tests specified after subjection to test environments may be made after exposure to several",
    "tests specified after subjection to test environments may be made after exposure to several environmental conditions. The order of tests shall be in accordance with paragraph 3.2, page 4, of DO-160A. The test procedures specified or referenced are satisfactory for use in determining the performance of air data computers under standard and extreme environmental conditions. Alternate approved test procedures that provide equivalent results may be used. As many instruments as deemed necessary to",
    "procedures that provide equivalent results may be used. As many instruments as deemed necessary to demonstrate that all instruments will comply with the requirements of this paragraph, shall be tested in accordance with the manufacturer's recommendations.",
    "## 5.2 Low Temperature Operation:",
    "The computer shall be subjected to the low temperature environmental conditions as specified in the applicable category of RTCA DO-160A. The performance tests as specified in paragraph 4.1 through 4.5 of this Standard shall be conducted at the low temperature environment. For ambient temperatures less than +10 °C the tolerance requirement shall be the sum of the standard condition tolerances plus 1.15% per additional degree C as the temperature is reduced, from +10 °C to the test temperature.",
    "1.15% per additional degree C as the temperature is reduced, from +10 °C to the test temperature. After subjection to this condition the requirements of paragraphs 4.1 through 4.5 of this Standard shall be met at standard conditions.",
    "## 5.3 High Temperature Operation:",
    "The computer shall be subjected to the high temperature environmental conditions as specified in the applicable category of RTCA DO-160A. The performance tests as specified in paragraphs 4.1 through 4.5 of this Standard shall be conducted at the high temperature environment. For ambient temperatures greater than +50 °C the tolerance requirement shall be the sum of the standard condition tolerances plus 1.67% per additional degree C as the temperature is increased from +50 °C to the test",
    "plus 1.67% per additional degree C as the temperature is increased from +50 °C to the test temperature. After subjection to this condition the requirements of paragraphs 4.1 through 4.5 of this Standard shall be met at standard conditions.",
    "5.4\nAltitude:\nThe computer shall be subjected to the maximum operating altitude conditions of DO-160A, and shall meet the standard condition requirements of paragraphs 4.1 through 4.5 of this Standard.\n\n## 5.5 Decompression:\n\nThe computer shall be subjected to the decompression conditions of DO-160A. Following the exposure, the computer shall meet the requirements of paragraphs 4.1 through 4.6 of this Standard at standard conditions.\n\n## 5.6 Overpressure:",
    "## 5.6 Overpressure:\n\nThe computer shall be subjected to the overpressure conditions of DO-160A. Following the exposure the computer shall meet the requirements of paragraphs 4.1 through 4.6 of this Standard at standard conditions.\n\n## 5.7 Vibration:",
    "## 5.7 Vibration:\n\nThe computer shall be subjected to vibration conditions of DO-160A, and shall meet the requirements of paragraphs 4.1 through 4.6 of this Standard. After exposure to vibration, the computer shall meet the requirements of paragraphs 4.1 through 4.5 of this Standard at standard conditions.\n\n## 5.8 Shock:",
    "## 5.8 Shock:\n\nThe computer shall be subjected to the operational shock test of DO-160A. Following the exposure the computer shall meet the requirements of paragraphs 4.1 through 4.6 of this Standard at standard conditions. The crash safety shock test shall be performed as stated in DO-160A.\n\n## 5.9 Power Input:",
    "## 5.9 Power Input:\n\nThe computer shall be subjected to the power input tests of DO-160A and meet the room temperature requirements of paragraphs 4.1 through 4.5 of this specification. Following the tests, it shall meet the requirements of paragraphs 4.1 through 4.5 of this Standard at standard conditions.\n\n## 5.10 Vibration Spike Conducted:",
    "## 5.10 Vibration Spike Conducted:\n\nThe computer shall be subjected to the voltage spike conducted test of DO-160A. The room temperature requirements of paragraphs 4.1 through 4.4 of this Standard shall be met.\n\n## 5.11 Audio Frequency Conducted Susceptibility:\n\nThe computer shall be subjected to the audio frequency conducted susceptibility of DO-160A and shall meet the requirements of paragraphs 4.1 through 4.4 of this Standard.\n\n## 5.12 Induced Signal Susceptibility:",
    "## 5.12 Induced Signal Susceptibility:\n\nThe computer shall be subjected to the induced signal susceptibility conditions of DO-160A, and shall meet the requirements of paragraphs 4.1 through 4.4 of this Standard.\n\n5.13 Radio Frequency Susceptibility:\nThe computer shall be subjected to the radio frequency susceptibility conditions of DO-160A, and shall meet the requirements of paragraphs 4.1 through 4.4 of this Standard.\n\n## 5.14 Emission Of Radio Frequency Energy:",
    "## 5.14 Emission Of Radio Frequency Energy:\n\nThe computer shall be subjected to the emission of spurious radio frequency energy conditions of DO-160A, for the Category to which the instrument is designed. The radio frequency emissions shall be within limits of the test requirement.\n\n## 5.15 Magnetic Effect:\n\nThe computer shall be subjected to the magnetic effect tests of RTCA DO-160A and shall meet the requirements specified therein.\n\n## 5.16 Humidity:",
    "## 5.16 Humidity:\n\nThe computer shall be subjected to the humidity conditions of DO-160A. Following the exposure the computer shall meet the requirements of paragraphs 4.1 through 4.5 of this Standard at standard conditions.\n\n## 5.17 Fungus Resistance:",
    "## 5.17 Fungus Resistance:\n\nComputers which are to be marked with a fungus resistance Category shall be subjected to the fungus culture conditions of DO-160A. Following this test, the computer shall meet the requirements of paragraphs 4.1 through 4.6 of this Standard at standard conditions.\n\n## 5.18 Waterproofness:",
    "## 5.18 Waterproofness:\n\nComputers which are to be marked with a waterproofness Category shall be subjected to the water drip conditions of DO-160A. Following this test, the computer shall meet the requirements of paragraphs 4.1 through 4.5 of this Standard at standard conditions.",
    "5.19 Salt Spray:\nComputers which are to be marked with a salt spray Category shall be subjected to the salt spray conditions of DO-160A. Following this test, the computer shall meet the requirements of paragraphs 4.1 through 4.6 of this Standard at standard conditions.",
    "5.20 Susceptibility Fluid:\nComputers which are to be marked with a susceptibility fluid Category shall be subjected to the hydraulic fluid spray conditions of DO-160A. Following this test, the computer shall meet the requirements of paragraphs 4.1 through 4.6 of this Standard at standard conditions.",
    "5.21 Sand and Dust:\nComputers which are to be marked with a sand and dust Category shall be subjected to the sand and dust conditions of DO-160A. Following this test, the computer shall meet the requirements of paragraphs 4.1 through 4.5 of this Standard at standard conditions.\n\n5.22 Explosion:\nComputers which are to be marked Explosion Category E shall be tested in accordance with the explosion criteria of DO-160A.",
    "6.\nTEST CONDITIONS:\n6.1\nGeneral:\n6.1.1\nAll performance shall be evaluated under ambient room conditions as defined in Radio Technical Commission for Aeronautics Document DO-160A, \"Environmental Conditions and Test Procedures for Airborne Equipment\", except where otherwise specified.\n6.1.2\nThe pressure standards shall be accurate, with corrections, to within .004 inches (.10 mm) of mercury.\n6.1.3\nA warmup period of not to exceed 30 minutes shall be allowed if specified by the manufacturer.",
    "A warmup period of not to exceed 30 minutes shall be allowed if specified by the manufacturer.\n6.1.4\nExcept during the appropriate portions of friction tests, vibration as defined in DO-160A to minimize friction, shall be allowed if specified by the manufacturer.",
    "## 6.2 Tests Under Standard Conditions:\n\nIf static source error correction (SSEC) is supplied, SSEC shall be activated during accuracy tests. For computers with externally shaped SSEC curves, a representative SSEC curve shall be used for accuracy tests. Each computer shall be subjected to scale error tests to prove compliance with the accuracy requirement of paragraphs 4.1 through 4.5.",
    "6.2.1\nAltitude:\nAltitude Test Points shall be at the values shown in Table 1 up to the maximum altitude \nspecified for the computer.\nIf barometric correction of altitude is supplied, a minimum of four values including the maximum negative, zero, and maximum positive corrections of Table 2 shall be used during accuracy tests at altitudes below 20,000 feet. Between zero and 8300 feet of altitude corrections which would provide an altitude output below 0 feet need not be applied.",
    "6.2.2\nCalibrated Airspeed:\nAirspeed test points shall be as listed in Table 3 within the range specified for \nthe computer.\n6.2.3\nMach:\nMach test points shall be as listed in Table 4 within the range specified for the computer.\n6.2.4\nVertical Speed:\nVertical speed test points shall be as listed in Table 5.\n6.2.5\nMaximum Allowable Airspeed and Overspeed Warning:\nTest points shall be as shown in Table 6.\n6.2.6\nTotal Air Temperature:\nTest points shall be as shown in Table 7.\n6.2.7\nThreshold:",
    "6.2.6\nTotal Air Temperature:\nTest points shall be as shown in Table 7.\n6.2.7\nThreshold:\nThe threshold requirements of paragraph 4.4 shall be met for each pressure parameter at \nthree test points. The threshold shall be determined by slowly increasing and decreasing the applied pressure around each test point.\n6.2.8\nOther Outputs:\nThe manufacturer shall specify the test points and test procedure for other outputs.\n6.2.9\nLeakage:\nEach computer shall be tested for leakage per paragraph 4.6.\n6.2.10",
    "6.2.9\nLeakage:\nEach computer shall be tested for leakage per paragraph 4.6.\n6.2.10\nPower Loss:\nThe alarm signal required by paragraph 3.8 shall be tested for power loss.\n6.2.11\nSelf-Test Capabilities:The computer shall be tested per paragraph 3.9 requirements as applicable.\n6.2.12\nAttitude Tolerances:\nComputers that are sensitive to attitude in one or more of the positions of \nparagraph 4.7 shall be tested in the sensitive attitudes in addition to the normal attitude position. A",
    "sensitive attitude shall be any paragraph 4.7 attitude in which a balance means is supplied or which demonstrates an output change greater than 20% of paragraph 4.7 tolerances.\n6.2.13\nInsulation Resistance:\nThe insulation resistance measured at 200 VDC for 5 seconds between all",
    "Insulation Resistance:\nThe insulation resistance measured at 200 VDC for 5 seconds between all \nelectrical circuits and the metallic case shall not be less than 5 megohms. Insulation resistance measurements shall not be made to circuits where the potential will appear across elements such as windings, resistors, capacitors, etc., since the measurement is intended only to determine adequacy of insulation.\n6.2.14\nOverpotential Tests:",
    "6.2.14\nOverpotential Tests:\nThe computer shall not be damaged by the application of a test potential",
    "The computer shall not be damaged by the application of a test potential \nbetween electrical circuits, and between electrical circuits and the metallic case. The test potential shall be a sinusoidal voltage of a commercial frequency with an RMS value of five times the maximum circuit voltage. The potential shall start from zero and be increased at a uniform rate to its test value. It shall be maintained at this value for 5 seconds, and then reduced at a uniform rate to zero.",
    "Since these tests are intended to insure proper electrical isolation of the circuit components in question, these tests shall not be applied to circuits where the potential will appear across elements such as windings, resistors, capacitors, semiconductors, etc. Circuits that operate at potentials at or below 28 V are not to be subjected to overpotential tests.",
    "6.3\nTests Under Environmental Conditions:\n6.3.1\nThose computers designated for testing under environmental conditions shall be tested as specified under the applicable paragraphs of DO-160A, and shall perform as required by paragraphs 5 through 5.22 of this Standard.\n7.\nACCEPTANCE TESTS:\n7.1\nEach computer shall be tested by the manufacturer to show compliance with all applicable paragraphs of \nthis Standard for standard conditions.\n8.\nQUALIFICATION TESTS:\n8.1",
    "this Standard for standard conditions.\n8.\nQUALIFICATION TESTS:\n8.1\nTests shall be performed by the manufacturer to show compliance with all applicable paragraphs of this\nStandard for the standard and environmental conditions.\n9.\nADDENDUM:\n9.1\nThe applicable documents have moved to Section 2.",
    "## 9.2 Identification:\n\nThe following information shall be legibly and permanently marked on the equipment or nameplate attached thereto:",
    "a.\nName of equipment.\nb.\nAS and/or TSO designation (as applicable).\nc.\nManufacturer's part number.\nd.\nManufacturer's name and address.\ne.\nManufacturer's serial number and date of manufacture.\nf.\n Range of altitude, airspeed and Mach.\ng.\nModel designations of airplane (if a static pressure correction or other characteristics peculiar to a \nspecific model are included).\nh.\nEnvironment categories (coded per RTCA Document DO-160A).\ni.\n Nominal weight."
  ]
}