{
  "source": "SAE AS8042 1985 R 2008.md",
  "chunks": [
    "## Aerospace Standard\n\nIssued         ****        1985-12\nReaffirmed  2008-02\n\n## Manifold Pressure Instruments",
    "1.\nPURPOSE:\nThis Aerospace Standard establishes the minimum safe performance standards for manifold \npressure instruments, primarily for use with aircraft reciprocating engines.\n2.\nSCOPE:\nThis Standard covers two basic types of manifold pressure instruments:\nType I\n- Direct Indicating\nType II - Remote Indicating; comprised of separate transmitter and indicator\n3.\nGENERAL STANDARDS:\n3.1\nMaterial:\nMaterials shall be of a quality which experience and/or tests have demonstrated to be suitable",
    "Materials shall be of a quality which experience and/or tests have demonstrated to be suitable \nand dependable for use in aircraft instruments.\n3.2\nWorkmanship:\nWorkmanship shall be consistent with high grade instrument manufacturing practice.\n3.3\nInterchangeability:\nInstruments and instrument systems which are identified with the same \nmanufacturer's part or model number shall be completely interchangeable.\n3.4\nCompatibility:",
    "manufacturer's part or model number shall be completely interchangeable.\n3.4\nCompatibility:\nIf components of Type II instruments are individually acceptable but require matching for \nproper operation, they shall be identified in a manner that will insure performance to the requirements of this Standard.\n3.5\nAccessibility of Controls:\nControls, if provided, which are not normally adjustable in flight shall not be",
    "Controls, if provided, which are not normally adjustable in flight shall not be \nreadily accessible to flight personnel when the instrument is installed in accordance with the \nmanufacturer's instructions.",
    "TO PLACE A DOCUMENT ORDER: \n                             Tel:        877-606-7323 (inside USA and Canada) \n \n                             Tel:        724-776-4970 (outside USA) \n \n                             Fax:       724-776-0790 \n \n                             Email:    CustomerService@sae.org \nSAE WEB ADDRESS: \n                              \n                             http://www.sae.org",
    "3.6\nSelf-Test Provisions:\nSelf-test provisions, if included, shall be spring-loaded or otherwise arranged to \nautomatically return to the normal operating mode following self-testing.\n3.6.1\nIn-Flight Testing:\nIn-flight, self-test activation controls, if included, must provide a means to warn the \npilot or appropriate flight crew member of this mode of operation.\n3.6.2\nCombined Systems:",
    "pilot or appropriate flight crew member of this mode of operation.\n3.6.2\nCombined Systems:\nIf the equipment contains integral arrangements to permit pre-flight and/or inflight self-test checks on the operation of the equipment in combination with other aircraft subsystems, a means shall be provided to deactivate any subsystem which might be adversely affected during the self-test cycle.\n3.6.3\nEffect of Tests:\nThe application of the specified tests shall not produce a condition which would be",
    "The application of the specified tests shall not produce a condition which would be \ndetrimental to the continued performance of the aircraft or the instrument.\n3.7\nMalfunction Indication:\nMeans shall be provided to indicate malfunctions or failures of Type II \ninstruments in a positive manner.\n3.7.1\nPower Failure Indication:\nMeans shall be incorporated in the instrument to indicate when adequate",
    "Power Failure Indication:\nMeans shall be incorporated in the instrument to indicate when adequate \nelectrical power (voltage and/or current of all required phases) is not being made available for proper operation of the instruments. Dial lights are considered to be self-indicating.\n3.7.2\nRemote Indicator:\nMeans shall be incorporated to detect an internal malfunction or loss of \ninformation-valid signal from the remote source providing the information to be indicated.\n3.8\nFail-Safe Provisions:",
    "3.8\nFail-Safe Provisions:\nNo failure or malfunction of the instrument system shall introduce unsafe signal or \npower effects to associated equipment.\n3.9\nMultiple Mode:\nWhen an instrument has more than one mode of operation, each mode shall be \nidentified and means shall be provided to indicate the mode.",
    "## 3.10 Display:",
    "3.10.1\nIndicating Means:\nThe functions shall be indicated by means of one or more pointers, dials, tapes, \ndrums, digital displays or other devices. Unless otherwise specified, relative motion of the index with",
    "respect to the scale when moving elements are employed (either the index or the scale may be the moving element) shall be clockwise, up or to the right for increasing values. In a dual indicator, the pointers or other indicating means shall be clearly identified as 1 and 2 or as 3 and 4.\n3.10.2\nGraduations:\nThe graduations shall be arranged to provide the maximum degree of readability \nconsistent with the accuracy of the instrument.\n3.10.3\nNumerals:",
    "consistent with the accuracy of the instrument.\n3.10.3\nNumerals:\nThe display shall include sufficient numerals to permit quick and positive identification of \neach significant graduation.\n3.10.4\nAmbiguity:\nAppropriate means shall be provided to prevent ambiguous indications within the \nextremes of the operating range of the instrument.\n3.10.5\nInstrument Title:\nThe instrument title, MANIFOLD PRESSURE or MANIF PRESS, shall be of the",
    "3.10.5\nInstrument Title:\nThe instrument title, MANIFOLD PRESSURE or MANIF PRESS, shall be of the \nsame approximate size but no larger than the numerals. The title may be of the same finish as the numerals.\n3.10.6\nInstrument Function:\nWhere more than one function is displayed on a single instrument, the function \nname, when used, shall be of the same approximate size but no larger than the numerals and/or instrument title.\n3.10.7\nUnits of Measure:",
    "3.10.7\nUnits of Measure:\nThe units of measure (in Hg abs or cm Hg abs) shall appear on the display in \nlettering noticeably smaller than either the numerals or the title.\n3.10.8\nDial Finish:\nWhere applicable, unless otherwise specified by the user, matte white material shall be \napplied to graduations, numerals and pointers. Non-functional surfaces shall be dull black. The manufacturer's trademark shall not appear on the dial unless in black-on-black. \n3.10.9\nVisibility:",
    "3.10.9\nVisibility:\nPointer(s) and dial markings shall be visible from any point within the frustrum of a cone, \nthe side of which makes an angle of 30° with the perpendicular to the dial and the small diameter of which is the aperture of the instrument case. The distance between the dial and the cover glass shall be a practical minimum and shall not exceed .12 in (3.0 mm) for a single indicator and .19 in (4.8 mm) for a dual indicator.\n3.11\nCover Glass:",
    "3.11\nCover Glass:\nThe cover glass of the instrument shall de clear, flat, colorless and free from flaws which \nwould adversely affect the readability of the instrument. The total reflectance of the glass, including the integral lighting wedge, if applicable, shall not exceed 10% of the incident light. This reflectance applies over the visible light spectrum from 450 to 600 millimicrons and over an incident solid angle of 60° perpendicular to the viewing plane.\n3.12\nIntegral Lighting:",
    "3.12\nIntegral Lighting:\nWhen integral lighting is provided, it must under normal cockpit lighting conditions \nmake all markings within the required visibility angle easily readable. No direct light shall radiate from the instrument within an angle of 45° either side of the vertical center line of the instrument face in the horizontal plane, not above 30° to the longitudinal axis in the vertical plane.\n3.13\nTemperature:",
    "3.13\nTemperature:\nWhen installed in accordance with the manufacturer's instructions, the instrument shall \nfunction over the range of ambient temperatures shown in Column A, and shall not be adversely affected by exposure to the range of temperatures shown in Column B below:",
    "Instrument Location\nA\nB\nEngine or Engine Accessory Compartment\n-30° to 100°C\n-65° to 100°C\nHeated Areas (Temperature Controlled)\n-30° to 70°C\n-65° to 70°C\nUnheated Areas\n-55° to 70°C\n-65° to 70°C",
    "3.14\nAltitude:\nWhen installed in accordance with the instrument manufacturer's instructions, the instrument \nshall function and shall not be adversely affected following exposure to a pressure range equivalent to -1,000 to 40,000 feet of standard altitude. The instrument shall not be adversely affected when subjected to an ambient pressure of 50 in (127 cm) of Hg absolute.\n3.15\nVibration:\nWhen installed in accordance with the manufacturer's instructions, the instruments shall",
    "When installed in accordance with the manufacturer's instructions, the instruments shall \nfunction and shall not be adversely affected when subjected to vibrations of the following characteristics:",
    "Max. Double\n       Amplitude     \nMaximum Accel.     \nInstrument Location\nHz\nEngine Mounted\n5-150\n.100 in / 2.54 mm\n20 g\nWing or Empennage\n5-500\n.036 in /  .91 mm\n10\nFuselage\n5-500\n.036 in /  .91 mm\n 5",
    "3.16\nHumidity:\nThe instruments shall function and shall not be adversely affected following exposure to any \nrelative humidity in the range from 0 to 95% at a temperature of approximately 70°C.\n3.17\nOperation:\nThe transmitter of a Type II instrument shall be capable of operating in either the horizontal \nor the vertical position.\n3.18\nPressure Stops:\nUnderpressure and overpressure stops shall be provided and shall be designed to",
    "Pressure Stops:\nUnderpressure and overpressure stops shall be provided and shall be designed to \nrestrain the prime mover. The stops shall allow the pointer or other indicating means to travel beyond full scale, but there shall be no overlap of low and high stopped positions.\n3.19\nNoncorrosive Sealing:\nWhere applicable, the instrument mechanism shall be sealed from the pressure",
    "Noncorrosive Sealing:\nWhere applicable, the instrument mechanism shall be sealed from the pressure \ncompartment by a metal diaphragm or bellows to prevent corrosive or explosive vapors from coming in contact with the mechanism.\n3.20\nPower Variation:\nThe instrument, if powered, shall properly function with plus or minus 15% variation in \nDC voltage and/or plus or minus 10% variation in AC voltage and plus or minus 5% variation in frequency.\n3.21\nHermetic Sealing:",
    "3.21\nHermetic Sealing:\nWhen hermetically sealed, the case of a Type II indicator shall be filled with an inert \ngas free of dust particles, and sufficiently dry so that fogging of the indicator glass does not occur during the low temperature and fogging tests of this Standard.\n3.22\nDecompression:\nWhen installed in accordance with the manufacturer's instructions, the instrument \nshall function and not be adversely affected following exposure to a sudden pressure decrease.\n3.23\nOutgassing:",
    "3.23\nOutgassing:\nThe instrument shall be so designed as to safeguard against hazards to the aircraft and \ncrew, and/or malfunction of the instrument due to outgassing of compounds when subjected to a pressure of .50 in (12.7 mm) Hg abs for a period of two hours.\n3.24\nFire Hazard:\n3.24.1\nThe instruments shall be so designed as to safeguard against hazards to the aircraft in the event of",
    "malfunction or failure, and the maximum operating temperature of surfaces of any instrument component contacted by combustible fuel or vapor shall not exceed 200°C due to self-heating.\n3.24.2\nExcept for small parts (e.g. fasteners, grommets, knobs, seals, small electrical parts) that would not",
    "contribute significantly to the propagation of a fire, all materials used must be self-extinguishing when tested in accordance with the requirements of Federal Aviation Regulation 25.1359 (d) and Appendix F thereto, with the exception that materials tested may be configured in accordance with Paragraph (b) of Appendix F or may be configured as used.\n3.25\nExplosion Category:\nThe instrument component, when intended for installation either in uninhabited",
    "Explosion Category:\nThe instrument component, when intended for installation either in uninhabited \nareas of non-pressurized aircraft or in non-pressurized areas of pressurized aircraft, shall not cause an explosion when operated in an explosive atmosphere.\n3.26\nRadio Interference:\nThe instruments shall not be the source of objectionable interference, under \noperating conditions at any frequencies used on the aircraft, either by radiation or feed, in electronic",
    "equipment installed in the same aircraft.\n3.27\nCase Ground:\nIf the instrument case is of metal and if it has an electrical connector, one of the pins \nshall be connected to the case. This may be the same pin used for the cold or common side of the input power. \n3.28\nMagnetic Effect:\nThe magnetic effect of the instruments shall not adversely affect the performance of \nother instruments installed in the same aircraft.\n3.29\nPressure Extremes:",
    "other instruments installed in the same aircraft.\n3.29\nPressure Extremes:\nThe instruments shall not be adversely affected by exposure to pressures of 2.0 in \n(5.1 cm) abs and 5.0 in (12.7 cm) Hg in excess of the full scale reading.\n3.30\nIdentification:\nThe following shall be legibly and permanently marked on the instrument or the \nnameplate attached thereto: Name of instrument Manufacturer's part number Manufacturer's serial number or date of manufacture SAE AS FAA TSO, when issued",
    "Aircraft identification, if applicable Range, on transmitters of Type II instruments Electrical rating, if applicable Manufacturer's name",
    "## 4. Minimum Performance Under Standard Conditions:",
    "4.1\nTest Conditions:\n4.1.1\nAtmospheric Conditions:\nUnless otherwise specified herein, all tests required by this Standard shall \nbe made at an atmospheric pressure of approximately 29.92 in Hg (1013.2 mb), an ambient temperature of approximately 25°C and a relative humidity of not greater than 85%. When tests are conducted with the pressure or temperature substantially different, allowance shall be made for the variation from the specified conditions.\n4.1.2\nVibration to Minimize Friction:",
    "4.1.2\nVibration to Minimize Friction:\nUnless otherwise specified herein, all tests may be conducted with the \ninstrument subjected to a vibration of .002 to .005 in (.05 to .13 mm) double amplitude at a frequency of 25 to 33 Hz.\n4.1.3\nPower Conditions:\nExcept as otherwise specified herein, all tests shall be conducted at the power \nrating recommended by the manufacturer.\n4.1.4\nPosition:\nExcept as otherwise specified herein, all tests shall be conducted with the instrument in its",
    "Except as otherwise specified herein, all tests shall be conducted with the instrument in its \nnormal operating position.\n4.1.5\nTest Medium:\nThe medium used for applying pressure during the tests shall be air or nitrogen.\n4.1.6\nPressure Standard:\nDirect-reading instruments and transmitters of Type II instruments shall be \ncalibrated against an absolute pressure standard known to be accurate within .03 in (.08 mm) Hg.\n4.1.7\nElectrical Standards:",
    "4.1.7\nElectrical Standards:\nTransmitters of Type II instruments shall be read by a synchro angle position \nindicator known to be accurate within .3°. Indicators of Type II instruments shall be set by a synchro or angle generator known to be accurate within .3°. Pressure versus angular scaling shall be specified by the manufacturer.\n4.2\nInsulation Resistance:\nThe insulation resistance of Type II instruments measured at 200 volts DC for 5",
    "The insulation resistance of Type II instruments measured at 200 volts DC for 5 \nseconds between all electrical circuits (except those internally grounded) connected together and the metallic case shall be not less than 5 megohms. Insulation resistance measurements shall not be made for circuits where the potential will appear across elements such as windings, resistors, capacitors, etc., since this measurement is intended only to determine the adequacy of insulation.\n4.3\nOverpotential Tests:",
    "4.3\nOverpotential Tests:\nA Type II instrument shall not be damaged by application of test potential between",
    "electrical circuits and between electrical circuits and the metallic case. The test potential shall be a sinusoidal voltage of a frequency of 50 to 400 Hz with an RMS value of 5 times the maximum circuit voltage, or per Paras 4.3.1 or 4.3.2 as applicable. The potential shall start from zero and be increased at a uniform rate to its test value. It shall be maintained at this value for 5 seconds, then reduced at a",
    "uniform rate to zero. Since these tests are to insure proper electrical isolation of the circuit components in question, these tests shall not be applied to circuits where the potential would appear across elements such as windings, resistors, capacitors, etc., nor to internally grounded circuits.\n4.3.1\nExceptions:\nHermetically sealed instruments shall be tested at 200 volts RMS. Circuits that operate at \npotentials below 15 volts shall not be subjected to overpotential tests.",
    "## 4.4 Scale Error At Room Temperature:",
    "4.4.1\nDirect-Reading and Transmitter Instruments:\nThe test shall be done by subjecting the instrument to",
    "the pressure required to produce the test points, first with the pressure increasing, then with the pressure decreasing. With the pressure increasing, the pressure shall be brought up to, but shall not exceed the pressure specified to give the desired reading; and with the pressure decreasing, the pressure shall be brought down to, but shall not fall below the pressure specified to give the desired reading. The scale errors of direct-reading and transmitter instruments shall not exceed the",
    "reading. The scale errors of direct-reading and transmitter instruments shall not exceed the tolerances of Table I.",
    "4.4.2\nRemote Indicators:\nRemote indicators of Type II instruments shall be tested by applying the specified \nelectrical inputs. The scale errors shall not exceed .2 in (.5 cm) Hg.",
    "## 4.5 Scale Error At High Temperature:",
    "4.5.1\nDirect-Reading Instruments:\nThe instrument shall be soaked in an ambient temperature of 50°C for 1 \nhour or more, then tested per Para 4.4.1. The error at each test point shall not exceed the tolerance in Table I plus .4 in (1.0 cm) Hg.\n4.5.2\nTransmitters of Type II Instruments:\nThe instrument shall be soaked in an ambient temperature of \n70% for 1 hour or more, then tested per Para 4.4.1. The error at each test point shall not exceed the tolerance in Table I plus .4 in (1.0 cm) Hg.",
    "SCALE ERROR AT ROOM TEMPERATURE\nAbsolute Pressure\nTolerance, ±\nin Hg\ncm Hg\nin Hg\ncm Hg\n10\n25\n.7\n1.8\n20\n50\n.6\n1.5\n75*\n1.0\n30* 35\n.4 .4\n90\n1.0\n40\n.4\n105\n1.0\n45\n.4\n120*\n1.2\n50*\n.5\n135\n1.3\n| 55   |   .5 |\n|------|------|\n| 150  |  1.5 |\n| 60   |  0.6 |\n| 165  |  1.5 |\n| 65   |      |\n| 70   |      |\n| .6   |      |\n| .7   |      |\n| 180* |  1.8 |\n| 75*  |  0.7 |\n| 195  |  1.8 |\n| 80   |  0.8 |\n| 210  |  2   |\n| 85   |  0.9 |\n| 225  |  2.3 |\n| 90   |  0.9 |\n\n*Friction and position test points.",
    "*Friction and position test points.\n\n## 4.6 Friction Error:",
    "4.6.1\nDirect-Reading Indicators and Type II Transmitters:\nThe instrument shall be tested for friction at each",
    "The instrument shall be tested for friction at each \ntest point marked with an asterisk in Table I. The pressure shall be increased so as to bring the pointer or angle position indicator to approximately the desired reading, then hold constant while two readings are taken; the first without any vibration or tapping, and the second after the instrument has been vibrated and tapped. The difference between the two readings shall not exceed .5 in (1.3 cm) Hg.\n4.6.2\nRemote Indicators:",
    "4.6.2\nRemote Indicators:\nThe instrument shall be tested for friction at each test point marked with an \nasterisk in Table I. The electrical signal shall be increased so as to bring the pointer or other readout to approximately the desired reading, then held constant while two readings are taken; the first without any vibration or tapping, and the second after the indicator has been vibrated and tapped. The difference between the two readings shall not exceed .4 in (1.0 cm) Hg.",
    "## 4.7 Position Error:",
    "4.7.1\nDirect-Reading Indicators and Type II Transmitters:\nThe instrument shall be tested for position error at \neach test point marked with an asterisk in Table I. The pressure shall be set at each test point with the instrument in its normal operating position, then held in the other 5 positions which are mutually 90° \napart. The readings at the other 5 positions shall be within .3 in (.8 cm) Hg of the reading at the normal position.\n4.7.2\nRemote Indicators:",
    "4.7.2\nRemote Indicators:\nThe instrument shall be tested for position error at each test point marked with an \nasterisk in Table I. The electrical signal shall be set to each test point with the indicator in its normal operating position, then held in the other 5 positions which are mutually 90° apart. The readings at the other 5 positions shall be within .2 in (.5 cm) Hg.\n4.8\nLeakage:\nThe leakage of direct-reading and transmitting instruments shall be tested by applying",
    "Leakage:\nThe leakage of direct-reading and transmitting instruments shall be tested by applying \npressure to produce a full-scale reading, then the pressure connection shall be sealed off as close as possible to the instrument. During a period of 5 minutes the reading shall not change by more than 1% of full scale.\n4.9\nSealing (If Applicable):\nHermetically sealed instruments shall be tested for leakage by means of a mass",
    "Hermetically sealed instruments shall be tested for leakage by means of a mass \nspectrometer type of helium leak detector, or equivalent. The leak rate shall not exceed 3 micron-liter per hour at a pressure differential of 1 atmosphere.\n4.10\nFogging (If Applicable):\nHermetically sealed Type II indicators, while operating, shall be exposed to a",
    "Hermetically sealed Type II indicators, while operating, shall be exposed to a \n70°C ambient for a minimum of 30 minutes. While at this temperature, the external face of the cover glass shall be reduced to a temperature of 20°C or less. No moisture or other material shall be deposited on the internal face of the cover glass as a result of this test.\n4.11\nDamping:\nA pressure sufficient to produce full scale deflection of the instrument shall be applied.",
    "A pressure sufficient to produce full scale deflection of the instrument shall be applied. \nWhen the pressure is suddenly released, the time for the instrument to traverse the interval from full scale to ambient as specified in Para 4.1.1 shall be within 1.0 to 3.0 seconds.",
    "## 5. Minimum Performance Under Adverse Environmental Conditions:\n\n5.1\nTest Procedures:\nExcept as otherwise specified herein, tests shall be done using the equipment, \nprocedures and sequence specified in Radio Technical Commission for Aeronautics Document DO-160B. Except as otherwise specified herein, all tests for performance may be conducted with the instrument subjected to vibration of .002 to .005 in (.05 to .13 mm) double amplitude at a frequency of 25 to 33 Hz.",
    "## 5.2 Temperature Tests:",
    "5.2.1\nCategories:\nDirect-reading (Type I) instruments and indicators of Type II instruments shall be \nconsidered to be in Category A1. Transmitters of Type II instruments shall be considered to be in \nCategory C3. \n5.2.2\nLow Temperature:\nThe low temperature operating and survival tests shall be done per Para 4.5 of",
    "Low Temperature:\nThe low temperature operating and survival tests shall be done per Para 4.5 of \nDO-160B. The readings of direct reading instruments and of the transmitters of Type II instruments shall not exceed the tolerances of Table I by more than .4 in (1.0 cm) Hg. The errors of Type II indicators shall not exceed .4 in (1.0 cm) Hg.\n5.2.3\nHigh Temperature:\nThe high temperature operating test is specified in Para 4.5 of this Standard. The",
    "The high temperature operating test is specified in Para 4.5 of this Standard. The \nhigh temperature survival test shall be done per Para 4.5 of DO-160B.\n5.2.4\nThermal Shock:\nThis test is applicable only to hermetically sealed components. The component shall",
    "be subjected to eight cycles of exposure to temperatures of -55° and +85°C without evidence of damage to the enclosure. Each cycle of the test shall consist of subjecting the component to the high temperature for d period of 30 minutes, then within 5 seconds of removal, the component shall be subjected to the low temperature for a period of 30 minutes. This cycle shall be repeated continuously, one cycle following the other until 8 cycles have been completed. Following this test, the component",
    "cycle following the other until 8 cycles have been completed. Following this test, the component shall be subjected to, and meet the Sealing test of Para 4.9 of this Standard.",
    "## 5.3 Altitude Exposure Test:\n\n5.3.1\nCategories:\nDirect-reading (Type I instruments) and indicators of Type II instruments shall be \nconsidered to be in Category A1. Transmitters of Type II instruments shall be considered to be in \nCategory C3.\n5.3.2\nTest:\nThe instrument shall be tested at altitude per Para 4.6.1 of DO-160B, and shall meet the \nrequirements of Para 4.4 of this Standard.\n\n## 5.4 Overpressure Tests:",
    "--`,``````,`,``,,`,,,`,`,`,`,```-`-`,,`,,`,`,,`---\n5.4.1\nCase Overpressure:\nWith the pressure connections of the instrument sealed off, the instrument shall \nbe subjected to the pressure specified in Para 4.6.3 of DO-160B.\n5.4.2\nMechanism Overpressure:\nTo the pressure connections of the direct reading instrument or the",
    "5.4.2\nMechanism Overpressure:\nTo the pressure connections of the direct reading instrument or the \ntransmitter of a Type II instrument a pressure of 2.0 in (5.1 cm) Hg abs shall be applied for a period of 10 minutes, then a pressure of 5.0 in (12.7 cm) Hg greater than the full scale reading of the instrument for a period of 10 minutes. The instrument shall meet the scale error test of Table I following the above exposures.",
    "## 5.5 Humidity Tests:\n\n5.5.1\nCategories:\nDirect-reading instruments and indicators of Type II instruments shall be considered to be \nin Category A. Transmitters of Type II instruments shall be considered to be in Category B.\n5.5.2\nTest:\nThe instrument shall be tested per Para 6.3 of DO-160B and shall meet the requirements of \nTable I. There shall be no evidence of damage or corrosion which could affect performance.\n\n## 5.6 Vibration Tests:",
    "5.6.1\nCategories:\nDirect-reading instruments and indicators of Type II instruments intended for use in \nhelicopters shall be considered to be in Category P; those intended for use in fixed-wing aircraft shall be considered to be in Category S. Transmitters of Type II instruments shall be considered to be in Category U.\n5.6.2\nTest:\nThe instrument shall be tested per the sinusoidal test procedure of Para 8.3.1 of DO-160B.",
    "Test:\nThe instrument shall be tested per the sinusoidal test procedure of Para 8.3.1 of DO-160B. \nPointer (or other display) oscillation shall not exceed 1.5% of full scale value for direct-reading instruments, nor .5% of full scale for Type II remote indicators. After completion of this test, no damage shall be evident, and the instrument shall meet the requirements of Para 4.4 of this Standard.",
    "## 5.7 Explosion Tests:\n\n5.7.1\nCategories:\nDirect-reading instruments and transmitters of Type II instruments shall be considered in \nCategory E2. Indicators of Type II instruments shall be considered in Category X.\n5.7.2\nTest:\nThe instrument shall be tested per Para 9.9.3.2 of DO-160B. Tests at 40,000 and 50,000 feet of \naltitude may be omitted.\n\n## 5.8 Waterproofness Tests:",
    "## 5.8 Waterproofness Tests:\n\n5.8.1\nCategories:\nDirect-reading instruments and indicators of Type II instruments shall be considered in \nCategory X. Transmitters of Type II instruments shall be considered in Category R.\n5.8.2\nTest:\nThe instrument shall be tested per Para 10.3.2 of DO-160B.\n\n## 5.9 Fluids Susceptibility Tests:",
    "5.9.1\nCategories:\nDirect-reading instruments and indicators of Type II instruments shall be considered in \nCategory X. Transmitters of Type II instruments shall be considered in Category F.\n5.9.2\nThe instrument shall be tested per Para 11.4.2 of DO-160B.\n5.10\nMagnetic Effect Tests:\n5.10.1\nCategories:\nDirect-reading instruments and indicators of Type II instruments shall be considered in \nCategory B. Transmitters of Type II instruments shall be considered in Category X.\n5.10.2\nTest:",
    "Category B. Transmitters of Type II instruments shall be considered in Category X.\n5.10.2\nTest:\nThe instrument shall be tested per Para 15.3 of DO-160B.\n5.11\nPower Input Tests:\nType II instruments shall function properly under the power variations stated in \nPara 3.20.",
    "## 6. Individual Tests:\n\n6.1\nEach instrument to be marked SAE AS 8042 shall have net the requirements of Paras 4.2 through 4.9.\n\n## 7. Qualification Tests:\n\n7.1\nAt least one and as many more instruments as the manufacturer deems necessary shall have met the \nrequirements of Paras 4.10, 4.11 and 5.2 through 5.11.\n\n## 8. References:",
    "1.\n\"Manifold Pressure Indicating Instruments\", SAE AS 411, November 1948 (Note 1).\n2.\n\"Manifold Pressure Indicating Instruments\", SAE AS 411A, April 1963 (Note 1).\n3.\n\"Synchros\", SAE ARP 461B, August 1963.\n4.\n\"Identification Marking Methods\", SAE AS 478G, November 1979.\n5.\n\"Lighting, Integral, for Aircraft Instruments:\nCriteria for Design of Red-Lighted Instruments\", SAE\n ARP 582A, October 1967.\n6.\n\"Design Criteria for White Incandescent Lighted Aerospace Instruments\", SAE ARP 798, June 1965.",
    "6.\n\"Design Criteria for White Incandescent Lighted Aerospace Instruments\", SAE ARP 798, June 1965.\n7.\n\"Barometry for Altimeter Calibration\", SAE AIR 1075, March 1974.\n8.\n\"Numeral, Letter and Symbol Dimensions for Aircraft Instrument Displays\", SAE AIR 1093, December 1969.",
    "## 8. (Continued):\n\n9.\n\"Environmental Conditions and Test Procedures for Airborne Equipment\", Radio Technical Commission for Aeronautics Document DO-160B, Washington, July 1984. (Also identified as EUROCAE/ED-14B.)\nNote 1 - AS 8042 supersedes AS 411A. AS 411 cannot be cancelled while TSO-C45 is still in effect. AS \n411A was never used as a TSO and is inactive for new design.\n\n## Prepared By Sae Committee A-4, Aircraft Instruments\n\n--`,``````,`,``,,`,,,`,`,`,`,```-`-`,,`,,`,`,,`---"
  ]
}