{
  "source": "SAE AMS-H-6088 1997.md",
  "chunks": [
    "## Adoption Notice",
    "SAE-AMs-H-6088, \"Heat Treatment of Aluminum Alloys\", was adopted on September 26, \n1997, for use by the Department of Defense (DoD). Proposed changes by DoD activities must be \nsubmitted to the DoD Adopting Activity: Commander, Naval Air Warfare Center Aircraft \nDivision, Code 414100B \n                     120-3, Highway 547, Lakehurst, NJ 08733-5 \n                                                             100. DoD activities may",
    "100. DoD activities may \nobtain copies of this standard from the DODSSP, Standardization \n                                                          Document Order Desk, 700 \nRobbins Avenue, Building 4D, Philadelphia, PA 191 \n                                               1 \n                                                1-5094. The private sector and other",
    "1-5094. The private sector and other \ngovernment agencies may purchase copies from SAE, 400 Commonwealth Drive, Warrendale, \nPA 15096.",
    "SAE-AMs-H-6088 should be used instead of MIL-H-6088, which was canceled on September \n26, 1997. \n\nAir Force - 11 \nArmy - MR \n(Project 95GP-04 \n16)",
    "DISTRIBUTION \n            STATEMENT \n                      A. Approved for public release; distribution \n                                                      .is \n                                                       unlimited. \n\n# Aerospace Material\n\nJUL 1997 \n~ \n~~ \nSPECIFICATION \n400 Commonwealth Drive, Warrendale, PA 15096-0001 \n\n# Submitted For Recognition As An American National Standard\n\n## Heat Treatment Of Aluminum Alloys Notice",
    "## Heat Treatment Of Aluminum Alloys Notice\n\nThis document has been taken directly from Military Specification MlL-H-6088G, Amendment 1, and contains only minor editorial and format changes required to bring it into conformance with the publishing requirements of **SAE** technical standards.",
    "The original military specification was adopted as an CAE standard under the provisions of the SAE \nTechnical Standards Board (TSB) Rules and Regulations (TSB 001",
    "Technical Standards Board (TSB) Rules and Regulations (TSB 001 \n) pertaining to accelerated adoption of government specifications and standards. TSB rules provide for (a) the publication of portions of unrevised government specifications and standards without consensus voting at the SAE Committee level, (b) the use of the existing government specification or standard format, and (c) the exclusion of any qualified product list (QPL) sections.",
    "## Scope And Application: 1.",
    "This specification covers the requirements and recommendations for the heat treatment of aluminum alloy rolled, extruded, forged, drawn, and cast product (See 6.1 and 6.5.1). It does not cover the requirements for the heat treatment of aluminum alloy parts (See 3.4). Subjects covered are: process establishment and re-establishment (previously called \"process qualification\" \nand \"process requalification\");",
    "and \"process requalification\"); \nperiodic process surveys; periodic product monitoring; furnaces and operation controls; pyrometric equipment; quenching equipment, media, and operation controls; parameters and procedures for solution heat treatment, quenching, age hardening, and annealing *(of* certain product); \nrequirements for inspections and record keeping; test methods: and limits of product acceptability.",
    "## 2. Applicable Documents:\n\nThe following publications form a part of this specification to the extent specified herein. The applicable issue of these publications shall be those in effect on date of invitation for bids or solicitation for offers. \n\nFAX: (412) 776-0790",
    "U.S. Government Publications: \n2.1 \nAvailable from DODSSP, Subscription Services Desk, Building \n4D, 700 Robbins Avenue, Philadelphia, PA 191 \n1 \n1-5094. \n\nMIL-STD-1537 \nElectrical Conductivity Test for Measurement of Heat Treatment of Aluminum \nAlloys, Eddy Current Method \nMIL-STD-45662 Calibration Systems Requirements \n\n2.2 \nSAE Publications: \nAvailable from SAE, 400 Commonwealth Drive, Warrendale, PA 15096-0001. \n\nAMS 2750 \nPyrometry AMS 2770 \nHeat Treatment of Wrought Aluminum Alloy Parts",
    "AMS 2750 \nPyrometry AMS 2770 \nHeat Treatment of Wrought Aluminum Alloy Parts \n\n2.3 \nASTM Publications: \n                                                                                          \nAvailable from ASTM, 1 \nO0 \nBarr Harbor Drive, West Conshohocken, PA 19428-2959.",
    "ASTM B 557 \nASTM E 10 \nASTM E 18 \nASTM E 103 \nTension Testing Wrought and Cast Aluminum and Magnesium \nAlloy Products \nBrinell Hardness of Metallic Materials \nRockwell Hardness and Rockwell Superficial Hardness of Metallic Materials \nRapid Indentation \nHardness \nTesting of Metallic Materials \n\n                                                                                          \n\n## Ansi Publications:\n\n2.4 \nAvailable from ANSI, 11 West 42nd Street, New York, NY 10036-8002.",
    "## Ansi Publications:\n\n2.4 \nAvailable from ANSI, 11 West 42nd Street, New York, NY 10036-8002. \n\nANSI H35.1 \nAlloy and Temper Designation System for Aluminum \n\n## 3. Requirements:",
    "ANSI H35.1 \nAlloy and Temper Designation System for Aluminum \n\n## 3. Requirements:\n\n3.1 \nProcess Establishment: \nPrior to production, fully capable heat-treating equipment and procedures shall be in place and established as specified herein (See Table I). The Government reserves the right of review, verification, and approval of the results of process establishment or re-establishment derived from testing new equipment and equipment which has undergone major work or repair (See 3.1.2).",
    "3.1.1 \nNotification of Authorized Government Representative: When an authorized government \nrepresentative \n(See 6.5.6) \nfinds it necessary to witness the process establishment tests, the \nrepresentative \nshall be given at least 7 days notice prior to such tests. All process information \nshall \nbe considered proprietary \nto the heat transfer, and its confidentiality \nshall be preserved.",
    "3.1.2 \nConditions Requiring Process Re-Establishment: Occurrence of one or more of the following \nevents necessitates re-establishment \nof the equipment or procedures involved: \n3.1.2.1 \nReplacement of, extensive deterioration of, major damage to, or modifications to the previously \naccepted heat-treavquench equipment that might result in non-conformance (See 3.5.1 through \n3.5.5 as applicable).",
    "3.1.2.2 \nFailure of existing equipment or standard heat-treating procedures to consistently produce \nproduct meeting the quality requirements specified herein (See 4.6.4). \n3.1 2.3 Any noncompliance (See 4.1.3 and 4\n.\n6\n.\n4\n)\n \ndetected during periodic process surveys (See 3.2) or \nperiodic product \nmonitoring (See 3.3). \n3.2 \nPeriodic Process Surveys:",
    "periodic product \nmonitoring (See 3.3). \n3.2 \nPeriodic Process Surveys: \nHeat-treating equipment and procedures shall be surveyed as specified in Table I.",
    "## 3.3 Periodic Product Monitoring:\n\nProducts shall be tested to monitor the operational characteristics of the heat-treating equipment and procedures as specified in Table I. \n\n## 3.4 Heat Treatment Of Parts:\n\nFinished or semi-finished parts made from wrought mill products shall be heat treated in accordance with AMS \n2770. Raw castings, finished or rough machined parts made from castings, and deep drawn shells shall be heat treated in accordance with the applicable requirements herein.",
    "## 3.5 Equipment:",
    "3.5.1 \nFurnaces: Any type of furnace i\ns\n acceptable for the heat treating of aluminum alloys, provided the \nproduct is not deleteriously affected. Unless otherwise indicated herein, the term \"air\", with \nreference to a heating medium, shall apply equally to combusted gases and protective \natmospheres. The use of torch-heating equipment is prohibited. \n3.5.1.1 Air Chamber Furnaces: Air chamber furnaces in which the products of combustion come in",
    "3.5.1.1 Air Chamber Furnaces: Air chamber furnaces in which the products of combustion come in \ncontact with the metal may be used for the heat treatment of those products \nwhich have been \ndemonstrated by test to be free from porosity resulting from solution heat treatment (See 6.3.3.2 \nand 6.5.5) in the furnace of concern. \n3.5.1.2 \nSalt Baths: l h e  \nsalt shall not react with the alloys being \ntreated. Nitrate salt baths shall not be",
    "salt shall not react with the alloys being \ntreated. Nitrate salt baths shall not be \nused to heat treat **5XX.X** casting alloys (See 6.3.1).",
    "3.5.1.3 \nAlternate Apparatus for Age-Hardening \nTreatment: Other apparatus for age-hardening heat \ntreatment may be used, provided it meets all requirements specified herein and the material \nmeets the material \nspecification requirements, and is not damaged. \n3.5.1.4 \nFurnace Temperature Uniformity \nSurveys: Surveys shall be as specified in AMS 2750. \n3.5.1.5 \nTemperature Uniformity: \n3.5.1 \n5.1 \nBatch Furnaces \nand Salt Baths: The design and construction \nof batch furnaces and baths shall",
    "Batch Furnaces \nand Salt Baths: The design and construction \nof batch furnaces and baths shall \nbe such that, during the heating and soaking period, the temperature of the heating medium at \nany point in the heating or soaking zone is controlled \nsuch that the metal temperature does not \nexceed the maximum of the soaking temperature range specified in 3.6.1 or the selected agehardening temperature range (See 3.9) applicable \nto the alloy being solution heat treated or",
    "to the alloy being solution heat treated or \naged. After all of the fumace charge reaches the minimum of the applicable \ntemperature range \nspecified, the maximum temperature variation of the heating medium and furnace charge \nwithin this zone shall be 20 O F  \n(or less when Table II \nor VI1 requires), with the exception of alloy \n6061 for which a variation of 30 O F  \nis permissible (See Table II, \nfootnote 5 and Table VII, \nfootnote 4). \n3.5.1 5.2",
    "is permissible (See Table II, \nfootnote 5 and Table VII, \nfootnote 4). \n3.5.1 5.2 \nContinuous Furnaces: For continuous furnaces, the soaking zone follows the heating zone, \nand it is in \nthe soaking zone that metal temperatures shall be within the heat-treating \ntemperature ranges specified in 3.6.1 or the selected age-hardening \ntemperature range (See \n3.9), as applicable. After all of the furnace charge within the soaking zone reaches the",
    "3.9), as applicable. After all of the furnace charge within the soaking zone reaches the \nminimum of the applicable temperature range specified, the maximum temperature \nvariation of \nthe heating medium and furnace charge in the soaking zone shall be 20 O\nF\n (or less when Table \nII or VI1 requires) with the exception of alloy 6061 for which a variation of 30 O\nF\n is permissible \n(See Table II, \nfootnote 5 and Table **VII,** footnote 4). \n3.5.2",
    "F\n is permissible \n(See Table II, \nfootnote 5 and Table **VII,** footnote 4). \n3.5.2 \nPyrometric Equipment: Properly arranged temperature-control and recording devices shall be \nprovided \non all heat-treating \nequipment \nto ensure control of temperature to the requirements \nof this \nspecification and AMs 2750 in all heating and soaking zones. \n3.5.2.1 \nTemperature Control and Recording Equipment: Instruments shall meet the requirements \nof",
    "3.5.2.1 \nTemperature Control and Recording Equipment: Instruments shall meet the requirements \nof \nAMS 2750 except that the recordings of the working instruments required by AMS 2750 may be \nstored on computerized magnetic storage media. If stored this way, a hard copy of the \nrecordings shall be available upon request. The exact location of sensors shall be governed by \nfurnace or bath configurations and dimensions in accordance with AMS 2750, and they shall be \nin such locations",
    "in such locations \nas to give accurate measurement o\nf\n the workpiece and heating medium \ntemperatures. \n3.5.2.2 \nAccuracy: The furnace pyrometric system shall be set to control at working temperatures applied \nin practice and the accuracy of the system shall be monitored according to AMS 2750.",
    "3.5.3 \nQuenching Equipment and Media: Suitable equipment for water, air, aqueous polymer solution, \nliquified gas, or oil quenching shall be provided. \n3\n.\n5\n.\n3\n.\n1\n Quench Baths: Quench baths \nshall permit complete immersion of material and shall be of \nsufficient size to extract the heat from the most massive load anticipated to be quenched. \n3.5.3. \nCirculation: The quench bath shall contain a circulation system (either internal \nor external) to \nprovide",
    "or external) to \nprovide \nfor the flow of quench medium through the heat-treat load. In lieu of bath circulation, \nproduct may be agitated if \nmovement is sufficient \nto ensure that quench uniformity is obtained \nand all requirements are met. This shall be verified by monitoring in accordance with 4.4.2. \n3.5.3. \nAir Agitation: Air agitation of the quench bath is permitted, if it is demonstrated that quench \nuniformity is obtained. This shall be verified by monitoring in accordance with 4.4.2.",
    "uniformity is obtained. This shall be verified by monitoring in accordance with 4.4.2. \n3.5.3.1.3",
    "Heating and Cooling: The quench bath shall be provided with sufficient heating and/or cooling capacity needed to maintain the temperature of the quenching medium within the ranges specified in 3.7, as applicable, and instrumentation necessary to ensure adequate temperature control. The instrumentation shall be capable of reading within 1\n5\n \nO\nF\n \nof true temperature.",
    "3.5.3.1.4 \nSpeed of Immersion: The quench system shall have the means to control the speed at which \nsolution heat treated parts enter the quench medium, if such control is part of the required heattreating procedure. The allowable quench delay (See 3.7.4) shall not be exceeded. \n3.5.3.1.5 \nInflow and Draining: All water baths, except aqueous polymer solutions, employed in \nquenching products which have been heated in salt bath furnaces shall be maintained such",
    "quenching products which have been heated in salt bath furnaces shall be maintained such \nthat no visible salt residue is observed on the surface of the products after drying. Wateraqueous polymer solutions shall at all times when in use contain no salt concentrations in \nexcess of 6.0 percent \nby weight. \n3\n.\n5\n.\n3\n.\n2\n Spray-Quenching Equipment: When a spray system is employed for quenching, the discharge of",
    "3\n.\n2\n Spray-Quenching Equipment: When a spray system is employed for quenching, the discharge of \nthe coolant from the nozzles shall be of sufficient volume, pressure, and temperature to ensure \nthat a uniform and satisfactory quench is achieved on all products. For plate and extrusions, this \nshall be verified \nby monitoring in accordance with 4.4.1. Calibrated recording instrumentation \nshall be provided to monitor spray quench variables. \n3.5.3.3 \nLocation",
    "shall be provided to monitor spray quench variables. \n3.5.3.3 \nLocation \nof Quenching Equipment: Quenching equipment and handling \nfacilities shall be located \nsuch that the delay in quenching does not exceed the maximum delay times specified in Table \nVI, as applicable. \n3.5.4 Rinsing Equipment: Rinse tanks, sprays, or other suitable apparatus shall be employed as \nnecessary to ensure that no salt residues or films remain on metal surfaces after drying.",
    "necessary to ensure that no salt residues or films remain on metal surfaces after drying.",
    "3.5.5 \nConstruction \nof Support Racks, Fixtures, and Other Workpiece Holders: Support racks shall be so \nconstructed as to minimize shifting or movement of the metal during the heat treatment and \nquenching operations. The racks, fixtures, trays, or baskets shall be constructed so that no \ndeleterious effect on the products being processed will arise from solution heat treating or \nquenching. \n3.5.6",
    "quenching. \n3.5.6 \nTesting Equipment: The electrical conductivity tester shall be calibrated in accordance with the \nprocedures outlined in 4.5.5.2. \n3.5.7 \nCalibration: Calibration of all equipment shall be in accordance with MIL-STD-45662 \nand \nAMS 2750, as applicable.",
    "## 3.6 Parameters And Procedures For Solution Heat Treatment:",
    "3.6.1 \nSolution Heat Treatment of Mill and Foundry Products: Aluminum alloy wrought products and \ncastings shall be solution heat treated within the applicable metal temperature ranges specified in \nTable II. \n3.6.2 \nRe-Solution \nHeat Treatment: A solution heat treatment of an aluminum alloy workpiece which has \npreviously been solution heat treated shall be considered a re-solution heat treatment. \nAccordingly, the first solution heat treatment of an alloy following purchase",
    "Accordingly, the first solution heat treatment of an alloy following purchase \nas solution heat treated \nor solution heat treated and aged shall be considered a re-solution heat treatment. Annealing and \nage-hardening heat treatments shall not be considered re-solution heat treatments. Alclad \nproducts of the **2XXX** and **7XXX** series alloys shall not be re-solution heat treated more than the \nnumber of times specified in Table 111 (See 6.3.3.5). \n3.6.3 \nHeat-Treating",
    "number of times specified in Table 111 (See 6.3.3.5). \n3.6.3 \nHeat-Treating \nOperations: Heat-treating \noperations shall be performed on the whole workpiece, \nnever on a portion \nonly, and shall be applied in \na manner that will produce uniform properties \nwithin \nthe limitations of material configuration. \n3.6.3.1 \nHeat Treating Alclad Sheet: When solution heat treating alclad sheet, the size and spacing of the \nload shall permit \nthe entire load to come to the specified",
    "load shall permit \nthe entire load to come to the specified \ntemperature range within 30 minutes for \nthicknesses up to 0.050 inch, 60 minutes for 0.050 or greater but less than 0.1 \n02 inch, and \n120 minutes for 0.102 or greater. When a furnace charge consists of a group of alciad alloy \nworkpieces of varying thickness, the heat-up time for the charge shall be the limit specified for \nthe thinnest work piece or section of a work piece (See 6.3.3.3).",
    "the thinnest work piece or section of a work piece (See 6.3.3.3). \n3.6.4 Cleanliness: Surfaces of metal shall be free from lubricants \nor other matter deleterious to the \naluminum alloy being heat treated. Substances \non the surface \nwhich, after solution heat treatment, \naffect appearance only shall not be cause for disapproval of the production procedure nor rejection \nof the workpieces so affected.",
    "3.6.5 \nCharge Preparation and Limitation: Aluminum alloys being heat treated shall be so supported as to \npermit access of the heating medium to uniformly heat the alloy to the required temperature. \nExcept as noted below, furnaces shall not be charged following a downward temperature setting \nuntil all instruments indicate that the furnace has reached the range in Table II encompassing the \nnew lower temperature. If the furnace has automatic controls that ensure that the reduction \nin",
    "new lower temperature. If the furnace has automatic controls that ensure that the reduction \nin \nfurnace temperature is attained prior to any metal in the charge reaching the soak temperature, \nfurnace charging may take place at any time. \n3.6.6 \nSoaking Time: After the charge has reached the required solution heat-treating temperature range, \nit shall be held (soaked) within that temperature range for a period necessary to ensure the \nmaximum possible",
    "maximum possible \nsolution of alloying elements and development o\nf\n specified properties \nupon \naging. In a continuous furnace, the speed of any product passing through the working zone \n(See 6.5.3) shall be such that soaking time shall yield product capable of being aged to \nrequirements of the applicable product specification. Recommended soaking times are listed in \nTables IV and V. When a charge includes sections of various thicknesses, the recommended",
    "Tables IV and V. When a charge includes sections of various thicknesses, the recommended \nsoaking time shall be determined by the section having the greatest thickness (See 6.3.3.1).",
    "## 3.7 Quenching Parameters And Procedures:",
    "3.7.1 \nQuenching Wrought Nonforged Product: Parameters and procedures for quenching wrought alloy product (except forgings) of 2XXX and 7XXX series alloys shall be as specified in 3.7.1.1 and \n3.7.1.2. \n3.7.1.1 \nTotal Immersion in Water Baths or Aqueous Polymer Solutions: When a water bath is used, the \nvolume and circulation of the bath shall be such that its temperature shall be no higher than \n100\" F at the time of completion of the quench. When an aqueous polymer solution is used, the",
    "100\" F at the time of completion of the quench. When an aqueous polymer solution is used, the \nvolume and circulation \nof solution shall be such that the bath temperature at no time exceeds 130 \nOF. Quenching delays and duration of quenchant contact shall be as specified in 3.7.4 and 3.7.5, \nrespectively. Quenched product shall, after age-hardening to tempers specified in \nthe acquisition \ndocuments, satisfy the applicable property requirements and, when tested, pass the corrosion",
    "documents, satisfy the applicable property requirements and, when tested, pass the corrosion \ntest in 4.5.3. Test programs to determine compliance with these requirements shall conform to \nTable VIII, as applicable. \n3.7.1.2",
    "Quenching in Liquified Gas, Airblast, and Water Spray: Quenching by total immersion in liquified gas or by contact with high-pressure, high-volume jets of water, or air within a suitable chamber is permissible provided that quenched product is capable of passing the corrosion test in 4.5.3, and of being age-hardened to mechanical properties and other characteristics conforming to applicable specified requirements. Quenching delays and duration of quenchant contact shall be as specified in 3.7.4",
    "requirements. Quenching delays and duration of quenchant contact shall be as specified in 3.7.4 and 3.7.5, respectively. Test programs to determine compliance with these requirements shall conform to Table VIII, as applicable.",
    "3.7.2 \nQuenching Forgings: Except \nas specified \nin \n3.7.2.1,3.7.2.2, or 3.7.2.3, forgings may be cold water, \nhot water, or aqueous polymer quenched provided \nthat resultant \nproduct is capable of passing the \napplicable \ntests and satisfying \nall applicable specified requirements after age-hardening \nto tempers \nspecified in the acquisition documents. Test programs to determine compliance \nwith these \nrequirements shall conform to Table VIII, as applicable. \n3.7.2.1",
    "with these \nrequirements shall conform to Table VIII, as applicable. \n3.7.2.1 \nQuenching 2014 and 2024 Forgings: Unless otherwise specified in a drawing or procurement \ndocument, forgings of 2014 and 2024 shall be quenched by total immersion in water heated to \n140 \nto 180 \nO F .  \n3.7.2.2 \nQuenching 2XXX and 7XXX Forgings Other Than 2014 and 2024: Forgings of these alloys shall be quenched by total immersion in water heated to 140 \nto 160 O\nF\n unless quenchants other than",
    "to 160 O\nF\n unless quenchants other than \nhot water are necessary \nto achieve required properties or to minimize residual tensile stresses \nand/or distortion (See 6.8). \n3.7.2.3 \n-T41 and -T61 Tempers: Unless otherwise specified in a drawing or procurement \ndocument, \nforgings and impact extrusions for heat treatment to the -T41 and -T61 tempers shall be \nquenched by total immersion in boiling \nwater. \n3.7.3",
    "quenched by total immersion in boiling \nwater. \n3.7.3 \nQuenching Castings: Castings may be oil, water (See 3.7.3.2), or aqueous polymer quenched \nprovided \nthat the resultant product is capable of passing \nthe applicable tests and satisfying all \napplicable specified requirements after age-hardening to tempers specified in the acquisition \ndocuments. Air quenching is satisfactory for continuously quenching thin sections if all specified \nproperty requirements",
    "property requirements \nare met. Test programs to determine compliance with these requirements \nshall conform to Table VIII, as applicable. \n3.7.3.1 \nQuenching Castings of Alloys 520.0 and 242.0: Unless otherwise specified in a drawing or \nprocurement document, castings of Alloy 520.0 (formerly designated 220) shall be quenched by \ntotal immersion \nin oil heated to 300 O F  \nand castings of Alloy 242.0 (formerly \ndesignated 142) shall \nbe air-quenched.",
    "and castings of Alloy 242.0 (formerly \ndesignated 142) shall \nbe air-quenched. \n3.7.3.2 Water Quenched Castings: Such castings shall be quenched by total immersion in a water bath \nheated from 150 to 212 O\nF\n unless other quenching temperatures are approved by the procuring \nactivity. \n3.7.4 \nQuench Delay: Maximum allowable delays before immersion quenching product shall comply with \nTable VI, as applicable to section thickness. Allowable delays before quenching using an",
    "Table VI, as applicable to section thickness. Allowable delays before quenching using an \nalternative to immersion, shall be determined by corrosion tests (See 4.5.3) and/or mechanical \nproperty tests on product age-hardened \nto tempers within the scope of the applicable material \nspecification and specified in the acquisition \ndocuments.",
    "3.7.5 Duration of Contact Between Quenchant and Workpiece: Workpieces quenched by immersion \nshall remain in the quenchant \nfor not less \nthan 2 minutes per inch of thickness, or fraction thereof in \nthe thickest section. Alternatively, workpieces shall be kept immersed in \nthe quenchant for not less \nthan 2 minutes after boiling ceases. Workpieces quenched by spray shall remain in contact with \nthe spray until steam no longer rises from the workpiece surface. Workpieces quenched in an air",
    "the spray until steam no longer rises from the workpiece surface. Workpieces quenched in an air \nblast shall remain in contact with that quenchant until surface temperatures of the workpiece are \nreduced to **212** O\nF\n.\n \n3.8 Racking and Spacing: \nI",
    "reduced to **212** O\nF\n.\n \n3.8 Racking and Spacing: \nI \nProduct shall be racked or supported and spaced to permit free access of the heating and/or quenching medium to all surfaces of the product in all portions of the load. Adequacy of heating and quenching procedures shall be documented by accumulation of adequate data to demonstrate conformance to applicable material specifications. When immersion quenching, see **4.4.2.1** and \n4.4.2.3.",
    "3.8.1 Racking and Spacing of Forgings and Castings: Forgings and castings, except as specified in \n3.8.1.2, shall be separated from each other by a distance greater than the thickest section, or as \nprovided by special racking procedures which demonstrate that the specific product receives an \nadequate heating or quench. \n3.8.1.1 Fixtures: Fixtures shall be designed so as to have a minimum effect on the heating rate and the",
    "quench rate. Orientation shall be such as to avoid entrapment of steam, allow free circulation \nof \nquenchant, and to preclude steam from harmfully degrading the quench. The size of the load \nshall be limited \nso as to produce no more than a 20°F \nrise in water temperature, or a **25°F** rise in \naqueous polymer temperature as a result of quenching. Exceptions to the temperature rise are \nacceptable, if the product has been demonstrated by testing and documentation to meet the",
    "acceptable, if the product has been demonstrated by testing and documentation to meet the \nrequirements of the applicable material specification. \n                                                                                          \n3.8.1.2 Random Racking: Random racking or layering of forgings or castings, 1 \n.O inch or **less** in \nthickness, is permitted to a maximum thickness of **3.0** inches, with a minimum spacing of",
    "thickness, is permitted to a maximum thickness of **3.0** inches, with a minimum spacing of \n3.0 inches between layers, provided that quenching is performed by immersion. Exceptions to \nthis method are acceptable, if the product meets the requirements of the applicable \nmaterial \nspecification. Records shall be kept of the test results of the product so racked. \n3.9 Recommended \nAge-Hardening Heat Treatments:",
    "3.9 Recommended \nAge-Hardening Heat Treatments: \nThe recommended time-temperature cycles shown in Table **VI1** are typical for various forms, sizes, and methods of manufacture, and may not exactly describe the optimum treatments for specific products.",
    "## 4. Quality Assurance Provisions: 4.1 Responsibility For Inspection:",
    "Unless otherwise specified in the contract or purchase order, the contractor is responsible for the performance of all inspection requirements (examinations and tests) as specified herein. Except as otherwise specified in the contract or purchase order, the contractor may use his own or any other facilities suitable for the performance of the inspection requirements specified herein, unless disapproved by the procuring activity. The procuring activity reserves the right to perform any of the",
    "by the procuring activity. The procuring activity reserves the right to perform any of the inspections set forth in this specification where such inspections are deemed necessary to ensure that supplies and services conform to prescribed requirements.",
    "4.1.1 Responsibility \nfor Compliance: **All** items shall meet all requirements of section 3. The inspection \nset forth in this specification shall become a part of the contractor's overall inspection system or \nquality program. The absence of any inspection requirements in the specification shall not relieve \nthe contractor of the responsibility of ensuring that all products or supplies submitted to the \nprocuring \nactivity",
    "procuring \nactivity \nfor acceptance comply with all requirements of the contract. Sampling \ninspection, as part of manufacturing \noperations, is an acceptable practice to ascertain \nconformance to requirements, however, this does not authorize submission of known defective \nmaterial, either indicated or actual, nor does it commit the procuring activity to accept defective \nmaterial. \n4.1.2 Retention of Inspection Records: Inspection \nrecords, unless \notherwise specified herein, shall be on",
    "records, unless \notherwise specified herein, shall be on \nfile and available for review for four years after the date of inspection. \n4.1.2.1 \nProcess Establishment \nand Process Re-Establishment \nRecords: Current records of process \nestablishment and process re-establishment \nshall be kept on file until superseded, and then kept \non \nfile for an additional five years. \n4.1.2.2 \nTest Results: Results of all tests required by this specification \nshall be retained for five years",
    "shall be retained for five years \nafter the date of testing. \n4.1.2.3 \nFurnace and Quench Process Records: Production processing records required by this \nspecification \nshall be kept on file and available for review for five years after the inspection date \nof the product. \n4.1.2.4 \nFurnace and Quench Facility Records: Records shall be maintained \nfor each furnace and \nquench facility to show compliance with this specification. These records shall include the",
    "quench facility to show compliance with this specification. These records shall include the \nfollowing: furnace number or description, volume of working zone (See 6\n.\n5\n.\n3\n)\n,\n \ntemperature \nrange of usage, whether used for solution heat treatment, age-hardening \nheat treatment, or both; \nand dates and types of major repairs or alterations. These records shall be on file and available \nfor review until process re-establishment occurs and then be retained for five years.",
    "for review until process re-establishment occurs and then be retained for five years.",
    "4.1.3 \nHeat-Treat Deviations: Any change in heat-treating procedures or equipment that results in \nproduct not conforming to this specification shall constitute a deviation. Unless such deviation \nis \napproved in writing by the procuring activity, delivery of the product shall be withheld until the \ndeviation(s) is(are) corrected and satisfactory performance is re-established (See 3.1.2). \n4.2 \nTemperature Surveys of Heating Equipment:",
    "4.2 \nTemperature Surveys of Heating Equipment: \nProcess establishment and re-establishment surveys, as well as periodic process surveys, shall be performed in accordance with 3.1, 3.2, and AMS 2750, as applicable.",
    "4.3 \nSpray-Quench Equipment: \n4.3.1 \nProcess Establishment and Re-Establishment for Spray Quenching: Values of all parameters \ngoverning effective quenching for each spray quenching unit shall be obtained (See 3.5.3.2). \nProcess establishment and re-establishment \nprocedures to obtain these values shall consist o\nf\n \nquenching product representative of all product to be quenched by the unit of concern and, after",
    "quenching product representative of all product to be quenched by the unit of concern and, after \napplicable age-hardening, evaluating mechanical properties in accordance with 4.5.1. \nRe-establishment of the process shall be performed whenever conditions change as set forth in \n3.1 2. \nProcess establishment and re-establishment data shall be available for verification, review, \nand concurrence by an authorized representative of the procuring activity. \n4.3.1.1",
    "and concurrence by an authorized representative of the procuring activity. \n4.3.1.1 \nProcedure for Plate: The quenching procedure shall be a single run each of one **2XXX** series \nalloy and one **7XXX** (preferably 7075) series alloy in the W temper in the minimum \nthickness and \nthe maximum thickness of the plate processed through the spray-quench line. The alloys shall \nbe sufficiently \nquench-sensitive to provide a good evaluation. The test plate shall be of a size",
    "be sufficiently \nquench-sensitive to provide a good evaluation. The test plate shall be of a size \nwhich fully evaluates the effective area of furnace and quench chambers. Temperatures and \npressures within the quenchant line during test quenching shall be recorded and the records \nretained (See 4.1 2.3). \n4.3.1.1.1 \nProcedure to Evaluate Quench Effectiveness: Such effectiveness shall be determined by \nevaluating the tensile properties of spray-quenched and age-hardened test pieces \nexcised",
    "evaluating the tensile properties of spray-quenched and age-hardened test pieces \nexcised \nfrom test plates in accordance with ASTM B 557. \n                                                                                          \n4.3.1.1.1.1 \nTest Specimens: The numbers and locations of specimen blanks to be excised \nshall conform \nto Figures 1 and 2, as applicable to test plate \nthickness. \n4.3.1.1 .1.2 Temper of Test Pieces: Specimen blanks excised \nin accordance with Figure 1 \nshall be so",
    "in accordance with Figure 1 \nshall be so \nexcised \nfrom each solution heat-treated and spray-quenched test plate. These specimens \nshall be age-hardened along with the remainder of the test plate or in a laboratory furnace, to \none temper representative of mill product. Following age-hardening, one specimen blank \nshall be excised from the test plate in accordance with Figure 2.",
    "4.3.1 .I \n.I .\n3\n Test Method: Specimens shall be machined from the age-hardened blanks, and tensiontested in accordance with ASTM B 557. Dimensions \nof machined specimens shall comply \nwith those specified therein as standards for sheet-type, rectangular specimens, as blank \ndimensions allow. Deviations from standard configurations and dimensions may be made if \nsuch deviations are allowed in the acquisition \ndocuments. \n4.3.1.1.1.4 \nPass-Fail Criteria:",
    "such deviations are allowed in the acquisition \ndocuments. \n4.3.1.1.1.4 \nPass-Fail Criteria: \na. Tensile properties of specimens made from plate o\nf\n 1 \n.O-inch or lesser thickness shall \ncomply with requirements specified for plate of the same temper and thickness in the \napplicable material \nspecification. \nb. Yield and ultimate tensile strengths of specimens made from plate of thicknesses \nexceeding 1 \n.O inch shall meet the yield and tensile strengths specified for plate of the",
    "exceeding 1 \n.O inch shall meet the yield and tensile strengths specified for plate of the \nsame temper and thickness in the applicable material specification. Such plate shall \nhave no requirements of minimum elongation.",
    "4.3.1.2 \nProcedure for Extrusions: The quenching procedure shall be a single run each of one 2XXX \nseries alloy and one 7XXX series alloy in the W temper in the minimum cross-section and the \nmaximum cross-section \nof extrusions processed through the spray-quench line. The alloys shall \nbe sufficiently quench-sensitive to provide a good evaluation. The test materials may be \nextrusions of any width with a sufficient number of test pieces quenched at one time to evaluate",
    "extrusions of any width with a sufficient number of test pieces quenched at one time to evaluate \nadequately the effective area of furnace and quench chambers. Temperatures and pressures \nwithin the quenchant line shall be recorded and records retained (See 4.1.2.3). \n4.3.1.2.1 \nProcedure to Evaluate Quench Effectiveness: Such effectiveness shall be determined by \nevaluating \nthe tensile properties of spray-quenched and age-hardened test pieces excised",
    "evaluating \nthe tensile properties of spray-quenched and age-hardened test pieces excised \nfrom test extrusions in accordance with ASTM B 557. \n                                                                                          \n4.3.1.2.1 .I Test Specimens: Specimen blanks whose longitudinal axis parallels the direction of ram",
    "travel during the extrusion operation shall be excised at 6-inch intervals across the workingquench width at each end of the spray-quenched load. For determination of the capability of \nthe quenching procedure to satisfactorily \nthrough-quench a section of maximum thickness, \nspecimen blanks shall be excised from several locations in the width or thickness direction, \none of them being \nthe **t/2** location, \nas applicable to cross-sectional \nconfiguration and",
    "one of them being \nthe **t/2** location, \nas applicable to cross-sectional \nconfiguration and \ndimensions. The specimen blanks shall be of the sheet type and be capable of being \nmachined into tension-test specimens conforming to ASTM B 557, as applicable to \nconfiguration and dimensions. The blanks shall be excised to a depth of no more than \n0.025 inch above the bottom (during quench) surface of any test extrusion. Deviations from",
    "0.025 inch above the bottom (during quench) surface of any test extrusion. Deviations from \nstandard configurations and dimensions may be made if such deviations are allowed in the \nacquisition documents.",
    "4.3.1.2.1.2 \nTemper of Test Pieces: Specimen blanks excised in accordance with 4.3.1.2.1.1 shall be \nage-hardened together with a full simulated production load to one temper representative of \nplant product. \n4.3.1.2.1.3 \nTest Method: Tension-test specimens shall be machined from the age-hardened blanks and \nbe tension-tested in accordance with ASTM B 557. \n4.3.1.2.1.4 \nPass-Fail Criteria: Specimens shall demonstrate tensile properties complying with",
    "4.3.1.2.1.4 \nPass-Fail Criteria: Specimens shall demonstrate tensile properties complying with \nrequirements specified for extrusions of the same temper and cross-sectional dimensions in \nthe applicable material specification. \n4.4 \nPeriodic Product Monitoring: \n4.4.1 \nMonitoring Spray Quenching of Plate and Extrusions: Except as otherwise specified or allowed \nherein (See 4.4.1.4), such monitoring \nshall comprise eddy current tests in accordance with 4.5.5 of",
    "shall comprise eddy current tests in accordance with 4.5.5 of \nthe conductivity of quenched 7075 alloy plate of a minimum 0.250-inch thickness, or extrusions of \n0.250-inch minimum thickness which do not have a thickness between cross-sectional elements \ngreater than 0.250 inch. \n4.4.1.1 \nQuenching Conditions: The line temperature and pressure of the quenchant throughout a test \nquench shall be maintained within limits determined during process establishment. \n4.4.1.2",
    "quench shall be maintained within limits determined during process establishment. \n4.4.1.2 \nQuenching Records: When product of 0.250 inch or thicker is processed, temperature and \npressure within the quenchant line shall be recorded for each quench load. Such records shall \nbe maintained in accordance with 4.1.2.3. \n4.4.1.3 \nFrequency of Product Monitoring: When product of 0.250 inch or thicker is being quenched by a",
    "Frequency of Product Monitoring: When product of 0.250 inch or thicker is being quenched by a \nsystem conforming to 3.5.3.2, conductivity of the product shall be measured once during each \ncalendar week. In \naddition, at least once in \nevery three-month interval, conductivity on product of \nthe maximum thickness that the heat-treat line can successfully process, or on product \nof the \nmaximum thickness processed in that interval, shall be measured in accordance with 4.5.5. \n4.4.1.4",
    "maximum thickness processed in that interval, shall be measured in accordance with 4.5.5. \n4.4.1.4 \nProduct for Testing: Product of 7075 alloy in \nthe dimensions herein specified shall be the product \ntested, unless the producing facility does not fabricate such product or if 7075 is not available at \nthe time of the survey. In such absence, product of other alloy in the dimensions specified \nherein",
    "herein \nmay be tested, provided that the alloy is sufficiently quench-sensitive for evaluation of system \nperformance, and that a definitive conductivity range has been established for such product in a \ntemper specified.",
    "4.4.1.5 \nMeasuring Electrical Conductivity: Test procedures to determine electrical conductivity shall \nconform to 4.5.5. Conductivity measurements shall be made on product in the W temper after 1 \nO \nhours or more have elapsed since quenching, or after electrical conductivity has stabilized, but \nprior to artificial aging. Conductivity of plate shall be measured at four-inch maximum intervals \nacross the width of the plate and at 24-inch maximum intervals along the length of the plate.",
    "across the width of the plate and at 24-inch maximum intervals along the length of the plate. \nReadings shall be taken on both sides (faces) of the plate. Conductivity of test extrusions shall \nbe measured at two-inch maximum intervals around the section perimeter of test extrusions and \nat 24-inch intervals along an extrusionk length. For extruded shapes (T-, L-sections, etc), \nconductivity measurements on that portion of a surface directly opposite the junction of two or",
    "conductivity measurements on that portion of a surface directly opposite the junction of two or \nmore sectional elements shall be excluded. Records shall be maintained in accordance with \n4.1.2. \n4.4.1.6 \nCriteria for Quench-System Acceptance - 7075 Plate: When testing 7075 plate, the quenching \nsystem shall be suspect if the conductivity readings on one side of the plate exhibit a range \ngreater than 2.5 percent International Annealed Copper Standard (IACS), or exceed a maximum \nvalue o\nf\n 31",
    "value o\nf\n 31 \n.O percent IACS. \n4.4.1.7 \nCriteria for Quench-System Acceptance - Plate Other Than 7075: When plate of an alloy other \nthan 7075 is tested, the quenching system shall be suspect if the conductivity readings on one \nside of the plate exhibit a range greater than 2.5 percent IACS, or exceed a maximum established as satisfactory for that alloy, thickness, and temper. \n4.4.1.8 \nCriteria for Quench-System Acceptance - 7075 Extrusions: When testing 7075 extrusions, the",
    "Criteria for Quench-System Acceptance - 7075 Extrusions: When testing 7075 extrusions, the \nquenching system shall be suspect if the conductivity readings around the section perimeter and \nat 24-inch intervals along the length exhibit a range greater than 4.0 percent IACS, or if the \nvalues from each element (flange, web, etc) of a shape exhibit a range greater than 3.0 percent \nIACS, or exceed a maximum of 32.0 percent IACS. \n4.4.1.9",
    "IACS, or exceed a maximum of 32.0 percent IACS. \n4.4.1.9 \nCriteria for Quench-System Acceptance - Extrusions Other Than 7075: When extrusions of an \nalloy other than 7075 are tested, the quenching system shall be suspect if the conductivity \nreadings around the section perimeter and at 24-inch intervals along the length exhibit a range \ngreater than 4.0 percent IACS, or if \nthe values from each element (flange, web, etc) of a shape",
    "greater than 4.0 percent IACS, or if \nthe values from each element (flange, web, etc) of a shape \nexhibit a range greater than 3.0 percent IACS, or exceed a maximum established as satisfactory \nfor that alloy, temper, and cross-sectional configuration and dimensions. \n4.4.1.10 \nTest Procedures When Quenching System is Suspect: When a quenching system is suspect, \nadditional inspections shall be made of the equipment and test material \nto determine the cause",
    "additional inspections shall be made of the equipment and test material \nto determine the cause \nor causes of aberration. The cause@) \nshall be corrected and the equipment, procedures and \nproduct shall be handled in accordance with 4.6.4 and 4.6.4.1.",
    "4.4.2 \nMonitoring Immersion Quenching of Product: A plan for such monitoring shall be implemented for \neach forging and casting and for sheet and plate in each applicable thickness range shown in \nTable VI, and for each configuration of other wrought products. As a minimum, the plan shall \ninclude the following. \n4.4.2.1 \nRacking or Spacing Documentation: Documentation, such as drawings or other suitable media",
    "4.4.2.1 \nRacking or Spacing Documentation: Documentation, such as drawings or other suitable media \nshall be maintained to ensure proper racking. A record shall be maintained to show that each \nracking plan has produced material satisfying requirements of the applicable material \nspecification. When specified in a contract or purchase order, a racking plan shall be examined \nfor approval by the procuring activity. Records shall be maintained in accordance with 4.1.2. \n4.4.2.2",
    "4.4.2.2 \nPeriodic Inspection: The plan shall include periodic inspection of mill products by electrical conductivity and hardness testing and routine inspection o f castings by mechanical property testing to ensure that the quench continues to be adequate. Inspection frequency shall be agreed upon by procuring activity. Frequency and results of inspection shall be recorded and the records retained in accordance with 4.1.2.",
    "4.4.2.3 \nInspection for Racking Adequacy: Unless otherwise specified, adequacy of the racking method \nshall be established by electrical conductivity measurements on a suitable quantity of mill products (See 4.5.5 for test method). \n4.4.2.3.1 \nTesting of Forgings: Electrical \nconductivity of forgings shall be made on a two-inch grid, unless \nprevented by testpiece configuration. When so prevented, measurements shall be taken in a",
    "prevented by testpiece configuration. When so prevented, measurements shall be taken in a \nsufficient number of locations to reveal the adequacy of the quench. Alternatively, one test \npiece from each inspection lot may be age-hardened to its specified temper and sectioned into \ntest blanks for testing of mechanical properties in accordance with 4.5.1. \n4.4.2.3.2 \nTesting of Extrusions: Electrical \nconductivity measurements on extrusions shall be made at \ntwo-inch maximum intervals",
    "conductivity measurements on extrusions shall be made at \ntwo-inch maximum intervals \naround the perimeter of the cross-section of the extrusion and at \n24-inch maximum intervals along the length of the extrusion, unless prohibited by the size and \nconfiguration of the extrusion. It shall not be necessary to check opposite sides of any solid \nsections of the extrusion which are less than 3/8-inch thick, or that portion \nof a surface directly",
    "of a surface directly \nopposite the juncture of two or more elements. Exceptions to requirements herein \nshall be \nsubject to approval of the cognizant engineering activity. \n4.4.2.3.3 \nTesting of Plate: Electrical conductivity test measurements on plate shall be on a grid four \ninches (along width) by 24 inches (along length) on at least one piece \nfrom the center of the \nload or rack and two other pieces selected at random from the load or pack.",
    "load or rack and two other pieces selected at random from the load or pack.",
    "## Sae",
    "4.4.2.3.4 \nRandom-Racked \nor Layered Forgings and Castings: Immersion \nquenching of random-racked \nor layered \nforgings and castings shall be monitored \non each heat-treat load by electrical \nconductivity \nor hardness measurements made on a two-inch grid spacing on at least one piece \nfrom the center of the load, and on at least two other pieces selected at random from the load. \nWhen material configuration prevents a two-inch grid spacing, then a suitable number of",
    "When material configuration prevents a two-inch grid spacing, then a suitable number of \nmeasurements shall be made to determine adequacy of the quench. \n4.4.3 \nTests for Process Control: \n4.4.3.1 \nMaterial \nand Process Tests: Such tests shall be performed \nin order to demonstrate the capability \nof the facility to produce product meeting requirements of the applicable product specifications \nand other acquisition documents. Tests and testing procedures shall conform to Table VIII and",
    "and other acquisition documents. Tests and testing procedures shall conform to Table VIII and \n4.4.3.2, \nas applicable. \n4.4.3.2 Monthly Test on Furnace Load: Tests of furnace load performance shall be made once each \nmonth. If more frequent testing is necessary or advisable, a test plan incorporating \nan increased \nfrequency shall be adopted. Such plan shall be subject to review and approval by the procuring",
    "frequency shall be adopted. Such plan shall be subject to review and approval by the procuring \nactivity. If the monthly workload included plate and/or sheet as well as other metal forms, the \nload to be tested as in Table VIII shall be a \"plate and sheet\" load. If this product form was not \nheat treated during the month, the test load shall be selected from the available product forms, \nusing that form for which Table **VIII** requires the maximum number of test categories.",
    "## 4.5 Test Methods:",
    "4.5.1 \nMechanical Properties: Specimens shall conform to an appropriate \ntype of tensile specimen in \naccordance with ASTM B 557 \nand shall be tested in accordance with an appropriate method \nspecified therein and shall meet the requirements of 4.6.1, \n4.5.1 .1 \nMechanical Properties o\nf\n Wrought Products: Unless every heat-treated \nlot is tested (see \napplicable material specification \nfor sampling plan), a minimum of nine tension tests, sampled to",
    "applicable material specification \nfor sampling plan), a minimum of nine tension tests, sampled to \nrepresent the quantity of the mill product, shall be made on the mill product which was heat \ntreated with the monthly production \ntest load from each heat-treat furnace or bath being \noperated. The procuring activity may waive this requirement if \nother approved testing \nprocedures are used. The tension specimens shall include specimens taken from the portion of \nthe load receiving",
    "the load receiving \nthe slowest quench, those portions subjected to the highest and lowest \nsolution heat-treating \ntemperatures, and, when nonuniform shapes have been heat treated, from \nthe thickest and thinnest sections of the cross-sectional configuration. The tension specimen \nhaving the lowest yield strength shall be used for the corrosion test specified in 4\n.\n5\n.\n3\n.",
    "4.5.1.1.1 \nMechanical Property Tests of Mill Products Where Specimen Taking is Impractical: When \ntaking specimens from a heat-treated mill product is impractical, tension specimens shall be \ntaken from samples heat treated with a production load. The thickness and alloy of the \nsamples and their location in the load shall be selected to represent items heat treated \nduring \nthe previous month which were considered to have experienced the lowest quench rate and",
    "during \nthe previous month which were considered to have experienced the lowest quench rate and \nthose which were subjected to the highest and lowest solution heat-treating temperatures. \n4.5.1.1.2 \nTesting of Heat-Treat Loads When Changes are Made in the Heat-Treat Facility: When \nchanges are made in the heat-treat facility as outlined in 3.1.2, the mechanical property \nsampling and testing as specified in 4.5.1.1 and 4.5.1.1.1 shall be followed. \n4.5.1.2",
    "sampling and testing as specified in 4.5.1.1 and 4.5.1.1.1 shall be followed. \n4.5.1.2 \nMechanical Properties of Casting **Alloys:** The required tests for casting alloys shall be in \nconformance with the applicable casting product specifications.",
    "## 4.5.2",
    "Melting and Porosity Resulting from Solution Heat Treatment: One or more of the heat-treated specimens tested in accordance with 4.5.1.1 shall be examined for evidence of melting and porosity and shall conform to the requirements of **4.6.2.** Each specimen shall be prepared for examination by sectioning, and then polishing one surface generated by the sectioning to appropriate fineness. Each polished surface shall be examined under a metallurgical microscope at 500 diameters magnification to",
    "surface shall be examined under a metallurgical microscope at 500 diameters magnification to detect porosity resulting from solution heat treatment. Following this examination, the polished surfaces shall be etched for approximately two seconds in Keller's reagent or other suitable etching solution and examined for evidence of melting during solution heat treatment.",
    "4.5.3 \nIntergranular Corrosion Test: Corrosion tests shall be conducted in accordance with the procedure \noutlined below and samples shall conform to the requirements of 4.6.3. In the case of alclad \nalloys, the alclad shall be removed from both sides of the sample by filling or by other suitable \nmeans. Prior to the corrosion test, each sample shall be immersed for 1 minute in an etching \nsolution at 200 O\nF\n to produce a uniform surface condition. The solution shall have the following",
    "solution at 200 O\nF\n to produce a uniform surface condition. The solution shall have the following \ncomposition:",
    "50 milliliters \n5 milliliters \n945 milliliters \nNitric acid, concentrated (70 percent) \nHydrofluoric acid **(48** percent) \nDistilled or deionized \nwater",
    "After this etching treatment, the sample shall be rinsed in distilled or deionized water, immersed for one minute in concentrated nitric acid (70 percent) at room temperature to remove any metallic copper that may have been plated out on the specimen, and rinsed in distilled or deionized water, then allowed to dry. The sample shall be corroded by immersion in a minimum o f",
    "30 milliliters per square inch of surface area in a solution of the following composition, which shall be prepared immediately before use (the temperature during the immersion period shall be 86°F i \n9):",
    "## Ams-H-6088 Sae 4.5.3 (Continued):\n\nSodium chloride \nHydrogen peroxide (30 percent) \nDistilled or deionized water \n57 grams \n10 milliliters Dilute to 1 liter \n\nThe immersion period shall be 6 I \nAll chemical$ shall be reagent grade.",
    "4.5.3.1 \nNumber of Specimens in Container: More than one specimen of the same alloy and temper may \nbe etched in a container, provided that at least 30 milliliters of solution are used for each square \ninch of specimen surface, and the specimens are electrically insulated \nfrom each other. \n4.5.3.2 \nMicroscopic Examination: At the end of the immersion period, the sample shall be removed from \nthe solution, washed, and dried. A cross-section specimen, which shall be at least 314 inch long",
    "the solution, washed, and dried. A cross-section specimen, which shall be at least 314 inch long \nwhenever the size of the sample permits, shall be cut from the sample and mounted for \nmicroscopic examination. Microscopic examination shall be made on the specimen, both before \nand after etching, at 100 to 500 diameters magnification \nwith a metallurgical microscope. The \netching shall be done by immersion for 6 to 20 seconds in a solution of the following composition:",
    "Nitric acid, concentrated (70 percent) \n2.5 milliliters \nHydrochloric \nacid, concentrated \n1.5 milliliters \nHydrofluoric \nacid (48 percent) \n1 \n.O milliliter \nDistilled or deionized \nwater \n95.0 milliliters \n\nAll chemicals shall be reagent grade.",
    "4.5.4 \nTest for Diffusion in Alclad Alloys: A microscopic \nexamination \nof sections of specimens cut from \nmill products representative \nof a lot or furnace load shall be made to determine the extent of \ndiffusion of the alloying constituents \nthrough the cladding. Examination shall be made with a \nmetallurgical microscope at 1 \nO0 \nto 1,000 diameters magnification, after etching as specified in \n4.5.3.2 and specimens shall conform to the requirements \nof 4.6.3. The solution potential",
    "4.5.3.2 and specimens shall conform to the requirements \nof 4.6.3. The solution potential \nmeasurement method for evaluation of alclad diffusion \nis acceptable providing documentation \nwhich correlates this method to the optical method is available for review. \n4.5.5 \nEddy-Current Measurements of Electrical \nConductivity: \n4.5.5.1 \nProcedure Requirements: Electrical \nconductivity inspection \nshall be performed, as specified",
    "Procedure Requirements: Electrical \nconductivity inspection \nshall be performed, as specified \nherein, in accordance with MIL-STD-1537. The procedure shall be available to the procuring \nactivity. \n4.5.5.2 \nEquipment Calibration: \nThe equipment to measure electrical \nconductivity shall be calibrated in \naccordance with MIL-STD-1537 except that the number of standards necessary shall be as \nrecommended by the device's manufacturer.",
    "4.5.5.3 \nPersonnel Qualification: Personnel conducting eddy current inspections shall be trained and \nqualified \nas specified in MIL-STD-1537. \n4.5.6 \nHardness Measurements: When required, hardness of product shall be tested in accordance with \nASTM E 1 \nO or ASTM E **18,** as applicable to the product to be tested. The use of ASTM E l  \n03 for \n\"pass-fail\" inspections during manufacture is neither mandated nor forbidden. When a question",
    "\"pass-fail\" inspections during manufacture is neither mandated nor forbidden. When a question \narises about hardness data gathered using the method of ASTM E 103, additional hardness data \nshall be taken using \nthe methods of ASTM E 10 or E 18, as applicable to the product. \n4.6 \nLimits of Acceptability: \n4.6.1 Mechanical Properties: The heat-treated (or re-solution heat-treated) test samples shall exhibit",
    "tensile strength, yield strength, and elongation not less than those specified in applicable product \nspecifications or detail drawings. \n4.6.2 \nMelting and Porosity Resulting From Solution Heat Treatment: Specimens, prepared in \naccordance with 4.5.2, shall show no evidence of melting resulting from solution heat treatment \nand the specimens shall be substantially free from porosity caused by hydrogen diffusion during \nsolution heat treatment. \n4.6.3",
    "solution heat treatment. \n4.6.3 \nIntergranular Corrosion and Alclad Diffusion: The degree of susceptibility \nto intergranular corrosion \nand degree of alclad diffusion shall be no greater than that normally experienced when following \nthe practices recommended in this specification. Practices other than those recommended herein \nmay be employed (See 4.6.3.1), provided it is documented that the resulting degrees of \nintergranular corrosion and alclad diffusion",
    "intergranular corrosion and alclad diffusion \nare no greater than those resulting from applications of \nthe recommended practices, as applicable to product. This objective evidence shall be retained in \naccordance with 4.1.2.2. \n                                                                                          \n4.6.3.1 Tests for Alclad Diffusion and Susceptibility to Intergranular Corrosion: Prior to using equipment",
    "or procedures which vary from those recommended herein, tests shall be made to determine the alclad diffusion and susceptibility \nto intergranular corrosion produced by the proposed variation. \nDecision \nas to whether the alclad diffusion and the susceptibility to intergranular corrosion is \nexcessive shall be based upon comparison with samples of the same thickness from the same \npiece of raw stock, heat treated in accordance with the equipment and procedures",
    "piece of raw stock, heat treated in accordance with the equipment and procedures \nrecommended and specified herein. \n4.6.4 \nFailures: The occurrence of failure(s) during any of the tests specified herein shall give rise to an \nevaluation of the adequacy of heat treatment(s). If \nthe test failure is attributed to improper heat \ntreatment, the equipment and procedures shall not be used until \nthe deviation(s) is (are) corrected",
    "the deviation(s) is (are) corrected \nand the applicable part(s) of the equipment and procedures are re-established i\nn\n accordance with \n3.1.2, as specified in 4.2 or 4.3.1. Re-establishment may be waived by the procuring \nactivity if \ncorrective action, to bring the equipment and procedures back into conformance with the \nrequirements herein, is implemented and verified by documentation.",
    "4.6.4.1 \nStatus of Product: Product heat treated in the interval between the occurrences of the last \nsatisfactory inspection results and the first unsatisfactory \ninspection results shall be deemed \nquestionable. Each unit of questionable product \nshall be inspected, unless the inspection \nmethod is a destructive test. Destructive testing shall entail a sampling plan agreed upon \nbetween the product vendor and the acquisitioner. Unsatisfactory \nproduct may be re-solution",
    "between the product vendor and the acquisitioner. Unsatisfactory \nproduct may be re-solution \nheat treated unless the product exhibits eutectic or other localized melting, excessive porosity \nresulting \nfrom solution heat treatment, or in the case of alclad product, shows a harmful \ndegree of \ndiffusion of alloying elements from the core through the cladding. Alclad product which is \nquestionable or fails for reasons other than those enumerated above may be re-solution \nheat",
    "questionable or fails for reasons other than those enumerated above may be re-solution \nheat \ntreated up to the limit of the permissible \nnumber of times specified in Table **111.** Inspection results \nshall be documented.",
    "## 4.7 Heat-Treat Lot Numbers For Forgings:",
    "Each heat-treat lot of forgings (See 6.5.2)",
    "shall be assigned a lot number. Each forging in the lot shall display its lot number, unless such display is infeasible or would result in nonconformance to the applicable product specification. If such display is not feasible, each lot shall be identified by tags or travellers. Lot numbers shall be entered in records kept by the furnace and quench facilities and in records of tests conducted by the quality control laboratory. The entire history of the heat treatment of each heat-treated",
    "by the quality control laboratory. The entire history of the heat treatment of each heat-treated forging shall be traceable through the records specified herein.",
    "## 5. Packaging:\n\n                                                                                          \nNot applicable. \n\n## 6. Notes: 6.1 Intended Use:",
    "This specification is intended for use in all phases of the control of processes and equipment applied to the heat treatment of aluminum alloy cast, forged, rolled, drawn, and extruded products. It covers products which are essentially raw materials for subsequent operations. It does not cover \"parts\" in the meaning of that term used in AMS 2770",
    "which is not intended to be applicable to primary mill products. Assigning a part number to a mill product does not change its status from that of a raw mill product to that of a part.",
    "## 6.2 Acquisition Requirements:\n\nAcquisition documents should specify the following: \nTitle, number, and revision letter of this specification. \n\nIssue o f DODISS \nto be cited in the solicitation, and if required, the specific issue of individual documents referenced (See 2.2). \n\nWhen verification of process establishment is required (See 3.1). \n\nConditions governing heat treatment of parts (See 3.4). \n\nExceptions to provisions of 4.1. \n\n## 6.3 General Information:",
    "6.3.1 \nAdvantages of Salt Baths: The time required to bring \nthe load to temperature is shorter and \nuniform temperature is more easily maintained in molten salt baths than in air chamber furnaces. \nWhen solution heat treating in molten salt, the danger of generating porosity is greatly diminished. \nAfter prolonged use, there is some decomposition of the sodium nitrate \nto form compounds which, \nwhen dissolved in the quenching water, attack the aluminum alloys. The addition to the salt bath o",
    "when dissolved in the quenching water, attack the aluminum alloys. The addition to the salt bath o\nf\n \nabout *112* ounce of sodium or potassium dichromate per 100 pounds of nitrate \ntends to inhibit this \nattack. Nitrate salt baths may present an explosion safety hazard when heat treating 5XX.X \ncasting alloys. \n6.3.2",
    "Advantages of Air Chamber Furnaces: Air chamber furnaces are more flexible and more economical for handling large volumes of work. When solution heat treating certain aluminum alloys it is necessary to control the atmosphere in order to avoid the generation of porosity. Such porosity lowers the mechanical properties of aluminum alloys and may be manifest as large numbers of minute blisters over the surface of the product. In severe cases, the product may even crack when it is quenched. Fumace",
    "the surface of the product. In severe cases, the product may even crack when it is quenched. Fumace products of combustion contain water vapor and may contain gaseous compounds o f sulfur, both of which tend to promote porosity during solution heat treatment. For this reason, furnaces which permit their products of combustion to come in contact with the load are not recommended for the solution heat treatment of alloys which may become porous during such treatment. Either anodic oxide films or",
    "treatment of alloys which may become porous during such treatment. Either anodic oxide films or the metal coating of the alclad materials protect the underlying alloy from this effect. Also, certain fluoroborates will protect against or minimize this effect.",
    "6.3.3 \nSolution Heat Treatment: Solution heat treatment is a process to heat an alloy to a suitable \ntemperature (See Table Il) \nfor sufficient \ntime to allow soluble constituents to enter into solid \nsolution where they are retained in a supersaturated state by rapid cooling in a suitable quenching \nmedium. \n6.3.3.1 \nSoaking Time: The soaking time required to bring \nabout the necessary degree o\nf\n solid solution",
    "Soaking Time: The soaking time required to bring \nabout the necessary degree o\nf\n solid solution \nincreases with increasing thickness of the metal. The minimum soaking period is determined by \ntesting samples of the metal \nto make certain \nthat the required mechanical properties have been \ndeveloped. The soaking periods recommended in Tables IV and V have been found to be \nsufficient in commercial practice.",
    "6.3.3.2 \nDevelopment of Hydrogen Porosity: When solution heat treating in air chamber furnaces, \nexcessive soaking periods increase the danger of the development of hydrogen porosity, a \nphenomenon formerly known as \"high temperature oxidation\". However, with proper control of \nfurnace atmospheres, soaking periods longer than those listed in Tables IV and V may be used \nsafely. \n6.3.3.3 \nDiffusion in Clad Products: The soaking period for clad products should be the minimum which is",
    "Diffusion in Clad Products: The soaking period for clad products should be the minimum which is \nnecessary to develop the required mechanical properties. Longer soaking may allow the alloying \nconstituents o\nf\n the base metal to diffuse through the alclad coating. When this occurs, corrosion \nresistance is adversely affected. Consequently, every effort should be made to avoid diffusion by \nusing the minimum possible soaking periods for clad products. \n6.3.3.4",
    "using the minimum possible soaking periods for clad products. \n6.3.3.4 \nIncorrect Solution Heat-Treating Temperature: If \nthe specified maximum temperature is \nexceeded, there is danger of localized melting, with possible lowering of the mechanical \nproperties of the alloy. Excessive overheating will cause severe blistering in the product. If the \ntemperature is below the minimum specified, solution is incomplete, the maximum mechanical",
    "temperature is below the minimum specified, solution is incomplete, the maximum mechanical \nproperties are not developed, and corrosion resistance can be adversely affected. \n6.3.3.5 \nEffect of Re-Solution Heat Treatment on Corrosion Resistance o f\n 201 \n7-T4 and 2024-13 \nand -T4: If the temperature used for re-solution heat treatment of 2017-T4 or 2024-T3 and -T4",
    "and -T4: If the temperature used for re-solution heat treatment of 2017-T4 or 2024-T3 and -T4 \nproduct is less than that applied in the initial heat treatment, a **loss** of corrosion resistance results. Since the use of a longer soaking period tends to overcome this **loss,** both a longer-thanaverage soaking period and a solution heat-treating temperature within 5 O F  \nof the applicable maximum tabulated are recommended for re-solution heat treatment of each of these alloys.",
    "6.3.3.6 \nThermal Treatment of Forgings to -01 Condition: This is a high temperature anneal given to a \nforging for a special purpose such as to accentuate ultrasonic response or provide dimensional \nstability. In \norder to be so annealed, product is held at approximately the same temperature for \napproximately the same time period as in solution heat treatment, but in this instance the product \nis slowly cooled to room temperature. This anneal is applied to products that are to be machined",
    "is slowly cooled to room temperature. This anneal is applied to products that are to be machined \nprior to solution heat treating and aging to the desired temper. This application is neither \nmandatory nor forbidden, provided that all other requirements specified herein, in the applicable \nproduct specification, and in other applicable acquisition documents are met. The Government \nreserves the right to require the use or nonuse of such treatments, if these conditions are not \nbeing met.",
    "being met. \n                                                                                          \n6.3.4 \nQuenching for Resistance to Corrosion: For products in some tempers of 21 \n17 and bare and \nalclad 2024 and 7075 alloys, a rapid quench is necessary so that the resulting product will have \nmaximum resistance to corrosion. As the quench rate is lowered, these alloys become \nincreasingly susceptible to intergranular attack which causes excessive **loss** of mechanical",
    "increasingly susceptible to intergranular attack which causes excessive **loss** of mechanical \nproperties after exposure to corrosives. \n6.3.5 \nAlloy and Temper Designation: The alloy and temper designations used herein conform to the \nAmerican National Standards Institute Publication, ANSI H35.1.",
    "6.3.6 \nAlclad Sheet: Alclad sheet is a product consisting of an aluminum alloy sheet having on one or \nboth surfaces a layer of aluminum or aluminum alloy integrally bonded to the surface of the base \nmetal. In general, alclad sheets have mechanical properties slightly lower than those of the bare \nalloy sheets of the same thickness. However, the corrosion resistant qualities of the aluminum alloy sheet are improved by the cladding. \n\n## 6.3.7 Annealing Treatments:",
    "6.3.7.1 \nAnnealing of Work-Hardened Wrought Alloys: Table XI lists recommended annealing conditions \nfor work-hardened wrought aluminum alloys. For desired results for a specific product, optimum \nannealing conditions should be determined. In \norder to avoid excessive oxidation and grain \ngrowth, the annealing temperature should not exceed 775 O\nF\n.\n \n6.3.7.2 \nRelief of Residual Stresses in Castings: The process of soaking castings for 2 hours at 650 to",
    "Relief of Residual Stresses in Castings: The process of soaking castings for 2 hours at 650 to \n750\" F and then cooling them to room temperature, will relieve residual stresses in castings and \nattain dimensional stability. \n6.3.7.3 \nPartial \nAnneal of Heat-Treated Aluminum Alloys: When 2XXX, GXXX, and 7XXX series \naluminum alloys in the heat-treated condition are heated at 650 O F  \nand cooled, they have been",
    "aluminum alloys in the heat-treated condition are heated at 650 O F  \nand cooled, they have been \npartially annealed and can be moderately (not severely) formed. Each particular application \nshould be optimized for retained strength and formability. When attempting to restore the \naluminum alloy to its initial heat-treated condition, a complete re-solution heat treatment will be \nnecessary. \n6.3.7.4 \nFull Anneal of Heat-Treatable Wrought Alloys: All 2XXX, GXXX, and 7XXX series aluminum",
    "6.3.7.4 \nFull Anneal of Heat-Treatable Wrought Alloys: All 2XXX, GXXX, and 7XXX series aluminum \nalloys when fully annealed according to recommended general conditions presented in Table XI \nobtain their lowest strength and best formability. However, they will require a complete heat \ntreatment (solution heat treatment, quench, and age) to develop their desired properties. \n6.3.8 \nAging: Aging causes precipitation of alloying elements from solid solution resulting in an increase",
    "in strength properties o\nf\n an alloy. This usually occurs slowly at room temperature (natural aging - \nSee Table il) \nand more rapidly at elevated temperature (artificial aging - See Table Vil). \nAge-hardening is followed by normal cooling in a room temperature atmosphere. (The term \n\"precipitation\" \nis frequently used in lieu of \"age-hardening\".) Age-hardening heat treatments \nneeding relatively long times and relatively low temperatures to develop required properties are",
    "needing relatively long times and relatively low temperatures to develop required properties are \nrecommended for products with large cross sections or large masses to promote uniformity of \nproperties. Alternate treatment on other products utilizing shorter times at proportionately higher \ntemperatures may be used if all material requirements are met.",
    "6.3.8.1 \nArtificial Aging: \n6.3.8.1.1 \nExample of Artificial \nAging: Heating of aluminum alloy bare and alclad 2024 at an elevated \ntemperature - but well below the annealing temperature - after solution heat treatment and \nnatural aging (temper -T4), will result in tensile and yield strengths considerably higher than \nthose which would result even with prolonged room temperature aging of this alloy. There is \nalso a decrease in the elongation",
    "also a decrease in the elongation \nof the material. This process is called \"elevated temperature \nprecipitation heat treatment\" or \"artificial \naging.\" \n6.3.8.1.2 \nEffect of Cold Work on Artificial Aging: The mechanical properties resulting from the aging \ntreatment are dependent on the amount of cold work present in the material at the time of \nartificial \naging. The mechanical \nproperties \nthat can be developed in any design are dependent,",
    "artificial \naging. The mechanical \nproperties \nthat can be developed in any design are dependent, \ntherefore, upon the severity of the forming operations used in fabricating the part, and this will \ngovern the selection of the temper of stock material used. For example, if only slight forming is \ninvolved, 2024-T36 or 2024-T361 material, which contains a considerable \ndegree of cold work, \ncould be used with resultant higher mechanical properties of the aged part than could be",
    "could be used with resultant higher mechanical properties of the aged part than could be \nobtained if 2024-0 or 2024-T3 material were used. The amount of cold work put into the part \nduring the forming operation will add to that in the stock metal and, therefore, the formed part \nwill generally have greater ultimate and yield strength and lower elongation after aging than \nwould a piece of stock material given the same aging treatment. \n6.3.8.1.2.",
    "would a piece of stock material given the same aging treatment. \n6.3.8.1.2. \nEffect of Heat on Cold Work: Annealing or solution heat treating will remove any cold work \npresent in the material so treated. Subsequent solution heat treatment and artificial \naging of \nthe annealed material, will result in \n-T6 conditions, provided the material \nis not reworked prior \nto aging. The higher strength conditions can be obtained only if known amount of cold",
    "to aging. The higher strength conditions can be obtained only if known amount of cold \nworking are accomplished prior to natural or artificial aging operations. For example, to \nobtain -T81, -T84, and -T861 conditions, the material would have to be cold-worked to \napproximately 1, 4, and 6 percent, respectively, subsequent to solution heat \ntreatment and \nprior to natural and artificial aging.",
    "## Ams-H-6088\n\n6.3.9 \nMechanical Stress Relief of Plate, Extrusions, and Forgings: To provide relief of residual stresses, plate, extrusions, and forgings are stretched or compressed after solution treatment, but prior to aging as follows:",
    "6.3.9.1 \nPlate. Stretched **1.5** to 3 percent permanent set to produce the TXX51 tempers. \n6.3.9.2 \nExtrusions. Stretched 1 \nto 3 percent permanent set to produce the TXX51 tempers (14, or \ncompressed 1 \nto 5 percent permanent set to produce the TXX52 tempers. \n6.3.9.3 \nForgings. Stretched 1 \nto 5 percent permanent set to produce the TXX51 tempers. \n6.3.9.4 \nForgings. Compressed 1 \nto 5 percent permanent set to produce the TXX52 tempers.",
    "6.3.9.4 \nForgings. Compressed 1 \nto 5 percent permanent set to produce the TXX52 tempers. \n1/ Modifications to this temper are: TXX510 which applies to products that receive no straightening aíter stretching and TXX511 which applies to products that receive minor straightening after stretching so as to comply with straightness tolerances.",
    "6.3.1 O \nInfluence of Residual Tensile Stress on Stress-Corrosion Behavior: Heat-treatment features, \nsuch as quenching medium and aging treatment (as well as straightening procedure after \nsolution heat treatment), can significantly \naffect the level of residual tensile stress in a part and \ninfluence stress-corrosion behavior. These heat-treatment features should be optimum with \nregard to minimizing residual tensile stress. \n6.3.1 \nElectrical",
    "regard to minimizing residual tensile stress. \n6.3.1 \nElectrical \nConductivity, Hardness, and Temper Relationships: For information \npurposes only, \nTables IX and X present typical values relating electrical conductivity and hardness with temper \nfor non-clad and alclad aluminum alloys.",
    "## Consideration Of Data Requirements:",
    "6.4 \nThe following data requirements should be considered when this specification is applied on a contract. The applicable Data Item Descriptions (DID'S) should be reviewed in conjunction with the specific acquisition to ensure that only essential data are requested/provided and that the DID'S",
    "are tailored to reflect the requirements of the specific acquisition. To ensure correct contractual application o f the data requirements, a Contract Data Requirements List (DD Form 1423) must be prepared to obtain the data, except where DOD FAR Supplement 27.475-1 exempts the requirement for a DD Form 1423. - \n- \nlllmïlk \n3.5.2.1, 3.8, 3.8.1.2, 4.1.2, DI-MISC-80653 \nTest Reports \n4.1.2.1, 4.1.2.3, 4.1.2.4, \n4.3.1, 4.5.6, 4.6.4.1",
    "| 4.7           |\n|---------------|\n| List/         |\n| Internal Data |\n|               | \n\n \n                                                                                \n\n## 6.4 (Continued):\n\nThe above DID'S \nwere those cleared as of the date of this specification. The current issue of DOD \n501 \n0\n.\n\n1\n \n2-L, Acquisition Management Systems and Data Requirements Control List (AMSDL), must be researched to ensure that only current, cleared DID'S \nare cited on the DD Form 1423.",
    "## 6.5 Definitions:\n\nSome of the terms defined in this paragraph are so defined as to be especially pertinent to this specification.",
    "6.5.1 \nHeat Treatment: The phrase \"heat treatment\" as used in this specification is meant to collective,j \ninclude all thermal treatments covered by this specification such as: solution heat treatment, age-hardening heat treatment, stabilizing, and annealing. \n6.5.2 \nHeat-Treat Lot, Forgings: A heat-treat lot consists of an identifiable quantity of metal of the same",
    "alloy and of the same product form, temper, and thickness or section, and of the same process \nhistory, all forgings, having been processed at the same time through a heat-treat and quench \nfacility, or as a continuous production run in a continuous heat-treating \nfurnace and quench facility \nduring a maximum of eight hours or as required by the applicable material specification. \n6.5.3 \nWorking Zone: Working zone i\ns\n that portion of the enclosed volume of a piece of thermal",
    "6.5.3 \nWorking Zone: Working zone i\ns\n that portion of the enclosed volume of a piece of thermal \nprocessing equipment occupied by parts or raw material during the soaking portion of a thermal \ntreatment. It is usually, but not always, a high percentage of the total enclosed volume. \n6.5.4 \nContractual Requirements and Recommendations: Wherever used in this specification, the word \n\"shall\" indicates a mandatory requirement, and the word %hould indicates a recommendation. \n6.5.5",
    "\"shall\" indicates a mandatory requirement, and the word %hould indicates a recommendation. \n6.5.5 \nBlistering and Porosity Resulting From Solution Heat Treatment: Such occurrences have in the \npast been called high temperature oxidation. It is now known that hydrogen entering aluminum \nalloys during solution heat treatment is the cause for development of surface blisters and \nsubsurface patterns of pores. \n6.5.6",
    "subsurface patterns of pores. \n6.5.6 \nAuthorized Representative: Any Government representative specifically authorized to approve equipment, material, or procedures within the scope of this document. They can be, but are not limited to, the following: \nContracting Officer Defense Industrial Supply Center (DISC) \nDefense Contract Management Command (DCMC) \nDefense Plant Representative Office (DPRO)",
    "6.5.7 \nCognizant Engineering Activity: The engineering organization responsible for the design of the \nitem being heat treated. \n \n\n## Ams-H-6088 Ams-H-6088 Patent Notice: 6.6\n\nThe Government does not possess a royalty-free license for heat treatment of 7175 alloy forgings under U\n.\n\nS\n.",
    "S\n.\n\n \nPatent Number 3,791,876 which expires 12 February 1994. The Department of Defense has no opinion about the novelty, uniqueness, and effectiveness of the patented procedure, nor does the Department offer any advice concerning the seeking of a license to apply that procedure.",
    "6.7 \nProduct processed and marked to the requirements of AMs-H-6088 also meets the requirements of \nMIL-H-6088, Revision G, Amendment 1. Product processed **and** marked to the requirements of \nMIL-H-6088G, Amendment 1, also meets the requirements of AMs-H-6088. \n6.8 \nChanges authorized by MIL-H-6088, Revision G, Amendment 1, have been incorporated into \n3.7.2.2.",
    "Quality Assurance \nparagraph \n(s) \nRequirement \nparagraph@) \n3.1, 3.1.2 \n4.1.2.1, 4.2, \n4.3.1 \nlishment and reestablishment \n\n                                                                                          \n\n| 3.2              |   4.2  |\n|------------------|--------|\n| 3.3              |    4.4 |\n| Periodic process |        |\n| surveys          |        |\n| Periodic product |        |\n| monitoring       |        |",
    "Products 11 \nand limitations \n2/ \nSolution \nTemper designation \nheattreating \nImmediately \nAíter \nAfter \naíter \nnatural \nstress \n(metal) \nquenching \naging 31 \nrelief 4\n1\n \ntemperature \n(degrees \nF) \n51 \n945-995 \n-W \nI \n-T3 6\n1\n,\n -T4 \n-T451 \nAlloy \n201 \n1 \nIwire, rod, \n2014 \nbar \nflat sheet \n925-945 \n-W \n-T3 *61,* -T42 \n-- \ncoiled sheet \n925-945 \n-W \n-T4, -T42 \n-- \nplate \n9 \n2 \n5 \n- \n9 \n4 \n5 \n-W \n-T4, -T42 \n-T451 \nwire, rod, \n925-945 \n-W \n-T4 \n-T451 \nbar \nextrusions \n925-945 \n-W \n-T4, -T42",
    "-W \n-T4, -T42 \n-T451 \nwire, rod, \n925-945 \n-W \n-T4 \n-T451 \nbar \nextrusions \n925-945 \n-W \n-T4, -T42 \n-T451 \nO, \n201 \n7 \n-T4511 \ndrawn tube \n925-945 \n-W \n-T4 \n-- \nwire, rod, \n9 \n2 \n5 \n- \n9 \n5 \nO \n-W \n-T4 \n-T451 \nbar \nrivets \n925-950 \n-W \n-T4 \n-- \n2024 \nflat sheet \n91 \n0-930 \n-W \n-T3 6\n1\n,\n -T361 \n-- \n61, \n-T42 \ncoiled sheet \n91 \n0-930 \n-W \n-T4, -T42, \n-- \n-T3 6\n1\n \nrivets \n91 \n0-930 \n-W \n-T4 \n-- \nplate \nwire, rod, bar \nextrusions \ndrawn tube sheet, plate \nwire, rod, \n21 \n17",
    "0-930 \n-W \n-T4 \n-- \nplate \nwire, rod, bar \nextrusions \ndrawn tube sheet, plate \nwire, rod, \n21 \n17 \n|            | 91          | 0-930    |\n|------------|-------------|----------|\n| -W         | -T4, -T42,  | -T351    |\n| -T361      |             |          |\n| 61         |             |          |\n| 91         | 0-930       |          |\n| 71         |             |          |\n| -W         | -T4, -T36 6 | 1        |\n| -T42       |             |          |\n| 91         | 0-930       | -W       |",
    "| -T42       |             |          |\n| 91         | 0-930       | -W       |\n| 61,        |             |          |\n| -T42       | -T351       |          |\n| O,         |             |          |\n| T3511      |             |          |\n| 91         | 0-930       | -W       |\n| 61,        |             |          |\n| -T42       |             |          |\n| --         |             |          |\n| 91         | 0-930       | -W       |\n| 925-950    | -W          | -T4      |",
    "| 91         | 0-930       | -W       |\n| 925-950    | -W          | -T4      |\n| --         |             |          |\n| bar        |             |          |\n| I          |             |          |\n| rivets     |             |          |\n| 890-950    |             |          |\n| -W         |             |          |\n| I          |             |          |\n| -T4        |             |          |\n| --         |             |          |\n| 21         | 24          |          |",
    "| --         |             |          |\n| 21         | 24          |          |\n| 2219       |             |          |\n| plate      | 91          | 0-930    |\n| 2/,        |             |          |\n| -T42       | -T351       |          |\n| sheet      | 985-1       | 005      |\n| -W         |             |          |\n| -T31 6     | 1           | ,        |\n| --         |             |          |\n| plate      |             |          |\n| 6/,        |             |          |",
    "| plate      |             |          |\n| 6/,        |             |          |\n| -T42       |             |          |\n| 985-1      |             |          |\n| 005        |             |          |\n| -W         |             |          |\n| -T31       |             |          |\n| 61,        |             |          |\n| -T37       | -T351       |          |\n| 6          | 1           | ,        |\n| 985-1      | 005         |          |\n| -W         |             |          |",
    "| 985-1      | 005         |          |\n| -W         |             |          |\n| -T4        |             |          |\n| --         |             |          |\n| 985-1      | 005         | -W       |\n| 61,        |             |          |\n| -T42       | -T351       |          |\n| rivets     |             |          |\n| wire, rod, |             |          |\n| bar        |             |          |\n|            |             |          |\n|            |             |          |",
    "|            |             |          |\n|            |             |          |\n|            |             |          |\n|            |             |          |\n|            |             |          |\n|            |             |          |\nAlloy \ntions \nTernper desianation \nProducts 11 \nand lirnita- \nImmediately \naiter \nquenching \n2/ \nSolution \nheattreating \n(metal) \ntemperature \n(degrees F) \nE\nd\n \n1 \nWrought products (EX \n221 \n9 \nI \nextrusions \nI \n985-1005 \nSIDING FORGING \n-W \n-T351 \nO,",
    "E\nd\n \n1 \nWrought products (EX \n221 \n9 \nI \nextrusions \nI \n985-1005 \nSIDING FORGING \n-W \n-T351 \nO, \n-T3511 \n-T31 6\n1\n,\n -T42 \n601 \nO \nIsheet \nI \n1045-1065 \n-W \n6013 \nIsheet \nI \n1045-1065 \n__ \n-T4 \nI \n-W -W \n-W \n606 \n1 \nsheet \nI \n960-1075 81 \nplate \nI \n960-1075 \nwire, rod, \nI \nbar \nI \n960-1075 \n-W \n-T4, -T42 \n-T451 \nlextrusions \nI \n960-1075 \n-W \n-T4, -T42 \n-T451 \nO, \n6063 \ndrawn \ntube \n960-1 \n075 \nextrusions \n960-985 \n6066 \ndrawn tube \n960-980 \nextrusions \n960-1010 \n-T4, -T42 -T4, -T42 \nNIA",
    "extrusions \n960-985 \n6066 \ndrawn tube \n960-980 \nextrusions \n960-1010 \n-T4, -T42 -T4, -T42 \nNIA \n-T451 \nO, \n6262 \ndrawn tube \n960-1 \nO1 \nO \nwire, rod, \n960-1 \n050 \nbar \n-T4 \nle*Nsions \nI \n960-1050 \n-W \nI \nI \nIdrawn \ntube \nI \n960-1050 \n6951 \nI \nsheet \nI \n975-995 \n-W \n-W \n7001 \nlextrusions \nI \n860-880 \n-W \nplate \n880-900 \nsheet \n840-860 91 \nplate \n840-860 9\n1\n \nextrusions \n860-885 \n                                                                                          \n-W \n-W",
    "-W \n-W \n-W512/ -W510 2/ -W511 2/ \n-W \nextrusions \n880-900",
    "| wire, rod,    | 880-900     |\n|---------------|-------------|\n| rivets        |             |\n| sheet         | 860-930 101 |\n| plate         |             |\n| 111           |             |\n| 860-930       |             |\n| wire, rod,    | 860-930     |\n| +             |             |\n| bar 111       |             |",
    "After \nnatural \naging 3\n1\n \nAiter \nstress \nrelief 41 \n-W \n-W \n-T4611 \n-W \n-W \n-T4511 \n-T4, -T42 \n-T451 \n-W \n-W \n-T451 \nO, \n-T4511 \n__ \n-- \n-T4 -T4, -T42 \n-- \n-W51 \nO 2/ \nW511 2/ \n-W -W \n-W \n-W512/ \n-W510 2/ \n-W511 2/ \n-W \n-W \n-- \nI \n__ \n-W -W -W \n-W512/ -W512/ \nI \n| Solution                              | Temper designation    |\n|---------------------------------------|-----------------------|\n| Products                              |                       |",
    "| Products                              |                       |\n| 11                                    |                       |\n| heat-                                 |                       |\n| Alloy                                 |                       |\n| and limita-                           | treating              |\n| tions                                 | (metal)               |\n| Immediately                           |                       |",
    "| Immediately                           |                       |\n| Aíter                                 | Aíter                 |\n| after                                 |                       |\n| natural                               | stress                |\n| quenching                             | aging                 |\n| 3                                     | 1                     |\n| relief 41                             |                       |",
    "| relief 41                             |                       |\n| 2/                                    |                       |\n| temperature                           |                       |\n| (degrees                              |                       |\n| F)                                    |                       |\n| 51                                    |                       |\n| Wrought products (EXCLUDING FORGINGS) |                       |",
    "| Wrought products (EXCLUDING FORGINGS) |                       |\n| 7075                                  | extrusions            |\n| --                                    |                       |\n| -W510                                 |                       |\n| 2/                                    |                       |\n| -W511                                 |                       |\n| 2l                                    |                       |",
    "| 2l                                    |                       |\n| drawn tube                            | 860-880               |\n| --                                    |                       |\n| -.                                    |                       |\n| 71                                    | 50                    |\n| 2/                                    |                       |\n| -W511                                 |                       |",
    "| -W511                                 |                       |\n| 2/                                    |                       |\n| plate                                 | 880-895               |\n| 2/                                    |                       |\n| 71                                    |                       |\n| 78                                    | sheet 131             |\n| -W                                    |                       |",
    "| -W                                    |                       |\n| _-                                    |                       |\n| plate                                 |                       |\n| 131                                   |                       |\n| 860-91                                |                       |\n| O                                     |                       |\n| -W                                    |                       |",
    "| -W                                    |                       |\n| __                                    |                       |\n| -W51                                  |                       |\n| 2l                                    |                       |\n| extrusions                            | 860-880               |\n| --                                    |                       |\n| -W51                                  | O                     |",
    "| -W51                                  | O                     |\n| 2/                                    |                       |\n| -W511                                 |                       |\n| 2/                                    |                       |\n| 7475                                  | sheet                 |\n| 880-970                               | -W                    |\n| --                                    |                       |",
    "| --                                    |                       |\n| __                                    |                       |\n| plate                                 |                       |\n| 880-970                               | -W                    |\n| --                                    | --                    |\n| 7475                                  | sheet                 |\n| 880-945                               | -W                    |",
    "| 880-945                               | -W                    |\n| --                                    |                       |\n| --                                    |                       |\n| Alclad                                |                       |\n| Forgings 14/                          |                       |\n|                                       |                       |",
    "Temper designation \nImmediately \nProducts 11 \nand limitations \nquenching \naging 3/ \nnatural \nstress \nrelief 4\n1\n \nSolution \nheattreating \n(metal) \ntemperature \n(degrees F) \n51 \n                                                                                          \n                                                                                          \n-- \n950 - 970 \n-- \n-T4 \n-- \n-- \n930 - 950 \n_- \n-T4 \n-- \n-- \n950 - 970 \n- \n-T45 \n-- \n-- \n940 - 970 \n-- \n-T45 \n-- \n-- \n980 - 995 \n__ \n-T4",
    "_- \n-T4 \n-- \n-- \n950 - 970 \n- \n-T45 \n-- \n-- \n940 - 970 \n-- \n-T45 \n-- \n-- \n980 - 995 \n__ \n-T4 \n-- \n__ \n960 - 995 \n__ \n-T4 \n__ \n~~ \n~~ \n~- \n-\n-\n \n__ \n-- \n-T4 \n-- \n980 - 1025 \n__ \n12/ \n__ \n-T4 \n__ \n328.0 \n(Red X-8) \n333.0 \n(333) \n336.0 \n(A332.0) \nA336.0 \n(A332.0) \n354.0 \n(354) \n355.0 \n(3551, \nC355.0 \n356.0 \n(3561, \nA356.0 \n(A356) \nProducts \n1 \nt \nand limitations \nImmediately \nafier \nquenching \nAfter \nAfter \nnatural \nstress \naging 3\n1\n \nrelief 4t \nSolution \nheattreating \n(metal) \ntemperature",
    "After \nAfter \nnatural \nstress \naging 3\n1\n \nrelief 4t \nSolution \nheattreating \n(metal) \ntemperature \n(degrees F) \n5t \nI \n21 \n__ \n-T4 \n-- \n980 - 1025 \n12/ \n-- \n-T4 \n-- \n980 - 1010 \n-- \n-T4 \n357.0 \n__ \n(3571, \nA357.0 \n-_ \n(A357) \n350.0 \n-. \nt \n(359) \nI \nI \n520.0 \n-- \n800 - 820 \n-- \n-T4",
    "11 \nThe term \"wire, rod, and bar\" as \nused herein refers \nto rolled \nor cold \nfinished wire, rod, and bar. The term \"extrusions\" \nrefers to extruded \nwire, rod, bar, shapes, and tube. \nThis temper is unstable \nand generally \nnot available. \n2l \n31 \nApplies only to those alloys which will naturally \nage to a substantially \nstable condition. See Table **VI1** for natural \naging \ntimes. \n41 \n                                                                                          \nFor rolled",
    "For rolled \nor extruded \nproducts, \nmetal is stress relieved \nby stretching \nafter quenching, and for forgings, metal is stress \nrelieved \nby stretching \nor compression aíter quenching. \n5\n1\n \nWhen a difference \nbetween \nthe maximum and minimum \ntemperatures of a range listed herein \nexceeds 20 O\nF\n,\n any 20 \nO\nF\n \ntemperature \nrange (or 30°F range \nfor 6061) within the entire range may be utilized (See 3\n.\n5\n.\n1\n.\n5\n)\n,\n \nprovided \nthat no \nexclusions \nor qualifying \ncriteria",
    ".\n5\n.\n1\n.\n5\n)\n,\n \nprovided \nthat no \nexclusions \nor qualifying \ncriteria \nare cited herein \nor in \nthe applicable \nmaterial \nspecification.",
    "| Cold working subsequent to solution heat    | treatment and prior to any precipitation heat    | treatment is necessary.    |\n|---------------------------------------------|--------------------------------------------------|----------------------------|",
    "61 \n7\n1\n \nTemperatures \nas low as 900 **O F**  may be used, provided \nthat every heat \ntreat lot is tested \nto show that the requirements \no\nf\n \nthe applicable \nmatenal specification \nare met, and analysis of test data to show statistic conformance \nto the specification \nlimits is available \nfor review. \n81 \nMaximum \ntemperature \nfor alclad \n6061 sheet should not exceed 1000 \"F. \n                                                                                          \n91",
    "91 \nOther temperatures may be necessary \nfor certain \nsections, conditions, \nand requirements. \n1 \no/ \nIt must be recognized \nthat under some conditions \nmelting \ncan occur when heating \n7075 alloy above 900 O F  \nand that \ncaution \nshould \nbe exercised \nto avoid \nthis problem. In order to minimize diffusion \nbetween \nthe cladding \nand \nthe core, \nalclad 7075 sheet in thicknesses",
    "between \nthe cladding \nand \nthe core, \nalclad 7075 sheet in thicknesses \nof 0.020 inch or less may be solution heat-treated \nat 850\" \nto 930 \"F.",
    "111 \nFor plate thicknesses over 4 inches \nand for rod diameters or bar thicknesses over 4 inches, a maximum temperature of \n910 O\nF\n is recommended \nto avoid melting. \n12l \nHeat treatment above 1010 \nO F  \nmay require an intermediate \nsolution heat treatment of one hour at 1000 - 1010 \nO F  \nto \nprevent eutectic melting \nof magnesium \nrich phases. \nUnder some conditions \nmelting can occur when heating \nthis alloy above 900 degrees F. \n1\n3\n1\n \nUnless otherwise indicated, hand \nforgings include",
    "this alloy above 900 degrees F. \n1\n3\n1\n \nUnless otherwise indicated, hand \nforgings include \nrolled rings, and die forgings include impacts. \n1 \n4/ \n1 \n5/ \nHeat-treating \nprocedures \nare at present proprietary among producers. At least one such procedure, i\ns\n patented \n(US. \nPatent Number 3,791,876). (See 6.6). \nFormer commercial designation is shown in parentheses. \n16/ \n1 \n71 \nUnless otherwise specified \nsolution",
    "16/ \n1 \n71 \nUnless otherwise specified \nsolution \nheat treatment is not required. Castings should be quickly cooled after shake-out or \nstripping from molds, so as to obtain a fine tin distribution. \n1 \n81 \nIn \ngeneral, product should \nbe soaked \nfor two \nhours in the range 91 \n0-930 \nO F  \nprior to heating \ninto the solution heat-treating \nrange. Other presolution \nheat-treating \ntemperature ranges may be necessary for some configurations and sizes.",
    "1 \n2 \nMaximum number of re-solution \nheat treatments permissible 11 \nThickness (inch) \nUnder 0.020 \nO \n0.020 to 0.125, incl \nOver 0.1 \n25 \n11 One additional \nre-solution heat treatment is permitted if the \nheating rate is sufficiently \nrapid to keep product in conformance \nto 4.7.3.",
    "I \nSoaking time (mintues) 1/ \n-~ \n~ \nSalt bath 3/ \nAir furnace 4/ \n(max) \n(min) \n(alclad \nonly) 5/ \nThickness (inches) 2/ \n0.016 and under 0.017 to 0.020 incl \n0.021 to 0.032 incl \n0.033 to 0.063 incl \n0.064 to 0.090 incl \n0.091 to 0.124 incl \n0.125 to 0.250 incl \n0.251 to 0.500 incl \n0.501 to 1.000 incl \n1.001 to 1.500 incl \n1.501 to 2.000 incl \n2.001 to 2.500 incl \n2.501 to 3.000 incl \n3.001 to 3.500 incl 3.501 to 4.000 incl \n10 \n15 \n10 \n20 \n15 \n25 \n20 \n30 \n25 \n35 \n30 \n40 \n35 \n45 \n45 \n55",
    "10 \n15 \n10 \n20 \n15 \n25 \n20 \n30 \n25 \n35 \n30 \n40 \n35 \n45 \n45 \n55 \n60 \n70 \n90 \n1 \nO0 \n105 \n115 \n120 \n130 \n135 \n160 \n150 \n175 \n165 \n190 \n(min) \n(alclad \nonly) 5/ \n20 \n25 \n20 \n30 \n25 \n35 \n30 \n40 \n35 \n45 \n40 \n50 \n50 \n60 \n60 \n70 \n90 \n1 \nO0 \n120 \n130 \n150 \n160 \n180 \n190 \n21 \no \n220 \n240 \n250 \n270 \n280",
    "1/ Longer soaking times may be necessary for specific forgings. Shorter soaking times are \nsatisfactory \nwhen the soak time is accurately determined by thermocouples attached to the \nload or when other metal temperature-measuring \ndevices are used. \n2/ The thickness is the minimum dimension of the heaviest \nsection. \n3/ Soaking time in salt-bath furnaces begins at time of immersion, except when, owing to a heavy",
    "3/ Soaking time in salt-bath furnaces begins at time of immersion, except when, owing to a heavy \ncharge, the temperature of the bath drops below the specified minimum; in such cases, \nsoaking time begins when the bath reaches the specified minimum. \n4/ Soaking time in air furnaces begins when all furnace control instruments indicate recovery to \nthe minimum of the process range. \n5/ For alclad metals, the maximum recovery \ntime (time between charging furnace and recovery of",
    "5/ For alclad metals, the maximum recovery \ntime (time between charging furnace and recovery of \nfurnace instruments) should not exceed 30 minutes for thicknesses up to 0.050 inch, \n60 minutes for 0.050 inch or greater but less than 0.102 inch, and 120 minutes for 0.102 inch or \ngreater.",
    "f\n Cast Alloys \nI \nAllov \nI \nSoaking Time (hours) \nA201 \n.O (201) \nand \nA206.0 (206) \n2 at 910 - 930°F \nfollowed by \n2-8 at 945-965 \nfollowed by \n8-24 at 970-995 \n6 to 18 incl \n222.0 (122) \n2 to 10 incl \n6 to 18 incl \n4 to 12 \nincl \n6 to 18 incl \n12 \n8 hr. then water quench \nto 150-212 \nO F  \n10 to 12 incl \n6 to 24 incl \n6 to 24 incl \n8 to 24 incl \n10 to 14 incl \n18 \n242.0 (142) 295.0 (195) \n296.0 (13295.0) \n31 \n9.0 (31 \n9) \n328.0 \n336.0, \nA336.0 354.0 (354) \n355.0 (355) \nand \nC355.0 (C355)",
    "31 \n9.0 (31 \n9) \n328.0 \n336.0, \nA336.0 354.0 (354) \n355.0 (355) \nand \nC355.0 (C355) \n356.0 (356) \nand \nA356.0 (A356) \n357.0 (357) \nand \nA357.0 (A357) \n359.0 (359) \n520.0 (220)",
    "Maximum time (seconds) 2/ \nNominal thickness (inches) \nUp to 0.016 incl \n0.017 to 0.031 incl \n5 7 \n0.032 to 0.090 \nincl \n0.091 and over \n10 \n15",
    "11 \nQuench delay time begins when the furnace door starts to open or when the \nfirst corner of the load emerges from a salt bath, and ends when the last \ncorner o\nf\n the load is immersed in the quenchant. With the exception of alloy \n221 \n9, the maximum quench delay times may be exceeded (for examples, \nwith extremely large loads or long lengths) if performance tests indicate that \nall portions o\nf\n the load will be above 775 O F  \nwhen quenched. For alloy 221 \n9,",
    "all portions o\nf\n the load will be above 775 O F  \nwhen quenched. For alloy 221 \n9, \nthe maximum quench delay times may be exceeded if performance tests \nindicate all parts will be above 900 O F  \nwhen quenched. \n21 Shorter times than shown may be necessary to ensure that the minimum \ntemperature o\nf\n 71 \n78 alloy is above 775 O\nF\n when quenched.",
    "Age-Hardening Heat-Treating \nCondition \nAlloy \nTemper \nbefore \naging \nAge-hardening \nheat \nTemper \ntreatment 1 \n/ \ndesignation \nLimitations \nafter \nMetal \nAging \ntemperature \ntime 2/ 13/ \n(degrees \nF) \n(hours) \n~ \nWrought products (excluding \nforgings): \n201 \n1 \n-W \nRoom \ntemp. \n96 Minimum \n-T4, -T42 \n-T3 \n31 \n0-330 \n14 \n-T8 \n201 \n4 \n1-w \nI \nIRoom \ntemp. \n196 Minimum \nI -T4, -T42 \nI \n-T3 \nIflat sheet \nI31 \n0-330 \n118 \nI \n-T6 \n340-360 \n10 \n-T6, -T62 \n340-360 \n10 \n-T651 \nextrusions \n340-360 \n10",
    "I31 \n0-330 \n118 \nI \n-T6 \n340-360 \n10 \n-T6, -T62 \n340-360 \n10 \n-T651 \nextrusions \n340-360 \n10 \n-T651 \nO \n-T6511 \nextrusions \n340-360 \n10 \n-T4, -T42 3/ -T451 \n3/ \n-T451 \nO \n-T4511 \n2017 \n-W \nI \nI \nRoom \nterm. \n196 Minimum \nI \n- ~ 4  \n__ \n-- \n-- \n-- \n-. \n__ \n2024 \n-T4 -T451 \n-W \n-T3 \nRoom temp. \n96 Minimum \n-T4, -T42 \nsheet and drawn \n365-385 \n12 \n-T81 \ntube \n-T4 \n-T3 \nwire, rod, bar \n365-385 \n12 \n-T6 \nextrusions \n365-385 \n12 \n-T81 \n3 \n6 \n5 \n- \n3 \n8 \n5 \n1\n8\n \nI \n-T86 \n365-385 \n1\n9\n \nI \n-T62",
    "12 \n-T6 \nextrusions \n365-385 \n12 \n-T81 \n3 \n6 \n5 \n- \n3 \n8 \n5 \n1\n8\n \nI \n-T86 \n365-385 \n1\n9\n \nI \n-T62 \n365-385 \n116 \nI \n-T72 \n365-385 \n-T36 -T42 \n-T42 -T42 \nwire \nsheet and plate \nsheet only \nother than sheet \nand plate \nsheet and plate \n-T351 \nextrusions \n-T351 \nO \n-T361 \n365-385 \n-T851 \n-T861 \n365-385 \n-T851 \nO \n365-385 \n-Ta51 \n1 \n-1351 \n1 \n2048 \n21 \n17 \nRoom \ntemp. \n96 Minimum \n-T4, -T42 \n-W \n-T42 \nsheet and plate \n365-385 \n9 \n-T62 \n-T351 \n365-385 \n12 \n-T851 \n-W \nwire, rod, bar \nRoom \ntemp.",
    "sheet and plate \n365-385 \n9 \n-T62 \n-T351 \n365-385 \n12 \n-T851 \n-W \nwire, rod, bar \nRoom \ntemp. \n96 Minimum \n-T4 \n21 \n24 \nRoom \ntemp. \n96 Minimum \n-T4, -T42 \n365-385 \n9 \n-T6 \n365-385 \n1\n9\n \nI \n- ~ 6 2  \n365-385 \n1\n1\n2",
    "indicated \ntreatment \n4\n1",
    "Alloy \nAge-hardening heat \nTemper \nTemper \ntreatment 11 \ndesignation \nbefore \nLimitations \nafter \naging \nindicated \ntreatment \n                                                                                          \n6066 \n-W \nextrusions \nRoom temp. \n96 Minimum \n-T4, -T42 \n-T4 \n340-360 \n8 \n-T6 \n-T42 \n340-360 \n8 \n-T62 \n-T451 \nO \n340-360 \n8 \n-T651 \nO \n-T6511 \n-T4511 \n340-360 \n8 \n\n \n~",
    "| Metal       | Aging    |\n|-------------|----------|\n| temperature | time     |\n| 21          |          |\n| 131         |          |\n| (degrees    |          |\n| F)          |          |\n| (hours)     |          |\n| a           |          |\nI \nLimitations \nAlloy \nTemper \nbefore \naging \n6262 \nN \nr4 \nRoom temp. \n96 Minimum \n-T4 \nwire, rod, bar, \n330-350 \n8 \n-T6 \ndrawn tube \n330-350 \n8 \n-T651 \nr45i \nr 4  \nlextrusions \n1340-360 \n1\n1\n2\n \nI \n-T6 \n6951 \n7001",
    "-T6 \ndrawn tube \n330-350 \n8 \n-T651 \nr45i \nr 4  \nlextrusions \n1340-360 \n1\n1\n2\n \nI \n-T6 \n6951 \n7001 \n                                                                                          \n701 \nO \n                                                                                          \n7039 \nI \n1330-350 \n1\n1\n \n5-24 \nIT7351 \nw 151 \nW51 15/ \nW511 \n7049, \n71 \n49 \nsheet \n165-1 \n85 \n16 \nplus \n31 \n0-330 \n14 \nplate \n165-1 \n85 \n16 \nplus \n31 \n0-330 \n14 \nextrusions \nRoom temp. \n48 \nfollowed by",
    "31 \n0-330 \n14 \nplate \n165-1 \n85 \n16 \nplus \n31 \n0-330 \n14 \nextrusions \nRoom temp. \n48 \nfollowed by \n240-260 \n24 \nI \nfollowed by",
    "Age-hardening heat \ntreatment 11 \nTemper \ndesianation \n&er \nindicated \ntreatment \nAging \ntemperatu \nre \ntime 'ìí 131 \n(degrees F) \n(hours) \n-T6 \n1 \n-T64 \n-T7651 \nO, \n-T76511 \n12-1 \n4 \n48 \n-T7351 \nO, \n-T73511 19/ \n24-25 \n12-21 \n320-330 \nRoom temp. \nfollowed \nby \n240-260 \nfollowed \nby \n325-335",
    "Alloy \nAge-hardening heat \nTemper \nTemper \ntreatment 11 \ndesignation \nbefore \nLimitations \nafter \naging \nindicated \ntreatment \nMetal \nAging \ntemperature \ntime 21 131 \n(degrees F) \n(hours) \n4/ \n                                                                                          \n-W51 81 \n7050 \n-W510 \n8/ \n-W511 \n8/ \nWrought products (excluding forgings): \nplate \n240-260 \n3-6 \nplus \n31 \n5-335 \n12-1 \n5 \n-T7651 \n240-260 \n3-6 \nplus \n31 \n5-335 \n24-30 \n-T7451 171 \nextrusions \n240-260 \n3-8 \nplus",
    "12-1 \n5 \n-T7651 \n240-260 \n3-6 \nplus \n31 \n5-335 \n24-30 \n-T7451 171 \nextrusions \n240-260 \n3-8 \nplus \n31 \n5-335 \n15-18 \n-T7651 \n0 \n240-260 \n3-8 \nplus \n-W 81 \nwire, rod, rivets \n245-255 \n4 min. \n31 \n5-335 \n15-18 \n-T76511 \n7075 \n-W 7\n1\n \n-W 51 81 \n111 -W \n81 111 \n-W \n6/ \n81 \n111 \n-W \n5/ \n81 \n111 \n.W 8\n1\n 111 \n.W51 51 \n31, 111 \nN51 81 \nI11 .W51 101 .W51 \n6\n1\n \n3/ 111 \n                                                                                          \nplus \n350-360 \n8 min. \n-T73 \n240-260 \n24",
    "plus \n350-360 \n8 min. \n-T73 \n240-260 \n24 \n-T6, -T62 \nsheet and plate \n21 \n5-235 \n6-8 \nplus \n31 \n5-335 \n24-30 \n-T73 \n240-260 \n3-5 \nplus 31 \n5-335 \n15-18 \n-T76 \nwire, rod, bar \n2 \n1 \n5-235 \n6-8 \nplus \n340-360 \n8-1 \nO \n--u3 \nextrusions \n21 \n5-235 \n6-8 \nplus \n340-360 \n6-8 \n-T73 \n240-260 \n3-5 \nplus \n31 \n0-330 \n18-21 \n-T76 \nplate \n21 \n5-235 \n6-8 \nplus \n31 \n5335 \n24-30 \n-T7351 \n240-260 \n3-5 \nplus 31 \n5-335 \n15-18 \n-T7651 \n240-260 \n24 \n-1651 \nwire, rod, bar \n2 \n1 \n5-235 \n6-8 \nplus \n340-360 \n8-1 \nO",
    "5-335 \n15-18 \n-T7651 \n240-260 \n24 \n-1651 \nwire, rod, bar \n2 \n1 \n5-235 \n6-8 \nplus \n340-360 \n8-1 \nO \n-T7351",
    "Age-Hardening \nHeat-Treating \nCondition - Continued \nLimitations \nAlloy \nTemper \nbefore \naging \nI-W511 71 \n81 111 \n-W510 51 \n-W511 51 \n81 111 \n-W510 51 \n81 111 \nI-W511 81 \n7075 \nI-W510 \n71 \nlextrusions \n240-260 \nI24 \nI-T651 \n0 \n240-260 \n21 \n5-235 \nplus \n340-360 \n21 \n5-235 \nplus \n340-360 \n240-260 \nplus 31 \n0-330 \n240-260 plus \n3 \n1 \n0-330 \n18-21 \n-T76511 \nI \n-T6 81 \nsheet \n31 \n5-335 \n24-30 \n-T73 \n-T6 81 \nwire, rod, bar \n340-360 \n8-1 \nO \n-T73 \n-T6 8\n1\n \nextrusions \n340-360 \n6-8 \n-T73 \n31 \n0-330",
    "-T6 81 \nwire, rod, bar \n340-360 \n8-1 \nO \n-T73 \n-T6 8\n1\n \nextrusions \n340-360 \n6-8 \n-T73 \n31 \n0-330 \n1 \n8-21 \n-T76 \nI-T651 \n81 \nI \npiate \n131 \n5-335 \n124-30 \n1 -T7351 \nwire, rod, bar \n340-360 \n(8-10 \n1 -T735 \n1 \nextrusions \n340-360 \n16-8 \n1\n0\n \n-T7351 \n-T651 8\n1\n \n-T651 \nO 81 \nI-T6511 \n81 \nI \n~ \n31 \n0-330 \n118-21 \n1 -T765 \n1 \n0 \n340-360 \n16-8 \n1 -T73511 \nI31 \n0-330 \nI l  \n8-21 \n147651 \n1 \n71 \n50 \nW51 \nO, \nW511 \nextrusions \nW51 \nplate",
    "16-8 \n1 -T73511 \nI31 \n0-330 \nI l  \n8-21 \n147651 \n1 \n71 \n50 \nW51 \nO, \nW511 \nextrusions \nW51 \nplate \n                                                                                          \n12 \n24 \n-T6, -T62 \n3-5 \n7178 \n-W \n-W 81 111 \nsheet \n2 \n4 \nO \n- \n2 \n6 \nO \nplus \n31 \n0-330 \n240-260 plus 300-320 \n240-260 240-260 \nplus \n-w 8/ 111 \n31 \n5335 \n15-1 \n8 \n-T76 \nextrusions \n240-260 \n3-5 \nplus \n31 \n0-330 \n18-21 \n-T76",
    "Temper \ndesignation \nAge-hardening heat \ntreatment 1 \nI \naier \nindicated \ntreatment \ntemperature \ntime 2/ 131 \n(degrees F) \n(hours) \n-T6511 \n24 \n6-8 \n6-8 \n47351 \nO \n6-8 6-8 \n-T73511 \n3-5 \n18-21 \n-T7651 \n0 \n3-5 \n8 \n-T651 \nO, \n4-6 201 \n-T6511 \n24 \nT651 \nAge-hardening heat \ntreatment i/ \nAlloy \nTemper \nbefore \naging \nLimitations \nTemper \ndesignation \nafter \nindicated \ntreatment \nMetal \nAging \ntemperature \ntime 2/ 13/ \n(degrees F) \n(hours) \n4 \nWrought products (excluding \nforgings): \n7\n1\n \n7\n8",
    "time 2/ 13/ \n(degrees F) \n(hours) \n4 \nWrought products (excluding \nforgings): \n7\n1\n \n7\n8\n \n                                                                                          \n7475 \n                                                                                          \n7\n4\n7\n5\n \nAlclad \nForgings:",
    "Temper \nbefore \naging \nAlloy \nLimitations \nForainas: \n4032 \n6053 \n6061 \n6066 \n                                                                                          \n61 \n51 \n7049 \nW \n,W52 \ndie & hand \nforgings Room temp. \nfollowed \nby \nfollowed \nby \n240-260 \n320-330 \ndie forgings \n,W \n7050 \n240-260 \nplus \n340-360 \n240-260 \n,W52 \n1 \nhand \nforgings \n                                                                                          \n7075 \n.W \n.W 81 111 \nplus 340-360 \n6-8 \n-T7452 181 \n2",
    "7075 \n.W \n.W 81 111 \nplus 340-360 \n6-8 \n-T7452 181 \n2 \n4 \nO \n- \n2 \n6 \nO \n24 \n-T6 \n21 \n5-235 \n6-8 \nplus 340-360 \n8-10 \n-T73 \nhand forgings \n240-260 \n24 \n-T652 \n-W52 -w52 \nal \n111 \n-W51 \n21 \n5-235 \n6-a \nplus \n340-360 \n6-8 \n-T7352 \nrolled rings \n21 \n5-235 \n6-8 \nplus \n7076 \ndie & hand forgings \nw \n-W \nI die & hand \nforgings",
    "| Age-hardening    | heat     |\n|------------------|----------|\n| treatment 11     |          |\n| Temper           |          |\n| designation      |          |\n| after            |          |\n| indicated        |          |\n| treatment        |          |\n| Metal            | Aging    |\n| temperature      | time     |\n| 2                | 1        |\n| 131              |          |\n| (degrees         |          |\n| F)               | (hours)  |\n| 41               |          |",
    "| (degrees         |          |\n| F)               | (hours)  |\n| 41               |          |\n| 48               |          |\n| 24               | -T73,    |\n| -T7352           |          |\n| 10-16            |          |\n| 3-6              |          |\n| 6-12             | -T74 161 |\n| 3-6              |          |\n| 340-360          | -T7351   |\n| 2                | 1        |\n| 340-360          | -T74 16/ |\n| 265-285          |          |\n| -T6              |          |\nTemper \nAlloy",
    "| 265-285          |          |\n| -T6              |          |\nTemper \nAlloy \nbefore \naging \nAge-hardening heat \nTemper \ntreatment 11 \ndesignation \nLi \nmitations \nafter \nMetal \nAging \ntemperature \n(degrees F) \n(hours) \n4\n1\n \n7149 \n242.0 \n(1 \n42) \n(195) \n295.0 296.0 \n(B295.0) \n319.0 \n(31 \n9) \n328.0 \n(Red \nX-8) \n333.0 \n(333) \n336.0 \n(A332.0) \n354.0 \n(354) \n355.0 \n(355) \nand \nC355.0 \n(C355) \n-F \n-T4 \n-T4 \n-T4 -T4 -T4 \n430-450 \n7-9 \n-T51 \n300-320 \n1-6 \n-T6 \n300-320 \n10-12 \n-T61 \n330-350 \n14-18",
    "-T4 \n-T4 \n-T4 -T4 -T4 \n430-450 \n7-9 \n-T51 \n300-320 \n1-6 \n-T6 \n300-320 \n10-12 \n-T61 \n330-350 \n14-18 \n-T62 \n430-450 \n3-5 \n-T7 \n465-485 \n4-6 \n-U1",
    "indicated \ntreatment \ntime 2/ 131 \n                                                                                          \nAlloy \nLimitations \nTemper \nbefore \naging \n356.0 \nT4 \nF \nT4 \nT4 \n430-450 \n6-1 \n2 \n-T51 \n300-320 \n1-6 \n-T6 \n300-320 \n6-1 \nO \n-T61 \n(356) \nand \nA356.0 \n(A3561 \n,T4 \n300-340 \n2-1 \n2 \n-T6 \n.T4 \nI \n1300-320 \n18-12 \nI \n-T61 \n357.0 \n(357) \nand \nA357.0 \n(357) \n359.0 \n(3591 \n                                                                                          \n.T41 .T4 \n.T4",
    ".T41 .T4 \n.T4 \n1 \n-W \n330-350 \n6-1 \nO \n-T62 \n3 \nO \nO \n- \n3 \n2 \nO \n20-1 \n2 \n-T6 \n1 \n330-350 \n6-1 \nO \n-T62 \n200-220 \n10 \n-T5 \nor Room \n21 days \ntemp. \n300-320 \n3-5 \n-T5 \n-F \n707.0 \n(607) \nor Room \n21 days \ntemp. \n345-365 \n9-1 \n1 \n-T5 \n-F \nor Room \n21 days \n712.0 \n(D712.0) \n-F \n-F \n713.0 \n(613) \nRoom temp. \n240-260 \nor Room \ntem. \n850.0 \n420-440 \n(750) \nI \n-F \n420-440 \n851 \n.O \n(A850.0) \n852.0 \n(B850.0) \nI \n1420-40 \n-F",
    "1/ \nTo produce \nthe stress-relieved \ntempers, metal \nwhich has been solution heat-treated \nin accordance with Table II \n(-W temper) must be stretched \nor compressed \nas required \nbefore \naging. In instances \nwhere a multiple \nstage aging \ntreatment is used, the metal may be, but need not be, removed \nfrom the furnace and cooled between \naging steps. \n2l \nThe time at temperature will depend on time required \nfor load \nto reach \ntemperature. The times shown are based on rapid \nheating",
    "for load \nto reach \ntemperature. The times shown are based on rapid \nheating \nwith soaking time measured \nfrom the time the load reached \nthe minimum \ntemperature shown. \n3/ \nAlternate \ntreatment o\nf\n 18 hours at 305 to 330°F may be used \nfor sheet and plate. \n \n~",
    "| Age-hardening    | heat    |\n|------------------|---------|\n| treatment        |         |\n| 1/               |         |\n| 1                |         |\n| designation      |         |\n| &er              |         |\n| indicated        |         |\n| treatment        |         |\n| Metal            | Aging   |\n| temperature      |         |\n| time             |         |\n| 2i               |         |\n| 131              |         |\n| (degrees         | F)      |\n| (hours)          |         |",
    "| 131              |         |\n| (degrees         | F)      |\n| (hours)          |         |\n| 96 Minimum       | -T1     |\n| 16               | -T5     |\n| 21 days          |         |\n| 7-9              | -T5     |\n| 7-9              |         |\n| -T5              |         |",
    "## Ams-H-6088 Sae",
    "4\n1\n \nWhen the interval \nof the specified \ntemperature range exceeds 20 OF, \nany 20 O F  \ntemperature range (or 30 O\nF\n range for \n6061) within the entire range may be utilized provided \nthat no exclusions or qualifying criteria are cited herein or in \nthe \napplicable material \nspecification. \n51 \nAltemate treatment of 6 to 8 hours at 215 to 235 O F  \nfollowed by a second stage of 14 \nto 18 hours at 325 \nto 345 O\nF\n may be \nused providing \na heating-up rate of 25 O F  \nper hour is used.",
    "to 345 O\nF\n may be \nused providing \na heating-up rate of 25 O F  \nper hour is used. \nAlternate treatment of 10 to 14 hours at 340 to 360 O\nF\n may be used providing a heating-up \nrate of 25 O\nF\n per hour is used. \n61 71 \nFor extrusions an altemate three-stage treatment comprised of 5 hours at 200 to 220 \nO\nF\n followed by 4 hours at \n240 to 260 \"F followed \nby 4 hours at 290 to 310 O\nF\n may be used. \n8\nl",
    "The aging of aluminum alloys 7049,7050,7075, and 7178 from any temper to the Ti' type tempers requires closer control on aging practice variables such as time, temperature, heating-up rates, etc, for any given item. In addition to the above, when re-aging material in the T6 temper series to the T7 type temper series, the specific condition of the T6 temper material (such as its property level and other effects of processing variables) is extremely important and will affect the capability of the",
    "other effects of processing variables) is extremely important and will affect the capability of the re-aged material to conform to requirements specified for the applicable T7 type tempers.",
    "Old or former commercial designation is shown in parentheses.",
    "91 \n1 \nO1 \nFor plate, an altemate treatment of 4 hours at 195 to 21 \n5 O F  \nfollowed by a second stage of 8 hours at 305 to 325 O\nF\n may \nbe used. \n111 \nWith respect to -T73, -77351, -77351 \nO, -T73511, -77352, -l76, \n-i7651 \nO, and -T76511 \ntempers, a license \nhas been \ngranted to the public under US. \nPatent 3,198,676 and these times and temperatures are those generally recommended \nby the patent",
    "Patent 3,198,676 and these times and temperatures are those generally recommended \nby the patent \nholder. Counterpart patents exist in several countries other than the United States. Licenses to operate \nunder these counterpart patents should be obtained \nfrom the patent holder. \nA heating-up rate of 50 to 75 O F  \nper hour is recommended. \n12/ \n1 \n31 \nThe 96-hour minimum \naging time required for each alloy listed with temper designation \nW is not necessary if artificial",
    "W is not necessary if artificial \naging is to be employed \nto obtain tempers other than that derived \nfrom room temperature aging. (For example, natural \naging (96 hours) to achieve the -T4 or -T42 temper for 2014 alloy is not necessary prior \nto artificial aging \nto obtain a -T6 \nor -T62 temper.) \nAn altemate treatment comprised of 8 hours at 350 O\nF\n also may be used.",
    "1 \n41 \nA heating-up rate of 35 O F  \nper hour from 135 O\nF\n is recommended. \n1 \n51",
    "Formerly designated as Ti36 \ntemper. \n1 \n61 \nFormerly designated \nas i73651 \ntemper. \n1 \n71 \nFormerly designated \nas T73652 temper. \n1 \n81 \nLonger times are to be used \nwith section thicknesses less than 2 inches. \n1 \n91 \nSoak time of 4 hours for extrusions with leg \nthickness less than 0.8 inch \nand 6 hours for extrusions having \nthicker legs. \n201 \nAn aitemative treatment is to omit the first stage and heat at a rate no greater than 36 \"Fhour. \n21 \nI \nDoesn't require",
    "21 \nI \nDoesn't require \nthe 14-day room temperature age. \n22/",
    "Material \nInter- \nTests \ngranular \nDiffusion \ncorrosion \n(alclad \nMechanical \nproperties \n11 \nonly) \n2/ \nMelting \nand \nhydrogen \nporosity \n51 \nX 31 \nX 4\n1\n \nX \n?late, sheet \nand \nrxtrusions \n__ \n__ \nX \nCastings \nX 31 \n-- \nX \nX \nBar, rod and wire \nX \n-- \n-- \nX \nForgings \nX \nX \nTubing \n-- \nX \nX \n_- \nX \nX \nRivets & \nfastener \ncomponents \n1 \n/ Those specified \nin the applicable material specification. \n2/ Applicable only to bare or alclad 2XXX series (unaged) and 7XXX alloy series.",
    "2/ Applicable only to bare or alclad 2XXX series (unaged) and 7XXX alloy series. \n                                                                                          \n31 Required only for metal under 0.250 inch thick. 4/ Not required for metal under 0.020 inch thick. \n51 Melting and hydrogen porosity resulting from solution heat treatment.",
    "Brinell, 3/ \ntypical \nTemper \nB \nHardness \nand Electrical Conductivity vs Temper li 7\n1\n \nconductivity \n51 \nE \nH \n2/ \nminimum \nAlloy \nRockwell, \nîypical minimum \n4\n1\n,\n 61 \nI \nTvpical \n1100 \nI \no \nI \nI \n50 tmx \n95 tmx \n~~ \n2014 \n57.0 - 62.0 \n43.5 - 51.5 \n31.5 - 35.0 \n31.5 - 35.0 \n86 \n35.0 - 41.5 \n95 tmx \n2024 \n                                                                                          \n82 \n82 \n84 \n85 \n2048 \n110 \n120 \n95 tmx \n27.5 - 32.5 \n_i-- \n35.0 - 42.5 \n4\n4\n.\n0\n \n- 49.0 \n98",
    "82 \n82 \n84 \n85 \n2048 \n110 \n120 \n95 tmx \n27.5 - 32.5 \n_i-- \n35.0 - 42.5 \n4\n4\n.\n0\n \n- 49.0 \n98 \n1 \nO0 \n1 \nO0 \n110 \n115 \n69 \n74 \n22 tmx \n60 \n62 58 62 71 \nO \n22 tmx 6\n1\n \nT3 \n1 \nO0 \n65 \nT4 \n1 \nO\n0\n \n65 \nT6 \n125 \n78 \nO \n22tmx \nT3 \n110 \n69 \nT4 \n1 \nO0 \n63 \nT6 \n125 \n72 \nT8 \n120 \n74 \nT8 \n120 \n72 \nT3 T8 \nO \nT3 T37 \nT4 \nT6 T8 \n79 81 \n78 81 83 \n84 \n70 tmx \n95 \n95 \n102 \n70 tmx \n94 \n94 \n98 \n99 98 97 99 \n70 tmx \n92 \n93 \n90 93 98 \n1 \nO0 \n3003 \n5052 \n26.0 - 31 \n.O \n27.0 - 31 \n.O \n28.0 - 32.0 \n32.0 - 36.0 \n31",
    "92 \n93 \n90 93 98 \n1 \nO0 \n3003 \n5052 \n26.0 - 31 \n.O \n27.0 - 31 \n.O \n28.0 - 32.0 \n32.0 - 36.0 \n31 \n.O - 35.0 \n! 31.0 - 35.0 \n44.5 - 50.5 \n34.0 - 37.0 \n65 tmx \n95 tmx \n- \n70 tmx 61 \n90 tmx \nT87 \n125 \n75 \nO \nO \n6013 \n46.0 - 51 \n.\nO\n \n27.5 - 32.5 \n27.5 - 3\n4\n.\n0\n \n34.0 - 4\n4\n.\n0\n \n35.0 - 42.5 \nI 35.0 -42.5 \n1 \n96 \n75 tmx \n6061 \nO \nT4 \n40 \nT6 \n61 \nO \n40 tmx 61 \nT4 \n50 \nT6 \n80 \n42 \n60 \n85 \n64 \n78 \n70 tmx \n53 \n54 \n57 \n37.0 - 39.0 \n40.0 - 43.0 \n42.0 - 50.0 \n35.5 - 43.0 \n40.0 - 50.0 \n57.0 - 65.0",
    "70 tmx \n53 \n54 \n57 \n37.0 - 39.0 \n40.0 - 43.0 \n42.0 - 50.0 \n35.5 - 43.0 \n40.0 - 50.0 \n57.0 - 65.0 \n48.0 - 5\n8\n.\n0\n \n48.0 - 58.0 \n50.0 - 60.0 \n6063 \nI \nO \nI \nI \n37 40 \n44 \n70 \n50.0 - 60.0 \n42.0 - 47.0 \n40 tmx \n85 \n95 \n3\n4\n.\n0\n \n- 41 \n.O \nI 38.0 - 50.0 \nHardness and Electrical \nConductivity vs Temper 1/ - Continued \n~ \nRockwell, typical minimum \n4\n1\n,\n 61 \nI \nTypical \nTemper \nAlloy \n6 \nE \nH \n1 \n5T \nc0nd;ctivity \n5/ \nBrinell, 3/ \ntypical \nminimum \n701 \nO \n22 tmx \n85 82 \n70 tmx \n95 tmx \n4\n4\n.\n0",
    "c0nd;ctivity \n5/ \nBrinell, 3/ \ntypical \nminimum \n701 \nO \n22 tmx \n85 82 \n70 tmx \n95 tmx \n4\n4\n.\n0\n \n- 50.0 \n104 \n85 \n40.0 - 44.0 \n105 \n86 \n40.0 - 44.0 \n134 \n140 142 \n84 \n22 tmx 61 \n7049 \n106 \n87 \n39.0 - 4\n4\n.\n0\n \n70 tmx 61 \n95 tmx 61 \n4\n4\n.\n0\n \n- 50.0 \n135 \n7050 \n81 \n22 tmx 6/ \n81 \n82 \n                                                                                          \n135 \n135 \n140 \n7075 \n135 \n125 \n130 \n140 \n7149 \n71 \n50 \n104 \n85 \n40.0 - 44.0 \n70 tmx 61 \n95 tmx 61 \n44.0 \n- 50.0 \n104 \n85",
    "125 \n130 \n140 \n7149 \n71 \n50 \n104 \n85 \n40.0 - 44.0 \n70 tmx 61 \n95 tmx 61 \n44.0 \n- 50.0 \n104 \n85 \n41 \n.O - 44.0 \n105 \n86 \n40.0 - 44.0 \n84 \n22 tmx 61 \n106 \n87 \n39.0 - 44.0 \n70 tmx 6/ \n95 tmx 61 \n4\n4\n.\n0\n \n- 48.0 \n84 \n78 \n82 \n84 \n22 tmx \n87 \n81 \n82 \n84 \n145 \n135 \n135 \n140 \n95 tmx 6/ \n71 \n78 \n145 \n140 \n87 \n84 \n7475 \nO \nT3 \nT4 \nT6 \nO \nT73 \nO \nT73 \nT74 101 \nT76 \nO \nT6 \nT73 \nT76 \nT76 \nO \nT61 \nT73 \nT74 T76 \nO \nT6 \nT76 \nT73 \nT76 \n106 \n87 \n30.5 - 36.0 \n102 \n85 \n40.0 - 43.0 \n1 \n04 \n86 \n38.0 - 42.0 \n106",
    "O \nT6 \nT76 \nT73 \nT76 \n106 \n87 \n30.5 - 36.0 \n102 \n85 \n40.0 - 43.0 \n1 \n04 \n86 \n38.0 - 42.0 \n106 \n87 \n38.0 - 44.0 \n70 tmx \n95 tmx \n4\n4\n.\n0\n \n- 50.0 \n108 \n29.0 - 33.5 \n104 \n85 \n41 \n.O - 44.0 \n105 \n86 \n40.0 - 44.0 \n106 \n87 \n39.0 - 44.0 \n43.0 - 47.0 \n108 \n88 \n29.0 - 34.0 \n106 \n87 \n38.0 - 42.0 \n103 \n40.0 - 44.5 \n105 \n38.0 - 42.0",
    "NOTE: Refer to notes at end of Table X.",
    "Values, Electrical \nConductivity vs Temper 11 \nRockwell, typical minimum 41 \nAlloy \nTemper \n2/ \n15T \nE \nB \nTypical \nconductivity \n5/ \nSheet \nthickness \n(inches) 9/ \nT6 \n2014 \n85 \n- \n76 \n75 \n.O62 & Under \n.O63 & Over \n102 \n1 \no1 \n35.5 - 44.0 35.5 - 44.0 \nT3 \n79 \n2024 \n- \nT4 \n79 \n- \n82 \nT6 \n- \n.O62 & Under \n.O63 & Over \n.O62 & Under \n.O63 & Over \n.O62 & Under \n.O63 & Over \nAll \n82 \n57 60 57 60 \n60 \n62 \n65 \n91 \n93 91 93 93 94 97 \nT8 \n28.5 - 35.0 \n28.5 - 35.0 \n28.5 - 35.0 \n28.5 - 35.0",
    "60 \n62 \n65 \n91 \n93 91 93 93 94 97 \nT8 \n28.5 - 35.0 \n28.5 - 35.0 \n28.5 - 35.0 \n28.5 - 35.0 \n35.0 - 45.0 \n35.0 - 45.0 \n35.0 - 45.0 \n80 \nT6 \n- \n221 \n9 \n71 \n82 \nT8 \n- \n.O62 & Under .O63 & Over \n.O62 & Under \n.O63 & Over \n61 60 64 63 \n92 91 96 95 \n32.0 - 37.0 \n32.0 - 37.0 \n31 \n.O - 37.0 \n31 \n.O - 37.0 \n- \n74 \nAll \nT6 \n84 \n6061 \n40.0 - 47.0 \n1 6  \n.O32 & Under \n7075 \n.O33 \n- .O62 \n86 \n- \n- \nT76 \n.O63 & Over \n.O32 \n& Under \n.O33 - .O62 \n84 \n- - \n.O63 & Over \n78 \n76 \n75 \n76 75 74 \n103 102 \n1 \no1 \n102",
    ".O32 \n& Under \n.O33 - .O62 \n84 \n- - \n.O63 & Over \n78 \n76 \n75 \n76 75 74 \n103 102 \n1 \no1 \n102 \n1 \no1 \n1 \nO0 \n30.5 - 36.0 \n30.5 - 36.0 \n30.5 - 36.0 \n38.0 - 42.0 \n38.0 - 42.0 \n38.0 - 42.0 \n71 \n78 \nT6 \n.O36 & Under \n79 \n                                                                                          \n.O37 - .O62 \n86 \n- \n- \n.O63 & Over \n76 \n78 \n104 \n103 1 \no2 \n29.0 - 3\n4\n.\n0\n \n29.0 - 37.0 \n29.0 - 37.0",
    "11 This table i\ns\n for information purposes only. Electrical conductivity measurements may be \ninfluenced by the operating characteristics o\nf\n the instrument probe used. \n21 Only the basic temper, TX(X), i\ns\n shown. Hardness values also apply to the stress relieved \nTX51 \n, \nTX52, TX54, TX510, or TX511 conditions and the user heat treated T42 and T62 \nconditions. \n31 BHN, 500 Kg load, 10 mm ball. \n4/ Hardness values for the annealed (O) \nconditions are typical maximum; all other hardness",
    "4/ Hardness values for the annealed (O) \nconditions are typical maximum; all other hardness \nvalues are typical minimum. The 15T values are for material 0.032 inch or **less** in thickness \nand may be used for the thinnest material that does not show anvil effect. \n51 Typical conductivity as expressed by percentage o\nf\n conductivity of the International Annealed \nCopper Standard (IACS). \n61 Tmx i\ns\n the abbreviation for typical maximum. \n71 Electrical conductivity i\ns",
    "61 Tmx i\ns\n the abbreviation for typical maximum. \n71 Electrical conductivity i\ns\n not as sensitive a n  indicator as hardness testing for metallurgical \nconditions that affect strength in alloy 221 \n9. \n81 For the annealed (O temper), the non-clad values are applicable. \n91 Values are for sheet with clad intact. For alclad sheet over 0.091 inch thick, incorrect \nhardness readings can result from the cladding thicknesses. Partial removal o\nf\n the cladding \nthickness in local areas i\ns",
    "f\n the cladding \nthickness in local areas i\ns\n permitted to obtain valid hardness readings. \n1 \nO/ \nFormerly designated as Ti36 temper.",
    "Alloy \nApproximate \ntime at \ntemperatu \nre, \nhours \nApproximate Il \ntime at \ntemperature, \nhours \nII \nMetal \ntemperature \ndegrees \nF \n31 \nMetal \ntemperature \ndegrees \nF 3\n1\n \n2/ \n2/ \n2/ \n2 - 3 2 - 3  \n2 - 3 2 - 3  \n2 - 3 2 - 3  \n21 \n2/ \n2/ \n21 21 \n21 \n21 \n2/ \n1060 1100 \n1350 \n2014 201 \n7 \n2024 \n2036 21 \n1\n7\n \n221 \n9 \n3003 3004 31 \n05 \n5005 5050 5052 \n5056 5083 \n650 \n650 650 760 \n4\n1\n \n760 \n4\n1\n \n760 \n4\n1\n \n725 \n4\n1\n \n760 \n4\n1\n \n760 \n4\n1\n \n775 \n650 650 650 \n650 650 \n650 650 \n5086 51 \n54",
    "4\n1\n \n760 \n4\n1\n \n725 \n4\n1\n \n760 \n4\n1\n \n760 \n4\n1\n \n775 \n650 650 650 \n650 650 \n650 650 \n5086 51 \n54 \n5254 5454 5456 5457 \n5652 6005 \n601 \n3 \n6053 6061 6063 \n6066 \n7001 7075 \n7\n1\n \n75 \n7\n1\n \n78 \n650 \n650 650 650 \n650 650 \n650 \n760 \n4\n1\n \n775 \n4\n1\n \n760 \n4\n1\n \n760 \n4\n1\n \n760 \n4\n1\n \n760 \n4\n1\n \n760 \n5\n1\n \n760 \n5\n1\n \n760 \n5\n1\n \n760 \n5\n1\n \n2\n1\n \n2/ \n2\n1\n \n2\n1\n \n2\n1\n \n2\n1\n \n2/ \n2 - 3 2 - 3  \n2 - 3 2 - 3 2 - 3  \n2 - 3 2 - 3  \n2 - 3  \n2 - 3  \n2 - 3",
    "11 This table is for information purposes only.",
    "2/ Time in furnace should be no longer than necessary to get center of load to the desired \ntemperature, taking into consideration \nthe thickness or diameter of metal. Rate of cooling is \nunimportant. \n3\n1\n Metal temperature variation in the annealing furnace should be not greater than +1 O \nO F ,  \n-15 \nO F .  \n4\n1\n This annealing removes the effects o\nf\n the solution heat treatment. Cooling rate must be 50 \nO F  \nper hour from annealing \ntemperature to 500",
    "O F  \nper hour from annealing \ntemperature to 500 \nO F .  The rate of subsequent cooling is unimportant. \n                                                                                          \n5\n1\n This annealing removes the effects of the solution heat treatment by cooling at an uncontrolled \nrate in the air to 400 \nO F  \nor less followed by a reheating to 450 \nO F  \nfor 4 \nhours and cooling at room \natmosphere conditions.",
    "O F  \nfor 4 \nhours and cooling at room \natmosphere conditions.",
    "per end plus.one fron center as shown In fleure 2\nC,' For plate thicknesses over 1.0 inch, total nunber o f  samples fron \n(5 per end plus one fron center as shown h fgurc 2\n)\n.\nNOTEI \nDirections of rollno Is perpendtcular t o  the above plate sections. \nrdllng widths o f  plates ore shown. \nFinish \n \n\nAMs-H-6088 \nSAE \nAMs-H-6088 \n\n## Index - Continued",
    "| 6.5.5                 | Blistering                |\n|-----------------------|---------------------------|\n|                       |                           |\n| .26                   |                           |\n| 6.5.6                 | Authorized Representative |\n|                       |                           |\n| .26                   |                           |\n| 6.5.7                 |                           |\n| Cognizant Engineering | Activity                  |",
    "| Cognizant Engineering | Activity                  |\n|                       |                           |\n| 26                    |                           |\n| 6.6                   | Patent Notice             |\n|                       |                           |\n| 27                    |                           |\n|                       |                           |",
    "## Index Of Tables And Figures",
    "Pages \nTable I \nInspection requirements \n..................................................................................................... 28 \nII \nSolution heat-treating \ntemperatures ................................................................................... \n29 \nIII \nRe-solution \nheat treatment of alclad alloys ........................................................................ \n35 \nIV \nRecommended",
    "35 \nIV \nRecommended \nsoaking time for solution heat treatment of wrought products .................. \n36 \nV \nRecommended soaking time for solution treatment of cast alloys ..................................... \n37 \nVI \nMaximum quench delay (for immersion quenching) .......................................................... \n38 \nVI \nI \nRecommended age-hardening heat-treating \ncondition \n...................................................... \n39 \nV\nI\n1\n1",
    "condition \n...................................................... \n39 \nV\nI\n1\n1\n \nTest requirements for periodic monitoring \n.......................................................................... \n49 \nIX \nAluminum alloys (non-clad), typical values, hardness and electrical \nconductivity \nvs \n. \ntemper ....................................................................................................... 50 \nX \nAluminum alloys (alclad), heat.treated, typical values, electrical conductivity",
    "X \nAluminum alloys (alclad), heat.treated, typical values, electrical conductivity \nvs . \ntemper .......................................................................................................................... \n52 \nXI \nRecommended \nannealing conditions \nfor wrought aluminum and \naluminum alloys ................................................................................................................. \n54",
    "54 \n                                                                                          \nFigure 1 \nTension test sample location for spray quench equipment verification \n.............................. \n55 \nFigure 2 \nAllowable location \nto sample tension specimen \nfrom approximate location \nof center of plate ................................................................................................................ \n56",
    "56"
  ]
}