{
  "source": "SAE AS4914A 1999.md",
  "chunks": [
    "## Aerospace Standard\n\n400 Commonwealth Drive, Warrendale, PA 15096-0001\n\n| Issued             | 1994-11   |\n|--------------------|-----------|\n| Revised            | 1999-05   |\n| Superseding AS4914 |           |\n\nAircraft Fluorescent Lighting Ballast/Fixture Safety Standard\n\n## 1. Scope:\n\nThis document does not dictate a specific design approach or technology, but rather it provides design consideration to assist the specification writer in establishing a fail/safe design.",
    "## 2. Applicable Documents:",
    "The following publications form a part of this document to the extent specified herein.  The latest issue of SAE publications shall apply.  The applicable issue of other publications shall be the issue in effect on the date of the purchase order.  In the event of conflict between the text of this document and references cited herein, the text of this document takes precedence.  Nothing in this document, however, supersedes applicable laws and regulations unless a specific exemption has been",
    "document, however, supersedes applicable laws and regulations unless a specific exemption has been obtained.",
    "2.1\nU.S. Government Publications:\nAvailable from DODSSP, Subscription Services Desk, Building 4D, 700 Robbins Avenue, Philadelphia, PA 19111-5094.\n\nMIL-HDBK-454 MIL-HDBK-1547\nMIL-STD-464 MIL-STD-889 DO-160",
    "MIL-HDBK-454 MIL-HDBK-1547\nMIL-STD-464 MIL-STD-889 DO-160\n\n2.2\nFAR Publications from FM:\nAvailable from Federal Aviation Administration, 800 Independence Avenue, SW, Washington, DC 20591. FAR 25.853\nSAE Technical Standards Board Rules provide that: \"This report is published by SAE to advance the state of technical and engineering sciences. The use of this report is entirely FAX: (724) 776-0790\n\n## 3. General Design Requirements:",
    "## 3. General Design Requirements:\n\nEquipment supplied under the requirements of this document shall be designed to the following standards and permit operation under the environments and to the performance levels specified.  The design/construction of all equipment shall incorporate features which allow the equipment to be operated safely.  Testing shall be conducted to verify the design standards.",
    "3.1\nMaterials and Finishes:\nMaterials and finishes used in the construction of the ballast/fixture shall be capable of withstanding the airplane environment.",
    "a.\nMetals:  All metals shall be of the corrosion resistant type unless suitably protected to resist \ncorrosion during normal service life.  Guidance regarding metals in contact with each other shall \nbe selected and protected as defined in MIL-STD-889.\nb.\nNonmetallic Materials:  Materials which are nutrients for fungi shall not be used.\nc.\nFlammable Materials:  All nonmetallic/metallic composite materials shall meet FAR 25.853.\n\n## 3.2 Arc Resistance:",
    "## 3.2 Arc Resistance:\n\nThe arc resistance time of insulating materials shall exceed 125 s, when tested per arc resistance test, ASTM designation D495-48T, high-voltage, low current arc resistance of solid electrical insulating materials.",
    "3.3\nLampholders:\na.\nThe lampholders shall be capable of retaining the fluorescent lamp and permit satisfactory lamp \noperation throughout the specified airplane environment.\nb.\nGold plated contacts are recommended.\nc.\nMoisture resistant lampholders shall be specified or the fixture design shall provide protection for \nthe lampholder from condensation and moisture accumulation.\n\n## 3.4 Ballast/Fixture:",
    "## 3.4 Ballast/Fixture:\n\nWhen operating in an ambient of 77 °F (25 °C), the exposed surface shall not exceed 160 °F (71 °C) under any conditions of normal, abnormal, overload operations or failure. All materials used shall be self-extinguishing per FAR Part 25.853.  The ballast shall be designed in such a manner to be smoke and fume free under any condition. The ballast shall be designed to have the capability of containing smoke, flame, explosion and arcing under any condition.",
    "3.5\nSchematic:\nA schematic shall be affixed to the equipment.  The schematic shall clearly show the electrical connections such as input voltage, frequency, dimmer control and lamp load (type or power), and ground plane spacing dimension.\n\n3.6\nGround Plane:\nIf the ballast or integrated light fixture and ballast design approach requires a minimum ground plane spacing, either the airplane lamp installation or the integrated light fixture shall provide a proper ground plane spacing.",
    "3.7\nConnector:\nConnectors with gold plated contacts are recommended for electrical connection.  If it is probable that incorrect connection between various light assemblies or ballast could cause a catastrophic failure, keyed connectors, mounting hole or foot print variation or other mechanical means shall be used to prevent incorrect connection.\n\nMoisture resistance level shall be consistent with lampholder, light fixture and ballast design.",
    "Moisture resistance level shall be consistent with lampholder, light fixture and ballast design.\n\n3.8\nThermal Protection:\nThe equipment shall be protected against overheating by thermal protective devices.  The rated temperature of these thermal protective devices must be lower than that of the rated temperature of the material.  It is recommended that verification tests be conducted to ensure the effectiveness of these thermal protective devices and their locations.",
    "## 3.9 Electrical Grounding And Bonding:\n\nThe equipment shall provide a grounding system capability that is compatible with the grounding within the aircraft and all other equipment to be used with or which interfaces with the equipment. Electrical grounding and bonding per MIL-B-5087B if applicable to the installation.\n\n## 3.10 Electrical Protection:",
    "## 3.10 Electrical Protection:\n\nThe input power circuit of the electrical equipment shall contain a fuse or circuit breaker with current rating of at least 50% over the maximum current under worst case voltage and environment conditions.  The fuse part number shall be marked adjacent to the fuse on external replaceable fuses.\n\n## 3.11 Standard Parts:",
    "Guidance on the selection of electrical/electronic components can be found in MIL-HDBK-454. Particular consideration shall be given to the environmental limits, electrical characteristics, power ratings, and material used.  All parts shall be suitably derated to ensure safety.  Recommended derating guidelines can be found in NAVMAT P-4855-1, \"Navy Power Supply Reliability Guidelines,\" or in MIL-HDBK-1547, \"Technical Requirements for Parts, Materials, and Processes for Space and Launch",
    "in MIL-HDBK-1547, \"Technical Requirements for Parts, Materials, and Processes for Space and Launch Vehicles.\"",
    "Note that high voltage capacitors and transformers in the ballast, when they fail short, can cause catastrophic failure to the ballast.  Circuit designs should therefore have provisions to mitigate such potential failures.  Additionally, temperature and voltage ratings must be extremely conservative.",
    "For capacitors, the temperature rating shall be greater than the ambient temperature adjacent to the capacitor when the ballast is operated at a temperature of 71 °C ambient.  Oil filled or oil-bath type capacitors should not be used in aircraft ballast designs. For inductors and transformers, the devices shall meet the requirements of MIL-T-921, class S, or MIL-T-27, class V.  Magnet wire used in these devices shall conform to the requirements of NEMA",
    "MW-1000, class MW-35C (heavy) [supersedes J-W-1177/14 and MIL-W-583 Class 200 Type K2].",
    "## 4. Test Requirements: 4.1 Operational Tests:\n\nThe system shall perform within operational requirements during and after exposure to the following.",
    "4.1.1\nThermal: The equipment shall be subjected to thermal testing as defined in DO-160C, Sections 4 \nand 5.  The category shall be defined by the customer specification.\n4.1.2\nAltitude: The equipment shall be subjected to altitude testing in accordance with DO-160C, \nSection 4.0.  The category shall be defined by the customer specification.\n4.1.3\nVibration: The equipment shall be subjected to vibration testing in accordance with DO-160C,",
    "4.1.3\nVibration: The equipment shall be subjected to vibration testing in accordance with DO-160C, \nParagraph 8.0, Sine or Random.  During the test, any signs of arcing, flame, smoke emission, intermittent contact (lamp flickering) shall constitute failure of the article.  After testing inspect the lamp and lampholder contacts for signs of arcing or lampholder contact displacement.  Any signs of arcing,  lamp or lampholder contact displacement shall constitute failure of the fixture.\n4.1.4",
    "4.1.4\nOperational Shock: The equipment shall be subjected to operational shock testing in accordance \nwith DO-160C, Paragraph 7.2, 6.0 g's.  After testing inspect the lamp and lampholder contacts for signs of arcing and lampholder contact displacement.  Any signs of arcing , flame, smoke emission, intermittent contact (lamp flickering) shall constitute failure of the article.\n4.1.5\nWaterproofness Tests: The equipment shall be subjected to the Waterproofness test specified in",
    "Waterproofness Tests: The equipment shall be subjected to the Waterproofness test specified in \nDO-160C, Section 10, Category W under the following conditions: a.\nThe equipment shall be tested in the normal aircraft installation orientation with droplets falling \nfrom above.\nb.\nA standing water requirement of 0.2 in will be imposed.\nc.\nThe test solution shall be a 5% NAACO solution.\nd.\nThe equipment shall be operated during the test.\ne.",
    "d.\nThe equipment shall be operated during the test.\ne.\nFuse opening or temporary shutdown shall not constitute failure or rejection of the article.\nf.\nFailure of the article shall consist of permanent malfunction, flame or smoke emission, arcing, \nor other signs of catastrophic failure.\n4.2\nNon-operational Tests:\n4.2.1\nAcceleration and Crash Safety: The equipment shall be subjected to crash safety testing in",
    "4.2.1\nAcceleration and Crash Safety: The equipment shall be subjected to crash safety testing in \naccordance with DO-1GOC, Paragraph 7.3 - except the force shall be 9.0 g's in each axis.\n4.2.2\nHumidity: The equipment shall operate normally after exposure to relative humidity up to 100% \nwith temperature and altitude cycling between 20 to 130 °F (-6.7 to 54.5 °C) and -1000 to 20,000 ft mean sea level (MSL), including conditions where condensation occurs on the equipment's",
    "described in OO-160C, Paragraph 6.3.2 for Category B equipment - Severe Humidity Environment.\n4.2.3\nInsulation Resistance Test: The insulation resistance between electrically isolated circuit elements \nand between those elements and the housing shall be measured at 500 V DC minimum (with \nlamps removed).  The minimum insulation resistance shall be 100 kΩ.  This test shall be performed prior to and following the dielectric withstanding voltage test.",
    "## 4.4 Dielectric Withstanding Test:\n\nApply a test voltage of 1500 V rms at 60 Hz for 1 mm between mutually insulated conductive paths. The test voltage shall be applied and removed at a uniform rate of 250 to 500 V/s.   Any arcing as evidenced by flashover, sparkover, (or) breakdown, or leakage current exceeding 2 mA shall constitute failure.  Capacitors, diodes, and other electronic devices susceptible to damage may be disconnected from the equipment or short circuited for these tests.",
    "## 4.5 Power Quality:\n\nArticle shall be tested to verify the compliance with its performance requirements when supplied with power, having normal and abnormal operating characteristic as specified in Section 16 of RTCA/DO-160C.  The applicable category shall be specified by customer specification.  When electrical power with an abnormal steady state and transient characteristic is applied, the article shall meet the following requirements:",
    "a.\nSustain no damage and remain safe.\nb.\nReliability and life shall not be affected.\nc.\nAutomatically recover full performance capability when power with normal characteristics is \nreestablished.\nd.\nThe article shall not cause interference to other aircraft equipment of systems that meet the \nsame requirement as stated.\n\n## 4.6 Electromagnetic Interference (Emi):",
    "## 4.6 Electromagnetic Interference (Emi):\n\nThe location of the equipment. in the aircraft and wiring have a major impact on the significance of the EMI   The system level EMI requirements should be considered when writing the equipment EMI \nspecification.  It is recommended that the ballast, fixture and lamp be tested to show that they meet the requirements of DO-160C Sections 17 through 21.",
    "When tested to the methods of DO-160C the following shall apply;\nThe ballast, lamp and fixture shall not be harmed when subjected to the following susceptibility requirements:",
    "Sections 17, 18 and 19, Category A Section 20, Category U The ballast, lamp and fixture shall not exhibit degraded performance when subjected to Section 20, Category T conditions. The ballast, lamp and fixture shall be designed to meet the Radiated Emissions requirements of Section 21, Category B.  Compliance to Category Z is a recommended practice.",
    "NOTE: When the installation requires a discrete ballast an light fixture assembly, the Radiated \nEmissions and susceptibility test be set up with a distance of 1 m between the ballast and light assembly.\n\n## 4.7 Flammability Test:\n\nAll nonmetallic/metallic composite materials shall meet the requirements of FAR Part 25.853.\n\n## 4.8 Fail/Safe Verification Test:",
    "## 4.8 Fail/Safe Verification Test:\n\nCatastrophic failure is defined as a failure or malfunction that emits smoke, noxious gas, or causes a flame, arc, fire, explosion, damage to adjacent aircraft structure, components, equipment or system, or interfere with the essential or critical aircraft equipment or system(s).",
    "The ballast and fixture shall be designed so that when a failure occurs due to any normal or abnormal conditions and/or operation, this failure shall not be catastrophic.  At least the following fail/\nsafe conditions shall be verified when the unit is powered:",
    "a.\nLamp fail conditions such as:  Indefinite short filament(s), open filament(s), broken lamp(s), \nrectifying lamp(s), lamp removal and relamp (dependent upon the design approach, a \nreasonable time shall be specified to simulate indefinite short or open filament(s) or indefinite).\nb.\nIndefinite shorted output:  Filaments shorted together and/or shorted to ground (dependent upon \nthe design approach, a reasonable time shall be specified to simulate indefinite shorted output).\nc.",
    "c.\nNo load (no lamp(s):  Open circuit voltage with normal, abnormal and transient input power.\nd.\nHigh temperature:  The ballast and fixture shall be operated in a 185 °F (85 °C) ambient for 24 h or until the unit fails.  If no failure occurs within 24 h, slowly increase the temperature at a rate of \n7°/h until failure.  Note that the effectiveness of the thermal protective device shall be verified by this test.\ne.",
    "e.\nHigh voltage:  The unit shall be operated at normal input power for 1 h. The input voltage shall be \nincreased at a rate of no more than 5 V/h until the unit fails.\nf.\nIndefinite shorted input control lines (ON/)OFF or DIM control lines) shorted to a high power or an \nAC return line(s) (dependent upon the design approach, a reasonable time shall be specified to simulate indefinite short input).\ng.",
    "g.\nHigh voltage transient in high ambient:  The unit shall operate in 185 °F (85 °C) ambient for 3 h \nthen apply 600 V power line spike at a rate of 60 per minute. Repeat for negative 600 power volt spike.  If no failure occurs, slowly increase the voltage spike level at 50 V increments and repeat until the unit fails.\nh.\nAll electronic components shall be subjected to a Failure Mode and Effects and Criticality",
    "h.\nAll electronic components shall be subjected to a Failure Mode and Effects and Criticality \nAnalysis (FMECA) per MIL-STD-1629A, Notice 2 along with a verification test conducted on the hardware.",
    "## 4.9 Acoustical Noise Test:",
    "The variation of the airplane ballast installation has a significant impact on ballast acoustical noise output.  The acoustical noise can affect the flightcrew performance and be an annoyance to passengers.  For the ballasts installed in the passenger cabin, it is recommended that:",
    "The Sound Power Level (SPL db REF: 10-12) data be obtained after thermal stabilization of the ballast and the ballast is firmly mounted to a .375 thick Graphite or .375 Nomex panel, which is cut in a rectangle 48 in x 12 in.",
    "The mounting plate be supported only at its corners.\n\nThe noise chamber must be noise proof and the wall must be constructed of acoustical noise absorbent material, microphone locations must be one meter radius and at 30° increments in all directions from the ballast.  The SPL shall not exceed the tabulated values when the ballast is connected to its normal lamp load and operated until reaching thermal stabilization.  The following are the recommended values:",
    "Octave Band Center Frequency\nin Hertz\nSound Power Level\ndb REF:  10-12 W\n     250\n35\n     500\n35\n   1000\n35\n   2000\n35\n   4000\n35\n   8000\n35\n16,000\n35",
    "Lampholders -- Lampholders must mechanically lock the lamp pins positively.  Lampholders that only depend on spring pressure tend to arc under intermittent contact during vibration.  Contacts should engage at least three quarters of the diameter of the lamp pins.  Contacts should be gold plated to provide corrosion resistance.  The lampholders should be protected from condensation moisture accumulation.  Hot relamping should be prohibited."
  ]
}