{
  "source": "SAE AS412B 2001 (R 2008).md",
  "chunks": [
    "## Aerospace Standard\n\n| Issued                    | 1948-11   |\n|---------------------------|-----------|\n| Reaffirmed        2008-02 |           |\n| Revised                   | 2001-07   |\n\n## Carbon Monoxide Detector Instruments Foreword\n\nChanges in this Revision are format/editorial only.\n\n## 1. Scope:",
    "Changes in this Revision are format/editorial only.\n\n## 1. Scope:\n\nThis Aeronautical Standard covers the basic type of carbon monoxide detector instrument used to determine toxic concentrations of carbon monoxide by the measurement of heat changes through catalytic oxidation.",
    "1.1\nPurpose:\nTo specify minimum requirements for carbon monoxide detector instruments for use in aircraft, the operation of which may subject the instrument to the environmental conditions specified in Paragraph 3.3.  This standard is not intended to cover fire detectors.\n\n## 2. References:\n\nThere are no referenced publications specified herein.\n\n## 3. General Requirements:",
    "There are no referenced publications specified herein.\n\n## 3. General Requirements:\n\n3.1\nMaterial and Workmanship:\n3.1.1\nMaterials: Materials shall be of a quality which experience and/or tests have demonstrated to be \nsuitable and dependable for use in aircraft instruments.\n3.1.2\nWorkmanship: Workmanship shall be consistent with high grade aircraft instrument manufacturing \npractice.",
    "TO PLACE A DOCUMENT ORDER: \n                             Tel:        877-606-7323 (inside USA and Canada) \n                             Tel:        724-776-4970 (outside USA) \n                             Fax:       724-776-0790 \n                             Email:    CustomerService@sae.org \nSAE WEB ADDRESS: \n                              \n                             http://www.sae.org\n\n## 3.2 Identification:",
    "## 3.2 Identification:\n\nThe following information shall be legibly and permanently marked on the instrument or attached thereto:\n\n(a) Name of instrument (Carbon Monoxide Detector) (b) SAE Aeronautical Standard AS412B (c) Manufacturer's part number (d) Manufacturer's serial number of date of manufacture\n(e) Manufacturer's name and/or trademark\n(f) Rating\n\n## 3.3 Environmental Conditions:",
    "## 3.3 Environmental Conditions:\n\nThe following conditions have been established as design requirements only.  Tests shall be conducted as specified in Sections 5, 6, and 7.\n\n--``,`,,,```,,,`,,`,```,```,```-`-`,,`,,`,`,,`---",
    "--``,`,,,```,,,`,,`,```,```,```-`-`,,`,,`,`,,`---\n\n3.3.1\nTemperature: When installed in accordance with the instrument manufacturer's instructions, the \ninstrument shall function over the range of ambient temperature indicated in Column A below, and shall not be adversely affected by exposure to the temperatures shown in Column B below.\n\nInstrument Location\n  A\n  B\nHeated Areas (Temp. controlled)\n-30 to 50 °C\n-65 to 70 °C\nUnheated Areas (Temp. uncontrolled)\n-55 to 70 °C\n-65 to 70 °C",
    "3.3.2\nHumidity: The instrument shall function and shall not be adversely affected when exposed to any \nrelative humidity in the range from 0 to 95 percent at a temperature of approximately 32 °C.\n3.3.3\nAltitude: The instrument shall function and not be adversely affected when subjected to a pressure \nand temperature range equivalent to -1000 feet to 40,000 feet standard altitude except that the \ninstrument temperature shall not be lower than -30 °C.\n3.3.4",
    "instrument temperature shall not be lower than -30 °C.\n3.3.4\nVibration: When installed in accordance with the instrument manufacturer's instructions, the \ninstruments shall function and shall not be adversely affected when subjected to vibrations of the following characteristics:",
    "Maximum Double\nAmplitude\nMaximum\nAcceleration\nType of Instrument Mounting\nCycles/Min\nAirframe Structure Mounted\n300 - 30,000\n.036 inch\n 10 g\nShock Mounted Panel or Shock Mounted Rack\n300 - 3,000\n.020 inch\n1.5 g\n\n## 4. Detail Requirements: 4.1 Design:",
    "## 4. Detail Requirements: 4.1 Design:\n\nThe instrument shall consist of a means for testing air for contamination with carbon monoxide.  It shall include an alarm circuit or control circuit which will indicate the presence of contamination when it reaches a concentration between .005 and .007 percent of carbon monoxide by volume.",
    "4.1.1\nSampling Method: A means shall be incorporated in the design to direct the air sample to the \nsensitive element of the instrument in a positive manner.\n4.2\nIndicating Method:\nThe instrument shall be capable of actuating both visual and aural alarm indicators.\n\n## 4.3 Reliability:",
    "## 4.3 Reliability:\n\nFalse signals (including failure) in the instrument shall not result from variations in flight attitude, from normal amounts of gasoline vapors and dust likely to accumulate in the instrument in normal flight operations, from accelerations encountered in flight or landing, or from variations in voltage (+25 percent, -100 percent of the rated).\n\n## 4.4 Power Variations:",
    "## 4.4 Power Variations:\n\nAll units shall properly function with +10 percent -20 percent variation in DC voltage and/or ±10 \npercent variation in AC voltage and ±5 percent variation in frequency.\n\n## 5. Test Conditions: 5.1 Atmospheric Conditions:",
    "## 5. Test Conditions: 5.1 Atmospheric Conditions:\n\nUnless otherwise specified, all tests required by this Aeronautical Standard shall be conducted at an atmospheric pressure of approximately 29.92 inches of mercury and at an ambient temperature of approximately 22 °C.  When tests are conducted with the atmospheric pressure or the temperature substantially different from these values, allowance shall be made for the variation from the specified conditions.",
    "5.2\nVibration:\n(To minimize friction.)  Unless otherwise specified, all tests for performance may be conducted with the instrument subjected to a vibration of 0.002 to 0.005 inch double amplitude at a frequency of 1500 to 2000 cycles per minute.  The term double amplitude as used herein indicates the total displacement from positive maximum to negative maximum.",
    "5.3\nVibration Equipment:\nVibration equipment shall be used which will provide frequencies and amplitudes consistent with the requirements of Paragraph 3.3.4 with the following characteristics:",
    "5.3.1\nLinear Motion Vibration: Vibration equipment for airframe structure mounted instruments shall be \nsuch as to allow vibration to be applied along each of three mutually perpendicular axes of the test \nspecimen.\n5.3.2\nCircular Motion Vibration: Vibration equipment for shock mounted panel instruments shall be such \nthat a point on the instrument case will describe, in a plane 45° to the horizontal plane, a circle the \ndiameter of which is equal to the double amplitude specified.\n5.4",
    "diameter of which is equal to the double amplitude specified.\n5.4\nPower Conditions:\nUnless otherwise specified, all tests shall be conducted at a power rating recommended by the manufacturer.",
    "5.5\nPosition:\nUnless otherwise specified, all tests shall be conducted with the instrument mounted in its normal operating position.\n\n## 5.6 Air Sample: --``,`,,,```,,,`,,`,```,```,```-`-`,,`,,`,`,,`---\n\nUnless otherwise specified, the air sample shall be air containing 0.0075 percent ±0.0005 percent of carbon monoxide by volume.\n\n## 6. Individual Performance Requirements:",
    "## 6. Individual Performance Requirements:\n\nAll instruments or components of such shall be subjected to whatever tests the manufacturer deems necessary to demonstrate specific compliance with this Aeronautical Standard, including the following requirements where applicable:\n\n## 6.1 Response Time:\n\nThe instrument shall be tested so that, when an air sample per Paragraph 5.6 is introduced, the alarm circuit or control circuit shall be energized within a maximum of 5 minutes.",
    "## 7. Qualification Tests:\n\nAs many instruments as deemed necessary to demonstrate that all instruments will comply with the requirements of this section shall be tested in accordance with the manufacturer's recommendations.\n\n## 7.1 Stability:",
    "The instrument shall be operated continuously for twenty-four hours at room temperature.  At the end of the first and twenty-fourth hour of operation a sample of air, per Paragraph 5.6 shall be introduced into the instrument and the time required for operation of the alarm circuit or control circuit at the end of the twenty-fourth hour shall not exceed that observed at the end of the first hour of this run by more than 30 seconds and in no case shall it exceed the time specified in Paragraph",
    "of this run by more than 30 seconds and in no case shall it exceed the time specified in Paragraph 6.1.",
    "## 7.2 Suction Variation:",
    "The instrument shall be operated continuously by varying the suction from 25 percent below to 25 \npercent above the normal rated suction.  At each of these values a sample of air, per Paragraph 5.6, shall be introduced and the time required for operation of the alarm circuit or control circuit shall not differ from that observed under the normal response time test at normal rated suction, by more than \n±30 seconds, and in no case shall it exceed the time specified in Paragraph 6.1.",
    "## 7.3 Voltage Variations:\n\nThe instrument shall be operated at any voltage within the range of Paragraph 4.4.  The instrument shall then be tested with an air sample, per Paragraph 5.6, and the response time shall not vary from that at the rated by more than ±30 seconds, and in no case shall it exceed the time specified in Paragraph 6.1.\n\n## 7.4 High Temperature:",
    "## 7.4 High Temperature:\n\nThe instrument shall be exposed to a temperature of 60 °C, and at this temperature, the time of response shall not exceed that specified for room temperature by more than 60 seconds, and in no case shall it exceed the time specified in Paragraph 6.1.\n\n--``,`,,,```,,,`,,`,```,```,```-`-`,,`,,`,`,,`---\n\n## 7.5 Low Temperature:",
    "--``,`,,,```,,,`,,`,```,```,```-`-`,,`,,`,`,,`---\n\n## 7.5 Low Temperature:\n\nThe instrument shall be exposed to a temperature of -65 °C for a period of 48 hours, after which it shall be raised to a temperature of -55 °C.  After operating for thirty minutes at a temperature of -55 °C, the rate of response shall not exceed the time specified at room temperature by more than\n60 seconds, and in no case shall it exceed the time specified in Paragraph 6.1.",
    "7.6\nHumidity:\nThe instrument shall be subjected to the conditions specified in Paragraph 3.3.2 for a period of \n10 hours, after which it shall meet the requirements of Paragraph 6.1.\n\n## 7.7 Altitude Effect:",
    "## 7.7 Altitude Effect:\n\n--``,`,,,```,,,`,,`,```,```,```-`-`,,`,,`,`,,`---\nTests shall be conducted at an altitude pressure equivalent to 25,000 feet and under these conditions the time of response shall not be increased by more than 60 seconds over sea level conditions and in no case shall it exceed the time specified in Paragraph 6.1.  The instrument shall then be placed in a pressure altitude equivalent to 40,000 feet and at that pressure tested with air.  No false alarm shall result.",
    "## 7.8 Vibration:",
    "The instrument while operating normally shall be subjected to vibrations of all frequencies within the appropriate range specified in Paragraph 3.3.4 in order to determine if there exists any natural frequencies of any parts that lie within the specified range.  The amplitude used may be any convenient value that does not exceed the maximum double amplitude specified in Paragraph 3.3.4",
    "and such as not to exceed the maximum acceleration specified in Paragraph 3.3.4. The instrument shall then be subjected to vibration at the appropriate maximum double amplitude or maximum acceleration specified in Paragraph 3.3.4 at each of the above determined natural frequencies for a period of three hours.  If no natural frequencies occurred in the appropriate frequency range, the frequencies and double amplitude for this endurance test should be determined from the following table:",
    "Cycles per Minute\nDouble Amplitude\nAirframe Structure Mounted\n3000\n.036\nShock Mounted Panel or Shock Mounted Rack\n3000\n.010\n\n## 7.8   (Continued):",
    "## 7.8   (Continued):\n\nNo damage shall be evident and the instrument shall meet the requirements of Section 6.  During this time no false alarm shall be given.  The time required for a response to a sample while under vibration, per Paragraph 5.6, shall not vary from that observed under normal conditions before the vibration test by more than 60 seconds, and in no case more than the time specified in Paragraph 6.1.\n\n## 7.9 Contamination Tests:",
    "Air contaminated with 100 octane gasoline in concentration of 1000 parts per million by volume shall be passed through the instrument continuously for a period of 2 hours, after which an air sample per Paragraph 5.6 shall be passed through the instrument.  The time shall not exceed that specified in Paragraph 6.1, and during the passage of the gasoline contaminated air through the instrument, no false alarms shall result.  In the event that it is impractical to maintain a vapor concentration of",
    "alarms shall result.  In the event that it is impractical to maintain a vapor concentration of 1000",
    "parts per million, the length of test shall be varied in inverse proportion to the concentration for variations within ±25 percent of the specified concentration."
  ]
}