{
  "source": "SAE ARP5381 2000 R2006.md",
  "chunks": [
    "| Issued     |   2000-10 |\n|------------|-----------|\n| Reaffirmed |       200 |\n| 6          |           |\n| -0         |           |\n| 3          |           |\n\n## Aerospace Recommended Practice Minimum Performance Recommendations For Part 23, 27, And 29 Aircraft Wheels, Brakes, And Wheel And Brake Assemblies 1. Scope:",
    "This Minimum Performance Document defines the testing required for wheels, brakes, and wheel and brake assemblies to be used on civil aircraft certified under 14 Code of Federal Regulations (CFR)",
    "Part 23, 27, and 29. Compliance with this document is recommended to assure that the equipment supplied will meet the intended design function when installed on aircraft. Compliance with this document does not constitute authorization for installation on an aircraft. The combined recommendations of this document provide an acceptable practice, but not the only practice, for obtaining authorization to apply TSO markings on the equipment.",
    "1.1\nApplications:",
    "Compliance with these minimum performance requirements by manufacturers is required as a means of assuring that the equipment will have the capability to satisfactorily perform its intended function(s). Installers and users must properly maintain this equipment to assure its continued safe operation. NOTE: Aircraft operational characteristics and other external influences may affect performance capabilities. Consequently, anticipated aircraft braking performance should be verified by aircraft",
    "capabilities. Consequently, anticipated aircraft braking performance should be verified by aircraft testing.",
    "SAE Technical Standards Board Rules provide that: \"This report is published by SAE to advance the state of technical and engineering sciences.  The use of this report is entirely voluntary, and its applicability and suitability for any particular use, including any patent infringement arising therefrom, is the sole responsibility of the user.\" \n\nTel:        877-606-7323 (inside USA and Canada) \n \nTel:        724-776-4970 (outside USA) \n \nFax:       724-776-0790",
    "## 1.2 Composition Of Equipment:\n\nThe words \"equipment\" or \"brake assembly\" or \"wheel assembly\" as used in this document include all components which form the entire unit. For example, a wheel assembly may include half hub(s), bearings, flange(s), drive keys, heat shields, brake disks, and fuse plugs.  A brake assembly may include backing plate, torque tube, cylinder assemblies, pressure plate, and heat sink.",
    "It should not be inferred from this example that each wheel assembly and brake assembly will necessarily include all or only, the above example components. This will depend on the specific design chosen by the manufacturer.\n\n## 2. References:\n\nAircraft Year Book - Tire and Rim Association, Inc.\n\n## 3. Definitions And Abbreviations:\n\n3.1\nWheel Rated Static Load, S:\nS = Maximum Static Load (Reference 23.731(a), 27.731(b), and 29.731(b) of 14 CFR",
    "3.2\nWheel Rated Inflation Pressure, WRP:\nWRP = Wheel Rated Inflation Pressure (wheel unloaded)\n\n3.3\nWheel Rated Tire Loaded Radius, R:\nR = Static Radius at load \"S\"  for the wheel rated tire size at WRP R is the minimum distance from the axle center line to the ground.\n\n3.4\nWheel Rated Maximum Radial Limit Load, L:\nL = Maximum Radial Limit Load (Reference 23.731(b), 27.731(c), and 29.731(c) of 14 CFR) L is the Wheel Rated Maximum Radial Limit Load (5.2.1).",
    "3.5\nWheel Rated Tire Size(s), TSWR:\nTSWR  = Wheel Rated Tire Size(s) approved for fit to the wheel\n\n3.6\nSuitable Tire (for Wheel Test), TTWT:\nTTWT  = Wheel Rated Tire Type(s) and Size(s) for Wheel Tests TTWT is that which has been determined as being the most appropriate to introduce loads and/or pressure to induce the most severe stresses. The suitable tire may be different for different tests.",
    "3.7\nWheel /Brake Rated Structural Torque, STR:\nSTR = Wheel/Brake Rated Structural Torque STR is the maximum structural torque, demonstrated (5.3.4).\n\n3.8\nWheel/Brake Rated Design Landing Energy, KEDL:\nKEDL = Wheel/Brake Rated Design Landing Energy KEDL is the energy to be absorbed by the wheel/brake/tire assembly during stops performed during the Design Landing Stop test (5.3.2).",
    "3.9\nWheel/Brake Design Landing Speed, VDL:\nVDL = Wheel/Brake Design Landing Speed VDL  is the initial braking speed for a Design Landing Stop (5.3.2).\n\n3.10 Wheel/Brake Accelerate Stop Energy, KERT (for Commuter Category Aircraft):\nKERT = Wheel/Brake Accelerate Stop Energy KERT  is that energy which has been demonstrated in accordance with 5.3.3.",
    "3.11 Wheel/Brake Accelerate Stop Speed, VRT (for Commuter Category Aircraft):\nVRT = Wheel/Brake Accelerate Stop Speed\nVRT is that initial brakes-on speed that has been demonstrated in accordance with 5.3.3.\n\n3.12 Brake Rated Wear Limit,  BRWL (for Commuter Category Aircraft):\nBRWL = Brake maximum wear limit to ensure compliance with 5.3.3.\n\n3.13 Airplane Maximum Rotation Speed, VR:\nVR = Airplane Maximum Rotation Speed\n\n## 3.14 Brake Rated Metered Operating Pressure, Bropmax:",
    "## 3.14 Brake Rated Metered Operating Pressure, Bropmax:\n\nBROP = Brake Rated Metered Operating Pressure\nBROP is the maximum pressure that is available to the brake from the metering device in normal operation.\n\n## 3.15 Brake Rated Maximum Pressure, Brpmax:\n\nBRPMAX = Brake Rated Maximum Pressure\nBRPMAX is the maximum pressure that the brake is designed to accommodate from the metering device.\n\n## 3.16 Brake Rated Minimum Slope Pressure,  Brsp20:",
    "## 3.16 Brake Rated Minimum Slope Pressure,  Brsp20:\n\nBRSP20 = Brake Rated Minimum Slope Pressure \nBRSP20  is the minimum pressure required to hold the aircraft on a 20° slope at  the aircraft design takeoff weight.\n\n## 3.17 Brake Rated  Retract  Pressure, Brpret:\n\nBRPRET = Brake Rated Retract Pressure\nBRPRET is the greatest pressure that brake piston retraction to the un-pressureized position is assured.",
    "3.18 Brake Rated  Maximum Parking Pressure, BRPPMAX:\nBRPPMAX = Brake Rated Maximum Parking Pressure\nBRPPMAX is the maximum pressure that the brake is designed to accommodate from the parking valve.\n\n## 3.19 Brake Rated Design Landing Pressure, Brpdl:\n\nBRPDL = Brake Rated Design Landing Pressure\nBRPDL is the average of the peak brake pressures required to accomplish the Design Landing Test.\n\n## 3.20 Rated Design Landing Deceleration, Ddl: Ddl = Rated Design Landing Deceleration",
    "## 3.20 Rated Design Landing Deceleration, Ddl: Ddl = Rated Design Landing Deceleration\n\nDDL is the minimum of the mean flywheel distance averaged deceleration values demonstrated during the 100 KEDL stops of 5.3.2.\n\n3.21 Rated Accelerate Stop Deceleration, DRT (for Commuter Category Aircraft):\nDRT = Rated Accelerate Stop Deceleration DRT is the mean flywheel distance averaged deceleration that the wheel-tire and brake assembly will produce when absorbing KERT.",
    "3.22 Distance Averaged Deceleration, D:\nD = ((Initial brakes-on speed)2 - (Final brakes-on speed)2)/(2 x braked flywheel distance))\nD is the distance averaged deceleration to be used in all deceleration calculations.\n\n3.23 Time, (s):\ns = Measurement of time, in seconds\n\n3.24 Wheel/Brake Energy:\nReferences to wheel/brake energy refer to the energy absorbed by the tire, wheel and brake assembly, unless specifically stated otherwise.",
    "3.25 Brake Lining:\nBrake lining is individual blocks of wearable material, discs that have wearable material integrally bonded to them, or discs that have wearable material as an integral part of the disc structure.\n\n3.26 Heat Sink:\nThe heat sink is the part of the brake that is primarily responsible for absorbing kinetic energy  during a stop.  The heat sink typically consists of the stationary and rotating disc assemblies. \n\n## 4. General Design Specifications:",
    "## 4. General Design Specifications:\n\n4.1\nDesign:\nUnless shown to be unnecessary, the equipment shall comply with the following:",
    "4.1.1\nBearing Lubricant Retainers: Lubricant retainers must retain the lubricant under all operating conditions, prevent the lubricant from reaching braking surfaces, and prevent foreign matter from entering the bearings.\n4.1.2\nRemovable Flanges: All removable flanges must be assembled onto the wheel in a manner that will prevent the removable flanges and retaining devices from leaving the wheel if a tire should deflate while the wheel is rolling.\n4.1.3",
    "4.1.3\nAdjustment: Suitable adjustment device(s) shall be considered to maintain appropriate running \nclearance when subjected to brake rated retract pressure (BRPRET).  Adjusting devices are \nrecommended for brake designs intended for use on Commuter Category aircraft.\n4.1.4",
    "recommended for brake designs intended for use on Commuter Category aircraft.\n4.1.4\nWater Seal: Wheels intended for use on amphibious airplanes must be sealed to prevent entrance of water into the wheel bearings or other portions of the wheel or brake, unless the design is such that brake action and service life will not be impaired by the presence of sea water or fresh water.\n4.1.5\nBurst Prevention: Means shall be considered to prevent wheel and tire explosions and/or bursts,",
    "Burst Prevention: Means shall be considered to prevent wheel and tire explosions and/or bursts, \nwhich might otherwise result from over pressurization or elevated brake temperatures. Explosion/ burst protection devices should be used and are recommended for brake designs intended for \nCommuter Category aircraft. \n4.1.6",
    "Commuter Category aircraft. \n4.1.6\nWheel Rim and Inflation Valve: The rim dimensions and standard inflation valves are available from the Tire and Rim Association and other standards organizations. (Reference: Aircraft Year \nBook - Tire and Rim Association Inc.).\n4.1.7\nBrake Piston Retention: Means shall be considered to prevent the actuation system from allowing \nhydraulic fluid to escape if the limits of piston travel are reached. Piston retention mechanisms are",
    "recommended for brakes that are intended for use on Commuter Category aircraft.\n4.1.8\nWear Measurement/Indicator: A reliable method shall be provided for determining when the heat \nsink is worn to it's minimum limit. \n4.1.9\nWheel Bearings: When the inboard and outboard bearings of a wheel are not fully \ninterchangeable, consideration should be given to preclude mis-assembly of wheel bearings.\n4.1.10 Fatigue: The design of the wheel should take into account techniques used to improve fatigue",
    "resistance of critical areas of the wheel and minimize the effect of the expected corrosion and temperature environment.\n4.1.11 Dissimilar Metals: If dissimilar metals are used adequate protection must be provided to prevent \nelectrolytic action.  In addition, the differential effect of thermal expansion should not unduly affect the static strength and fatigue life.\n4.2\nConstruction:\n4.2.1",
    "4.2\nConstruction:\n4.2.1\nCastings: Castings must be of high quality, clean, sound, and free from blowholes, porosity, or surface defects caused by inclusions, except that loose sand or entrapped gases may be allowed when the serviceability is not impaired. Minor surface imperfections may be removed if strength and serviceability are not impaired.\n4.2.2",
    "4.2.2\nForgings: Forgings must be of uniform condition, free from blisters, fins, folds, seams, laps, cracks, segregation, and other imperfections. Minor surface imperfections may be removed if strength and serviceability are not impaired.\n4.2.3",
    "4.2.3\nRim Joints and Surfaces: Wheels designed for use with a tire and tube combination, shall be free from defects on the rim surface between bead seats that would be injurious to the tube or casing while mounting the tire or while in service. Rim surfaces, joints between rim surfaces, and/or demountable flanges shall be smooth, close fitting, and non-injurious to the tube while mounting the tire or while in service\n4.2.4",
    "4.2.4\nRivets and Bolts: When rivets are used, they must be properly headed over, and rivets or bolts coming in contact with the casing or tube must be smooth to avoid damage to the tube or casing during normal operation.\n4.2.5\nBolts and Studs: When bolts or studs are used for fastening together sections of a wheel or brake \nthe length of the threads must be sufficient to fully engage the nut, including its locking feature, and",
    "there must be sufficient un-threaded bearing area to carry the required load.\n4.2.6\nSteel and Aluminum Parts: The corrosion protection system(s) should be compatible with the \nexpected environment. All aluminum alloy parts must be anodized or have equivalent corrosion \nprotection.  This corrosion protection should include all holes and passages.\n4.2.7\nMagnesium Parts: All magnesium alloy parts should receive a suitable dichromate treatment or",
    "4.2.7\nMagnesium Parts: All magnesium alloy parts should receive a suitable dichromate treatment or \nhave equivalent protection from corrosion.  This protection includes fuse plug holes, valve stem holes, and other passages.\n4.2.8\nBearing and Braking Surfaces: The bearings and braking surfaces must be preserved during the application of finish to wheels and brakes.",
    "## 4.3 Marking:\n\nWheel assemblies and brake assemblies must be legibly and permanently marked with the following:\n\na.\nName of manufacturer\nb.\nDate of manufacture, if not included in serial number\nc.\nPart number\nd.\nTSO C26d\ne.\nWheel size (this marking applies to wheels only)\nAll stamped, etched, or embossed markings must be located in non-critical areas.\n\n## 5. Minimum Performance Under Standard Test Conditions: 5.1 Introduction:",
    "## 5. Minimum Performance Under Standard Test Conditions: 5.1 Introduction:\n\nThe test conditions and performance criteria described in this section provide a laboratory means of obtaining TSO-C26d approval.\n\n## 5.2 Wheel Tests:\n\nTo establish the ratings for a wheel, it shall be substantiated that standard production wheel samples will meet the following radial load, combined load, roll load and pressure test requirements.",
    "For all tests the wheel shall be fitted with a suitable tire (TTWT) and wheel loads applied through the tire or appropriate loading block when applicable.",
    "5.2.1\nRadial Load Tests: If the radial limit load of 5.2.2 is equal to or greater than the radial limit load of \nthis paragraph, the test specified in this paragraph may be omitted.  Test the wheel for yield and ultimate loads as follows.\n5.2.1.1\nTest Method: Mount the wheel, with a suitable tire of proper fit installed, on its axle, and position \nit against a flat non-deflecting surface.",
    "it against a flat non-deflecting surface.\nThe wheel axle must have the same angular orientation to the non-deflecting surface that it will have to the runway when it is mounted on the airplane and is under maximum limit load (L). Inflate the tire to the pressure recommended for the Wheel Rated Static Load (S) with gas and/or liquid.",
    "If liquid inflation is used, this must be bled off to obtain the same tire deflection that would result if gas inflation were used.\n\nLiquid pressure should not exceed the pressure that would develop if gas inflation were used, and the tire deflected to its maximum extent.  Load the wheel through its axle perpendicular to the flat non-deflecting surface.  Deflection readings must be taken at suitable points to indicate deflection and permanent set of the wheel rim at the bead seat.",
    "5.2.1.2\nYield Load: Apply to the wheel a load not less than 1.15 times the maximum radial limit load (L) determined under §§ 23.471 through 23.511 or §§ 27.471 through 27.505, or §§ 29.471 through 29.511 of 14 CFR, as appropriate.",
    "Determine the most critical wheel orientation with respect to the non-deflecting surface. Apply the load with the tire loaded against the non-deflecting surface, and with the wheel  rotated 90° with respect to the  most critical orientation. Repeat the loading with the most critical orientation positioned at 180°, 270° and 0° from the non-deflecting surface.",
    "## The Bearing Cups, Cones, And Rollers Used In Operation Must Be Used For These Loadings.",
    "Three successive loadings at the 0° position must not cause permanent set increments of increasing magnitude.  The permanent set increment caused by the last loading at the 0° position may not exceed 5% of the deflection caused by that loading or 0.005 in (0.125 mm), whichever is greater.  There must be no yielding of the wheel that results in loose bearing cups, gas or liquid leakage through the wheel or past the wheel seal, or interference in any critical areas.",
    "5.2.1.3\nUltimate Load: Apply to the wheel a load not less than 2.0 times the maximum radial limit load (L) for castings and 1.5 times the maximum radial limit load (L) for forgings, determined under §§ 23.471 through 23.511 or §§ 27.471 through 27.505 or §§ 29.471 through 29.511 of 14 CFR, as appropriate.",
    "Apply the load with the same wheel and tire loaded against the non-deflecting surface and most critical orientation positioned at 0° with respect to the line between the center of the wheel and the point of contact.  The bearing cones may be replaced with conical bushings; however, the cups used in operation must be used for this loading.  If, at a point of loading during the test, it is shown that the tire will not successfully maintain pressure or if bottoming of the tire on the nondeflecting",
    "the tire will not successfully maintain pressure or if bottoming of the tire on the nondeflecting surface occurs, the tire pressure may be increased.  If bottoming of the tire continues to occur with the increased pressure, a loading block, which fits between the rim flanges and simulates the load transfer of the inflated tire may be used.  The arc of wheel supported by the loading block must be no greater than 60°.",
    "The wheel must support the load without failure for at least 3 s. Abrupt loss of load carrying capability or fragmentation during test constitutes failure.\n\nIf the radial limit load in 5.2.2 is equal to or greater than the radial limit load in 5.2.1, the tests specified in 5.2.1 may be omitted.",
    "5.2.2\nCombined Radial and Side Load Test: Test the wheel for the yield and ultimate loads as follows:\n5.2.2.1\nTest Method: Mount the wheel, with a suitable tire of proper fit installed, on its axle, and position \nit against a flat non-deflecting surface.  The wheel axle must have the same angular orientation",
    "it against a flat non-deflecting surface.  The wheel axle must have the same angular orientation \nto the non-deflecting surface that it will have to the runway when it is mounted on the aircraft and under the combined radial and side load.  Inflate the tire to the pressure recommended for the \nmaximum static load with gas and/or liquid.",
    "If liquid inflation is used, this must be bled off to obtain the same tire deflection that would result if gas inflation were used. Liquid pressure must not exceed the pressure that would develop if gas inflation were used and the tire deflected to its maximum extent. For the radial load component, load the wheel through its axle perpendicular to the flat non-deflecting surface. For the side load component, load the wheel through its axle parallel to the flat non-deflecting surface. The side",
    "component, load the wheel through its axle parallel to the flat non-deflecting surface. The side load component should arise from the friction of the tire or the loading block on the non-deflecting surface. Apply the two loads simultaneously, increasing them continuously or in increments no larger than 10% of the loads to be applied. (Applicable after 75% of the required loads have been reached.) If it is impossible to generate the side load, due to friction limitations, it shall be permissible",
    "If it is impossible to generate the side load, due to friction limitations, it shall be permissible to increase the radial load, or apply a portion of the side load directly to the tire/wheel.  In such circumstances it must be demonstrated that the moment resulting from the side load is no less severe than would otherwise have occurred.",
    "## 5.2.2.1   (Continued):\n\nAlternately, the resultant load equivalent to the radial and side loads may be applied to the axle. Deflection readings must be taken at suitable points to indicate deflection and permanent set of the wheel rim at the bead seat.",
    "5.2.2.2\nCombined Yield Load: Apply to the wheel radial and side loads not less than 1.15 times the respective ground loads determined under §§ 23.485, 23.497, and 23.499, or § 27.485 and § 27.497, or §§ 29.485 and 29.497 of 14 CFR, as appropriate.",
    "Apply these loads with the tire loaded against the non-deflecting surface and the wheel with the most critical orientation positioned at 90° with respect to the line between the center of the wheel and the point of contact.  Repeat the loading with the most critical orientation positioned at 180°, \n270°, and 0° from the non-deflecting surface.  The bearing cups, cones, and rollers used in operation must be used in this test.",
    "A tire with a tube fitted may be used when testing with a \"tubeless\" tire only after it has been demonstrated that pressure will be lost due to the inability of a tire bead to remain properly positioned under the load.  The wheel must be tested for the most critical inboard and outboard side loads.",
    "Three successive loadings at the 0° position must not cause permanent set increments of increasing magnitude.  The permanent set increment caused by the last loading at the 0° position must not exceed 5% of the deflection caused by that loading or 0.005 in (0.125 mm) whichever is greater.  There must be no yielding of the wheel that would result in loose bearing cups, gas or liquid leakage through the wheel or past the wheel seal.  There shall be no interference in any critical area between the",
    "the wheel or past the wheel seal.  There shall be no interference in any critical area between the wheel and brake assembly, or between the most critical deflected tire and brake (with fittings) up to limit load conditions, taking into account the axle flexibility.  Lack of interferences can be established by analysis and/or tests.",
    "5.2.2.3\nCombined Ultimate Load: Apply to the wheel radial and side load not less than 2.0 times for castings and 1.5 times for forgings the respective ground limit loads determined under §§ 23.485, 23.497, and 23.499, or §§ 27.485 and 27.497, or §§ 29.485 and 29.497 of 14 CFR, as appropriate.",
    "Apply these loads with the same wheel, and tire loaded against the non-deflecting surface and the most critical orientation positioned at 0° with respect to the center of the wheel and the point of contact.  The bearing cones may be replaced with conical bushings; however, the cups used in operation must be used for this loading. If, at a point of loading during the test, it is shown that the tire will not successfully maintain pressure; or if bottoming of the tire occurs, the tire pressure may",
    "will not successfully maintain pressure; or if bottoming of the tire occurs, the tire pressure may be increased.  If bottoming of the tire continues to occur with this increased pressure, a loading block that fits between the rim flanges and simulates the load transfer of the inflated tire may be used.  The arc of wheel supported by the loading block must be no greater than 60°.",
    "## 5.2.2.3    (Continued):\n\nThe wheel must support the load without failure for at least 3 s. Abrupt loss of load carrying capability or fragmentation during test constitutes failure.\n\n## 5.2.3 Wheel Roll Test:",
    "5.2.3.1 Test Method: Mount the wheel, with a suitable tire of proper fit installed, on its axle and position it \nagainst a flat non-deflecting surface or a flywheel.  The angle of the wheel axle relative to the load surface must be representative of the orientation to the load surface that it will have to a flat \nrunway when it is mounted on the aircraft and is under the maximum static load.",
    "runway when it is mounted on the aircraft and is under the maximum static load.\nDuring the roll test the tire pressure shall be not less than 1.10 times wheel rated inflation pressure (WRP) for airplanes and 1.12 times wheel rated inflation pressure (WRP) for rotorcraft to account for temperature rise and loaded tire pressure factors.",
    "The radial load must be applied to the wheel through the axle and perpendicular to the load surface.\n\nThe wheel must be tested under the maximum static load (S) for a distance of 1000 miles for Part \n23 aircraft and 500 miles for Parts 27 and 29 rotorcraft.\n\nAt the end of the test the wheel must have no cracks, there must be no leakage through the wheel or past the wheel seal, and the bearing cups must not be loosened in the hubs.",
    "5.2.3.2\nOverpressure Test: The wheel must be tested to withstand without failure for at least 3 s \napplication of an overpressure factor not less than 3.5 times the wheel rated inflation pressure (WRP). Plugs may be used at over inflation protection device locations to conduct this test.\n5.2.3.3",
    "5.2.3.3\nDiffusion Test: The tubeless tire and wheel assembly must hold the wheel rated inflation pressure (WRP) for 24 h with no greater pressure drop than 5%.  This test must be performed after the tire growth has stabilized.",
    "## 5.3 Wheel And Brake Assembly Tests:",
    "5.3.1\nGeneral:\n5.3.1.1\nThe wheel and brake assembly shall be tested, with a suitable tire (TTWT) fitted, on a testing \nmachine in accordance with the following and 5.3.2.\n5.3.1.2\nFor tests detailed in 5.3.2, the test energy (KEDL) and brake application speed (VDL) must comply \nwith § 23.735 of 14 CFR as appropriate, at a minimum. (Higher energy and speed combinations may be specified which encompass compliance with applicable regulations.)\n5.3.1.3",
    "5.3.1.3\nFor tests detailed in 5.3.2 the initial brake application speed shall be as close as practicable to that established in accordance with 5.3.1.2.\n5.3.1.4\nThe brake assembly must be tested using the operating medium specified for use on the aircraft.\n5.3.2\nDesign Landing Test:\n5.3.2.1\nThe wheel/brake/tire assembly under test for Part 23 aircraft must complete 100 design landing \nstops at a mean deceleration (D) not less than 10ft/s2 (3.05 m/s2).",
    "stops at a mean deceleration (D) not less than 10ft/s2 (3.05 m/s2).\nThe wheel/brake/tire assembly under test for Part 27 or 29 aircraft must complete 20 design landing stops at a mean deceleration not less than 6ft/s2 (1.83 m/s2).",
    "The maximum brake pressure used for the 100-stop condition for airplane and the 20-stop condition for rotorcraft shall not be more than the brake rated metered operating pressure \n(BROPMAX ).",
    "5.3.2.2\nDuring the 100 stop design-landing test (KEDL), for Part 23 aircraft, one change of the individual \nor integrally bonded brake lining is permissible.  For discs using integrally bonded wearable \nmaterial one change is permitted, provided that the disc support structure is not intended for \nreuse. The remainder of the brake assembly parts must withstand the 100 KEDL stops without \nfailure or impairment of operation. Change of carbon brake discs or carbon disc assemblies is not",
    "failure or impairment of operation. Change of carbon brake discs or carbon disc assemblies is not \npermissible.   Tire changes are permissible to replace worn or deteriorated tires. Lining change is \nnot permitted during the 20 stop test (KEDL) for Part 27 and 29 rotorcraft.\n5.3.3\nAccelerate Stop Test (for Commuter Category Aircraft):\n5.3.3.1\nA test shall be defined for Commuter Category aircraft brakes to meet the requirements of an",
    "A test shall be defined for Commuter Category aircraft brakes to meet the requirements of an \naccelerate- stop condition. The mean deceleration (D) for this test shall not be less than 6 ft/s2 \n(1.83 m/s2).",
    "## Guidance Material\n\nThis test is recommended to encompass actual aircraft conditions and establish a worn brake energy value for the wheel/brake assembly using:",
    "a.\nThe brake rated metered operating pressure (BROPMAX).\nor\nb.\nThe maximum brake pressure consistent with the aircraft's scheduled braking pressure limitations taking account of the maximum predicted tire/runway friction coefficient based on substantiated data.\n5.3.3.2\nFor the accelerate stop test, the tire, wheel and brake assembly must be capable of absorbing \nthe test energy (KERT) throughout the entire defined usable wear range of the heat sink elements",
    "(as determined by the means provided to comply with 4.1.8). It is recommended that the accelerate stop test be carried out on a fully worn brake (e.g.,  the heat sink wear indicator is at the minimum allowed position).  The proportioning of wear through the brake for the various friction pairs for this test should be based on service wear experience of an equivalent or similar brake or test machine wear test data.  Either operationally worn or mechanically worn brake components may be used.  If",
    "wear test data.  Either operationally worn or mechanically worn brake components may be used.  If mechanically worn components are used, it must be shown that they can be expected to provide similar results to operationally worn components.",
    "5.3.3.3\nThree (3) 20 to 0 knot taxi stops applied within 10 min shall be followed by the accelerate stop of \n5.3.3.4.  The accelerate stop of 5.3.3.4 must be initiated within 10 min after the conclusion of the \nlast taxi stop.  Deceleration for the taxi stops shall not be less than 6 ft/s2 (1.83 m/s2).  Heat sink \ntemperatures shall be recorded prior to taxi and accelerate stops.\n5.3.3.4\nA full stop demonstration is not required for the worn brake accelerate-stop test.  The test brake",
    "A full stop demonstration is not required for the worn brake accelerate-stop test.  The test brake \npressure may be released at a test machine speed of up to 20 knots.  In this case the test parameters must be adjusted such that the energy absorbed by the tire, wheel and brake during \nthe test is not less than the energy absorbed if the test had commenced at the specified speed \nand continued to zero ground speed.\n5.3.3.5",
    "and continued to zero ground speed.\n5.3.3.5\nWithin 20 s of completion of the stop, or brake pressure release in accordance with 5.3.3.4, the \nbrake pressure shall be adjusted to the brake rated maximum parking pressure (BRPPMAX) and \nmaintained for 3 min.",
    "maintained for 3 min.\nNo sustained fire that extends above the level of the highest point of the tire is allowed before 5 min have elapsed after application of parking brake pressure; until this time has elapsed neither fire fighting means nor artificial coolants shall be applied.",
    "The time when the first fuse plug operates, if applicable, is to be recorded. The sequence of events described in 5.3.3.4 and 5.3.3.5. are illustrated in Figure 1.\n\n## 5.3.4 Structural Torque Test:",
    "5.3.4.1\nApply wheel rated radial load (S) and the torque load specified in 5.3.4.2 or 5.3.4.3, as applicable, for at least 3 s.  Rotation of the wheel must be resisted by a reaction force transmitted through the brake, or brakes, by an application of at least brake rated maximum  pressure \n(BRPMAX), or equivalent.  If such pressure or its equivalent is insufficient to prevent rotation, the",
    "friction surface may be clamped, bolted, or otherwise restrained while applying the pressure. The brake wear condition imposing the greatest wheel load shall be used for this test. \n5.3.4.2\nFor landing gears with only one wheel per landing gear strut, the torque load is 1.2 x  wheel rated radial load (S) x wheel rated tire loaded radius (R).\n5.3.4.3",
    "5.3.4.3\nFor landing gears with multiple wheels per landing gear strut, the torque load is 1.44 x wheel rated radial load (S) x  wheel rated tire loaded radius (R).",
    "## 5.4 Brake Tests:\n\nIt shall be substantiated that standard production samples of the brake will meet the following tests:",
    "5.4.1\nOverpressure Test: The brake with actuator pistons extended to simulate a maximum worn \ncondition must withstand hydraulic pressure for at least 3 s, equal to the following: a.\nFor airplanes, 2.0 times the brake rated maximum pressure (BRPMAX).\nb.\nFor rotor craft, 2.0 times the brake rated minimum slope pressure (BRSP20 ) or 2.0 times the brake rated maximum pressure (BRPMAX ) whichever is greater.\n5.4.2",
    "5.4.2\nEndurance Test: A brake assembly must be subjected to an endurance test during which malfunction may not occur.  If desired, the heat sink components may be replaced by a reasonably representative dummy mass for this test.",
    "For airplanes, the test must be conducted by subjecting the brake assembly to 100,000 cycles of application and release of the brake rated design landing pressure (BRPDL ). The pistons shall be adjusted so that 25,000 cycles are performed at each of the four positions where the pistons would be at rest when adjusted for 25, 50, 75, and 100% of the wear limit. The brake shall also be subjected to 5000 cycles of the brake rated maximum pressure (BRPMAX).",
    "For rotorcraft, 50,000 cycles of application and release of brake rated design landing pressure \n(BRPDL) are required with 12,500 cycles at each wear limit position. The brake should then be subjected to 2500 cycles of the brake rated maximum pressure (BRPMAX)\n\n5.4.2    (Continued):\nLeakage at static seals shall not exceed a trace. Leakage at moving seals shall not exceed one drop per inch of peripheral length at each condition of wear limit or 5 cc total.",
    "5.4.3\nPiston Retention: If included in the design, positively retained hydraulic pistons shall be retained \nwithout leakage at 1.5 times brake rated maximum pressure (BRPMAX)  for 10 s with the heat sink \nremoved.\n5.4.4\nLeakage Tests (Hydraulic Brakes): The brake shall be subjected to an operating pressure equal to \n1.5 times brake rated maximum pressure (BRPMAX ) for 5 min.  The brake pressure shall then be",
    "1.5 times brake rated maximum pressure (BRPMAX ) for 5 min.  The brake pressure shall then be \nadjusted to an operating pressure of 5 psig (35 kPa) for 5 min.  There shall be less than one drop \nleakage per seal and no permanent set of the structural components during this test.",
    "## 6. Data Requirement: 6.1 Data Submitted:\n\nFor any application for approval of equipment, the manufacturer shall supply the following data:",
    "6.1.1\nThe following wheel and brake assembly ratings:\na.\nWheel Ratings Wheel Rated Static Load, S\nWheel Rated Inflation Pressure, WRP Wheel Rated Tire Loaded Radius, R\nWheel Rated Maximum Radial  Limit Load, L\nWheel Rated Tire Size(s), TSWR\nb.\nWheel/Brake and Brake Ratings\nWheel/Brake Rated Design Landing Energy, KEDL & associated brakes on speed, VDL\nWheel/Brake Rated Accelerated Stop Energy, KERT & associated brakes on speed, VRT  (for Commuter Category Aircraft)",
    "Brake Rated Metered Operating Pressure, BROPMAX\nBrake Rated Maximum Pressure BRPMAX \nBrake Rated Minimum Slope Pressure, BRSP20  (for Rotorcraft)\nBrake Rated Retract Pressure, BRPRET\nBrake Rated  Maximum Parking Pressure BRPPMAX Brake Rated Design Landing Pressure , BRPDL\nBrake Rated Wear Limit, BRWL (for Commuter Category Aircraft)\nWheel/Brake Rated Structural Torque, STR\nRated Design Landing Deceleration, DDL\nRated Accelerate Stop Deceleration, DRT  (for Commuter Category Aircraft)",
    "6.1.2\nThe weight of the wheel or brake, as applicable.\n6.1.3\nType of hydraulic fluid used (for brakes).\n6.1.4\nOne copy of the documentation to show compliance with the test requirements. NOTE: When test results are being recorded for incorporation in the type test report, it is not \nsufficient to note merely that the specified performance was achieved.  Except where tests are obviously GO/NO GO in character (e.g., the determination of whether mechanical",
    "devices function correctly) the actual numerical values obtained for each of the parameters tested shall be recorded."
  ]
}