{
  "source": "SAE AMS2770 1974.md",
  "chunks": [
    "'SS~ed s-1-'4 \nTWO PENN9VLVANIA GLAiA. N!W YOFK, N.V. 10001 \t\nRCVISBY \n\n## Heat Treatment Of Aluminum And Aluminum-Base Alloys L, Scope:\n\n1.1 Purpose: This specification covers the engineering requirements for the thermal treatment of aluminum-base alloy parts. \n1.2 Application: To produce conditions favorable to the forming of parts by annealing or by solution heat \ntreating, quenching, and refrigerating; or to strengthen parts by solution and precipitation heat treatment.",
    "d~ u \nd \nm va \n00a \n ' \n \nc._ ~ \nv~d \ny mL \n~vono \n~.~« \n~ O T \nQ on \nn \nd E 10 \n~~ ~ \n,,cE \n0 \nL o u \n~ « L \n,; \n~ 3 \n~ v~ \noEc \nT~ « \n,°~En \n\n2. \nAPPLICABLE DOCUMENTS: The following publications form a part of this specification to the extent \nspecified herein. The latest issue of Aerospace Material Specifications (AMS) shall apply. The applicable issue of other documents sha11 be as specified in AMS 2350. \n\nq°uv \n~oM \nc~ \nAD \nV\" \n~~ a \nY \nA O c \n~ddm \n~ ~ y « N \nE~ma \nEqNo \nyD ~ C",
    "q°uv \n~oM \nc~ \nAD \nV\" \n~~ a \nY \nA O c \n~ddm \n~ ~ y « N \nE~ma \nEqNo \nyD ~ C \n\n2.1 \nSAE Publications: Available from Society of Automotive Engineers, Inc. , Two Pennsylvania Plaza, \nNew York, New York 10001. \n\n` v.~ E \n~d~m \n:.E=c \n\n2.1.1 Aerospace Material Specifications: \nAMS 2350 - Standards and Test Methods \n\nn O N.~ \n~d~o \n~_~; \n~~ \noc \nA \ncV= \nn;°. NN \n \nq N = C",
    "n O N.~ \n~d~o \n~_~; \n~~ \noc \nA \ncV= \nn;°. NN \n \nq N = C \n\n2.2 ASTM Publications: Available from American Society for Testing and Materials, 1916 Race Street, \nPhiladelphia, Pennsylvania 19103. \nASTM B557 - Tension Testing Wrought and Cast Aluminum and Magnesium Alloy Products \n\n## 3. Technical Requirements:\n\n°.ymm A \t\nN \nD T~ \n N \nC C q ~ \n~qod Noma pp y ar E C~.wL \nad ~ \n~v'^m uo~c c \n.~, od u \n\n## 3.1 Equipment: 3.1.1 Ftzrnaces:",
    "3.1.1.1 \nGeneral: Furnaces shall be of an acceptable type such as air, molten salt bath, oil bath, or \nfluidized bed. Temperature in the furnace shall be controlled as in 3.1,1, 2. The products of \ncombustion or superheated steam should be excluded from contact with the material in the charge \nElectrical heating elements and radiant tubes sha11 be shielded to prevent direct radiation from \nstriking any part of the furnace charge. Salt baths shall be of a composition and maintained in",
    "striking any part of the furnace charge. Salt baths shall be of a composition and maintained in \nsuch condition as to prevent attack of the alloys in the charge.",
    "ti ~ ~ o \n  d \nnE~° \nddc \n  ~ L ~ \n    V \nU \n  A \n    r a \n•~ ~ mN \nt \n  < < C \nM\n  N j O \n  ` O ~ \n=dnv \na~q~ \n    a~ \nr \n  W q ~ \n    m \nd<<d \nv?., \n>omy \no>;~ \no`E \nN \t\n       ~ \nd ~+ ti N \n` d C N \n       N \nCNL.'r~ \n       d \nAdo> \no~o- \nm q W ~ \n\nu O ~ O \n~ ~L \n     a \nd ~ V \n      ~ \n    d \nW~a~ \n      A \nN ~ N E",
    "CAUTION: Sa1t baths containing mixtures of nitrates are hazardous under certain \nconditions. Explosive reactions with magnesium may occur if alloys such as 5056, \n5456, and 520. 0(220), containing appreciable amounts of magnesium, are placed in \nthe molten bath. Aluminum-base alloy parts lost or allowed to remain in the sludge \nin the bottom of the tank may start a thermit reaction and overheat the bath. Above",
    "in the bottom of the tank may start a thermit reaction and overheat the bath. Above \n1100° F(593° C), either at locally overheated points or throughout the bath, the salt \nbegins to decompose with emission of corrosive and toxic fumes and at higher tem- \nperatures may detonate. Contamination with soot, graphite, cyanide, oil, and other \noxidizable substances may cause similar reactions. Therefore, salt baths shall be",
    "oxidizable substances may cause similar reactions. Therefore, salt baths shall be \noperated below 1050° F(566° C) and sludge accumulation sha11 be removed frequently \nto keep the bath free of contamination and loose parts.",
    "3.1.1.2 Thermocouples: At least one thermocouple shall be located in E;ach control zone. Each furnace \nshall have a minimum of two load thermocouples, one each at the hottest and coldest locations in the \nwork zone as determined by furnace survey. Each container of rivets or sma11 parts shall have a \nthermocouple buried in the center of the load. Load thermocouples shall be attached to the heaviest",
    "section in the load, or peened into a load test block of the same thici~ess. Other thermocouples \nshall be located as required to control uniformity of heating. \n3.1. 2 Temperature Controllers: Furnace temperature shall be controllf~d by potentiometric control and recording instruments accurate to +2° F L 1,1° C). Multipoint recorders sha11 show the temperature of",
    "each thermocouple by clearly legibie indications at least once each 5 min. , or six times during each heating period, whichever requires the faster printing speed. Control thermocouples sha11 be Iocated as close as practicable to the work zone. The controls shall main~tain a11 points in the work zone within",
    "the specified temperature range after recovery of the coldest thermocouple to the minimum of the speci fied range following charging of the work load, without overshootiiig the maximum specified temperature during the heat-up period. For repetitive loads qualified in a.ccordance with 3.4.1. 5, load thermo \ncouples may be omitted. \n3.1. 3 f~luenching Tanks: Sha11 be of sufficient capacity and adequate circulation so that the temperature of the",
    "water is not raised above the allowable range specified in 3.4. 3. 7. Means shall be provided for circulation, heating,, and cooling as necessary. A concentration of dissolved salts above a level that \nleaves a visible deposit on parts after drying shall be reduced by xnflow of fresh water during use.",
    "Tanks shall be located as near as practical to the furnace and facilities arranged to allow a rapid transfer of heated parts. Each tank shall be equipped with a temperature indicator accurate to +2° F \n(+1.1° C). Racks and containers shall be of light and open construction to afford minixnum heat transfer \nto the work load and quench water. \n3.1. 4 Refrigeration Units: Shall be equipped with temperature recordin~; instruments having an accuracy of \n+2° F (+1.1° C).",
    "+2° F (+1.1° C). \n3. 2 Qualification and Calibration of Equipment: Facilities and equipment sha11 be qualified to the requirements of this specification prior to processing of parts. Alteration of equipment or procedures shall require requalification. \n3.2. 1 B,ecoverv Time: The interval between the closing of the furnace door, or immersion of the load in the \nheating medium, and the first indication that all therxnocouples have reached the specified temperature",
    "range shall be defined. as recovery time. Loads sha11 be arra.nged in the furnace in such a manner that \nthe combined characteristics of furnace heating and load arrangenlent allow recovery within the time \nshown in Table I for the thinnest material in the load.",
    "Material Thicl~ess \t\nRecovery Time \nInch \t\n(Millimetres) \t\nminutes max \n15 \n20 \n25 \nUp to 0. 021, excl \n0. 021 to 0. 063, incl \nOver 0.063 to 0.125, incl \nOver 0. 125 to 0. 500, incl \nOver 0. 500 \n(Up to 0. 53, excl) \n(0.53 to 1.60, incl) \n(Over 1. 60 to 3.18, incl) \n(Over 3. 18 to 12. 70, incl) \n(Over 12. 70) \n30 \n30 + 10 min. for \neach additional 0.5 in. (13 mm)",
    "3.2. 2 Qualification of Equipment: 3.2. 2. 1 Furnace Temperature Survey: The temperature distribution ir.i each furnace sha11 be surveyed for \nuniformity in compliance with applicable technical requiremenl:s prior to initial production use, after \nany changes that might affect operational characteristics prior to further use, and at not longer than \nsix month intervals thereafter.",
    "six month intervals thereafter. \n3. 2. 2.1.1 Test Locations: There sha11 be at least one test location for each 25 cu ft (0. 70 m 3) of air furnace \nworking zone or for each 40 cu ft (1.12 m 3) of salt bath volume. Each furnace shall have a minimum of nine test locations but the total number need be no more than 40. Test positions for rectangular furnaces shall be at the corners and the center of the working zone with the balance space~",
    "at regular intervals through the remaining space. Test positions for cylindrical furnaces shall be at three locations each, spaced regularly around the top and bottom circumferences of the working \nzone, and one each at the top, center, and bottom of the furnace aa~is, with the balance distributed \nuniformly through the remaining space. \n3.2. 2.1.2 Soak Test: Temperature distribution shall be surveyed at one solution heat treating range and one",
    "precipitation heat treating range for which each furnace is to be used and at the highest annealing \ntemperature range at which the furnace will be used. Test thermocouples sha11 be installed in all of the test locations in the same manner that a load is charged in the furnace so as to reflect the normal operating characteristics of the furnace. Readings of each thermocouple shall be taken at",
    "intervals of not longer than 2 min. until the temperature stabilizes and at no longer than 5 min. intervals thereafter until the recurrent temperature pattern is established, but not less than 30 min. after stabilization. \n3.2.2.1. 3 Radiation Test: In addition to the soak test, air furnaces sha11 have three or more radiation panels",
    "located near the center and the ends of the long dimension of the working zone. The panels shall be made of 6061-T4 or -T6 bare a11oy sheet nominally 0. 050 in. (1.27 mm) thick by at least 12 in. \n(305 mm) square with a thermocouple peened into the center. The radiation test may be performed \nas a part of the soak test with the radiation panels used in the place of thermocouples at three of `",
    "the required test locations. The rolled surfaces of the sheet sha11 be placed normal to the directio~ of the nearest heating element or heated wa11. \n3. 2. 3 Accuracy of Furnace Pyrometer Systems: The accuracy of temperature measuring systems sha11 be \ndetermined weekly by comparison with a calibrated probe unless the furnace is operating with two or",
    "more potentiometer measuring systems checked daily against each other. Test thermocouple potentiometer instrumentation shall be calibrated against a Bureau of Standards primary or secondary standard \nsystem at intervals of not longer than three months to an accuracy of +2° F(+1.1° C). All furnace systems shall be checked at least once each three months. \n3.3 Preparation: Dirt, welding flux, shot peening residues, die pick-up, and similar contamination shall be",
    "removed from parts before placing in the furnace charge. Cleaners shall be compatible with the alloy \nand surface condition. Organic residues such as cutting oils and rubber mallet marks that burn off \ncleanly do not require cleaning. Salt bath residues sha11 be removed by thorough wa~hing in water.",
    "## 3.4 Procedure: 3.4. 1 General Requirements:",
    "~.4. 1. 1 Solution treatment is permissible only for parts which -T42, -T6, -T61, -T62 or -T7X tempers are \nspecified as the final temper. Solution heat treated parts that yield the unstable \"W\" condition \n(Table V) shall be precipitation heat treated. \n3.4.1. 2 Pa.rts either made from material as supplied by the producer or as solution heat treated in accordance with this specification may be precipitation heat treated, but sha.11 be so treated only in the",
    "starting temper corresponding to the final temper shown in Table VI. Solution heat treated parts in \nthe \"W\" condition may require two precipitation heat treatment steps to obtain the final temper \nspecified for the parts. The interval between solution heat treatment and precipitation heat treatment or between precipitation heat treat steps is not restricted except that 5 days shall elapse between solution heat treatment of 7079 alloy and precipitation heat treatment, and 2 days for 7049 alloy",
    "3.4.1. 3 Annealing, where permissible, shall be followed by solution heat treatment and aging or precipitation \nheat treatment, unless the \"O\" temper is specified as the final condition. \n3.4. 1. 4 Heat treating operations shall be performed on the whole part, never on a portion only, and in a \nmanner that will produce maximum uniformity. \n3.4.1. 5 Heating Time: Sha11 be based on bath temperatures or load therxnocouple readings. Heating, or",
    "soaking, time encompasses the time all thermocouples are within the specified temperature range. \nFor identical or nearly identical loads, the heating time for solution heat treating or precipitation \nheat treating is required to be determined by load thermocouple;s only for the first load of each identical group after each furnace survey. Subsequent loads in a group may be accepted on the basis of",
    "similarity of controller records provided both the indicated rec~overy time and total of recovery plus \nheating time are within +5 min. of the time indicated by the controller record of the first of the identical loads conforming to load thermocouple control requirement;s. \n3.4.1. 6 Load Arrangement: Material and parts shall be racked or supparted so as to permit free access of \nthe heating and quenching media to all portions of the work load. Very sma11 parts such as washers",
    "the heating and quenching media to all portions of the work load. Very sma11 parts such as washers \nand spacers may be handled like rivets. It is recommended thai; other parts be separated by at least",
    "2 in. (51 mm) for solution treating and 1 in. (25 mm) for precipxtation heat treatment, and at greater distances as necessary to prevent blocking of heat flow to other parts or to decrease recovery time. Only aluminim alloy wire and rod shall be used to support parts on the racks. Load arrangement and heating time control for identical loads shall be verified before charging the load. \n3. 4. 1. 7 Solution and Precipitation Heat Treatments: The work load sha11 be charged into furnaces that have",
    "been stabilized at the specified temperature. After recovery in conformance with 3. 2.1 the charge \nshall be heated within the specified temperature range without interruption for the required time as defined in 3. 4. 1. 5. The part numbers, material sizes, a11oy, quantity of parts or pieces in the work \nload, furnace number, and date of heat treatment sha11 be recor~ded on the controller cha.rt.",
    "load, furnace number, and date of heat treatment sha11 be recor~ded on the controller cha.rt. \n3.4. 2 Annealing: Loads may be charged into furnaces at any temperaturE; below the maximurn permissible \nannealing temperature (3.4.2.1). Control of recovery in accordance with 3.2.1 sha11 apply only to clad \nproducts annealed at temperatures above 700° F(371° C). Heating t;ime begins when the controller recorder reaches the control setting.",
    "3. 4. 2.1 Only material or parts in the \"O\" or \"F\" condition, or which will subsequently be reheat treated, may~ \nbe annea.led. Parts shall be annealed as specified in Table II. .Annealing of clad sheet under 0.125 in. ~ \n(3.18 mm) thick above 700° F(371°C) is not permitted. Clad sheet and plate 0.125 in. (3.18 mm) \nthick and over may be annealed above 700° F(371° C) once.",
    "## Annealing Of Wrought Aluminum Alloys",
    "For Removal of Work-Hardening from \nNon-Heat Treatable Alloys and Heat \nTreatable Alloy Sheet and Thin Sections \nFull Anneal for Removal of Work \nHardening and Previous Heat Treatment from Heat Treatable Alloys \nOption 1; Heat to 775° F+ 25 (412. 8° C \n+ 14) then cool in furnace at uniform rate not to exceed 50 F(28 C) deg per hour to below 500° F(260° C). \nOption 1: Heat to 650° F+ 25 (343. 3° C \n+ 14) and air cool. For 3003 alloy \nheat to 750° F+ 25 (398. 9° C+ 14).",
    "+ 14) and air cool. For 3003 alloy \nheat to 750° F+ 25 (398. 9° C+ 14). \n2024 alloy may be heated to 700° F+ 25 (371.1° C+ 14) and water quenched \nOption 2: Quick dip (not to exceed \n30 sec) in salt bath at 920° F+ 10 \n(493. 3° C + 5. 8).",
    "Option 2: For maximum formability, heat to ?75° F+ 25 (412. 8° C+ 14) and hold 1 hr for each 0. 5 in. (13 mm) of thiclrness of.' the heaviest section in the load, furnace cool to 450° F+ 25. \n\n(232. 2° C+ 14) and hold at 450° F+ 25 (232. 2° C+ 14) for not less than 6 hr, and cool in air. \t\n'",
    "3. 4. 3 Solution Heat Treatment: The charge shall be heated within the temperature range specified in Table V \nfor the applicable a11oy, held at temperature for the soak time specified in Table IV for the applicable thiclaiess, and quenched into water in accordance with 3.4.3. 7. THe controlling thicl~ess sha11 be the \nsmallest dimension of the largest section in the load. \n3. 4.3.1 Maximum Thicl~ess: Unless otherwise specified, the thicl~ess at the time of heat treatment of the",
    "materials listed in Table III shall not exceed the maximum shown. Parts made from plate over 2 in. \n(51 mm), forgings over 3 in. (76 mm), and extrusions over 4 in. (102 mm), shall be machined to \nwithin 0. 5 in. (13 mm) of final thicl~ess before heat treatment. No thiclmess limits apply to materials not listed in Table III.",
    "Maximum Thickness \nAlloy \t\nFinal Temper \t Inch \t(Millimetres) \n4 \t\n(102) \n8 \t\n(203) \n2014, 2024, 2219 \n2017, 6061 \n3 \t\n( 76) \n6 \t\n(152) \n7075 \n7049, 7075 \n2 \t\n( 51) \n3. \t\n( 76) \n7178 7178 \n7 \t\n(178) \n7079 \nAll All \nT6, T62, T76, T762 \nT73 T 62 T 76 T6, T62",
    "3. 4. 3. 2 Sa1t Baths: Shall not be used for parts in which molten salt could be retained. Rivets shall be \nplaced in a tube closed at one end to prevent contact with the salt and the salt level maintained at least 6 in. (152 mm) above the level of the rivets during heating. \n3. 4.3. 3 Clad Material: The maximum time of heating clad material shall not exceed 2 min. longer than the \nminimum time at temperature for thicla~esses under 0. 017 in. (0. 43 mm), 5 min. longer than the",
    "minimum time at temperature for thicla~esses under 0. 017 in. (0. 43 mm), 5 min. longer than the \nminimum time for thiclrnesses 0.017 in. (0. 43 mm) to 0. 019 in. (0. 48 mm), incl, or 10 min. longer than the minimum time for thicker material. Clad material that has been heat treated in accordance with this specification sha11 not be reheat treated unless authorized by the purchaser. \n3. 4. 3. 4 Rivets: Recovery time for rivet loads shall not exceed 30 min. and in no case shall the maximum",
    "effective thicl~ess of the load exceed 3 in. (76 mm). \n3. 4. 3. 5 T411 Temper: When specified as a conditioning treatment for machining or nondestructive testing, \nmaterial in \"F\" or \"O\" temper may be put in the T411 temper by heating to the solution treating \ntemperature and then cooling in air. Material in this condition is considered to be equivalent to \"O\" temper for the purpose of determining the applicability of subsequent heat treatments.",
    "3. 4. 3. 6 Air Furnace Atmosphere: Fluorborate compounds may be used to prevent high temperature oxidation \nor blisters. Discoloration resulting from heat treatment is acceptable. \n3. 4. 3. 7 Quenching: The solution heat treated load sha11 be transferred f:rom the working zone of the furnace \nwhile the load is still at the soaking temperature into the quench water with the least possible delay. \t\n~~",
    "~~ \nThe maximum time of delay permissible for the thinnest materi~~l in the load shall be as shown in \n- \t\nTable IV. The delay period shall be the time from complete opening of a furnace door or the st~.rt I \nof removal of the charge from a salt bath to complete immersioxi in the quenching water. Regardless'",
    "of time, however, the transfer operation is acceptable if it is determined tha.t ±he temperat~ire of the thinnest part in the load, when measured at the instant of quench~ing, is above 775° F(413° C). Rivets, \nfasteners, fastener components, washers, spacers, and other, s:mall parts heated in tubes sha11 be quenched by dumping into water. The quench water temperature: shall be maintained below 100° F",
    "(38° C) during the entire quenching operation, except for forging;~ and castings and for product to be heat treated to the T61 temper. Castings sha11 be quenched into water maintained between 150° - \n212° F(65. 6' - 100° C), except that alloy 242. 0(142) castings sha11 be cooled in still air for T77 \t\n'~ \ntemper. Forgings of 2000 series alloys shall be quenched in water maintained at 150° - 180° F \t\nI",
    "temper. Forgings of 2000 series alloys shall be quenched in water maintained at 150° - 180° F \t\nI \n(65. 6° - 82. 2° C), and all otherforgings in water maintained at 140° - 160° F(60° - 71.1° C). \nProducts to be heat treated to the T61 temper shall be quenched in boiling water.",
    "SOLUTION HEAT TREAT SOAK TIME AND \nPERMISSIBLE QUENCH DELAY \nMinimum Soak \nThicl~ess \nTime, Minutes \nInches \n(Millimetres) \nMaximum Quench \nDelay, sec \n6 '7 \nlp \n10 15 \n10 \n0. O10 - 0. 012, incl \n(0.25 - 0.3C~ incl) \n10 \nOver 0. 012 - 0. 015, incl \n(Over 0. 30 - 0.3F~ incl) \n10 \nOver U. 015 - 0. 019, incl \n(Over 0.38 - 0.48 incl) \n15 \nOver 0. 019 - 0. 030, incl \n(Over 0.48 - 0. 7E~ incl) \n20 \nOver 0. 030 - 0. 063, incl \n(Over 0. 76 - 1.6C~ incl) \n25 \nOver 0. 063 - 0. 090, incl",
    "20 \nOver 0. 030 - 0. 063, incl \n(Over 0. 76 - 1.6C~ incl) \n25 \nOver 0. 063 - 0. 090, incl \n(Over 1.60 - 2.2~ incl) \n30 \nOver 0.090 - 0. 125, incl \n(Over 2.29 - 3. lE~ incl) \n35 \nOver 0.125 - 0.250, incl \n(Over 3.18 - 6. 35 incl) \n45 \nOver 0.250 - 0. 500, incl \n(Over 6.35 - Y2. 7U incl) \nQ \nOver 0. 500 \n(Over 12. 70) \n15 \n25 25 \nnl - 45 min. plus 20 min. for each 0.5 in. (13 mm) over 0. 5 in. (13 mm) thicl~ess \nor fractiion thereof.",
    "3.4. 3. 8 Refrigeration of Freshly Quenched Parts: The fresh \"W\" condition may be preserved up to 170 hr by \ncooling below 0° F(-18° C), or up to 30 days by cooling below -11)° F(-23° C). When material or parts \nare specified to be refrigerated, cool below 0° F(18° C) within 1 hr and maintain refrigeration such \nthat excursions above 0° F(-1S° C) to a ma~cimum of 30° F(-1° C) are limited to 100 F deg-hr",
    "that excursions above 0° F(-1S° C) to a ma~cimum of 30° F(-1° C) are limited to 100 F deg-hr \n(56 C deg-hr) per day, until required for further processing. Parts or material may be immersed in liquified gas or refrigerant to a.id cooling of thick sections. All 2024 rivets shall be refrigerated, and 3/32 in. (2.38 mm) diameter 2117 rivets may be refrigerated when specified by the purchaser, \nuntil driven. Other 2117 and 2017 rivets sha11 be aged 96 hr at ambient temperature before driving.",
    "## 3.4.4 Aging And Precipitation Heat Treatment:\n\n3.4.4.1 R,00m Temperature Aging: After quenching, the 2000 and 6000 series alloys attain the T42 temper in \nabout 4 days at ambient temperature. No further heat treatment is permissible for parts •for which \nT42 temper is specified as the final condition, except reheat treatment of bare material and parts. \nReheat treatment shall consist of optional annealing and then re-•solution heat treating. \n\n## Solution Heat Treatment",
    "Solution Heat \nAlloy \t\nTreating Temperature \t\nTemperAfter \n(Any temper and product) \t\n° F \t (° C) \t Heat Treatment \n2014 \n925 - 945 \n(496.1 - 507.2) \nT42 \n2017 \n925 - 950 \n(496. 1- 510) \nT42 \n2018 \n940 - 970 \n(504.4 - 521.1) \nT4 \n2117 \n925 - 950 \n(496. 1- 510) \nT42 \n2024 \n910 - 930 \n(487. 8- 498. 9) \nT42 \n2025 \n950 - 970 \n(510 \t\n- 521. 1) \nT4 \n2218 \n940 - 960 \n(504.4 - 515. 6) \nT4 & T41 \n2219 \n985 - 1005 \n(529.4 - 540. 6) \nT42 \n2618 \n975 - 995 \n(523.9 - 535) \nT4 \n4032 \n940 - 960",
    "2219 \n985 - 1005 \n(529.4 - 540. 6) \nT42 \n2618 \n975 - 995 \n(523.9 - 535) \nT4 \n4032 \n940 - 960 \n(504.4 - 515.6) \nT4 \n6061 \n960 - 1000 \n(515. 6- 537. 8) \nT42 \n6063 \n960 - 980 \n(515. 6- 526. 7) \nT42 \n7049 \n865 - 885 \n(462. 8- 473. 9) \nW \n7075 \nUp to 0. 050 in. \n-(12. 7 mm), incl \n910 - 930 \n(487. 8- 498. 9) \nW \nOver 0.050 in. (12.7 mm) to 1.000 in. \n(25.4 mm) incl. \n865 - 930 \n(462. 8- 498.9) \nW \nOver 1.000 in. (25.4 mm) \n865 - 885 \n(462. 8- 473. 9) \nW \n7079 \n820 - 870 \n(437. 8- 465. 6) \nW",
    "W \nOver 1.000 in. (25.4 mm) \n865 - 885 \n(462. 8- 473. 9) \nW \n7079 \n820 - 870 \n(437. 8- 465. 6) \nW \n7178 (sheet) \n860 - 930 \n(460 \t\n- 498. 9) \nW \n7178 (plate) \n860 - 910 \n(460 \t\n- 487.8) \nW \n7178 (extrusions) \n860 - 880 \n(460 \t\n- 471. 1) \nW \nA201.0 (KO-1) Ql \n930 - 950 \n(498.9 - 510) \n+g50 - 970 \n(510 \t\n- 521. 1) \n+g70 - 990 \n(521.1 - 532. 2) \nT4 \n242. 0(142) Q \t\n950 - 980 \t\n(510 - 526. 7) \t\nT4 \n295.0 (195) \t\n940 - 970 \t\n(504.4 - 521. 1) \t\nT4 \n355.0 (355) \t\n960 - 990 \t\n(515.6 - 532. 2) \t\nT4",
    "295.0 (195) \t\n940 - 970 \t\n(504.4 - 521. 1) \t\nT4 \n355.0 (355) \t\n960 - 990 \t\n(515.6 - 532. 2) \t\nT4 \n356.0 (356) \t\n980 - 1010 (526.7 - 543.3) \t\nT4 \nA356.0 (A356) \t\n980 - 1010 (526.7 - 543.3) \t\nT4 \nA357.0 (A357) \t\n980 - 1010 (526.7 - 543.3) \t\nT4",
    "~\nThree step operation: soak at each temperature 8- 9 hr starting with lowest range. \nFor 242. 0-T77, air cool and precipitation heat treat. \n3.4.4.2 Precipitation Heat Treatment: Parts to be precipitation heat treated shall be heated to the temperature and for the time specified in Table VI for the applicable starting condition and final temper, followed by cooling in air. Segregated lots of alloys or tempers requiring different heating times at",
    "the same temperature may be processed together if the furnace door is opened for not longer than \n2 min. to remove the lot requiring the shorter heating time. Under no circumstances shall cold material be introduced to a furnace containing other material being precipitation heat treated. After \nprecipitation heat treatment, no further heating of parts is permissible except for reheat treating of bare material or parts or overaging to the T7X tempers. Reheat treatment shall consist of optional",
    "annealing and then both re-solution heat treatment and precipitation heat treatment. \n3.4.4. 3 \nStress Relief of 5000 Series: When specified, 5083, 5086, and 5456 a11oy parts sha11 be heated for at \nleast 30 min. at 450° F+ 10 (232. 2° C+ 5. 6) and cooled in air. Welded assemblies shall be heated for at least 15 min. at 550° F+ 10 (287. 8° C+ 5. 6). \n3. 5 Properties: Heat treatment sha11 produce properties in the parts conforming to the values specified",
    "for the final heat treated temper of the parts by the specification for the material from which the parts \nwere made, including conductivity and corrosion resistance for the T7X tempers, unless otherwise \nspecified by the drawing or purchase order. \n4.\nQUALITY ASSURANCE PROVISIONS: \n4.1 Responsibility for Inspection: The vendor of heat treated products ~shall supply a11 samples and shall be \nresponsible for performing all required tests. Results of such tests sha11 be reported to the purchaser",
    "as required by 4.6. Purchaser reserves the right to perform such confirmatory testing as he.deems \nnecessary to assure that the product conforms to the requirements of this specification. \n4. 2 Classification of Tests: Tests to determine conformance to a11 technical requirements of this specification are classified as acceptance or routine controltests. \n4. 3 Sampling: Sha11 be in accordance with the following; material used as test specimens shall conform to",
    "applicable material specifications: \n4. 3.1 Qualification: For qualification of equipment, not less than nine r075 or 2024 a11oy tensile test specimens shall be solution and precipitation heat treated in accordance with the use of each furnace at the \ntest locations specified in 3. 2. 2.1.1. The specimens may be heat treated concurrent with the temper \nture uniformity survey, separately, or with a production load. Tensile tests shall be performed in \naccordance with ASTM B557.",
    "accordance with ASTM B557. \n4. 3.2 Production: When specified, one or more specimens representing the thickest and thinnest sections \nof the parts and of the same a11oy and product as the parts, sha11 be distributed through the load and \nprocessed with the parts. \n4.4 A roval: Processor shall submit results of qualification tests and surveys for approval of the purchaser before parts for production use are supplied, unless such approval be waived. If necessary Lo",
    "make any change or repair for which requalification is required, n~~ production parts shall be processed \nprior to receipt of reapproval. \n4. 5 Heat Treatment Lo~: A log for each heat treat load sha11 be maintained to verify conformance to the \nrequirements of this specification of the following: qualification oi.' equipment, alloy and temper, arrangement of load, recovexy time, furnace temperature control, ti.me at temperature, quench delay",
    "time, and temperature of quench water for solution heat treatment., anc~ the date of heat treatment. The \nlog sha11 be traceable to all furnace records and recorder charts and shall be retained for inspection for \nat least two years. \n4, 6 Reports: The vendor of heat treated products shall furnish with each shipment three copies of a report \nshowing the heat treat log entry reference for each furnace charge of heat treated parts, the results of",
    "tests to determine conformance to the requirements of this specification, and a statement that the charge \nwas processed in conformance to the requirements of this specification. This report shall include the \npurchase order number, this specification number, material specification number, part numbers, \na11oy, and quantity. \n4. 7 Resampling and Retestin~: Sha11 be as agreed upon by purchaser and vendor. \n5.\nPREPARATION FOR DELIVERY:",
    "5.\nPREPARATION FOR DELIVERY: \n5.1 Identification: When specified, parts shall be identified as agreed upon by purchaser and vendor. \n5.2 Packaging: Parts sha11 be handled and transported so as to preserve the required physical characteristics and properties. \n6.\nACKNOWLEDGMENT: A vendor shall mention this specification number in a11 quotations and when aclmowledging purchase orders. \n7.\nREJECTIONS: Parts and material not heat treated in accordance with this specification or with authorized",
    "modifications will be subject to rejection. Evidence of eutectic melting, intergranular-corrosion susceptibility, or high-temperature oxidation, or failure of any test specimen to meet specified requirements \nsha11 be cause for rejection of parts and requalification of equipment.",
    "## 8. Notes:",
    "8.1 Overaged (T7X) Material Properties: Each lot of 7000 series material intended to be heat treated to any",
    "of the T7X tempers as the final condition should be sampled for capability of ineeting specified mechanical property and corrosion resistance requirements when processed in accordance with this specification, or the purchaser should require as a condition of acceptance the capability of the material to meet the specified properties when heat treated in accordance with the requirements of this specification to \nthe T7X tempers.",
    "the T7X tempers. \n8. 2 Similar Specification: MIL-H-6088 is listed for inforxnation only and shall not be construed as an acceptable alternate unless a11 requirements of this specification are met.",
    "## Precipitation Heat Treatment",
    "Time \t\nFinal \nHours \t\nTemper \nTemper \t\nTemperature \nBefore \nAlloy \t\nProduct \t\nTreatment \t\n° F \t (° C) \nT6 \nSheet Plate \t\nT3 \n~ \t\nT4 \t\n310 - 330 \t\n(154.4 - 165. 6) \t\n18 - 20 \t\nT6 \nT42 \t\nT62 \nT451 \t\nT651 \nWire, Rod \t\nT4 \t\nT6 \n2014 \nBar, Tube \t\nT42 \t\nT62 \nExtrusions \t T451 \t\n340 - 360 \t\n(171. 1- 182. 2) \t\n8- 10 \t\nT651 \nT451a \t\nT6510 \nT4511 \t\nT6511 \nForgings \t\nT4 \t\nT6 \n1 \t\nT6 \nRolled Rings \t\nT42 \t\n330 - 350 \t\n(165. 6- 176. 6) \t\n10 - \t\n2 \nT452 \t\nT652 \n2018 \t\nForgings \t\nT4 \t\n330 - 350",
    "T42 \t\n330 - 350 \t\n(165. 6- 176. 6) \t\n10 - \t\n2 \nT452 \t\nT652 \n2018 \t\nForgings \t\nT4 \t\n330 - 350 \t\n(165. 6- 176. 7) \t\n10 - 12 \t\nT6 \nSheet, Plate \t\nT3 \t\nT81 \nWire, Rod \t\nT351 \t\nT851 \nBar, Tube \t T4 \t\n370 - 380 \t\n(187.8 - 193.3) \t\n9. 5- 10.5 \t\nT6 \nT42 \t\nT62 \nSheet, Plate \t\nT36 \t\n370 - 380 \t\n(187.8 - 193. 3) 5. 5- 6. 5 \t\n'1'tsu \n2024 \t\nWire, R,od \t T361 \t\n. \t\nT861 \nn~ \nSheet \t\nT4 \t\n370 - 380 \t\n(187.8 - 193.3) 15 - 17 \t\n'1\"r~ \nT42 \t\nT 72 \nExtrusions \t T4 \t\n1 ~l \nForgings \t\nT42 \t\nT62 \nT3510",
    "(187.8 - 193.3) 15 - 17 \t\n'1\"r~ \nT42 \t\nT 72 \nExtrusions \t T4 \t\n1 ~l \nForgings \t\nT42 \t\nT62 \nT3510 \t\n370 - 380 \t\n(187.7 - 193.3) \t\n9.5 - 10. 5 \t\nT8510 \nT3511 \t\nT8511 \n2025 \t\nForgings \t\nT4 \t\n330 - 350 \t\n(165.6 - 176.7) \t\n10 - 12 \t\nT6",
    "## Precipitation Heat Treatment",
    "Temper \nTemperature \nBefore \nTime \nFinal \nAlloy \nProduct \nTreatment \n°F \n(°C) \nHours \nTemper \n2218 \nForgings Q \nT4 \n330 - 350 \n(165. 5- 176. 7) \n10 - 12 \nT61 \nT41 \n450 - 470 \n(232. 2- 243 3) \n5 5- 6 5 \nT72 \nSheet \nT31 \n340 - 360 \n(171,1 - 182.2) \n17 - 19 \nT81 \n_ \nT37 \n315 - 335 \n(157.2 - 168.3) \n23 - 25 \nT87 \nWire, Rod \nT3510 \nT8510 \n2219 \nBar Extrusions \nT3511 \n340 - 360 \n(171.1 - 182.2) \n17 - 19 \nT8511 \nT37 \nT87 \nAll, Except \nT42 \n365 - 385 \n(185 - 196.1) \n35 - 37 \nT62 \nForgings \nForgings",
    "T8511 \nT37 \nT87 \nAll, Except \nT42 \n365 - 385 \n(185 - 196.1) \n35 - 37 \nT62 \nForgings \nForgings \nT4 \n365 - 385 \n(185 \t\n- 196.1) \n25 - 27 \nT6 \nRolled Rings \nT352 \n340 - 360 \n(171. 1- 182.2) \n17 - 19 \nT852 \nHand For in s \n2618 \nForgings \nT4 \n380 - 400 \n(193 3- 204 4) \n19 - 21 \nT61 \n4032 \nForgings \nT4 \n330 - 350 \n(165 6- 176 7) \n9- 11 \nT6 \nSheet, Plate \nT4 \nT6 \nRod, Bar \nT42 \n310 - 330 \n(154. 4- 165. 6) \n18 - 20 \nT62 \nTube \nT451 \nT651 \n6061 \nExtrusions \nT4 \nT6 \nForgings \nT42 \nT6, T61Q \n~",
    "18 - 20 \nT62 \nTube \nT451 \nT651 \n6061 \nExtrusions \nT4 \nT6 \nForgings \nT42 \nT6, T61Q \n~ \nRolled Rings \nT4510 \n340 - 360 \n(171.1 - 182. 2) \n7. 5- 8. 5 \nT6510 \nT4511 \nT6511 \nT452 \nT652 \n6063 \nAll \nT1 \n390 - 41U \n(198. 9- 210) \n0. 75 - 1.25 \nT5 \nT4 \n340 - 360 \n(171.1 - 182. 2) \n7. 5- 8.5 \nT6 \nT42 \nT62 \n7049 \nForgings \nW \n240 - 260 \n(115. 6- 126. 7) \n24 - 25 \nT6 \nT6 \nAmbient \n48 minimum \nUp to 4 in. (102 mm) \n+330 - 340 \n(165. 6- 171. 1) \n12 - 14 \nT73 \n__ \nOver 4 in. ( 102 mm) \n+325 - 335",
    "+330 - 340 \n(165. 6- 171. 1) \n12 - 14 \nT73 \n__ \nOver 4 in. ( 102 mm) \n+325 - 335 \n(162 8- 168 3 \n12 - 14 \nT73 \nAll Products \nW \n240 - 260 \n(115. 6- 126 7) \n22 - 26 \nT6 \n7075 \nSheet \nT6 \n320 - 330 \n(160 - 165.6) \n24 - 25 \nT73 \nPlate \nT651 \nT7351 \nExtrusions \nT6 \nT73 \nT6510 \n345 - 355 \n(173. 9- 179.4) \n7- 7. 5 \nT73510 \nT6511 \nT73511 \nForgings \nT6. \n345 - 355 \n(173.9 - 179 4) \n8- 8 5 \nT73 \nBar, Rod \nT651 \n345 - 355 \n(173.9 - 179.4) \n7- 7.5 \nT7351 \n~ \nT652 \nT7352 \nSheet \nT6 \n320 - 330",
    "Bar, Rod \nT651 \n345 - 355 \n(173.9 - 179.4) \n7- 7.5 \nT7351 \n~ \nT652 \nT7352 \nSheet \nT6 \n320 - 330 \n(160 - 165. 6) \n16 - 17 \nT76 \nPlate \nT651 \nT7651 \nExtrusions \nT6 \nT76 \nT6510 \n315 - 325 \n(157.2 - 162. 8) \n19 - 20 \nT76510 \nT6511 \nT76511 \n1~ \nBoiling Water Quenched \n2~' \nForgings which were quenched in boiling water will be in ttie T61 temper after \nthis treatment.",
    "## Precipitation Heat Treatment",
    "Temper \nTemperature \nBefore \nTime \nFinal \nAlloy \nProduct \nTreatment \n° F \n(° C) \nHours \nTemper \n7079 \nAll \nW \nAmbient \n120 minimum \n+230 - 250 \n(110 - 121, 1) \n48 - 50 \nT6 \nAll \nW \n240 - 260 \n(115. 6- 126. 7) \n22 - 26 \nT6 \nSheet \n^ \t\nT6 \n320 - 330 \n(160 - 165.6) \n24 - 25 \nT73 \nPlate \nT651 \nT 7351 \n7178 \nE~rusions \nT65 \n\" \nT73 \nT6510 \n345 - 355 \n(173.9 - 179.4) \n7- 7. 5 \nT73510 \nT6511 \nT73511 \nSheet \nT6 \n320 - 330 \n(160 - 165.6) \n16 - 17 \nT76 \nPlate \nT651 \nT7651 \nExtrusions \nT6510 \n315 - 325",
    "T6 \n320 - 330 \n(160 - 165.6) \n16 - 17 \nT76 \nPlate \nT651 \nT7651 \nExtrusions \nT6510 \n315 - 325 \n(157.2 - 162. 8) \n19 - 20 \nT76510 \nT6511 \nT76511 \nA201.0 (KO-1) Castings \nT4 \nAmbient \n12 - 24 \n+300 - 320 \n(148.9 - 160) \n18 - 20 \nT6 \n242 0(142) \nCastings \nT4 \n640 - 660 \n(337.8 - 348.9) \n1- 3 \nT77 \nA242 0(A142) \nCastings \nT4 \n540 - 560 \n(282.2 - 293. 3) \n2- 5 \nT75 \n295 0(195) \nCastirigs \nT4 \n300 - 320 \n(148.9 - 160) \n12 - 20 \nT62 \nF \n430 - 450 \n(221.1 = 232. 2) \n7- 9 \nT51 \n355.0 (355) \nCastings \nT4",
    "(148.9 - 160) \n12 - 20 \nT62 \nF \n430 - 450 \n(221.1 = 232. 2) \n7- 9 \nT51 \n355.0 (355) \nCastings \nT4 \n300 - 320 \n(148.9 - 160) \n3- 5 \nT6 \nT4 \n465 - 485 \n(240.6 - 251. 7) \n4- 6 \nT71 \nC355 0(C355) \nCastings \nT4 \n300 - 320 \n(148.9 - 160) \n10 - 12 \nT61 \n356. 0(356) \nCastings \nF \n430 - 450 \n(221.1 - 232: 2) \n7- 9 \nT51 \nT4 \n300 - 320 \n(148.9 ~- 160) \n3- 5 \nT6 \nT4 \n390 - 410 \n(198.9 - 210) \n3- 5 \nT7 \nT4 \n465 - 485 \n(240.6 - 251. 7) \n2- 4 \nT71 \nA356 0(A356) \nCastings \nT4 \n300 - 320 \n(148.9 - 160) \n6- 10",
    "(240.6 - 251. 7) \n2- 4 \nT71 \nA356 0(A356) \nCastings \nT4 \n300 - 320 \n(148.9 - 160) \n6- 10 \nT61 \nA357.0 (A357) \nCastings \nT4 \n300 - 320 \n(148.9 - 160) \n10 - 12 \nT61 \nT4 \n330 - 350 \n(165.6 - 176. 7) \n6- 10 \n262 \n850.0 (750) \n~ \nA850.0 (A750) \nCastings \nF \n420 - 440 \n(215. 6- 226. 7) \n7- 9 \nT5 \nB850 0 (B750)"
  ]
}