{
  "source": "SAE AS 8016 A.md",
  "chunks": [
    "The Engineering Society Land Sea Air and Space For Advancing Mobility I N T E R N A T I O N A L\n®\n400 Commonwealth Drive, Warrendale, PA 15096-0001\n\n# Aerospace Standard\n\n Issued\n1978-10\n Revised\n1996-09\n\nSubmitted for recognition as an American National Standard\n\n## Vertical Velocity Instrument (Rate-Of-Climb) Foreword\n\nChanges in the revision are format/editorial only.\n\n## 1. Scope: 1.1 Types:",
    "Changes in the revision are format/editorial only.\n\n## 1. Scope: 1.1 Types:\n\nThis AS covers Vertical Velocity Instruments which display the rate of change of pressure altitude of an aircraft, as follows:",
    "Type A - Direct reading, self-contained, pressure actuated Type B - Electrically or electronically operated, self-contained, pressure actuated Type C - Electrically or electronically operated, input from a remote pressure sensor\n1.2\nRange:\nThe range of operation of the instrument and the altitude range when applicable shall be as marked on the instrument face or nameplate.",
    "1.3\nPurpose:\nThis SAE Aerospace Standard (AS) establishes the minimum performance standards for vertical velocity instruments for aircraft use.\n\n## 2. Applicable Documents:\n\nThe following documents shall form a part of this AS to the extent specified herein:",
    "2.1\nRadio Technical Commission for Aeronautics (RTCA) Document DO-160, \"Environmental\nConditions and Test Procedures for Airborne Electronic/Electrical Equipment and Instruments,\" dated 28 February 1975.  Copies may be obtained from the RTCA Secretariat, 1717 H Street, N.W., Washington, DC 20006.\n2.2\nU.S. Standard Atmosphere, 1962.  Copies may be obtained from the RTCA Secretariat, at the\naddress given in 2.1.\n2.3",
    "address given in 2.1.\n2.3\n\"Rules for SAE Use of SI (metric) Units - SAE document J916b,\" dated July 1976.  Copies may\nbe obtained from SAE, 400 Commonwealth Drive, Warrendale, PA 15096.",
    "## 3. General Standards: 3.1 Indicating Means:\n\nThe vertical velocity shall be indicated by means of a pointer, dial tape, drum, or other type of moving element, or by a digital display with appropriate direction indication.  Relative motion of the index with respect to the scale, or of the direction indicator (either the index or the scale may be the moving element) must be clockwise, up, or to the right for ascending vertical velocity.",
    "3.2\nDisplay:\n3.2.1\nGraduation (If Applicable):  The graduations shall be arranged to provide the maximum\nreadability consistent with the accuracy of the instrument, with at least 100 ft/minute (30 m/minute), graduations to 1000 ft/minute (300 m/minute).  Major graduations shall be at 1000 ft/minute (300 m/minute), intervals and the minor graduations shall be at 500 ft/minute (150 m/minute) intervals.\n3.2.2",
    "3.2.2\nNumerals (If Applicable):  The display shall include sufficient numerals to permit quick and\npositive identification of each graduation.\n3.2.3\nLimits:  The indicating means shall be limited in such a way that the moving element will not",
    "move more than (a) 10 degrees for circular display, or (b) 0.25 inch (.6 mm) for linear displays beyond the greatest graduation in both ascending and descending directions.  When the instrument is pegged at its maximum rate indication, the direction of that indication, whether ascending or descending, shall be clear and unambiguous.  If a digital display is used, a positive indication shall be provided on the display when the vertical velocity of the aircraft exceeds the instrument readout",
    "provided on the display when the vertical velocity of the aircraft exceeds the instrument readout capability.",
    "3.2.4\nVisibility:  The indicating means must be visible from all points within a space defined by a\nsurface generated by lines making an angle of at least 30 degrees with the perpendicular to the display surface and diverging from the perimeter of the instrument window aperture.  If integral lighting is provided, it must make all indicia within the instrument easily readable and not allow any objectionable stray light to come from the instrument.\n3.2.5",
    "3.2.5\nZero Setting:  Means for manually zeroing the instrument shall be provided for Type A, and\nshall be optional for Types B and C.  The zero adjust range shall be not less than 400 ft/minute up and down movement.  These methods shall meet the requirements of 3.5.\n3.3\nFire Resistance:",
    "3.3\nFire Resistance:\nExcept for small parts (such as knobs, fasteners, seals, grommets, and small electrical parts) that would not contribute significantly to the propagation of a fire, all materials used must be selfextinguishing when tested in accordance with the requirements of Federal Aviation Regulation 25.1359(d) and Appendix F thereto, with the exception that materials tested may be configured in accordance with paragraph (b) of Appendix F or may be configured as used.",
    "3.4\nReflectance, Cover Glass:\nThe total reflectance of the instrument cover glass including the integral lighting wedge, if applicable, shall not exceed 10% of the incident light.  This reflectance applies over the visible light spectrum from 450 millimicrons to 600 millimicrons, and over an incident solid angle of 60°\nperpendicular to the viewing plane.\n\n3.5\nAccessibility of Controls:\nControls not normally adjusted in flight must not be readily accessible to flight personnel.",
    "3.6\nAcceleration Sensitive Device:\nAny device used in the instrument to superimpose an acceleration-sensitive indication of vertical velocity on the pressure-actuated indication of vertical velocity shall be fail safe and shall not degrade the normal operation of the instrument.\n\n3.7\nInterchangeability:\nInstruments which are identified with the same manufacturer's part number shall be interchangeable.",
    "3.8\nEffects of Tests:\nUnless otherwise stated, the application of the specified tests shall not produce a condition which would be detrimental to the continued performance of the instrument.\n\n3.9\nMounting Attitude:\nShould the capability of an instrument to meet its stated performance be limited to a specific relationship of its axes to the axes of the aircraft, this limitation must be stated.  Instruments incorporating acceleration-sensitive devices must have these attitude limitations stated.",
    "3.10\nAccuracy:",
    "Accuracy requirements for this standard are related to the instrument display or electrical output for a specified sensor input.  For Type A and B instruments, the accuracy relates output to pressure input to the instrument, since they are self-contained.  For Type C instruments, the accuracy relates output to the input at the remote sensor; if matching of the instrument to the remote sensor is necessary to maintain the required overall accuracy, this must be so stated on the instrument",
    "is necessary to maintain the required overall accuracy, this must be so stated on the instrument nameplate.",
    "3.11\nPower Malfunction Indication:\nFor Type B and C instruments, means must be incorporated in the instrument to indicate the loss of signal to the instrument and/or the loss of electrical power to the instrument.  The indicating means must indicate a failure or malfunction in a positive manner.\n\n## 4. Performance Standards Under Standard Conditions:",
    "The test conditions applicable to a determination of the performance of vertical velocity instruments are set forth in Appendix A of this AS.  All instruments shall be tested in accordance with the manufacturer's recommendations.  The manufacturer shall conduct sufficient tests to prove compliance with these Minimum Performance Standards.  Test equipment used to demonstrate the required performance shall be described and its accuracy specified.",
    "4.1\nZero Setting:\nThe pointer zero setting mechanism, where applicable, shall operate smoothly throughout its range, which shall not be less than 400 fpm (120 m/minute) up and down movement.",
    "4.2\nScale Error:\n4.2.1\nWhen subjected to the rates of change of pressure specified in Table 1 for the instrument\nrange,  Types A and B instruments shall meet the tolerances specified in that table.\n4.2.2\nType C indicators must be tested in a manner equivalent to the testing of Type A and B.  Input\nsignals equivalent to the pressure input to the sensor for the instrument range must be used, and the error from the sensor input to the indicator output must be in accordance with Table 1.",
    "|                   |                   |                    |                    | Test Rate       | Test Rate         |\n|-------------------|-------------------|--------------------|--------------------|-----------------|-------------------|\n| Standard Altitude | Standard Altitude | Ascent and Descent | Ascent and Descent | Tolerance       | Tolerance         |\n| Test Interval     | Test Interval     | Feet Per Minute    | Meters Per Minute  | Feet Per Minute | Meters Per Minute |",
    "| Feet              | Meters            | (ft/minute)        | (m/minute)         | (ft/minute)     | (m/minute)        |\n| Between           | 2,000 to   2,500  | 600 to   750       | 500                | 150             | 100               |\n| 2,000 to   3,000  | 600 to   900      | 1,000              | 305                | 200             | 61                |\n| 2,000 to   4,000  | 600 to 1200       | 2,000              | 610                | 300             | 91                |",
    "| 2,000 to   5,000  | 600 to 1500       | 3,000              | 915                | 300             | 91                |\n| 2,000 to   6,000  | 600 to 1800       | 4,000              | 1220               | 400             | 122               |\n| 2,000 to   7,000  | 600 to 2400       | 5,000              | 1525               | 500             | 152               |\n| Between           | 15,000 to 17,000  | 4500 to 5200       | 2,000              | 610             | 300               |",
    "| 15,000 to 19,000  | 4500 to 5800      | 4,000              | 1220               | 400             | 122               |\n| Between           | 28,000 to 30,000  | 8550 to 9150       | 2,000              | 610             | 300               |\n| 28,000 to 32,000  | 8550 to 9800      | 4,000              | 1220               | 400             | 122               |",
    "## 4.3 Pointer Damping, Types A And B:\n\nThe pointer damping of the instrument on ascent and descent, when timed over the following test interval, shall be between 3 and 12 seconds:",
    "| Instrument Range   | Instrument Range   | Test Interval   | Test Interval   |\n|--------------------|--------------------|-----------------|-----------------|\n| ft/minute          | m/minute           | ft/minute       | m/minute        |\n| 0-2000             | 610                | 1800-180        | 549-61          |\n| All greater ranges | All greater ranges | 2000-200        | 610-61          |",
    "This test may be conducted by applying slight vacuum or pressure to the static pressure connection of the instrument, instantaneously releasing this vacuum or pressure, and measuring the time for the pointer to cover the test interval as it approaches zero.  Vibration shall be applied during this test.  (See Appendix A.) Where other than exponential type damping is used, the pointer shall not lag by more than the equivalent of 12 seconds in the above test, and the pointer oscillation shall be",
    "by more than the equivalent of 12 seconds in the above test, and the pointer oscillation shall be damped to an amplitude no greater than exists with the 3 second exponential damping as specified above.",
    "4.4\nFriction, Types A and B:\nWith no vibration applied, the instrument shall be tested in a manner similar to that used in the pointer lag test, as in 4.3.  The pointer shall move smoothly toward zero and shall stop within 200 ft/minute (61 m/minute) of zero.",
    "4.5\nLeakage Type A and B; Type C, as Applicable:",
    "With a suction of 15 inches of mercury (50.7 kPa) applied to the static pressure connection, the leakage shall not cause more than 0.05 inch of mercury (0.17 kPa) pressure drop during a 1-minute period.  With a pressure of 10 inches of mercury (33.8 kPa) applied to the static pressure connection, the leakage shall not cause more than 0.05 inch of mercury (0.71 kPa) pressure drop during a 1-minute period.  The total volume of the static pressure system during these tests shall be 100 ± 10",
    "period.  The total volume of the static pressure system during these tests shall be 100 ± 10 inches3 (1.6 L ± .16 L).",
    "4.6\nAttitude Error:\nWith the instrument vented to ambient pressure and the pointer approximately zeroed, the difference between the pointer indication in its normal operating position and when it is in any other position shall not exceed 50 ft/minute (15 m/minute).  Instruments incorporating acceleration-sensitive devices shall be allowed to stabilize at each reading attitude before compliance with this requirement is tested.",
    "4.7\nAcceleration-Sensitive Device Testing:\nIt shall be the responsibility of the instrument manufacturer to specify the method of test in order to show compliance with 3.6.\n\n4.8\nOverpressure (Type A):\nWithin 5 minutes following a rate of descent of 30,000 ft/minute (9150 m/minute) the instrument must return to plus or minus 100 ft/minute (30 m/minute) of the initial reading.  The test altitude shall be within the altitude range specified for the instrument.",
    "## 5. Minimum Performance Standards Under Environmental Conditions:",
    "Unless otherwise specified herein, the measurement procedures applicable to a determination of the performance under environmental conditions are set forth in Radio Technical Commission for Aeronautics (RTCA) Document No. DO-160 entitled, \"Environmental Conditions and Test Procedures for Airborne Electronic/Electrical Equipment and Instruments,\" dated 28 February 1975. Performance tests which must be made after subjection to test environments may be made after exposure to several environmental",
    "be made after subjection to test environments may be made after exposure to several environmental conditions.  The order of tests must be in accordance with paragraph 3.2 of DO-160.  The test procedures specified or referenced are satisfactory for use in determining the performance of vertical velocity instruments under normal and extreme environmental conditions; equipment category is to be as specified by the manufacturer.  Alternate approved test procedures that provide equivalent results",
    "specified by the manufacturer.  Alternate approved test procedures that provide equivalent results may be used.",
    "5.1\nMagnetic Effect:\nWhen subjected to the test of DO-160, paragraph 15.0, the instrument must meet the requirements of Class A or Z.",
    "5.2\nTemperature:\n5.2.1\nLow Temperature:  When subjected to the tests of DO-160, paragraph 4.4, the instrument must\noperate electrically and mechanically, and the requirements of 4.2 of this AS must be met. After subjection to this test, the requirements of 4.2 and 4.4 of this AS shall be met.\n5.2.2\nHigh Temperature:  When subjected to the tests of DO-160, paragraph 4.5, the instrument",
    "5.2.2\nHigh Temperature:  When subjected to the tests of DO-160, paragraph 4.5, the instrument\nmust operate electrically and mechanically, and the requirements of 4.2 of this AS must be met. After subjection to this test, the requirements of 4.2 and 4.4 of this AS shall be met.\n5.2.3\nTemperature Variation:  When subjected to the tests of DO-160, paragraph 5.0, the instrument",
    "5.2.3\nTemperature Variation:  When subjected to the tests of DO-160, paragraph 5.0, the instrument\nmust operate electrically and mechanically and the requirements of 4.2 of this AS must be met. After subjection to this test, the requirements of 4.2 and 4.4 of this AS must be met.\n5.3\nAltitude:\nWhen subjected to the tests of DO-160, paragraph 4.6, the instrument must operate electrically and mechanically, and the requirements of 4.2 of this AS must be met.",
    "5.4\nVibration:\nWhen subjected to the tests of DO-160, paragraph 8.0, the instrument must operate electrically and mechanically, and the requirements of 4.2 of this AS must be met.  After subjection to this test, the requirements of 4.2 and 4.4 of this AS must be met.  Vibration test requirements by aircraft type and equipment location shall be as specified by the manufacturer.",
    "5.5\nShock Test:\nAfter subjection to the tests of DO-160, paragraph 7.0, the instrument must operate electrically and mechanically, and the requirements of 4.2 and 4.4 of this AS must be met.\n\n5.6\nHumidity:\nImmediately following subjection to the tests of DO-160, paragraph 6.3.1, standard humidity environment, the requirements of 4.2 and 4.4 of this AS must be met.",
    "5.7\nPower Input (Type B and C):\n5.7.1\nNormal Electrical Input Variation Test:  When subjected to the tests of DO-160, paragraphs\n16.3.1.1 or 16.3.2.1, the instrument must operate electrically and mechanically and meet the requirements of 4.2 of this AS.\n5.7.2\nAbnormal Electrical Input Variation Test:  When subjected to the tests of DO-160, paragraphs",
    "5.7.2\nAbnormal Electrical Input Variation Test:  When subjected to the tests of DO-160, paragraphs\n16.3.3.1 or 16.3.4.1, the instruments must operate electrically and mechanically and degration of performance is permissible.  After returning to normal electrical input, the instrument must meet the requirements of 4.2 of this AS.",
    "## 5.8 Voltage Spike Conducted Test (Type B And C):\n\nThe instrument shall be subjected to the tests of DO-160, paragraph 17.0.  After completion of the test, the instrument shall meet the requirements of 4.2 of this AS.\n\n5.9\nAudio Frequency Conducted Susceptibility Test (Type B and C):\nThe instrument shall be subjected to the tests of DO-160, paragraph 18.0.  During the test, the instrument must operate electrically and mechanically and shall meet the requirements of 4.2 of this AS.",
    "5.10\nInduced Signal Susceptibility Test (Type B and C):\nThe instrument shall be subjected to the tests of DO-160, paragraph 19.0.  During the tests, the instrument must operate electrically and mechanically and must meet the requirements of 4.2 of this AS.",
    "5.11\nRadio Frequency Susceptibility Test, Radiated and Conducted (Type B and C):\nThe instrument shall be subjected to the tests of DO-160, paragraph 20.0.  During the tests, the instrument must operate electrically and mechanically and must meet the requirements of 4.2 of this AS.",
    "5.12\nEmission of Radio Frequency Energy Test (Type B and C):\nThe instrument shall be subjected to the tests of DO-160, paragraph 21.0.  During the test, the instrument shall operate electrically and mechanically.  After completion of the tests, the instrument shall meet the requirements of 4.2 of this AS.\n\n5.13\nExplosion:\nInstruments which are to be marked Explosion Category E must be tested in accordance with DO-160, paragraph 9.0.",
    "5.14\nWaterproofness:\nInstruments which are to be marked Waterproofness Category W must be tested in accordance with DO-160, paragraph 10.0.  Following this test, the instrument must meet the requirements of 4.2 and 4.4 of this AS.\n\n5.15\nHydraulic Fluid:\nInstruments which are to be marked Hydraulic Fluid Category H must be tested in accordance with DO-160, paragraph 11.0.  Following this test, the instrument must meet the requirements of 4.2 and 4.4 of this AS.",
    "5.16\nSand and Dust:\nInstruments which are to be marked Sand and Dust Category D must be tested in accordance with DO-160, paragraph 12.0.  Following this test, the instrument must meet the requirements of 4.2 and 4.4 of this AS.\n\n5.17\nFungus Resistance:\nInstruments which are to be marked Fungus Resistance Category F must be tested in accordance with DO-160, paragraph 12.0.  Following this test, the instrument must meet the requirements of 4.2 and 4.4 of this AS.",
    "5.18\nSalt Spray:\nInstruments which are to be marked Salt Spray Category S must be tested in accordance with DO-160, paragraph 14.0.  Following this test, the instrument must meet the requirements of 4.2 and 4.4 of this AS.\n\n## 6. Minimum Acceptance Test Requirements Under Standard Conditions:\n\nTests shall be performed on each Vertical Velocity Instrument produced to show compliance with the following paragraphs of this standard:",
    "4.1  Zero setting. 4.2  Scale error. 4.3  Pointer lag. 4.4  Friction. 4.5  Leakage.\n4.6  Attitude error. 4.7  Acceleration-sensitive device testing (as applicable).\n\n## Appendix A A.1 Standard Test Conditions:\n\nThe following conditions of tests are applicable to the instrument tests specified herein:",
    "The following conditions of tests are applicable to the instrument tests specified herein:\n\nA.1.1\nAtmospheric Conditions:\nUnless otherwise specified, all tests required by this standard must be conducted at an atmospheric pressure of approximately 29.92 inches of mercury (101.3 kPa), an ambient temperature of approximately +25 °C, and a relative humidity of not greater than 85 percent.",
    "When tests are conducted with the atmospheric pressure or temperature substantially different from these values, allowance shall be made for the variation from the specified conditions.",
    "A.1.2\nVibration to Minimize Friction:\nUnless otherwise specified, all tests for performance may be conducted with the instrument subjected to a maximum vibration of 0.001 inch (0.025 mm) double amplitude at a frequency of 10 to 60 Hz.  The term double amplitude as used herein indicates the total displacement from positive maximum to negative maximum.",
    "A.1.3\nPower Conditions:\nUnless otherwise specified, all tests must be conducted at the power rating recommended by the manufacturer, measured at the input terminal to the instrument.\n\nA.1.4\nMounting Position:\nUnless otherwise specified, all tests must be made with the instrument mounted in its normal operating position."
  ]
}