{
  "source": "SAE AS8013A 1996.md",
  "chunks": [
    "# For Advancing Mobility Land Sea Air And Space® I N T E R N A T I O N A L Aerospace Standard\n\nIssued\n1983-06\n400 Commonwealth Drive, Warrendale, PA 15096-0001\nRevised     1996-09\n\n# Submitted For Recognition As An American National Standard\n\n## Minimum Performance Standard For Direction Instrument, Magnetic (Gyroscopically Stabilized) Foreword\n\nChanges in the revision are format/editorial only.\n\n## 1. Scope:",
    "Changes in the revision are format/editorial only.\n\n## 1. Scope:\n\nThis SAE Aerospace Standard (AS) establishes the minimum requirements for design and qualification of equipment identified as Gyroscopically Stabilized Magnetic Direction Instruments.\n\n1.1\nPurpose:\nThis document defines minimum performance requirements under standard and environmental conditions for Gyroscopically Stabilized Magnetic Direction Instruments for use in aircraft.\n\n## 2. Applicable Documents:",
    "The following publications form a part of this document to the extent specified herein. The latest issue of SAE publications shall apply. The applicable issue of other publications shall be the issue in effect on the date of the purchase order. In the event of conflict between the text of this document and references cited herein, the text of this document takes precedence. Nothing in this document, however, supersedes applicable laws and regulations unless a specific exemption has been",
    "document, however, supersedes applicable laws and regulations unless a specific exemption has been obtained.",
    "SAE Technical Standards Board Rules provide that: \"This report is published by SAE to advance the state of technical and engineering sciences. The use of this report is entirely voluntary, and its applicability and suitability for any particular use, including any patent infringement arising therefrom, is the sole responsibility of the user.\" SAE reviews each technical report at least every five years at which time it may be reaffirmed, revised, or cancelled. SAE invites your written comments",
    "years at which time it may be reaffirmed, revised, or cancelled. SAE invites your written comments and suggestions.",
    "2.1\nRTCA Publications:\nAvailable from RTCA Inc., 1140 Connecticut Avenue, NW, Suite 1020, Washington, DC 20036. RTCA Document No. DO-160A, \"Environmental Conditions and Test Procedures for Airborne Equipment\" dated January 1980\n\n2.2\nFAR Publications:\nAvailable from Federal Aviation Administration, 800 Independence Avenue, SW, Washington, DC 20591.\n\nFederal Aviation Regulation 25.1359",
    "Federal Aviation Regulation 25.1359\n\n3.\nGENERAL REQUIREMENTS:\n3.1\nOperation of Controls:\nThe operation of controls intended for use during flight, if any, in all possible position combinations and sequences shall not result in a condition whose presence or continuation would be detrimental to the continued performance of the equipment.",
    "3.2\nAccessibility of Controls:\nControls which are not normally adjusted in flight shall not be readily accessible to flight personnel, when the equipment is installed in accordance with the manufacturer's instructions.\n\n3.3\nCompatibility of Components:\nIf the equipment components require matching for proper operation, they shall be identified in a manner that will provide for proper matching. The instructions furnished by the manufacturer must contain data detailing these limitations.",
    "3.4\nFire Resistance:\nExcept for small parts (such as knobs, fasteners, seals, grommets, and small electrical parts) that would not contribute significantly to the propagation of a fire, all materials must be self-extinguishing when tested in accordance with the requirements of Federal Aviation Regulation 25.1359 (d) and Appendix F thereto, with paragraph (b) of Appendix F or may be configured as used.",
    "3.5\nInterchangeability:\nInstruments and components which are identified with the same manufacturer's part number shall be interchangeable.\n\n--`,,```````,`,,`,``,``,,,,`,`-`-`,,`,,`,`,,`---\n\n## 3.6 Malfunction Indication:\n\nIntegral means shall be provided to indicate failures and/or the existence of the following conditions:",
    "a.\nSystem in fast alignment mode, required of electrical instruments except manually caged indicators \nwith automatic release.\nb.\nGyro operating at speed below the minimum designated by the manufacturer for the instrument to \nmeet the performance requirements herein. The requirement applies to electrical and remotely operated instruments.",
    "Additionally, the indicator or display of the repeating or remote indicating type of gyroscopically stabilized instrument shall be provided with means to indicate the following failures:",
    "c.\nLoss of synchro excitation\nd.\nA mechanical obstruction in the indicator dial drive mechanism\ne.\nPrimary power loss to the indicator or display\n f.\nServo Amplifier power loss\ng.\nElectrical failure in the servo drive motor\nThe indicating means shall indicate the failure or malfunction in an unambiguous manner. The indicating means may be a single indication of any or all of the preceding conditions or failures.\n\n## 3.7 Instrument Cover Glass Reflectance:",
    "## 3.7 Instrument Cover Glass Reflectance:\n\nThe total reflectance of the instrument cover glass including the integral lighting wedge, if applicable, shall not exceed 10 percent of the incident light. This reflectance applies over the visible light spectrum from 450 nanometers to 600 nanometers, and over an incident solid angle of 60 degrees perpendicular to the viewing plane.\n\n## 3.8 Indicating Method:\n\nOne of the following methods of indication shall be employed:",
    "One of the following methods of indication shall be employed:\n\nMethod I \nRotating dial display with fixed lubber line. The dial shall rotate counterclockwise for right turns.\nMethod II\nHorizontal scale display with fixed lubber line. The graduations shall move to the left for right turns.\nMethod III Rotating pointer with fixed graduated dial. Pointer shall rotate clockwise for right turns. Dial\nposition may be settable.\n--`,,```````,`,,`,``,``,,,,`,`-`-`,,`,,`,`,,`---",
    "3.9\nOperating Limits:\nThe instrument shall indicate heading throughout the 360 degree scale range. During dives, climbs, and banks of up to at least 55 degree displacement from level attitude, the instrument shall remain functional; however, the heading error involved through the gimbal system need not be corrected. The system may be provided with means to permit deactivating the slaving means during maneuvers.",
    "3.10\nDial Markings:\n3.10.1\nGraduations:\nThe indicators shall be provided with degree graduations at intervals not to exceed 5 \ndegrees, with major graduations every 10 degrees and with numerals at intervals not greater than 30 \ndegrees, except that the 0, 90, 180, and 270 degrees positions may be marked N, E, S, and W, respectively.\n3.10.2\nVisibility:\nIndex and dial markings shall be visible from any point within the upper half of a frustum of",
    "Index and dial markings shall be visible from any point within the upper half of a frustum of \na cone, the side of which makes an angle of at least 30 degrees with the perpendicular to the dial and the small diameter of which is the aperture of the instrument case. At least two numerals shall be visible simultaneously.\n3.11\nCaging Provisions:",
    "3.11\nCaging Provisions:\nUnless the gyro assembly has unrestricted freedom of operation in the pitch and roll axes, a means shall be provided for caging and/or releveling the gyro. A means shall be provided to indicate when the gyro is caged, except when it is not possible to leave the gyro in the caged condition.",
    "3.12\nCompensation:\nMeans shall, if necessary, be provided for compensating for single cycle (hard iron) error. Change in deviation shall be smooth and continuous.\n\n3.13\nSynchronization Provision:\nAutomatic or manual means shall be provided to bring the indicated heading into alignment with the magnetic heading. An indication of alignment and/or failure to align shall be provided.\n\n## 3.14 Self-Test Capability:",
    "## 3.14 Self-Test Capability:\n\nIf the equipment contains integral arrangements to permit preflight and/or inflight self-test checks on the operation of the equipment and/or in combination with other aircraft subsystems, a means shall be provided to permit deactivating a using subsystem which might be adversely affected during the self-test cycle. In flight self-test activating controls shall provide a means to warn the pilot of this mode of operation.",
    "3.15\nIdentification:\nThe following information shall be legibly and permanently marked on the instrument or nameplate attached thereto:\n\na.\nName of instrument\nb.\nManufacturer's name or trademark and part number\nc.\nManufacturer's serial number or date of manufacture\nd.\nEnvironmental categories\ne.\nSAE AS8013A or equivalent approval identification\n3.16\nCase Grounding:\nMetallic or other conductive instrument cases shall be connected to aircraft ground through a connector pin.",
    "## 4. Minimum Performance Requirements Under Standard Test Conditions:\n\n4.1\nStarting:\nRated instrument performance rotor speed shall be achieved within 3 minutes after normal power is applied for both air and electric operated instruments. If the instrument incorporates a gyro speed monitoring device which provides a positive indication when the gyro speed is below that necessary to meet instrument performance, the starting time may exceed 3 minutes, but shall not be greater than 5 minutes.",
    "4.2\nScale Error:\nWhen the magnetic-sensitive unit is placed on magnetic headings at 30 degree intervals, starting from north, each indication shall correspond to the actual magnetic heading within 2 degrees.",
    "4.3\nCompensation:\n--`,,```````,`,,`,``,``,,,,`,`-`-`,,`,,`,`,,`---\nWith the instrument on a north heading and the magnetic compensator adjusted for minimum effect, the scale error with the compensator shall not differ from the scale error without the compensator by more than 2 degrees. The test shall be repeated with the instrument on an east heading.",
    "4.4\nTurn Error:",
    "Two minutes after resumption of straight and level flight the scale error resulting from a coordinated turn of 180 degrees in 1 minute at a true airspeed of 180 miles per hour (289 km/h) shall be within 2 degrees. The error shall have been obtained from a turn which was begun from an easterly heading. An optional test procedure to demonstrate the effects of turn error is as follows: With the system synchronized on an east heading, set the magnetic heading sensor to a south heading, and allow",
    "synchronized on an east heading, set the magnetic heading sensor to a south heading, and allow the system to operate for 1 minute. Set the magnetic heading sensor to an east heading and allow the system to operate for 2 minutes. The resultant heading shall duplicate the initial synchronized reading within 2 degrees.",
    "4.5\nHeeling:\nWhen the gyroscope is tilted 10 degrees about the roll or pitch axis and rotated 360 degrees in azimuth in 30-degree increments, the indicated headings shall not differ from the indicated headings with the gyroscope in its normal level position by more than 4 degrees. The instrument shall remain at each heading for 5 minutes before reading.",
    "4.6\nField Strength Variation Effect:\nWith the transmitter at a total field of 0.57 ±.02 gauss (.057 ±.002 mT) at a dip angle of 72 ± 1 degrees and the compass at a null, the null shall not vary more than ±2 degrees when the dip angle is changed to 80 ± 1 degrees.\n\n## 5. Minimum Performance Requirements Under Environmental Conditions:",
    "Unless otherwise specified herein, the procedures applicable to a determination of the performance of directional instruments under environmental conditions are set forth in Radio Technical Commission for Aeronautics (RTCA) Document No. DO-160A, entitled \"Environmental Conditions and Test Procedures for Airborne Equipment\" dated January 1980. Performance tests specified after subjection to test environments may be made after exposure to several environmental conditions. The order of tests shall",
    "may be made after exposure to several environmental conditions. The order of tests shall be in accordance with paragraph 3.2, page 4, of DO-160A. The test procedures specified or referenced are satisfactory for use in determining the performance of directional instruments under standard and extreme environmental conditions. Alternate approved test procedures that provide equivalent results may be used. As many instruments as deemed necessary to demonstrate that all instruments will comply with",
    "used. As many instruments as deemed necessary to demonstrate that all instruments will comply with the requirements of this paragraph, shall be tested in accordance with the manufacturer's recommendations.",
    "## 5.1 Performance Standard For Use During Environmental Tests:\n\nThe following performance standard shall be used when performance testing during an environmental test is required:\n\na.\nThere shall be no more than 2 degrees of scale error (indicated heading-vs-actual magnetic heading).\n\n## 5.2 Temperature - Altitude - Humidity:",
    "a.\nLow-Temperature - The instrument shall be subjected to the tests of DO-160A, paragraph 4.4. When \nspecified the instrument shall operate electrically and mechanically and the requirements of \nparagraph 5.1 of this Standard shall be met. Following the test, the requirement of paragraph 4.1 through 4.3 of this Standard shall be met at standard conditions.\nb.\nHigh Temperature - The instrument shall be subjected to the tests of DO-160A, paragraph 4.5. There",
    "High Temperature - The instrument shall be subjected to the tests of DO-160A, paragraph 4.5. There \nshall be no evidence of materials such as potting and sealing compounds exuding or dripping from the instrument. When specified, the instrument shall operate electrically and mechanically and the requirements of paragraph 5.1 of this Standard shall be met. Following the test, the requirements of paragraph 4.1 through 4.3 of this Standard shall be met.\nc.",
    "c.\nAltitude - The instrument shall be subjected to the tests of DO-160A, paragraphs 4.6.1, 4.6.2, and",
    "4.6.3. When specified the instrument shall operate electrically and mechanically and the requirements of paragraph 5.1 of this Standard shall be met. After being subjected to the tests of paragraph 4.6.2, the requirements of paragraph 4.1 through 4.3 of this Standard shall be met and after being subjected to the tests of paragraph 4.6.3 the requirements of paragraphs 4.1 through 4.3 of this Standard shall be met.\nd.",
    "d.\nHumidity - The instrument shall be subjected to the tests of DO-160A, paragraph 6. After the \ninstrument is subjected to the appropriate tests of paragraph 6, it shall meet the requirements of paragraph 4.1 through 4.3 of this Standard.",
    "## 5.3 Shock:\n\nThe instrument shall be subjected to the tests of DO-160A, paragraphs 7.1 and 7.2.\n\na.\nAfter the instrument is subjected to the tests of paragraph 7.1, it shall meet the requirements of \nparagraph 4.1 through 4.3 of this Standard under standard conditions.\nb.\nFollowing the tests of paragraph 7.2, the instrument or dummy load shall have remained in its \nmounting and no parts of the instrument or its mounting base shall have become detached and free of the shock tested equipment.",
    "## 5.4 Vibration:\n\nThe instrument shall be subjected to the tests of DO-160A, paragraph 8.3. When specified the instrument shall operate electrically and mechanically and the requirements of paragraph 5.1 shall be met. Following the test, the requirements of paragraph 4.1 through 4.3 of this Standard shall be met at standard conditions.",
    "5.5\nPower Input:\na.\nNormal Electrical Input Variation:\n(1)\nThe instrument shall be subjected to the tests of DO-160A, paragraph 16.3.1. When specified, it \nshall meet the requirements of paragraph 5.1 of this Standard. Also the gyro rotor shall start and continue to rotate at the low voltage condition. Degraded performance as specified in DO-160A is allowed.\n(2)\nThe instrument shall be subjected to the tests of DO-160A, paragraph 16.3.2. When specified, it",
    "The instrument shall be subjected to the tests of DO-160A, paragraph 16.3.2. When specified, it \nshall meet the requirements of paragraph 5.1 of this Standard. Also the rotor gyro shall start and continue to rotate at the low voltage condition. Degraded performance as specified in DO-160A is allowed.\nb.\nAbnormal Electrical Input Variation:\n(1)\nThe instrument shall be subjected to the tests of DO-160A, paragraph 16.3.3. When specified, it",
    "The instrument shall be subjected to the tests of DO-160A, paragraph 16.3.3. When specified, it \nshall operate electrically and mechanically, and degradation of performance is permissible. There shall be no evidence of the presence of fire or smoke during the test of paragraph 16.3.3.2. After returning to normal input it shall meet the requirements of paragraph 4.1 through 4.3 of this Standard. Degraded performance as specified in DO-160A is allowed.\n(2)",
    "(2)\nThe equipment shall be subjected to the tests of DO-160A, paragraph 16.3.4. When specified, \nthe instrument shall work electrically and mechanically with degraded performance. There shall be no evidence of the presence of fire or smoke during the test of paragraph 16.3.4.2. After returning to normal power input it shall meet the requirements of paragraph 4.1 through 4.3 of \nthis Standard. Degraded performance as specified in DO-160A is allowed.\n5.6\nConducted Voltage Transients:",
    "5.6\nConducted Voltage Transients:\nThe instrument shall be subjected to the tests of DO-160A, paragraph 17.",
    "a.\nIntermittent Transients - Following the tests of paragraph 17.3.2 or paragraph 17.4.1, as appropriate, \nthe instrument shall meet the requirements of paragraph 4.1 through 4.3 of this Standard.\nb.\nRepetitive Transients - When the instrument is subjected to the tests of paragraph 17.4.2, it shall \nmeet the requirements of paragraph 5.1 of this Standard.\n5.7\nConducted Audio Frequency Susceptibility:",
    "5.7\nConducted Audio Frequency Susceptibility:\nThe instrument shall be subjected to the tests of DO-160A, paragraph 18. During the tests, the instrument shall meet the requirements of paragraph 5.1 of this Standard.",
    "5.8\nInduced Signal Susceptibility:\nThe instrument shall be subjected to the tests of DO-160A, paragraph 19. During the tests, the instrument shall meet the requirements of paragraph 5.1 of this Standard.\n\n5.9\nRadio Frequency Susceptibility and Emission:\nThe instrument shall be subjected to the tests of DO-160A, paragraphs 20 and 21. During the tests, the instrument shall meet the requirements of paragraph 5.1 of this Standard.",
    "5.10\nMagnetic Effect:\nThe instrument shall be tested in accordance with DO-160A, paragraph 15.\n\n5.11\nExplosion:\nInstruments which are to be marked Explosion, Category E, shall be tested in accordance with DO- 160A, paragraph 9.\n\n5.12\nWaterproofness:\nInstruments which are to be marked Waterproofness, Category W, shall be tested in accordance with DO-160A, paragraph 10. Following this test, the instrument shall meet the requirements of paragraph 4.1 through 4.3 of this Standard.",
    "5.13\nFluids Susceptibility:\nInstruments which are to be marked other than Category X shall be tested in accordance with DO-160A, paragraph 11. Following this test, the instrument shall meet the requirements of paragraph 4.1 through 4.3 of this Standard.",
    "5.14\nSand and Dust:\nInstruments which are to be marked Sand and Dust, Category D, shall be tested in accordance with DO- 160A, paragraph 12. Following this test, the instrument shall meet the requirements of paragraph 4.1 through 4.3 of this Standard.",
    "5.15\nFungus Resistance:\nInstruments which are to be marked Fungus Resistance, Category F, shall be tested in accordance with DO-160A, paragraph 13. Following this test, the instrument shall meet the requirements of paragraph 4.1 through 4.3 of this Standard.",
    "5.16\nSalt Spray:\nInstruments which are to be marked Salt Spray, Category S, shall be tested in accordance with DO- 160A, paragraph 14. Following this test, the instrument shall meet the requirements of paragraph 4.1 through 4.3 of this Standard.\n\n## 6. Minimum Acceptance Test Requirements Under Standard Conditions:",
    "## 6. Minimum Acceptance Test Requirements Under Standard Conditions:\n\nTests shall be performed by the manufacturer to his individual specification on each Magnetic Direction Instrument produced to show compliance with the following paragraphs of this Standard as applicable:\n\n4.1\nStarting\n4.2\nScale error\n4.3\nCompensation\n\n## 7. Test Procedures:\n\nThe following definitions of terms and conditions of tests are applicable to the equipment tests specified herein.\n\n## 7.1 Atmospheric Conditions:",
    "--`,,```````,`,,`,``,``,,,,`,`-`-`,,`,,`,`,,`---",
    "Unless otherwise specified, all tests required by this Standard must be conducted at an atmosphere pressure of approximately 29.92 inches (760 mm) of mercury, an ambient temperature of approximately +77 °F (+25 °C), and a relative humidity of not greater than 85 percent. When tests are conducted with the atmospheric pressure or temperature substantially different from these values, allowance must be made for the variation from the specified conditions.",
    "7.2\nVibration to Minimize Friction:\nUnless otherwise specified, all tests for performance may be conducted with the instrument subjected to a vibration of 0.002 to 0.005 inches (0.05 to 0.13 mm) double amplitude at a frequency of 25 to 33 Hertz. The term \"double amplitude\" as used herein indicates the total displacement from positive maximum to negative maximum.\n\n7.3\nPower Conditions:\nUnless otherwise specified, all tests must be conducted at the power rating recommended by the manufacturer.",
    "7.4\nMounting Position:\nUnless otherwise specified, all tests must be made with the instrument (Indicator, gyroscope, etc.) mounted in the normal operating position.",
    "7.5\nMagnetic Field Strength:\nUnless otherwise specified, ail tests required by this Standard shall be made with a horizontal field strength of approximately 0.18 gauss (.018 mT) and a vertical field strength of approximately 0.54 gauss (.054 mT), in the direction normal in the northern hemisphere. When tests are made with field strength value substantially different from these values, allowance shall be made for variations from the specified tolerances.",
    "7.6\nCompensators:\nUnless otherwise specified, all tests shall be made with magnetic compensators removed or adjusted to the neutral position."
  ]
}