{
  "source": "SAE AS 396 B.md",
  "chunks": [
    "## Aerospace Standard\n\n| Issued        | 1947-08   |\n|---------------|-----------|\n| Revised       | 1958-07   |\n| Reaffirmed    | 1991-05   |\n| Noncurrent    | 1996-11   |\n| Reaf. Noncur. | 2008-02   |\n\n## Bank And Pitch Instruments (Indicating Stabilized Type) (Gyroscopic Horizon, Attitude Gyro) Foreword",
    "This document has been declared \"NONCURRENT\".  It is recommended, therefore, that this document not be specified for new designs.  \"NONCURRENT\" refers to those documents which have previously been widely referenced and may continue to be required on some existing designs.  \"NONCURRENT\" documents are available from SAE upon request.\n\n## 1. Purpose:",
    "## 1. Purpose:\n\nTo specify the minimum requirements for gyroscopically stabilized Bank and Pitch Indicating Instruments for use in aircraft, the operation of which may subject the instruments to the environmental conditions specified in Section 3.3.\n\n## 2. Scope:\n\nThis Aeronautical Standard covers both direct and repeating type gyroscopically stabilized Bank and Pitch Indicating Instruments.",
    "3.\nGENERAL REQUIREMENTS:\n3.1\nMaterial and Workmanship:\n3.1.1\nMaterials: Materials shall be of a quality which experience and/or tests have demonstrated to be \nsuitable and dependable for use in aircraft instruments.\n3.1.2\nWorkmanship: Workmanship shall be consistent with high-grade aircraft instrument \nmanufacturing practice.",
    "TO PLACE A DOCUMENT ORDER: \n                             Tel:        877-606-7323 (inside USA and Canada) \n \n                             Tel:        724-776-4970 (outside USA) \n \n                             Fax:       724-776-0790 \n \n                             Email:    CustomerService@sae.org \nSAE WEB ADDRESS: \n                              \n                             http://www.sae.org \n\n## 3.2 Identification:",
    "## 3.2 Identification:\n\nThe following information shall be legibly and permanently marked on the instrument or attached thereto:\n\na.\nName of Instrument\nb.\nAeronautical Standard AS 396B\nc.\nManufacturer's Part Number\nd.\nManufacturer's Serial Number or Date of Manufacture\ne.\nManufacturer's Name and/or Trade-Mark\nf.\nRating (Electrical, Vacuum, Etc.)\n\n## 3.3 Environmental Conditions:",
    "## 3.3 Environmental Conditions:\n\nThe following conditions have been established as design requirements only.  Tests shall be conducted as specified in Section 5, 6 and 7.\n\n3.3.1\nTemperature: When installed in accordance with the instrument manufacturer's instructions, the \ninstrument shall function over the range of ambient temperatures shown in Column A below and shall not be adversely affected by exposure to the temperatures shown in Column B below:",
    "Instrument Location\n  A   \n  B   \nHeated Areas (Temperature Controlled)\n-30 to 50C\n-65 to 70C\nUnheated Areas (Temperature Uncontrolled)\n-55 to 70C\n-65 to 70C",
    "3.3.2\nHumidity: The instrument shall function and shall not be adversely affected when exposed to any \nrelative humidity in the range from 0 to 95% at a temperature of approximately 32C.\n3.3.3\nVibration: When installed in accordance with the instrument manufacturer's instructions, the instruments shall function and shall not be adversely affected when subjected to vibrations of the \nfollowing characteristics:",
    "Instrument Location\n                     in Airframe                 \nCycles\nPer Sec.\nMax. Double\nAmplitude (Inches)\nMax.\nAcceleration\nPower Plant Mounted\n  5 - 150\n0.100\n20g\nWings and Empennage\n  5 - 500\n0.036\n10g\nFuselage\n  5 - 500\n0.036\n  5g\nPanel or Rack (with\n  5 - 50\n0.020\n1.5g\n   Shockmounts)",
    "3.3.4\nAltitude: The instrument shall function and shall not be adversely affected when subjected to a pressure and temperature range equivalent from -1000 feet to 40,000 feet standard altitude per NACA Report 1235, except as limited by application of Paragraph 3.3.1.  The instrument shall not be adversely affected when subjected to a pressure of 50 in. Hg. absolute.\n\n## 3.4 Radio Interference:",
    "## 3.4 Radio Interference:\n\nThe instrument shall not be the source of objectionable interference, under operating conditions at any frequencies used on aircraft either by radiation or feed-back, in the radio equipment installed in the same aircraft as the instrument.\n\n3.5\nMagnetic Effect:\nThe magnetic effect of the instrument shall not adversely affect the operation of other instruments installed in the same aircraft.\n\n## 4. Detail Requirements:",
    "## 4. Detail Requirements:\n\n4.1\nOperating Range:\nThe instrument shall be operable following maneuvers of 360 degrees in bank and 360 degrees in pitch.  Controlled precession may be employed to achieve the 360 degrees in pitch.\n\n## 4.2 Methods Of Display:",
    "## 4.2 Methods Of Display:\n\nThe method of displaying bank and pitch attitude shall be as specified below: Bank attitude shall be displayed so that the true relationship between aircraft bank attitude and the actual earth's horizon is clearly presented over the range of indication. Pitch attitude shall be displayed so that a change between the aircraft's pitch attitude and the actual earth's horizon is clearly presented in the proper relationship over the range of indication.",
    "4.3\nIndicating Requirements:\n4.3.1\nIndicating Range: The range of indication in pitch shall be at least plus or minus 25 degrees.  The \nrange of indication in bank shall be at least plus or minus 100 degrees.\n4.3.2\nIndicating Graduations: Right and left bank graduations shall at least be provided at\n30 degrees.\n4.3.3\nPitch Attitude Reference: A zero pitch reference shall be provided.  An adjustable pitch reference",
    "Pitch Attitude Reference: A zero pitch reference shall be provided.  An adjustable pitch reference \nmarker or indicator may be provided to accommodate a range of pitch attitude trim.\n4.3.4",
    "Visibility and Parallax: Index and dial markings shall be visible from any point within the frustum of a cone the side of which makes an angle of not less than 30 degrees with the perpendicular to the dial and the small diameter of which is the aperture of the instrument case.  Parallax error of the indicating elements shall be less than two degrees within a frustum of a cone the side of which makes an angle of 30 degrees with the perpendicular to the dial and the small diameter of which is the",
    "an angle of 30 degrees with the perpendicular to the dial and the small diameter of which is the aperture of the instrument cone.",
    "4.3.5\nFinish: Unless otherwise specified by the user, matte white material shall be applied to major graduations, numerals and pointers.  Non-functional surfaces shall be a durable dull black.\n4.4\nPower Variation:\nAll instruments shall properly function with ± 15% variation in D.C. voltage and/or ± 10% variation in A.C. voltage and ± 5% frequency variation.",
    "4.5\nTurn Error:\nThe bank or pitch indicating error resulting from a coordinated turn of 180 degrees in one (1) minute at a true airspeed of 180 mph (156 knots) shall not exceed 3 degrees.",
    "4.6\nPower Malfunction Indication:\nMeans shall be incorporated in the instrument to indicate when adequate power (voltage and/or current) is not being made available to all the phases required for the proper operation of the instrument.  The indicating means shall indicate a failure or a malfunction in a positive manner.",
    "4.7\nGyro Caging:\nIf a gyro caging means is provided, it shall not be capable of inadvertently locking the gyro in a caged position.  Any failures which cause the gyro to be caged shall be indicated in a positive manner.\n\n## 5. Test Conditions: 5.1 Atmospheric Conditions:",
    "Unless otherwise specified, all tests required by this Aeronautical Standard shall be conducted at an atmospheric pressure of approximately 29.92 inches of mercury and at an ambient temperature of approximately 25 C and at a relative humidity of not greater than 85 percent.  When tests are conducted with atmospheric pressure or temperature substantially different from these values, allowance shall be made for the variations from the specified conditions.",
    "## 5.2 Vibration (To Minimize Friction):\n\nUnless otherwise specified, all tests for performance may be conducted with the instrument subjected to a vibration of 0.002 to 0.005 inch double amplitude at a frequency of 1500 to 2000 cycles per minute.  The term double amplitude as used herein indicates the total displacement from positive maximum to negative maximum.\n\n## 5.3 Vibration Equipment:",
    "## 5.3 Vibration Equipment:\n\nVibration equipment shall be used which will provide frequencies and amplitudes consistent with the requirements of Paragraph 3.3.3 with the following characteristics:",
    "5.3.1\nLinear Motion Vibration: Vibration equipment shall be such as to allow vibration to be applied along each of three mutually perpendicular axes of the instrument.\n5.3.2\nCircular Motion Vibration: Vibration equipment shall be such that a point on the instrument case will describe a circle in a plane inclined 45 degrees to the horizontal plane, the diameter of which is equal to the double amplitude specified.\n5.4\nPower Conditions:",
    "5.4\nPower Conditions:\nUnless otherwise specified, all tests shall be conducted at the power rating recommended by the manufacturer.",
    "5.5\nPosition:\nUnless otherwise specified, all tests shall be made with the instrument (indicators, amplifiers, transmitters, etc.) mounted in their normal operating position.\n\n## 6. Individual Performance Tests:\n\nAll instruments shall be tested in accordance with the manufacturer's recommendations.  The manufacturer shall conduct sufficient tests to prove compliance with this standard including the following requirements where applicable.",
    "6.1\nStarting:\nInstrument performance shall be achieved within 3 minutes after normal rated power is applied.  By application of 80 percent of rated voltage the gyro rotor shall start and continue to rotate.",
    "6.2\nSettling Error:\nWhen the gyro has erected and attained equilibrium speed and the indicator and/or the gyro component has been oscillated on a roll, pitch and yaw, simulator through an angle of ± 7½ deg. about each axis at a frequency of 5 to 7 cycles per minute for 30 minutes and then returned to level position, the alignment of the bank and pitch indicators with their respective zero indices shall be within one degree.",
    "6.3\nVerticality:",
    "With the instrument mounted on a level platform and the gyro running at equilibrium, an azimuth rotation of the platform of 180 degrees shall result in less than 1.0 degree change in either the roll or the pitch indication.  The rotation of the platform and the 180 degree instrument reading shall be accomplished within a time period of ten (10) seconds.  If the gyro's spin axis is inclined, for purposes of turn error correction, there shall be, in addition to the tolerance, a change in pitch",
    "purposes of turn error correction, there shall be, in addition to the tolerance, a change in pitch indication equivalent to twice the angle of inclination.",
    "## 6.4 Dielectric:\n\nUngrounded instruments or grounded instruments prior to connection of internal ground wire, shall be tested by either the method of inspection of Paragraphs 6.4.1 or 6.4.2.",
    "6.4.1\nInsulation Resistance: The insulation resistance measured at 500 volts D.C. (200 volts for \nhermetically sealed, inert gas filled instruments) between all electrical circuits connected together and the metallic case shall not be less than 20 megohms.\n6.4.2\nDielectric Strength: The insulation shall withstand without evidence of damage the application of a",
    "sinusoidal voltage at a commercial frequency between all electrical circuits connected together and the metallic case, for a period of five seconds.  The RMS value of the sinusoidal voltage applied shall be either five (5) times the maximum instrument operating voltage, or 500 volts, (200 volts for sealed, inert gas filled instruments), whichever is lower.\n6.4.2.1\nInstruments having a permanent internal ground connection shall be tested as follows:",
    "6.4.2.1\nInstruments having a permanent internal ground connection shall be tested as follows:\nThe insulation shall withstand without evidence of damage the application of a sinusoidal voltage at a commercial frequency between each electric circuit and the metallic case, for a period of five (5) seconds.  The RMS value of the sinusoidal voltage applied shall be 1.25 times the maximum circuit operating voltage obtainable between the test points.",
    "## 7. Qualification Tests:\n\nAs many instruments as deemed necessary to demonstrate that all instruments will comply with the requirements of this section shall be tested in accordance with the manufacturer's recommendations.\n\n## 7.1 Low Temperature:",
    "## 7.1 Low Temperature:\n\nThe instrument, shall be subjected to the temperature indicated in the following table, in accordance with their location in the aircraft.  After exposure to this temperature for 5 hours, the instrument shall start upon application of rated power and at that temperature shall meet the requirements of Paragraph 6.2 except that the allowable alignment tolerance shall be 2 degrees.",
    "| Instrument Location                      | Temperature   |\n|------------------------------------------|---------------|\n| Heated Area (Temperature Controlled)     | -30 C         |\n| Unheated Area (Temperature Uncontrolled) | -55 C         |\n\n## 7.2 High Temperature:\n\nThe requirements of Paragraph 7.1 shall apply except that the exposure temperature shall be 50C for heated areas and 70C for unheated areas.\n\n## 7.3 Extreme Temperature Exposure:",
    "## 7.3 Extreme Temperature Exposure:\n\nThe instrument shall, after alternate exposures to ambient temperature of 65C and 70C for periods of 24 hours each and a delay of 3 hours at room temperature following completion of the exposure, meet the requirements of Section 6 at room temperature.  There shall be no evidence of damage as a result of exposure to the extreme temperatures specified herein.\n\n## 7.4 Magnetic Effect:",
    "The magnetic effect of the Indicator shall be determined in terms of the deflection of a free magnet, approximately 1½ inches long, in a magnetic field with a horizontal intensity of 0.18 (±0.01) gauss when the indicator is held in various positions on an east-west line with its nearest part 12 inches from the center of the magnet.  This test shall first be made with the indicator not operating and then shall be repeated with the indicator in normal operation.  The maximum deflection of the",
    "and then shall be repeated with the indicator in normal operation.  The maximum deflection of the free magnet shall not exceed 5 degrees for any pointer or dial position.",
    "## 7.5 Humidity:\n\nThe instrument (indicator, remote gyro, amplifier, etc.) shall be mounted in a chamber maintained at a temperature of 70 ± 2C and a relative humidity of 95 ± 5% for a period of six hours.  After this period the heat shall be shut off and the instrument shall be allowed to cool for a period of 18 hours in this atmosphere in which the humidity rises to 100% as the temperature decreases to not more than 38 C.  This complete cycle shall be conducted:",
    "a.\nFive times for components located in uncontrolled temperature areas.\nb.\nOnce for components located in controlled temperature areas.\nImmediately after recycling; there shall be no evidence of damage or corrosion which affects performance, following this test, and the instrument shall meet the requirements of Section 6 except for Paragraph 6.4.\n\n## 7.6 Vibration:",
    "Resonance - The instrument, while operating, shall be subjected to a resonant frequency survey of the appropriate range specified in Paragraph 3.3.3 in order to determine if there exists any resonant frequencies of the parts.  The amplitude used may be any convenient value that does not exceed the maximum double amplitude and the maximum acceleration specified in Paragraph 3.3.3. The instrument shall then be subjected to a vibration at the appropriate maximum double amplitude or maximum",
    "shall then be subjected to a vibration at the appropriate maximum double amplitude or maximum acceleration specified in Paragraph 3.3.3 at the resonant frequency for a period of one hour in each axis or with circular motion vibration, whichever is applicable.  When more than one resonant frequency is encountered with vibration applied along any one axis a test period may be accomplished at the most severe resonance, or the period may be divided among the resonant frequencies, whichever shall be",
    "severe resonance, or the period may be divided among the resonant frequencies, whichever shall be considered most likely to produce failure.  The test period shall not be less than one-half hour at any resonant mode.  When resonant frequencies are not apparent within the specified frequency range, the instrument shall be vibrated for two hours in accordance with the vibration requirements schedule (Paragraph 3.3.3) at the maximum double amplitude and the frequency to provide the maximum",
    "schedule (Paragraph 3.3.3) at the maximum double amplitude and the frequency to provide the maximum acceleration. Cycling - The instrument, while operating, shall be tested with the frequency cycled between limits specified in Paragraph 3.3.3 in 15 minute cycles for a period of one hour in each axis at an applied double amplitude specified in Paragraph 3.3.3, or an acceleration specified in Paragraph 3.3.3, whichever is the limiting value or a total of three hours for circular motion vibration,",
    "3.3.3, whichever is the limiting value or a total of three hours for circular motion vibration, whichever is applicable. The instrument shall be tested during vibration to determine that it is functioning properly.  After the completion of this vibration test, no damage shall be evident and the instrument shall meet the requirements of Section 6 (other than Paragraph 6.4)."
  ]
}