{
  "source": "TSO-C219 AIRBORNE COLLISION AVOIDANCE SYSTEM (ACAS) XaXo.md",
  "chunks": [
    "# Department Of Transportation Federal Aviation Administration Aircraft Certification Service\n\nWashington, DC Effective  \nDate:  02/28/20 \n\n## Technical Standard Order\n\nSubject: AIRBORNE COLLISION AVOIDANCE SYSTEM (ACAS) Xa/Xo \n \n1.",
    "## Technical Standard Order\n\nSubject: AIRBORNE COLLISION AVOIDANCE SYSTEM (ACAS) Xa/Xo \n \n1. \n\nPURPOSE. This technical standard order (TSO) is for manufacturers applying for a TSO \nauthorization (TSOA) or letter of TSO design approval (LODA). In it, we (the Federal Aviation Administration (FAA)) tell you what minimum performance standards (MPS) your airborne collision avoidance system (ACAS) Xa/Xo must first meet for approval and identification with the applicable TSO marking. \n\n2.",
    "2. \n\nAPPLICABILITY.  This TSO affects new applications submitted after its effective date. a. It is the intention of the FAA to transition manufacturers to the latest airborne traffic alerting and collision avoidance system to increase safety margins, to improve the surveillance logic and to optimize the collision avoidance logic.  All these enhancements support NextGen operations.",
    "Accordingly, TSO-C119e, Traffic Alert and Collision Avoidance System (TCAS) Airborne Equipment, TCAS II with Hybrid Surveillance, dated June 30, 2016, will remain effective until 24 \nmonths after issuance of this TSO or March 30, 2022 whichever is later.  After this date, we will no longer accept applications for TSO-C119e.",
    "b. TCAS II Airborne Equipment and TCAS II with Hybrid Surveillance, approved under a previous TSOA, may still be manufactured under the provisions of its original approval. \n\n \nc.  \"ACAS X\" in this TSO refers to an ACAS Xa/Xo system and not to any other ACAS X \nvariant. \n\n3.",
    "**REQUIREMENTS.**  New models of ACAS X identified and manufactured on or after the effective date of this TSO must meet the MPS qualification and documentation requirements in Section 2.1 and 2.2 of RTCA/DO-385, Minimum Operational Performance Standards for Airborne Collision Avoidance System X (ACAS X) (ACAS Xa and ACAS Xo), dated October 2, 2018, as modified by Change 1, dated September 16, 2019 and Appendix A of this TSO.",
    "a. **Functionality.**  This TSO's standards apply to equipment intended to provide a reliable traffic alert and collision avoidance function for transponder-equipped aircraft.  \n \nTable 1-1 defines the ACAS X equipment classes, article labels and functionality for the ACAS X \narchitecture.  There are two classes:",
    "- Class 1 (ACAS Xa - Active Surveillance) and\n\n## - Class 2 (Acas Xo - Operation Specific Surveillance Capability)",
    "The classes define the capability of the ACAS X System. Class 1 equipment introduces enhanced algorithms compared to the existing Traffic Alert and Collision Avoidance System II (TCAS II) system, with no new traffic symbols, control modes, Traffic Advisory (TA)/Resolution Advisory (RA) information, or operational procedures, so control panels, displays and other existing articles that support TCAS II can be used with the ACAS Xa unit. Class 2 Systems need displays and control panels that",
    "TCAS II can be used with the ACAS Xa unit. Class 2 Systems need displays and control panels that support DNA and/or CSPO-3000 functions (see Note below). ACAS Xo DNA provides the capability to suppress all ACAS X alerts and guidance for a designated aircraft; and CSPO-3000 modifies the Collision Avoidance System (CAS) logic for closely spaced parallel approaches separated by 3000 feet for a designated aircraft.",
    "ACAS X  \nEquipment  \nACAS X  \nArticle \nClass \nCapability  \nArticle Name \nFunction/Notes \nLabel \n* \nACAS X \nA \nDirectional \nAntenna \nOmni-\n* \nACAS X \nB \nDirectional \nAntenna \nResolution \nAdvisory (RA) \n* \nACAS X \nC \nGuidance and \nAnnunciation \nDisplay \nD \nACAS Xa Unit \n1 \nACAS Xa  \nE \nControl Panel \nMode control for the basic ACAS Xa  \nF \nTraffic Display \nDisplay of traffic and alerting \nD1 \nACAS Xo Unit \nAdds DNA (see Note) \nD2 \nACAS Xo Unit  Adds CSPO-3000 (see Note) \nACAS Xo \nE1",
    "D1 \nACAS Xo Unit \nAdds DNA (see Note) \nD2 \nACAS Xo Unit  Adds CSPO-3000 (see Note) \nACAS Xo \nE1 \nControl Panel  \nMode control with DNA \n2 \n(Includes \nE2 \nControl Panel  \nMode control with CSPO-3000 \n \nACAS Xa) \nF1 \nTraffic Display  Display of traffic, alerting, DNA symbols \n \nF2 \nTraffic Display \nDisplay of traffic, alerting, CSPO-3000 symbols",
    "There are twelve articles associated with the ACAS X equipment. Three of the articles are generic \n(marked with * in Table 1-1) and do not have a class associated with them because the performance standards do not differ and are compatible universally on either Class 1 or Class 2 equipment. The other articles have both class and article labels. Appendix I of RTCA/DO-385 maps the performance",
    "Broadcasts and receives 1030 MHz and 1090 MHz messages, respectively. Mounted on the top or bottom of the aircraft. Broadcasts and receives 1030 MHz and 1090 MHz messages, respectively. Mounted on the bottom of the aircraft in lieu of a bottom directional antenna. Display and annunciation of RA alerting and vertical guidance Performs airspace surveillance, intruder tracking, ownship altitude tracking, threat detection, RA maneuver determination and selection, and generation of advisories.",
    "tracking, threat detection, RA maneuver determination and selection, and generation of advisories. Includes STM and TRM (see Note).",
    "requirements for each article. Each article is labeled alphabetically and is further delineated by the ACAS Xo capability (DNA or CSPO-3000). Articles may be combined into one unit and labeled with multiple article markings (See Paragraph 4).  \n\n \nNote:  \nDNA - Designated No Alerts function CSPO-3000 - Closely Spaced Parallel Operations down to 3,000 feet runway separation \nSTM - Surveillance and Tracking Module \nTRM - Threat Resolution Module \n \n\n## B. Failure Condition Classification.",
    "## B. Failure Condition Classification.\n\n(1) Failure of the function defined in paragraph **3.a** of this TSO that causes misleading information is:",
    "(a) \n *Hazardous/severe-major* for un-annunciated failures that could generate an \nincorrect ACAS X RA, or result in a missing ACAS X RA.  \n(b) *Major* for un-annunciated failures that could generate a false ACAS X Resolution \nAdvisory (RA).",
    "Advisory (RA).   \nHowever, you may follow the guidance in Advisory Circular (AC) 20-151C, Airworthiness Approval of Traffic Alert and Collision Avoidance Systems (TCAS II), Versions 7.0 & 7.1 and Associated Mode S Transponders, dated July 21, 2017, to define these failure condition classifications.  \nNote:  As used in this paragraph:",
    "- \nA threat is an intruder aircraft that satisfies the threat detection logic and thus \nrequires a RA. \n- \nAn incorrect RA is a RA occurring when a threat is present, but, because of the \nfailure of function, commands a maneuver that reduces separation to the threat. \n- \nA false RA is a RA caused by an ACAS X malfunction that is not warranted by  \nan actual threat.    \n- \nA missing RA is a RA that does not occur, or that occurs later than the collision",
    "- \nA missing RA is a RA that does not occur, or that occurs later than the collision \nalerting system logic indicates is necessary, when a threat is present.  \n(2) Loss of the function defined in paragraph **3.a** of this TSO is a *major* failure condition, provided the ACAS X equipment provides annunciation of any loss of capability to generate a RA. However, you may follow the guidance in AC 20-151C, to define this failure condition classification.",
    "Note:  Loss of function does not include unannunciated loss or degradation of capability to generate a RA.  Unannunciated loss or degradation of capability to generate a RA is an unannunciated failure that may result in a missing RA.  See paragraph 3.b(1)(a) of this TSO.  \n(3) Design the system to at least these failure condition classifications. However, you may follow the guidance in AC 20-151C, to define these failure condition classifications.",
    "c. **Functional Qualification.** Demonstrate the required performance under the test conditions in Section 2.4 of RTCA/DO-385 as modified by Change 1 and Appendix A.  Use the ACAS \n \nX Test Suite Encounter Set found in RTCA DO-385 Electronic Supplement, dated August 8, 2018, where applicable in RTCA/DO-385 as modified by Change 1 and Appendix A.",
    "d. **Environmental Qualification.** Demonstrate the required performance under the test conditions specified in Section 2.3 of RTCA/DO-385 using standard environmental conditions and test procedures appropriate for airborne equipment. You may use a different standard environmental condition and test procedure than RTCA/DO-160G, Environmental Conditions and Test Procedures for Airborne Equipment, dated December 8, 2010, provided the standard is appropriate for the ACAS X airborne equipment.",
    "Note: The use of RTCA/DO-160D (with Changes 1 and 2 only, without change 3 \nincorporated) or earlier versions is generally not considered appropriate and will require substantiation via the deviation process as discussed in paragraph **3.g** of this TSO.",
    "e. **Software Qualification.** If the article includes software, develop the software according to RTCA, Inc. document RTCA/DO-178C, Software Considerations in Airborne Systems and Equipment Certification, dated December 13, 2011, including referenced supplements as applicable, to at least the software level consistent with the failure condition classification defined in paragraph **3.b** of this TSO.",
    "f. **Electronic Hardware Qualification.** If the article includes complex custom airborne electronic hardware, then develop the component according to RTCA, Inc. Document RTCA/DO-254, *Design Assurance Guidance for Airborne Electronic Hardware*, dated April 19,",
    "2000, to at least the design assurance level consistent with the failure condition classification defined in paragraph **3.b** of this TSO. For custom airborne electronic hardware determined to be simple, RTCA/DO-254, paragraph 1.6 applies.",
    "g. **Deviations**. We have provisions for using alternate or equivalent means of compliance with the criteria in the MPS of this TSO. If you invoke these provisions, you must show that your equipment maintains an equivalent level of safety. Apply for a deviation pursuant to 14 CFR § 21.618. \n\n \n\n## 4.     Marking.",
    "## 4.     Marking.\n\na. Mark at least one major component permanently and legibly with all of the information in \n14 CFR 45.15(b).  Use serial number in place of optional date of manufacture as stated in 14 CFR 45.15(b)(2).  Include equipment class and article name, unless the classes and article name are identified in the installation instructions or by software.",
    "b. If the article includes software and/or airborne electronic hardware, then the article part numbering scheme must identify the software and airborne electronic hardware configuration. The part numbering scheme can use separate, unique part numbers for software, hardware, and airborne electronic hardware.",
    "c. You may use electronic part marking to identify software or airborne electronic hardware components by embedding the identification within the hardware component itself (using software) rather than marking it on the equipment nameplate. If electronic marking is used, it must be readily \n \naccessible without the use of special tools or equipment. \n\n \n5.",
    "5. \n\nAPPLICATION DATA REQUIREMENTS. You must give the FAA aircraft certification office (ACO) manager responsible for your facility a statement of conformance, as specified 14 \nCFR 21.603(a)(1) and one copy each of the following technical data to support your design and production approval. LODA applicants must submit the same data (excluding paragraph 5.g) \nthrough their civil aviation authority.",
    "a. Manuals containing the following: \n \n(1) Operating instructions and article limitations sufficient to describe the equipment's operational capability. \n\n \n(2) Detailed description of any deviations.",
    "(3) Installation procedures and limitations sufficient to ensure that the ACAS X, when installed according to the installation or operational procedures, still meets this TSO's requirements. Limitations must identify any unique aspects of the installation. The limitations must also include a note with the following statement: \n \n\"This article meets the minimum requirements of TSO-C219.      \nInstallation of this article requires separate approval.\"",
    "Installation of this article requires separate approval.\" \n \n(4) For each unique configuration of software and airborne electronic hardware, reference the following: \n \n(a) Software part number including revision and design assurance level; (b) Airborne electronic hardware part number including revision and design assurance level; and,",
    "(c) Functional description. \n \n(5) A summary of the test conditions used for environmental qualifications for each component of the article. For example, a form as described in RTCA/DO-160G, Environmental Conditions and Test Procedures for Airborne Equipment, Appendix A. \n\n \n(6) Schematic drawings, wiring diagrams, and any other documentation necessary for installation of the ACAS X.",
    "(7) By-part-number list of replaceable components that makes up the ACAS X. Include vendor part number cross-references, when applicable. \n\n \nb. Instructions covering periodic maintenance, calibration, and repair, to ensure that the ACAS X continues to meet the TSO approved design. Include recommended inspection intervals and service life, as appropriate.",
    "c. If the article includes software: a plan for software aspects of certification (PSAC), \n \nsoftware configuration index, and a software accomplishment summary. \n\n \nd. If the article includes simple or complex custom airborne electronic hardware, a plan for hardware aspects of certification (PHAC), a hardware verification plan, top-level drawing, and hardware accomplishment summary (or similar document, as applicable).",
    "e. A drawing depicting how the article will be marked with the information required by paragraph 4 of this TSO.",
    "f. Identify functionality or performance contained in the article not evaluated under paragraph 3 of this TSO (defined as non-TSO functions). Non-TSO functions can be accepted in parallel with the TSO authorization. For those non-TSO functions to be accepted, you must declare these functions and include the following information with your TSO application:",
    "(1) Description of the non-TSO function(s), such as performance specifications, failure condition classifications, software, hardware, and environmental qualification levels. Include a statement confirming that the non-TSO function(s) do not interfere with the article's compliance with the requirements of paragraph 3.",
    "(2) Installation procedures and limitations sufficient to ensure that the non-TSO function(s) \nmeets the declared functions and performance specification(s) described in paragraph **5.f.(1)**. \n\n \n(3) Instructions for continued performance applicable to the non-TSO function(s) described in paragraph **5.f.(1)**. \n\n \n(4) Interface requirements and applicable installation test procedures to ensure compliance with the non-TSO function(s) performance data defined in paragraph **5.f.(1)**.",
    "(5) Test plans, analysis, and results, as appropriate, to verify that performance of the hosting TSO article is not affected by the non-TSO function(s). \n\n \n(6) Test plans and analysis, as appropriate, to verify the function and the performance of the non-TSO function(s) as described in paragraph **5.f.(1)**.",
    "g. The quality manual required by 14 CFR 21.608 including functional test specifications. The quality system must ensure that you will detect any change to the approved design that could adversely affect compliance with the TSO MPS, and reject the article accordingly. (Not required for LODA \napplicants.) Applicants who currently hold TSOAs must submit revisions to the existing quality manual as necessary.",
    "h. A description of your organization as required by 14 CFR 21.605. \n \ni. \nMaterial and process specifications list. \n \nj. A list of all drawings and processes (including revision level) that define the \narticle's design. \n \nk. Manufacturer's TSO qualification report showing results of testing accomplished \naccording to paragraph 3.c of this TSO. \n\n \n6.",
    "MANUFACTURER DATA REQUIREMENTS.   Besides the data given directly to the responsible ACO, have the following technical data available for review by the responsible ACO: \n \na. For new, first of model articles send recorded flight test data from RTCA/DO-385 \nMOPS, §§ 3.4.4.1.g, 3.4.4.2, and 3.4.4.4 to the FAA Technical Center and coordinate with the responsible ACO for review and acceptance.  For follow-on models, at the discretion of the ACO, submit the recorded flight test data for review.",
    "Note: Details concerning the format and data types of the data to be provided should be coordinated with the FAA in a timely manner. Sixty days or more in advance of the availability of the recorded flight data is recommended.  \n \nContact information for FAA Technical Center flight test data review: FAA William J. Hughes Technical Center  \nANG-C31  Bldg. 301  3rd floor Atlantic City International Airport Atlantic City, NJ 08405 Email:  9-AVS-AIR-ACAS-TEST@faa.gov",
    "b. Provide documentation the ACAS X parameter data item files (PDIF) that are described in Section 1.6 of RTCA/DO-385 are properly identified, controlled and distributed.  \n \nc. Functional qualification specifications for qualifying each production article to ensure compliance with this TSO.",
    "d. Article calibration procedures. \n \ne. Schematic drawings. \n \nf. Wiring diagrams. \n \ng. Material and process specifications. \n \nh. The results of the environmental qualification tests conducted according to paragraph 3.d \nof this TSO. \n \ni. \n\nIf the article includes software, the appropriate documentation defined in RTCA/DO-\n178C, including all data supporting the applicable objectives in Annex A, Process Objectives and Outputs by Software Level.",
    "j. If the article includes complex custom airborne electronic hardware, the appropriate hardware life cycle data in combination with design assurance level, as defined in RTCA/DO-254, \n\nAppendix A, Table A-1. For simple custom airborne electronic hardware, the following data: test cases or procedures, test results, test coverage analysis, tool assessment and qualification data, and configuration management records, including problem reports.",
    "k.  If the article contains non-TSO function(s), you must also make available items 6.b through **6.j** as they pertain to the non-TSO function(s). \n\n \n\n## 7. Furnished Data Requirements.",
    "## 7. Furnished Data Requirements.\n\na. When furnishing one or more articles manufactured under this TSO to one entity (such as an operator or repair station), provide one copy or on-line access to the data in paragraphs **5.a** and 5.b of this TSO. Add any other data needed for the proper installation, certification, use, or continued compliance with the TSO, of the ACAS X.",
    "b. If the article contains declared non-TSO function(s), include one copy of the data in paragraphs **5.f.(1)** through 5.f.(4). \n\n \nc. If the article contains software or AEH, provide a copy of the Open Problem Report (OPR) summary to the Type Certificate/Supplemental Type Certificate design approval holder. \n\n \n\n## 8. How To Get Referenced Documents",
    "## 8. How To Get Referenced Documents\n\na. Order RTCA documents from RTCA Inc., 1150 18th Street NW, Suite 910, Washington, D.C. 20036. Telephone (202) 833-9339, fax (202) 833-9434. You can also order copies online at www.rtca.org.",
    "b. Order copies of 14 CFR parts 21 and 45 from the Superintendent of Documents, Government Publishing Office, P.O. Box 979050, St. Louis, MO 63197-9000. Telephone (202) 512-\n1800, fax (202) 512-2104.  You can also order copies online at bookstore.gpo.gov , or find them online at the FAA's Internet website Regulatory and Guidance Library at rgl.faa.gov . \n\n \nc. You can find a current list of TSOs and ACs at rgl.faa.gov. You will also find the TSO \nIndex of Articles at the same site.",
    "Victor W. Wicklund Aircraft Certification Service Acting Deputy Director, Policy and Innovation Division\n \n\n## Appendix A.  Faa Modifications To Rtca/Do-385 And Change 1 This Appendix Lists Faa Modifications To Rtca/Do-385 And Change 1, Minimum Operational Performance Standards For Airborne Collision Avoidance System (Acas X) (Acas Xa And Acas Xo).",
    "Replace 3rd sentence in 5th paragraph in Section 2.2.3.6.1 with   \nIdentification and surveillance of on-ground Active CAS can be accomplished by examining the VS field in the DF=0 acquisition reply to a UF=0 acquisition interrogation as described in §2.2.4.6.2.2.2 and by correlating the ICAO 24-bit Aircraft Address associated with the reply with the address received in the TCAS Broadcast Interrogation.",
    "Replace 2nd and 4th paragraph in Section 2.2.3.9.2.1 with",
    "The Capability field, CA, in DF=11 transmissions from RTCA/DO-181A or later transponders (§2.2.3.8.3.1.5) indicates whether the vertical status of the Mode S equipped aircraft is airborne, on the ground, or unknown.  ACAS X **shall** (1106) make use of the CA field information from RTCA/DO-181A or later transponders as described in §2.2.4.6.2.2.2 to prevent unnecessary interrogations to aircraft that are on the ground. ACAS X derives the ICAO 24-bit Aircraft Address of Mode S-equipped aircraft",
    "that are on the ground. ACAS X derives the ICAO 24-bit Aircraft Address of Mode S-equipped aircraft from the AA field of DF11 or DF17 messages.  Additionally, ACAS X **shall** (1107) examine the Vertical Status field, VS, in the DF=0 transmissions from the aircraft as described in §2.2.4.6.2.2.2 in order to minimize interrogations and prevent tracking of aircraft on the ground.",
    "Note: ACAS X also monitors the FS field in received downlink formats DF=4, 5, 20, 21 (§2.2.3.8.3.1.8) for Mode S intruder air/ground determination as described in §2.2.4.6.2.2.2. \n\nReplace Section 2.2.4.6.2.2.1 with All newly initiated tracks should default to the IN-AIR state until ACAS X determines their true Air-\nGround condition. ACAS X **shall** determine the true Air-Ground state using §2.2.4.6.2.2.2 and \n§2.2.4.6.2.2.3 as criteria.",
    "Replace Section 2.2.4.6.2.2.2 with  \nA Mode S-equipped intruder **shall** default to IN-AIR status, unless it is declared ON-GROUND by ACAS X. The ACAS X **shall** declare an intruder ON-GROUND if its CA, FS, and VS fields indicate \n'on the ground'. Optionally, ACAS X may declare an intruder ON-GROUND by meeting all of the following conditions:",
    "1. The CA, FS, and VS fields that have been received from the intruder have not indicated \n'on the ground' for the duration of the track. \n  \n2. The intruder's RI field (from Mode S DF=0 replies) indicates no RA capability. \n  \n3. The intruder's airborne velocity or ground speed is reported as < 50 knots (only applicable \nto intruders with ADS-B information). \n  \n4. Either of the following conditions are met: \n  \ni.",
    "to intruders with ADS-B information). \n  \n4. Either of the following conditions are met: \n  \ni. \nOwnship is in the IN-AIR state AND the intruder's tracked barometric altitude has \nbeen less than 360 ft above the ground level estimate determined in §2.2.4.6.2.1 for 20 seconds AND its reported barometric altitude has not increased by more than 100 \nft from its lowest reported barometric altitude for the same 20-second period.",
    "ft from its lowest reported barometric altitude for the same 20-second period. \n \nii. The intruder's tracked barometric altitude is less than 150 ft above the ground level \nestimate determined in §2.2.4.6.2.1. \n \nOptionally, the ACAS X may declare an intruder to be IN-AIR if the intruder's RI field (from Mode S \nDF=0 replies) indicates RA capability.",
    "Notes: \n1. \nIt is not necessary to receive all the CA, FS and VS fields in order to make the ON-GROUND \ndetermination.  Reception of any one of them is sufficient, however, if more than one of the fields is received during the current processing cycle, then all of the received fields must indicate 'on the ground' before declaring the intruder ON-GROUND   \n \n2.",
    "2. \nOn rare occasions, an airborne Mode S intruder may incorrectly report on the ground status in its CA, FS, and/or VS fields due to a failure in the source of the air-ground discrete. In such \ncases, if the Mode S intruder is also equipped with an Active CAS that is DO-185A,B \ncompatible or ACAS X, the equipped intruder can remain fully operational since it uses radio altitude to determine its own air-ground status instead of the air-ground discrete used by the",
    "transponder. ACAS X may do additional monitoring to determine if a Mode S intruder reporting on the ground status in its CA, FS, and/or VS fields is, in fact, likely to be airborne via the RI field. 3.  \nAn on the ground Mode S intruder on the airport surface may incorrectly report in-air status in \nits CA, FS, and VS fields due to an installation error or failure in the source of the air-ground",
    "its CA, FS, and VS fields due to an installation error or failure in the source of the air-ground \ndiscrete. In such cases, an ACAS X equipped aircraft on takeoff or final approach may declare a TA during a high workload period. ACAS X may perform additional monitoring to determine if a Mode S intruder reporting in air status in its CA, FS, and VS fields is, in fact, likely to be on the ground via optional ON-GROUND declaration method.  \n \n4.",
    "4.  \nIf the ground level estimate is unavailable as described in §2.2.4.6.2.1, then optional ON-\nGROUND declaration method is considered not met.  \nReplace 2nd paragraph in Section 2.2.4.6.4.2.1 with  \nThe CA field in squitter's from RTCA/DO-181A or later transponders **shall** (1337) be used to determine whether the aircraft is on the ground as described in §2.2.4.6.2.2. The equipment shall",
    "(1338) not interrogate an aircraft for acquisition in the following three cases: (1) the aircraft is currently on the ground as described in §2.2.4.6.2.2.2 and the aircraft does not have an operational Active CAS, (2) the aircraft has is currently on the ground as described in §2.2.4.6.2.2.2, the aircraft has an operational Active CAS, but own ACAS X is above 2000 feet AGL, or (3) the aircraft qualifies for acquisition using passive position reports as specified in §2.2.4.6.4.2.2.2.",
    "## Replace 2Nd Sentence In 11Th Paragraph In Section 2.2.4.6.4.2.3.2.5 With The Acas X Equipment **Shall** (1441) Also Delete The Established Track On A Mode S Transponderequipped Aircraft Following Five Consecutive Replies In Which The Aircraft Was Determined To Be On\n\nground as described in §2.2.4.6.2.2.2.",
    "ground as described in §2.2.4.6.2.2.2. \n\n \nReplace 1st paragraph in Section 2.2.4.6.4.2.4 with   \nWhen ownship is airborne and at or below 2000 ft AGL, the range of Mode S aircraft that are determined to be both on the ground as described in 2.2.4.6.2.2.2, and Active CAS-equipped, according to the TCAS Broadcast Interrogation **shall** (1363) have their range determined for the purposes of NTA3 and NTA6 through:",
    "a) Surface Position Messages with DF=17 Format Type Code 5, 6, 7 or 8 received within the last \n25 seconds. \nb) On-Ground Ref. T tracks which qualify for AIRB or SURF application active interrogations \nonce every 5 seconds when Surface Position Messages are not available. \n\n## Include In Section 2.2.5.5.9 Receivestatevectorposition\n\nAdditional input requirements include the following: \n     ……..",
    "Additional input requirements include the following: \n     …….. \n\n11. Surveillance **shall** provide the STM only State Vector Position Reports that are identified with an ICAO compliant 24-bit address.  This requirement suppresses the input of State Vector Position Reports with non-ICAO 24-bit addresses (ex: non-ICAO ADS-R (CF=6,IMF=1) and non-ICAO \nADS-B (CF=1)) into the STM.",
    "Notes: \n \n…… \n3.    The requirement in item #11 above implies that the non-ICAO data item will always be set to FALSE \n\n## Include In Section 2.2.5.5.10 Receivestatevectorvelocity\n\nAdditional input requirements include the following: \n     ……..",
    "Additional input requirements include the following: \n     …….. \n\n11. Surveillance **shall** provide the STM only State Vector Velocity Reports that are identified with an ICAO compliant 24-bit address.  This requirement suppresses the input of State Vector Velocity Reports with non-ICAO 24-bit addresses (ex: non-ICAO ADS-R (CF=6,IMF=1) and non-ICAO \nADS-B (CF=1)) into the STM. \n\n \nNotes: 4.   The requirement in item #11 above implies that the non-ICAO data item will always be set to FALSE",
    "## Include In Section 2.2.5.5.11 Receivestatemode Status\n\nAdditional input requirements include the following: \n     …….. \n\n4. Surveillance **shall** provide the STM only ADS-B Mode Status Reports that are identified with an ICAO compliant 24-bit address.  This requirement suppresses the input of State Vector Velocity Reports with non-ICAO 24-bit addresses (ex: non-ICAO ADS-R (CF=6,IMF=1) and non-ICAO \nADS-B (CF=1)) into the STM.",
    "Notes: 4.   The requirement in item #11 above implies that the non-ICAO data item will always be set to FALSE \n \n\n## Include And Replace In Section 2.4.2.11.11 Verification Of Df=18 Ads-B And Ads-R Only Passive Surveillance As Indicated Below: Include In Test 1 Scenario Descriptions\n\n- \nIntruder 7 shows that DF=18 ADS-B with non-ICAO 24-bit address passive measurements \nare not provided to the STM (after T=35 existing track will be coasted out by STM).",
    "Replace in Test 1 Scenario Descriptions \nFrom: \n\"Intruder Aircraft #2 Altitude  \n \n= 13,200 ft \nAltitude Rate   \n= 0 FPM \nRange  \n \n= 3.4 NM at T=0 sec \n\nRelative Speed  \n= 0 kt  \nDF=18, CF=1 (ADS-B Anonymous Address) \nAt T=10 the ADS-B Version from the intruder is degraded to 1.  \nAt T=40 the intruder is terminated.\" \n\nTo: \n\"Intruder Aircraft #2 Altitude  \n \n= 13,200 ft \nAltitude Rate   \n= 0 FPM \nRange  \n \n= 3.4 NM at T=0 sec",
    "Relative Speed  \n= 0 kt  \nDF=18, CF=0 (ADS-B ICAO 24-bit Aircraft Address) \nAt T=10 the ADS-B Version from the intruder is degraded to 1.  \nAt T=40 the intruder is terminated\" \n \n\nFrom: \n\"Intruder Aircraft #4 Altitude \n \n= 13,600 ft \nAltitude Rate  \n= 0 FPM \nRange  \n \n= 3.8 NM at T=0 sec \nRelative Speed  \n= 0 kt \n\nDF=18, CF=6, CF=1 (ADS-B Anonymous Address) At T=20 the NACv from the intruder is degraded to 0. At T=40 the intruder is terminated.\"",
    "To: \n\"Intruder Aircraft #4 Altitude \n \n= 13,600 ft \nAltitude Rate  \n= 0 FPM \nRange  \n \n= 3.8 NM at T=0 sec \nRelative Speed  \n= 0 kt \n\nDF=18, CF=0 (ADS-B ICAO 24-bit Aircraft Address) \nAt T=20 the NACv from the intruder is degraded to 0.  \nAt T=40 the intruder is terminated\" \n \nFrom: \n\"Intruder Aircraft #6 Altitude  \n \n= 14,000 ft \n\n|       | Altitude Rate      | = 0 FPM             |\n|-------|--------------------|---------------------|\n| Range |                    | = 4.2 NM at T=0 sec |",
    "Relative Speed  \n= 0 kt DF=18, CF=1 (ADS-B Anonymous Address) At T=30 the SIL from the intruder is degraded to 2. At T=40 the intruder is terminated.\" \nTo: \n\"Intruder Aircraft #6 Altitude  \n \n= 14,000 ft \n\n|       | Altitude Rate      | = 0 FPM             |\n|-------|--------------------|---------------------|\n| Range |                    | = 4.2 NM at T=0 sec |",
    "Relative Speed  \n= 0 kt DF=18, CF=0 (ADS-B ICAO 24-bit Aircraft Address) \nAt T=30 the SIL from the intruder is degraded to 2.  \nAt T=40 the intruder is terminated\" \n \n\nInclude in Test 1 Scenarios: \n\"Intruder Aircraft #7 Altitude  \n \n= 14,200 ft \nAltitude Rate   \n= 0 FPM \nRange  \n \n= 4.4 NM at T=0 sec \nRelative Speed  \n= 0 kt",
    "DF=18, CF=0 (ADS-B ICAO 24-bit Aircraft Address) \nAt T=35 the CF from the intruder is changed to 1 (ADS-B Anonymous Address) \nAt T= 45 the intruder is terminated\" \nInclude in Test 1 Success Criteria: \nIntruder 7 \nFrom T=1 to T=35, verify that the STM track is not dropped and the intruder is provided in the STM display output After T=41, verify that the STM track is dropped and the intruder is no longer provided in the STM display output for the remainder of the test.",
    "Include in Test 2 Scenario Descriptions \n\n- \nIntruder 7 shows that DF=18 ADS-R with non-ICAO 24-bit address passive measurements are not provided to the STM (after T=35 existing track will be coasted out by STM). \n\n## Replace In Test 2 Scenario Descriptions\n\nFrom: \n\"Intruder Aircraft #2 Altitude  \n \n= 13,200 ft \nAltitude Rate   \n= 0 FPM \nRange  \n \n= 3.4 NM at T=0 sec \n\nRelative Speed  \n= 0 kt  \nDF=18, CF=6, IMF=1 (ADS-R Anonymous Address)",
    "At T=10 the ADS-B Version from the intruder is degraded to 1.  \nAt T=40 the intruder is terminated.\" \nTo: \n\"Intruder Aircraft #2 Altitude  \n \n= 13,200 ft Altitude Rate   \n= 0 FPM \nRange  \n \n= 3.4 NM at T=0 sec Relative Speed  \n= 0 kt  \nDF=18, CF=6, IMF=0 (ADS-R ICAO 24-bit Aircraft Address) \nAt T=10 the ADS-B Version from the intruder is degraded to 1.  \nAt T=40 the intruder is terminated\" From: \n\"Intruder Aircraft #4 Altitude \n \n= 13,600 ft Altitude Rate  \n= 0 FPM \nRange",
    "\"Intruder Aircraft #4 Altitude \n \n= 13,600 ft Altitude Rate  \n= 0 FPM \nRange  \n \n= 3.8 NM at T=0 sec Relative Speed  \n= 0 kt DF=18, CF=6, IMF=1 (ADS-R Anonymous Address) \nAt T=20 the NACv from the intruder is degraded to 0.  \nAt T=40 the intruder is terminated.\" \nTo: \n\"Intruder Aircraft #4 Altitude \n \n= 13,600 ft Altitude Rate  \n= 0 FPM \nRange  \n \n= 3.8 NM at T=0 sec Relative Speed  \n= 0 kt DF=18, CF=6, IMF=0 (ADS-R ICAO 24-bit Aircraft Address)",
    "= 0 kt DF=18, CF=6, IMF=0 (ADS-R ICAO 24-bit Aircraft Address) \nAt T=20 the NACv from the intruder is degraded to 0.  \nAt T=40 the intruder is terminated\" From: \n\"Intruder Aircraft #6 Altitude  \n \n= 14,000 ft Altitude Rate   \n= 0 FPM \nRange  \n \n= 4.2 NM at T=0 sec Relative Speed  \n= 0 kt DF=18, CF=6, IMF=1 (ADS-R Anonymous Address) \nAt T=30 the SIL from the intruder is degraded to 2.  \nAt T=40 the intruder is terminated.\" \nTo: \n\"Intruder Aircraft #6 Altitude  \n \n= 14,000 ft Altitude Rate",
    "To: \n\"Intruder Aircraft #6 Altitude  \n \n= 14,000 ft Altitude Rate   \n= 0 FPM",
    "| Range     |     | = 4.2 NM at T=0 sec    |\n|-----------|-----|------------------------|\n\nRelative Speed  \n= 0 kt DF=18, CF=6,IMF=0 (ADS-R ICAO 24-bit Aircraft Address) \nAt T=30 the SIL from the intruder is degraded to 2.  \nAt T=40 the intruder is terminated\" \nInclude in Test 2 Scenario Descriptions: \n\"Intruder Aircraft #7 \nAltitude  \n \n= 14,200 ft",
    "|       | Altitude Rate      | = 0 FPM             |\n|-------|--------------------|---------------------|\n| Range |                    | = 4.4 NM at T=0 sec |",
    "Relative Speed  \n= 0 kt  \nDF=18 CF=6,IMF=0 (ADS-R ICAO 24-bit Aircraft Address) \nAt T=35 the IMF from the intruder is changed to 1 (ADS-R Anonymous Address) \nAt T= 45 the intruder is terminated\" \nInclude in Test 2 Success Criteria: \nIntruder 7",
    "At T= 45 the intruder is terminated\" \nInclude in Test 2 Success Criteria: \nIntruder 7 \nFrom T=1 to T=35, verify that the STM track is not dropped and the intruder is provided in the STM display output After T=41, verify that the STM track is dropped and the intruder is no longer provided in the STM display output for the remainder of the test.",
    "## Update And Replace In Do-385 Section 2.4.2.2, Appendix F, Acas X Test Suite Encounter Set Found In Rtca Do-385 Electronic Supplement, And Do-385 Volume Ii As Indicated Below:",
    "1. \nUpdate information in Section 2.4.2.2 (Test Suite Test Procedures) of DO-385 Volume I and \nDO-385 Change 1 in accordance with \"Modifications for MOPS Volume I Section 2.4.2.2 (Test Suite Test Procedures) associated with DO-385 Change 1, CP-001\" in \nTestSuiteXaDO385Change1CP001Section2422.pdf \n2.",
    "TestSuiteXaDO385Change1CP001Section2422.pdf \n2. \nUpdate information in Appendix F (Test Suite Encounter List) of DO-385 Volume I in accordance with \"Modifications for MOPS Volume I Appendix F (Test Suite Encounter List) associated with DO-385 Change 1, CP-001\" in \nTestSuiteXaDO385Change1CP001AppendixF.pdf \n3. \nReplace the entire DO-385 ACAS X Test Suite Encounter with TestSuiteXaDO385Change1CP001.zip \n4.",
    "Replace the entire DO-385 ACAS X Test Suite Encounter with TestSuiteXaDO385Change1CP001.zip \n4. \nUpdate information in DO-385 Volume II in accordance with \"FAA Modifications to Volume II: Algorithm Design Description of RTCA/DO-385 and Change 1 Associated with DO-385 \nChange 1, Change Proposal 001 (CP-001)\" in ACAS_RPT_20_003_V1R1.pdf \n5. \nReplace all PDIFs with those in DO-385Change1CP-001_PDIFs.zip. The filenames of all",
    "5. \nReplace all PDIFs with those in DO-385Change1CP-001_PDIFs.zip. The filenames of all \nPDIFs, including those that changed, have been updated to reflect this revision. The new PDIF names will begin with DO-385Change1CP-001. The checksums of the files are provided in \nACAS_RPT_20_003_V1R1.pdf \nAll documents listed for this change are available by submitting an email request to the TCAS \nProgram office: 9-AVS-AIR-ACASX-Test@faa.gov."
  ]
}