{
  "source": "TSO-C153a.md",
  "chunks": [
    "# Department Of Transportation Federal Aviation Administration Aircraft Certification Service\n\nDate:  5/29/19 \n \n\n# Washington, D.C.\n\n\n## Technical Standard Order Subject: Integrated Modular Avionics (Ima) Platform And Modules\n\n 1.",
    "## Technical Standard Order Subject: Integrated Modular Avionics (Ima) Platform And Modules\n\n 1. \n\nPURPOSE.  This technical standard order (TSO) is for manufacturers applying for a TSO \nauthorization (TSOA) or letter of design approval (LODA).  In it, we (the Federal Aviation Administration, (FAA)) tell you what minimum performance standards (MPS) your integrated modular avionics (IMA) platform and/or module must first meet for approval and identification with the applicable TSO marking.",
    "2. \n\nAPPLICABILITY.  This TSO affects new applications submitted after its effective date. \n\n \na. TSO-C153 will also remain effective until November 29, 2020.  After this date, we will no longer accept applications for TSO-C153. \n\n \nb. Integrated Modular Avionics Hardware Elements approved under a previous TSOA may still be manufactured under the provisions of its original approval. Minor changes can be made under this provision.",
    "3.  REQUIREMENTS.  New models of IMA platforms and/or modules identified and manufactured on or after the effective date of this TSO must meet the MPS qualification and documentation requirements in Appendix 2 of this TSO. \n\n \na. Functionality.  This TSO's standards apply to equipment intended to perform the functions described in Appendix 1 of this TSO.",
    "b. Failure Condition Classifications.  There is no standard minimum failure condition classification for this TSO. The failure condition classification appropriate for the equipment will depend on the intended use of the equipment in a specific aircraft.  Document the loss of function and malfunction failure condition classification for which the equipment is designed. Qualitative and safety mechanisms requirements for each Minimum Performance Standard class are specified in Appendix 2 of this",
    "requirements for each Minimum Performance Standard class are specified in Appendix 2 of this TSO.",
    "c. Functional Qualification.  Demonstrate the required performance under the test conditions in Appendix 2 of this TSO.",
    "d. Environmental Qualification.  Demonstrate the required performance under the test conditions specified in Appendix 4 of this TSO, using standard environmental conditions and test procedures appropriate for airborne equipment. You may use a standard environmental condition and test procedure other than RTCA DO-160G, provided the standard is appropriate for the IMA platform and/or module.",
    "Note:  The use of RTCA/DO-160D (with Changes 1 and 2 only, without Change 3 incorporated) or earlier versions is generally not considered appropriate and will require substantiation via the deviation process as discussed in paragraph 3.g of this TSO.",
    "e. Software Qualification.  If the article includes software, develop the software according to RTCA, Inc. document RTCA/DO-178C, Software Considerations in Airborne Systems and Equipment Certification, dated December 13, 2011, including referenced supplements as applicable, to at least the software level consistent with the failure condition classification defined in paragraph **3.b** of this TSO. You may also develop the software according to RTCA, Inc. document RTCA/DO-178B, dated December",
    "You may also develop the software according to RTCA, Inc. document RTCA/DO-178B, dated December 1, 1992, if you follow the guidance in advisory circular (AC) 20-115C, Airborne Software Assurance, dated July 19, 2013, or later version.",
    "f. Electronic Hardware Qualification.  If the article includes complex custom airborne electronic hardware, develop the component according to RTCA, Inc. Demonstrate compliance with RTCA/DO-254*, Design Assurance Guidance for Airborne Electronic Hardware,* to at least the design assurance level consistent with the failure condition classification defined in paragraph **3.b** of this TSO. For custom airborne electronic hardware determined to be simple, RTCA/DO-254, paragraph 1.6 \napplies.",
    "g. **Configuration Management.**  Manufacturers must include design features in each hardware platform and/or module that support a robust automatic configuration management function. This functionality may not be fully operational until actual installation. However, the manufacturer must be able to show that, by either mechanical means or automatic electronic monitoring of the integrated assemblies, the higher-level assemblies will only be assembled according to the intended design or that",
    "the higher-level assemblies will only be assembled according to the intended design or that incorrect assembly can be detected at power-up.  Furthermore, for individual platforms and/or modules that require interfaces to other system equipment through a mechanical or electrical connector(s), the manufacturer must be able to show that each platform and/or module, by either mechanical means or automatic electronic monitoring of the higher level assembly, will either prevent an incorrect",
    "or automatic electronic monitoring of the higher level assembly, will either prevent an incorrect connection or that an incorrect connection will be detected before any dispatch. The manufacturer must consider failure of the configuration management design features in the safety assessment performed on the installed IMA system in each unique aircraft configuration.",
    "h. Deviations.  We have provisions for using alternate or equivalent means of compliance to the criteria in the MPS of this TSO.  If you invoke these provisions, you must show that your equipment maintains an equivalent level of safety.  Apply for a deviation pursuant to Title 14 of the Code of Federal Regulation (14 CFR) § 21.618. \n\n \n\n## 4. Marking.",
    "## 4. Marking.\n\n \na. Mark at least one major component permanently and legibly with all the information in 14 \nCFR § 45.15(b) \n \nb. Also, mark the following permanently and legibly, with at least the manufacturer's name, subassembly part number, and the TSO number:",
    "(1) Each component that is easily removable (without hand tools); and, \n \n(2) Each subassembly of the article that you determined may be interchangeable. \n \nc. If the article includes software and/or airborne electronic hardware, then the article part numbering scheme must identify the software and airborne electronic hardware configuration.  The part numbering scheme can use separate, unique part numbers for software, hardware, and airborne electronic hardware.",
    "d. You may use electronic part marking to identify software or airborne electronic hardware components by embedding the identification within the hardware component itself (using software) rather than marking it on the equipment nameplate.  If electronic markings are used, they must be readily accessible without the use of special tools or equipment. \n\n \n5.",
    "5. \n\nAPPLICATION DATA REQUIREMENTS.  You must give the FAA aircraft certification office (ACO) manager responsible for your facility a statement of conformance, as specified in 14 \nCFR § 21.603(a)(1) and one copy each of the following technical data to support your design and production approval.  LODA applicants must submit the same data (excluding paragraph 5.g) through their civil aviation authority.",
    "a. A Manual(s) containing the following: \n \n(1) Operating instructions and article limitations sufficient to describe the equipment's operational capability.",
    "(2) Describe in detail any deviations. \n \n(3) Installation procedures and limitations sufficient to ensure that the IMA platform and/or module, when installed according to the installation or operational procedures, still meet this TSO's requirements.  Limitations must identify any unique aspects of the installation.  The limitations must include a note with the following statement:",
    "\"This article meets the minimum performance and quality control standards required by a technical standard order (TSO).  Installation of this article requires separate approval.\" \n \n(4) For each unique configuration of software and airborne electronic hardware, reference the following: \n(a) Software part number including revision and development assurance level; \n\n \n \n(b) Airborne electronic hardware part number including revision and development \nassurance level; and,",
    "(c) Functional description. \n \n(5) A summary of the test conditions used for environmental qualifications for each component of the article.  For example, a form as described in RTCA/DO-160G, Environmental Conditions and Test Procedures for Airborne Equipment, Appendix A. \n\n(6) Schematic drawings, wiring diagrams, and any other documentation necessary for installation of the Integrated Modular Avionics (IMA) platform and modules.",
    "(7) List of replaceable components, by part number, that makes up the IMA platform and modules.  Include vendor part number cross-references, when applicable. \n\nb. Instructions covering periodic maintenance, calibration, and repair, to ensure that the IMA \nplatform and/or module continue to meet the TSO approved design.  Include recommended inspection intervals and service life, as appropriate.",
    "c. If the article includes software include the plan for software aspects of certification (PSAC), software configuration index, and software accomplishment summary. \n\nd. If the article includes simple or complex custom airborne electronic hardware include the   \nplan for hardware aspects of certification (PHAC), hardware verification plan, top-level drawing, and hardware accomplishment summary (or similar document, as applicable).",
    "e. A drawing depicting how the article will be marked with the information required by paragraph 4 of this TSO.",
    "f. Identify functionality or performance contained in the article not evaluated under paragraph 3 \nof this TSO (that is, non-TSO functions).  Non-TSO functions are accepted in parallel with the TSO authorization.   For those non-TSO functions to be accepted, you must declare these functions and include the following information with your TSO application:",
    "(1) Description of the non-TSO function(s), such as performance standards, assumed failure conditions, resulting Design Assurance Level (DAL) of the software, hardware, and the environmental qualification levels.  Include a statement confirming that the non-TSO function(s) do not interfere with the article's compliance with the requirements of paragraph 3.",
    "(2) Installation procedures and limitations sufficient to ensure that the non-TSO function(s) \nmeets the declared functions and performance standard(s) described in paragraph **5.f.(1)**.",
    "(3) Instructions for continued performance applicable to the non-TSO function(s) described in paragraph **5.f.(1).** \n \n(4) Interface requirements and applicable installation test procedures to ensure compliance with the performance data defined in paragraph **5.f.(1).** \n \n(5) Test plans, analysis and results, as appropriate, to verify that performance of the hosting TSO article is not affected by the non-TSO function(s).",
    "(6) Test plans, analysis and results, as appropriate, to verify the function and performance of the non-TSO function(s) as described in paragraph **5.f.(1).** \n \ng. The quality system description required by 14 CFR § 21.608, including functional test standards.  The quality system should ensure that you will detect any change to the approved design that could adversely affect compliance with the TSO MPS, and reject the article accordingly.  (Not required for LODA applicants.)",
    "h. Material and process standards list. \n \n\ni. List of all drawings and processes (including revision level) that define the article's design. \nj. Manufacturer's TSO qualification report showing results of testing accomplished according to paragraph **3.c** of this TSO. \n\n6.",
    "6. \n\nMANUFACTURER DATA REQUIREMENTS.  Besides the data given directly to the responsible ACO, have the following technical data available for review by the responsible ACO: \n \na. Functional qualification standards for qualifying each production article to ensure compliance with this TSO.",
    "b. Article calibration procedures. \n \nc. Schematic drawings. \n \nd. Wiring diagrams. \n \ne. Material and process standards. \n \nf. The results of the environmental qualification tests conducted according to paragraph 3.d of \nthis TSO.",
    "this TSO. \n \ng. If the article includes software, the appropriate documentation defined in RTCA/DO-178B or RTCA/DO-178C specified in paragraph 3.e of this TSO, including all data supporting the applicable objectives in RTCA/DO-178B Annex A*, Process Objectives and Outputs by Software Level*.",
    "h.  If the article includes complex custom airborne electronic hardware, the appropriate hardware life cycle data in combination with design assurance level, as defined in RTCA/DO-254, Appendix A, Table A-l.  For simple custom airborne electronic hardware, the following data: test cases or procedures, test results, test coverage analysis, tool assessment and qualification data, and configuration management records, including problem reports.",
    "i. If the article contains non-TSO function(s), you must also make available items 6.a through \n6.h as they pertain to the non-TSO function(s). \n\n\n## 7. Furnished Data Requirements.",
    "## 7. Furnished Data Requirements.\n\n \na. If furnishing one or more articles manufactured under this TSO to one entity (such as an operator or repair station), provide one copy or on-line access to the data in paragraphs 5.a and **5.b** of this TSO.  Add any other data needed for the proper installation, certification, use, or for continued compliance with the TSO, of the IMA platform and modules.",
    "b. If the article contains declared non-TSO function(s), include one copy of the data in paragraphs **5.f.(1)** through 5.f.(4). \n\n \nc.  If the article contains software, include one copy of the OPR summary. \n \n\n## 8. How To Get Referenced Documents.\n\n \n\na. Order RTCA documents from RTCA Inc., 1150 18th Street NW, Suite 910, Washington, D.C. \n20036.  Telephone (202) 833-9339, fax (202) 833-9434.  You can also order copies online at \nwww.rtca.org",
    "b. Order SAE documents from SAE International, 400 Commonwealth Drive, Warrendale, PA \n15096-0001.  Telephone (724) 776-4970, fax (724) 776-0790.  You can also order copies \nonline at www.sae.org.",
    "c. Order copies of 14 CFR parts 21 and 45 from the Superintendent of Documents, Government \nPrinting Office, P.O. Box 979050, St. Louis, MO 63197.  Telephone (202) 512-1800, fax \n(202) 512-2250.  You can also order copies online at www.gpo.gov. \n \nd. You can find a current list of technical standard orders and advisory circulars on the FAA \nInternet website Regulatory and Guidance Library at http://rgl.faa.gov/.  You will also find the TSO \nIndex of Articles at the same site.",
    "Melvin J. Johnson Aviation Safety Deputy Director, Policy and Innovation Division Aircraft Certification Service \n\n## Appendix 1 Integrated Modular Avionics Overview, Definition And Examples\n\nThis Appendix provides: \n\no Chapter 1:  An overview of Integrated Modular Avionics (IMA) o Chapter 2:  Applicable definitions o Chapter 3:  Definition of Minimum Performance Standard (MPS) classes o Chapter 4:  Examples of IMA platform using IMA modules",
    "## Chapter 1: Integrated Modular Avionics Overview\n\nIn this TSO, Integrated Modular Avionics is defined according to RTCA DO-297 (equivalent to the EUROCAE ED-124): \nIntegrated Modular Avionics (IMA): is a shared set of flexible, reusable, and interoperable hardware and software resources that, when integrated, form a platform that provides services, designed and verified to meet a defined set of safety and performance requirements, to host applications performing aircraft functions.",
    "IMA architecture integrates many aircraft functions on the same platform, provided by several hosted applications that historically have been contained in functionally and physically separated 'boxes' or Line Replaceable Units (LRU).",
    "IMA platforms are composed of modules, which are designed to be reusable in order to reduce development cost and occasionally facilitate certification programs. Some modules provide only mechanical functionality, such as cooling the supply of electrical power. Others include core software and associated computing capabilities. The IMA modules are usually both generic and configurable, and the same platforms are adaptable for use on different aircraft models.",
    "## Chapter 2: Applicable Definitions Legend",
    "o \n[DO-297]: Definitions from RTCA DO-297 (equivalent to the EUROCAE ED-124). \no \n[TSO-C153a]: Definitions defined in the context of the TSO.",
    "o \n[TSO-C153a]: Definitions defined in the context of the TSO. \n \nAircraft Function *[DO-297]*: A capability of the aircraft that is provided by the hardware and the software of the systems on the aircraft. Application *[DO-297]*: Software and/or application-specific hardware with a defined set of interfaces that, when integrated with the platform, performs a specific function. Cabinet *[TSO-C153a]*: Result of the integration of hardware modules mounted within one rack.",
    "Characterization item *[TSO-C153a]*: Identified module characteristic towards which the IMA module developer needs to determine the module performance, with full verification and documentation in the user guide/installation manual as appropriate. Component *[DO-297]*: A self-contained hardware, software part, database, or combination thereof that is configuration-controlled. A component does not provide an aircraft function by itself. Configuration data *[DO-297]*:  See paragraph 3.7.1. Core",
    "provide an aircraft function by itself. Configuration data *[DO-297]*:  See paragraph 3.7.1. Core Software *[DO-297]*: The operating system and support software that manage resources to provide an environment in which applications can be executed. Core software is a necessary component of a platform and is typically comprised of one or more modules (e.g., libraries, drivers, kernel, data-loading, boot, etc.). IMA Platform *[DO-297]*: Module or group of modules, including core software, which",
    "boot, etc.). IMA Platform *[DO-297]*: Module or group of modules, including core software, which manages resources in a manner sufficient to support at least one application. IMA hardware resources and core software are designed and managed in a way that provides computational, communication, and interface capabilities for hosting at least one application. Platforms by themselves do not provide any aircraft functionality. The IMA platform may be accepted independently of hosted applications.",
    "any aircraft functionality. The IMA platform may be accepted independently of hosted applications. IMA System *[DO-297]*: Consists of (an) IMA platform(s) and a defined set of hosted applications. LRM (Line Replaceable Module) *[TSO-C153a]*: IMA platform element, identified in aircraft configuration and replaceable by aircraft line maintenance to restore the aircraft into an operational ready condition. An IMA LRM is stand-alone equipment that does not provide any aircraft function until Hosted",
    "An IMA LRM is stand-alone equipment that does not provide any aircraft function until Hosted applications are integrated. LRU (Line Replaceable Unit) *[TSO-C153a]*: Element supporting an aircraft function, identified in aircraft configuration and replaceable by aircraft line maintenance to restore the aircraft into an operational ready condition. An LRU is usually stand-alone equipment such as a radio, Flight Management Computer, or any functional equipment.",
    "IMA Module *[TSO-C153a]*: A component or collection of components that may be hardware or a combination of hardware and software, which provides resources to the IMA-hosted applications. \n\nApplication and module configuration data are not covered by this definition. Modules may be distributed across the aircraft or may be co-located. Operating System *[DO-297]:* 1)  \nThe same as executive software.",
    "2) \nThe software kernel that services only the underlying hardware platform. \n3)  \nSoftware that directs the operations of a computer, resource allocation and data management, controlling and scheduling the execution of computer-hosted applications, managing memory, \nstorage, input/output, and communication resources.",
    "storage, input/output, and communication resources. \n \nRack *[TSO-C153a]*: A physical package able to contain at least two hardware modules, which may provide partial protection from environmental effects (shielding) and may enable installation on and removal of the mounted modules from the aircraft without physically altering other aircraft systems or equipment.",
    "Resources / Shared resources *[DO-297]*: Any object (processor, memory, software, data, etc.) or component used by an IMA platform or application. A resource may be shared by multiple applications or dedicated to a specific application.  A resource may be physical (a hardware device) or logical (a piece of information). Support software *[TSO-C153a]*: Embedded software necessary as a complement to the operating system to provide general services such as contributing to the intended function of",
    "the operating system to provide general services such as contributing to the intended function of resources sharing, handling hardware, drivers, software loading, health monitoring, boot strap, etc. Unit *[TSO-C153a]*: Set of physical components (hardware and/or software) inside equipment in charge of providing a resource.",
    "Usage Domain *[TSO-C153a]*: The usage domain of an IMA module is defined as an exhaustive list of conditions (configuration settings, usage rules, etc.) to be respected by the user(s) to ensure that the IMA \nmodule continues to meet the performance characteristics and requirements of the TSO Minimum Performance Standard.  Compliance with usage domain ensures that: \n \n-",
    "- \nthe module is compliant with its functional, performance, safety, and environmental requirements specified for all implemented intended functions.",
    "- \nthe module characteristics documented in the User Guide (as required by Appendix 2) are guaranteed by manufacturer. \n- \nthe module is compliant with the applicable airworthiness requirements (including continuing airworthiness aspects). \n\n## Chapter 3: Definition Of Intended Function Classes",
    "To apply for TSO-C153a authorization, the IMA module shall comply with applicable common requirements and implement at least one Intended Function Class.",
    "CLASS RH: Rack Housing For TSO-C153a Class RH: 1.3. RH.1: IMA module is a physical package able to contain at least two hardware modules, that may provide protection from environmental effects (shielding, etc.) and enable installation and removal of those module(s) from the aircraft without physically altering other aircraft systems or equipment. 1.3. RH.2: IMA module may be a simple mechanical enclosure, or it may incorporate communication interfaces, backplanes for data and power supplies,",
    "enclosure, or it may incorporate communication interfaces, backplanes for data and power supplies, active cooling, or any combination of these features. 1.3. RH.3: IMA module does not offer the capability to host applications, unless combined with Class PR approval. 1.3. RH.4: IMA module may be configurable.",
    "## Class Pr: Processing For Tso-C153A Class Pr: 1.3. Pr.1: Ima Module Contains Processing Component, Memory Component, Interface Devices, And Associated Core Software Which Constitute One Or Several Processing Unit(S).",
    "Note: Containing memory component or interfaces devices does not lead  \nautomatically to having class DS and/or IF in the certification basis, DS or IF  \nclasses need to be applied for only if concurrent access to these Interface  \nor Data Storage resources is offered as a shared resource (as described in class  \nDS and IF).",
    "1.3. PR.2: The intended function of such IMA module is to share Processing, Data, and Information between at least two hosted applications, modules, and/or components. 1.3. PR.3: IMA module offers the capability to host applications. 1.3. PR.4: IMA module may be an association of hardware and Core Software.",
    "o Hardware may (or may not) contain resident (not field-loadable) software to enable electronic \npart marking and/or future loading of Field-Loadable Software parts. \no Core Software may be resident or a Field-Loadable Software Part. \n 1.3. PR.5: IMA module may be configurable.",
    "CLASS GP: Graphical Processing For TSO-C153a Class GP: 1.3. GP.1: IMA module contains graphical engine component and optional video engine component, memories, interfaces, and potentially associated Core Software which constitute one or several Graphical Unit(s). 1.3. GP.2: The intended function of such IMA module is to share graphics and optional video signal processing between at least two hosted applications, modules, and/or components. 1.3. GP.3: IMA module does not offer the capability to",
    "applications, modules, and/or components. 1.3. GP.3: IMA module does not offer the capability to host Hosted applications, unless combined with Class PR approval. 1.3. GP.4: IMA module may be an association of hardware and Core Software.",
    "o Hardware may (or may not) contain resident (not field-loadable) software to enable electronic \npart marking and/or future loading of Field-Loadable Software parts. \no Core Software may be resident or a Field-Loadable Software Part \n 1.3. GP.5: IMA module may be configurable.",
    "CLASS DS: Data Storage For TSO-C153a Class DS: 1.3. DS.1: IMA module contains memory (volatile or non-volatile), interface component, and potentially associated Core Software that constitute one or several Data Storage Unit(s). 1.3. DS.2: The intended function of such IMA module is to share stored data (e.g. databases, files, etc.) between several applications, modules, and/or components. 1.3. DS.3: IMA module does not offer the capability to host applications, unless combined with Class PR",
    "DS.3: IMA module does not offer the capability to host applications, unless combined with Class PR approval.",
    "1.3. DS.4: IMA module may be an association of hardware and a Core Software. \n\no Hardware may (or may not) contain resident (not field-loadable) software to enable electronic \npart marking and/or future loading of Field-Loadable Software parts. \no Core Software may be resident or a Field-Loadable Software Part. \n 1.3. DS.5: IMA module may be configurable.",
    "CLASS IF: Interface For TSO-C153a Class IF: 1.3. IF.1: IMA module contains input/output component(s) and potentially associated Core Software which constitute one or several Interface Unit(s). These interfaces can be discrete, analog, serial interface, digital bus, etc. 1.3. IF.2: The intended function of such an IMA module is to share information between several aircraft functions or applications. 1.3. IF.3: IMA module does not offer the capability to host applications, unless combined with",
    "1.3. IF.3: IMA module does not offer the capability to host applications, unless combined with Class PR approval. 1.3. IF.4: IMA module may be an association of hardware and a Core Software.",
    "o Hardware may (or may not) contain resident (not field-loadable) software to enable electronic \npart marking and/or future loading of Field-Loadable Software parts. \no Core Software may be resident or a Field-Loadable Software Part.",
    "## 1.3. If.5: Ima Module May Be Configurable. Class Ps: Power Supply For Tso-C153A Class Ps: 1.3. Ps.1: Ima Module Contains A Set Of Components (Hardware And/Or Software) Which Constitute One Or Several Power Supply Unit(S) In Charge Of Managing, Conditioning, And Providing Electrical Power.",
    "1.3. PS.2: The intended function of such IMA module installed into a rack (Class RH module) is to provide power supply from airborne electrical network to one or more hardware modules embedded into the same rack. 1.3. PS.3: IMA module does not offer the capability to host applications, unless combined with Class PR approval. 1.3. PS.4: IMA module may be configurable. 1.3. PS.5: IMA module may be an association of hardware and a Core Software.",
    "o Hardware may (or may not) contain resident (not field-loadable) software to enable electronic \npart marking and/or future loading of Field-Loadable Software parts. \no Core Software may be resident or a Field-Loadable Software Part.",
    "CLASS DH: Display Head For TSO-C153a Class DH: 1.3. DH.1: IMA module contains a set of components (hardware and/or software) in charge of managing displayed area that constitute one or several Display Unit(s). 1.3. DH.2: The intended function of such IMA module is to offer the capability to depict graphical information received from IMA Application(s), component(s), and/or module(s) on one Display Area. 1.3. DH.3: IMA module does not offer the capability to host applications, unless combined",
    "Area. 1.3. DH.3: IMA module does not offer the capability to host applications, unless combined with Class PR approval. 1.3. DH.4: IMA module may be an association of hardware and a Core Software.",
    "o Hardware may (or may not) contain resident (not field-loadable) software to enable electronic \npart marking and/or future loading of Field-Loadable Software parts. \no Core Software may be resident or a Field-Loadable Software Part \n 1.3. DH.5: IMA module may be configurable",
    "1.3. DH.5: IMA module may be configurable \n \nChapter 4: Example of IMA platform using IMA modules RTCA DO-297 contains some examples relating to the definition of IMA module and platform, which can be completed by some additional examples related illustrating Chapter 3 definitions.",
    "Figure 1: Single LRU platform (as per RTCA DO-297). This figure illustrates the sharing of computational and Input/output (I/O) resources within a single Line Replaceable Unit (LRU). Such IMA system key characteristics include: \n\n- \nHosting of multiple applications (not part of the IMA platform). \nNote:  The IMA platform includes all the components in the blue highlighted area. \n\n- \nPlatform configuration data and data loading.",
    "- \nPlatform configuration data and data loading. \n \n\n- \nDefined API between the IMA platform and hosted applications. \nAt one level, this figure illustrates a single platform providing core computational resources. At another level, it illustrates a module to be used within a larger IMA platform. \n\n \nIf sharing of processing, memory, and I/O resources is implemented within the LRU, such single LRU platform will be eligible to CLASS PR, DS, and IF.",
    "In this architecture, the two TSO-C153a class IF modules are switching A664 frames, providing each of the subscribers a shared access to the network. Network subscribers can be other TSO-C153a modules as the lower row of modules shows, or non-IMA equipment (top row) such as displays, radio transceivers. If sharing of ARINC Standard 664 I/O resources is implemented within the LRU, such single LRU \nplatform shall be eligible to **CLASS IF**.",
    "This figure illustrates the sharing of resources within several single Line Replaceable Modules (LRM) installed in a Rack: \n- \nRack: is an IMA module and will be eligible to **CLASS RH**; \n- \nLRM 1: provides shared Processing and Input/Output and shall be eligible to **CLASS PR+IF**; \n- \nLRM2: provides shared Graphical Processing and shall be eligible to **CLASS GP**; \n- \nLRM3: provides shared Power Supply to LRM embedded into the same rack and shall be eligible \nto **CLASS PS**; \n-",
    "to **CLASS PS**; \n- \nLRM 4: does not provide shared resource. This module shall be considered as a non-TSO-C153a \nmodule. \n All these modules are considered as parts.",
    "## Appendix 2 Integrated Modular Avionic Module Minimum Performance Standard (Mps)\n\nThis Appendix provides Specific Minimum Performance Standard for IMA modules.",
    "This Appendix provides Specific Minimum Performance Standard for IMA modules. \n\nPrinciple An IMA module is composed of hardware components or hardware and software components performing the intended function(s) whose minimum performance requirements are specified in this Appendix 2. This Minimum Performance Standard (MPS) is structured in a common requirements section and a set of classes specifying IMA module intended function(s):",
    "o COMMON: Minimum Performance Standard applicable to whatever IMA module and \nwhatever the implemented intended function class(s). \no CLASS RH: Rack Housing intended function. o CLASS PR: Processing intended function. o CLASS GP: Graphical Processing intended function. o CLASS DS: Data Storage intended function. o CLASS IF: Interface intended function. \no CLASS PS: Power Supply intended function. o CLASS DH: Display Head intended function.",
    "o CLASS PS: Power Supply intended function. o CLASS DH: Display Head intended function. \n To apply for TSO-C153a authorization, IMA module shall comply with common Minimum Performance Standard and implement at least one Intended Function Class as defined in this Appendix 2. When applying for TSO-C-153a authorization, the applicant shall include in the certification basis all classes for which the intended function is implemented in the IMA module/platform.",
    "## Verification Procedures: For Verification Procedures, The Following Definitions And Symbols Are Used In This Appendix: Analysis (A)\n\nAnalysis is the method of verification which consists in comparing design with known scientific and technical principles, technical data, or procedures and practices to validate that the proposed design will meet the specified functional or performance requirements. \n\n## Demonstration (D)",
    "## Demonstration (D)\n\nDemonstration is the method of verification where qualitative versus quantitative validation of a requirement is made during a dynamic test of the system/equipment. In general, software functional requirements are verified by demonstration since the functionality shall be observed through some secondary media. \n\n## Inspection (I)",
    "## Inspection (I)\n\nInspection is the method of verification to determine compliance with requirements and consists primarily of visual observations or mechanical measurements of the system/equipment, physical location, or technical examination of engineering support documentation. \n\n## Test (T)",
    "## Test (T)\n\nTest is the method of verification that shall exercise equipment functions and measure system/equipment performance under specific configuration and load conditions after the controlled application of known stimuli. Quantitative values are measured, compared against previous predicated success criteria, and then evaluated to determine the degree of compliance.",
    "Y  \nThe test is mandated under the conditions indicated in the column. \n \nm/n   Either verification method 'm' or verification method 'n' shall be used to verify the \nrequirement (i.e., D/A can be verified by Demonstration or Analysis). \n \nm+n   Both verification methods shall be used to verify the requirement (i.e., D+A means the \nrequirement shall be verified by Demonstration and Analysis).",
    "## Appendix 2.1 Integrated Modular Avionic Module Minimum Performance Standard (Mps) Common: Applicable To All The Ima Modules Purpose And Scope",
    "This section contains a set of Minimum Performance Standards (MPS) applicable to any IMA module and to any implemented intended function class(s). In the following standard, the term '*concurrent items*' designates the items that are using the shared resource of the IMA module. For example, *applications.* Depending on the module class, it means '*Processing element*' for PR class; '*thread*' for GP, IF and DH class; '*data storage element*' for DS class; and '*power rail*' for PS class.",
    "## Requirement Functional Requirements Common (Co) To All Classes:\n\nCO.a) The IMA shall implement at least one Function Class. \n\nThe following requirements of this paragraph are applicable to all classes with some exceptions as described below:",
    "CO.b) Except for the Housing function (F1) of the class RH (see Appendix 2.2 - paragraph  2.1.1), \nthe IMA module shall provide at least the following control features to react to detected failures: \na. disable \nb. reset \nCO.c) Except for the Housing function (F1) of the class RH (see Appendix 2.2 - paragraph 2.1.1), \neach IMA module shall provide health management and reporting capability. \nCO.d) Except for the Housing function (F1) of the class RH (see Appendix 2.2 - paragraph 2.1.1),",
    "CO.d) Except for the Housing function (F1) of the class RH (see Appendix 2.2 - paragraph 2.1.1), \nthe health management and reporting function shall detect, isolate, contain, and report faults in the shared resources and other resources that could adversely affect applications using the module resources or that could adversely affect the resources themselves. \nCO.e) Except for class RH, the robust partitioning (as per RTCA DO-297 between 'concurrent",
    "CO.e) Except for class RH, the robust partitioning (as per RTCA DO-297 between 'concurrent \nitems' sharing the resource shall be ensured by the IMA module. \nCO.f) Except for class RH, robust partitioning shall not rely on any required behavior of any \naircraft function or hosted application (as per RTCA DO-297 Section 3.5c). \n \n \nCO.g) Except for class RH, the potential breaches in robust partitioning shall be identified. An",
    "CO.g) Except for class RH, the potential breaches in robust partitioning shall be identified. An \nappropriate process and means shall be implemented to ensure that such failures which \nresult or may result in an unsafe condition are detected and reported. \nCO.h) Except for class RH, the IMA module shall implement a fault containment mechanism to \nprevent fault propagation between 'concurrent items' using the shared resource elements and other IMA modules.",
    "CO.i) reserved CO.j) Except for the Housing function (F1) of the class RH (see Appendix 2.2 - paragraph2.1.1), \nthe interface between the 'concurrent items' and the shared resource shall conform to characteristics as described by a standard (ARINC standards 653, 664, 600, for example).",
    "## Characterization Requirements:",
    "CO.k) Each item of the characterization shall be documented in the User Guide / Installation \nManual as appropriate. \nCO.l) The IMA module standard shall be characterized.  Figure 4 provides examples of \ncharacterization items.  Some of the items in Figure 4 may not apply and items may be missing for functional class (defined in Appendix 2 - class RH, or PR, GP, DS, IF, PS, DH). \nCO.m) Quantifiable characterized item shall be quantified with minimum, typical (when",
    "CO.m) Quantifiable characterized item shall be quantified with minimum, typical (when \nrelevant), maximum values, and the associated accuracy. \n \nNote:  Influence of environmental or abnormal conditions should be considered when \nrelevant. \nCO.n) The characterization of IMA module shall be correct and complete. Completeness is \nachieved when all shared features of the IMA module have been characterized.",
    "achieved when all shared features of the IMA module have been characterized. \nCO.o) The characterization shall identify the valid usage domain of the IMA module. CO.p) The characterization shall provide all constraints on the usage domain and on the \ninstallation (including limitations and activities) to be respected by the users. \nCO.q) The characterization shall provide the list of types of shared resource elements, the",
    "CO.q) The characterization shall provide the list of types of shared resource elements, the \nassociated attributes, their configurability and their performances, and associated limit of use. \nCO.r) The characterization shall include at least the following characteristics of the core \nsoftware/programmable hardware: \na. \nIdentification of the core software component(s) / programmable hardware (if any). \nb. \nThe IMA module functionality, performance, and safety requirements supported by",
    "b. \nThe IMA module functionality, performance, and safety requirements supported by \nthe core software / programmable hardware. \nc. \nExternal interfaces and associated data coupling/control coupling information. \nd. \nIntegration and loading procedure(s). \ne. \nDevelopment assurance level(s).",
    "CO.s) When the IMA module is offering the capability to host software, the characterization shall \nprovide any data needed to evaluate Worst Case Execution Time (WCET) of each concurrent item sharing the IMA module resource. \nCO.t) The performances of each shared resource management mechanism including monitoring \nshall be characterized, in particular the range, timing aspects, transients, etc. \nCO.u) For at least the following failure modes, the failure rate shall be provided: \na.",
    "CO.u) For at least the following failure modes, the failure rate shall be provided: \na. \nLoss of the IMA module. \nb. \nErroneous behavior of the IMA module. \nc. \nLoss of the shared resource element. \nd. \nErroneous behavior of shared resource element. \nCO.v) The characterization shall include the monitoring coverage rate (PBIT, CBIT, etc.) for the \nidentified failure modes of the IMA module (including shared and unshared resources, sharing mechanisms and robust partitioning mechanisms).",
    "CO.w) The characterization shall address the safety aspects of bad sequencing, delay, corruption \nand impersonation, where applicable. \nCO.x) The following health monitoring items shall be included in the characterization: \na. \ninterface rules, constraints (including limitations) to be respected by the users, \nb. \nlist of Health Monitoring services, \nc. \nlist of monitored components, monitored services, monitored interfaces, \nd. \nresponse to each type of fault, \ne.",
    "d. \nresponse to each type of fault, \ne. \nfault reporting attributes (reporting refers to internal logging, indication to applications using the shared resources, indication outside of the module), \nf. \nthe configuration attributes, if any. \nCO.y) If the IMA module is configurable, the characterization shall include, in addition, the \nfollowing items: \na. \nThe authorized configuration parameters (including range, type, and definition of \ncombined parameters) in the usage domain. \nb.",
    "combined parameters) in the usage domain. \nb. \nThe configuration activities to be conducted (including configuration procedures, means, and tools) by the user during application development (RTCA DO297 - Task \n2) and IMA system (RTCA DO-297– Task 3 and 4) integration. \nCO.z) If some tools are required for installation, these tools shall be characterized as follows: \na. \nIdentification, \nb. \nThe user's manuals of tools, \nc.",
    "a. \nIdentification, \nb. \nThe user's manuals of tools, \nc. \nThe activities related to those tools to be conducted during application development (RTCA DO-297 - Task 2) and IMA system (RTCA DO-297– Task 3 and 4) \nintegration. \nd. \nThe proposed associated qualification credits that could be granted to the user of the tools. \ne.",
    "The proposed associated qualification credits that could be granted to the user of the tools. \ne. \nThe Category of the tool and the Development Assurance Level of the tool (if any) as defined in applicable Software Development assurance guidance Limitations and Open Problem Report (if any) on Tools that could affect the tool qualification credit \nand require analysis by the user.",
    "f. \nLimitations and Open Problem Report (if any) on Tools that could affect the tool qualification credit and require analysis by the user. \nCO.aa) \nThe compatibility & mix ability information between hardware, software, tools and usage \ndomain shall be part of the characterization. This characterization shall address at least the \nfollowing: \na. \nHow the authorized mixed combinations are verified. \nb. \nThe compatibility assessment process with authorized mixed combinations of",
    "b. \nThe compatibility assessment process with authorized mixed combinations of \ninterfacing modules (external mix ability). \nc. \nAny preventative measures (design or procedures) to be developed by the user to prevent incorrect module combinations or software loads. \nd. \nInformation to be provided to maintenance personnel. \nCO.bb) \nThe control features (disable, reset, reload, etc.) of the IMA module to react to detected \nfailures shall be characterized.",
    "Characterization \nCategory \nCharacterization item \n \nGeneral \nInformation \nPower Dissipation. Thermal characteristics. Temperature control (e.g., cooling) characteristics. Size and Weight. \nInput and Output (I/O) Connectors (including pin-out).",
    "Input and Output (I/O) Connectors (including pin-out).  \nMating Connectors. Top-level drawings and Mechanical Interfaces. Mounting Mechanism and scheme. Clearance characteristics. Air Flow characteristics. Inter-Element Interfaces (such as Backplane interface). Grounding and Shielding Provisions. Separation and/or Isolation Provisions. Module Installation and Extraction Means. Backplane Interface. Start-up sequence Different operational modes (initialization, monitor, operational, etc.)",
    "Interfaces \nAnalog Input Standards For Each Analog Input \nType of Analog (e.g., differential, isolated, etc.) Range. Accuracy. Resolution. Null and Offset. Filtering. Input Impedance. Analog-to-Digital Conversion Speed. Steady State Voltage Rating. Transient Voltage Rating. Circuit Protection Techniques. Multiplexing. Latency Time. Bandwidth. \nAnalog Output Standards For Each Analog Output  \nType of Analog (e.g., differential, isolated, etc.) Range. Accuracy.  \nCharacterization \nCategory",
    "Type of Analog (e.g., differential, isolated, etc.) Range. Accuracy.  \nCharacterization \nCategory \nCharacterization item \nNull. Linearity. Current Capacity. Output Impedance. Steady State Voltage Rating. Transient Voltage Rating. Circuit Protection Techniques.  \nMultiplexing.  \nLatency Time. Bandwidth. \nDiscrete Input Standards For Each Discrete Input",
    "Multiplexing.  \nLatency Time. Bandwidth. \nDiscrete Input Standards For Each Discrete Input  \nTrip Point. Hysteresis. Filtering. Input Impedance. Logic Sense. Maximum Logic-High Level. Maximum Logic-Low Level. Minimum Logic-High Level. Minimum Logic-Low Level. Steady State Voltage Rating. Transient Voltage Rating. Circuit Protection Techniques. Multiplexing.  \nDiscrete Output Standards For Each Discrete Output",
    "Discrete Output Standards For Each Discrete Output \nVoltage Levels. Current Source Capacity. Current Sink Capacity. Output Impedance. Circuit Protection Techniques. Multiplexing.  \nDigital Communications For Each Input and Output  \nData Rates. Integrity Checks. Signal Levels. Current Sink and Source. Input Impedance. Output Impedance. Signal Rise and Fall Times. Filtering.  \nCharacterization \nCategory \nCharacterization item",
    "Characterization \nCategory \nCharacterization item \nStub Length Limits. Input and Output Capacitance. Isolation. Maximum Bit Error Rates. Circuit Protection Techniques. Resets. Monitors.  \nMultiplexing. \n \nIncluded Software Services (Core Software) and associated performances: Data loading, Health Management, Operating System. \nProcessing and \nMemory (including \nGraphical)",
    "Processing and \nMemory (including \nGraphical) \nProcessing Unit (CPU, GPU, etc.) Component(s) Bus(s) and Core Clock Frequencies. Memory Size(s), Type(s), Control of Access, and Timing(s) Local data bus(s) Type(s) and Timings Start-up and Reset mechanisms and timings \n \nDisplay and \nRendering \nRefer to SAE AS8034 'Minimum Performance Standard for Airborne Multipurpose Electronic Displays' (revision as defined in the applicable release of TSO-C113) \n \nPower Supply",
    "Power Supply \nRegulation. Input Voltage & Current range. Maximum Start-up (Input and Output In-rush) Current Rating. Hold-up Capacity. Restart. Transient Immunity. Short Circuit Management. Power Resets and Recovery. Circuit Protection Techniques. Slew rate at start-up. DC Output Ripple and Noise",
    "The following list of terms summarizes the terminology for characterization items defined in previous figure applicable to this TSO, hardware element development, and application of Appendix 1 MPS development criteria. The terms are segregated into eight categories per the appropriate hardware element performance. \n\n## (1) General Terms",
    "## (1) General Terms\n\n \nAir Flow Characteristic: Specific requirements to provide air movement into or onto a cabinet, LRU, or module (for example, air temperature, volume rate, and pressure) \n \nAnalog/Digital Conversion Speed: The time to perform one Analog-to-Digital (A-to-D) \nconversion. Typically, this is expressed as either the time for one analog conversion by the A-to-D \nconverter device or the frequency at which all analog inputs are converted.",
    "Circuit Protection Techniques: The electrical isolation or circuitry included on inputs or outputs to protect the functional circuits from external environments. An example is using transorbs to protect circuits from the indirect effects of lightning. \n\n \nCurrent Source/Sink: The maximum current drawn by the output while pulling the signal to a zero volt (ground) level. \n\n \nCurrent Source: The maximum current supplied by the output while driving the signal to a voltage level.",
    "Clearance Characteristics: Additional spacing requirements in specific directions from the cabinet or rack beyond the outline dimensions. One example of this additional clearance is the area to allow proper airflow. \n\n \nDesign Assurance: All planned and systematic actions and data used to substantiate that hardware correctly performs its intended function(s) and that design errors have been identified and corrected such that the hardware satisfies the applicable certification basis.",
    "Development Assurance: All planned and systematic actions and data used to substantiate that the system performs its intended function and that development errors have been identified and corrected such that the system satisfies the applicable certification basis.",
    "Functional Software: Software applications that will be approved as part of a functional TSO \nauthorization or as part of a type certification effort. This software is sometimes referred to as operational software, application software, or flight software. \n\n \nFunctional TSO: A TSO with a defined functionality (for example, Airborne Weather Radar, TSO-C63e). TSO-C153a is not considered a functional TSO, because IMA hardware elements typically do not have system-level functionality.",
    "Grounding / Shielding Provisions: The electrical and/or mechanical details of the design which provide grounding of the element or which provide electromagnetic shielding. These are the design details usually associated with the Radio Frequency emission and susceptibility protection of the system. \n\n \nHardware Element: In this TSO, a hardware element is: (1) a hardware module, or (2) cabinets or racks that host hardware modules.",
    "Note:  This definition may differ from terminology in other documents  \n(for example, RTCA/DO-254). \n\n \nInter-Element Connections: The connector type standard and connector pin assignments specified to allow modules to be installed interchangeably in the cabinets or racks. \n\n \nInter-Element Interfaces: The definition of the electrical signals, timing requirements, and protocols used to communicate among modules or elements with the cabinet or system.",
    "Module Extraction Means: The details of the mechanical design to enable removal of the module from the cabinet. \n\n \nModule Mounting Scheme: The details of the mechanical design used to secure each module into the cabinet or rack. \n\n \nMounting Mechanism: The details of the mechanical mechanism(s) used to secure the module into the cabinet or rack on the aircraft.",
    "Multiplexing: The design technique where multiple inputs are individually switched to one receiver (for example, multiple digital communication buses switched to serial receiver) or multiple outputs are individually supplied by the same circuit (for example, multiple analog outputs driven by one Digital-to-Analog converter through multiple sample-and-holds).",
    "Separation/Isolation Provisions: The electrical and/or mechanical details of the design which provide physical or electrical means of reducing interference from one element to another. \n\n \nSteady State Voltage Rating: The maximum voltage range that can be applied continuously to an input or output without resulting in damage.",
    "Transient Voltage Rating: The maximum voltage that can be applied for a short period of time to an input or output without resulting in damage. The maximum duration of the transient must be included. \n\n(2) Analog Input/Output Terms \n \nAccuracy: The degree of conformity to the true value of the signal. This is usually expressed as a percentage of the reading or a percentage of the full-scale value of the signal.",
    "Current Capacity: The maximum amount of current that can be sinked or sourced by the circuit. \n\n \nLinearity: The error from the directly proportional expected value of the signal as the signal values vary over the entire range. \n\n \nNull: The values of the signal for which a value of zero is identified. This is usually shown as positive and negative voltage values. \n\n \nOffset: The indicated value of the signal (usually non-zero) when zero volts is applied.",
    "Offset: The indicated value of the signal (usually non-zero) when zero volts is applied. \n\n \nRange: The least and greatest operating voltage extremes (full scale) of the signal; the voltage extremes between which the value of the signal is valid.",
    "Resolution: The smallest measurable division of the numerical expression of the signal. This is usually identified as the number of binary bits used to express the value of the signal and/or the value in volts of the least significant binary bit (LSB). \n\n(3) Discrete Input/Output Terms  \nDiscrete Input: This is an input with only two states. Typical examples are \"ground or open\" and \n\"28 volt and open\" inputs.",
    "Discrete Output: An output with only two states. Typical examples are \"ground or open\" and \"28 \nvolt and open\" outputs. \n\n(4) Input Terms Hysteresis: The values of the input voltage lag when changing states. For example, if an input circuit has 0.2 volts of hysteresis and if the trip point is 2.0 volts then the circuit will change state as the input voltage reaches 2.0 volts but will not revert back to the original state until the input voltage drops below 1.8 volts.",
    "Logic Sense: This is the functional interpretation of the discrete input states. A true or positive logic sense may identify the \"ground\" state as a 'low\" or binary \"0\". An inverse or negative logic sense may identify a \"ground\" state as a \"high\" or binary \"1\". \n\n \nMaximum Logic-High Level: The largest voltage value that can be connected to the input for which the circuit will interpret as \"high\".",
    "Maximum Logic-Low Level: The largest voltage value that can be connected to the input for which the circuit will interpret as \"low\". \n\n \nMinimum Logic-High Level: The smallest voltage value that can be connected to the input for which the circuit will interpret as \"high\". \n\n \nMinimum Logic-Low Level: The smallest voltage value that can be connected to the input for which the circuit will interpret as \"low\".",
    "Trip Point: This is the input voltage value at which the input circuitry changes state. \n\n \n(5) Output Terms Current Sink Capacity: The maximum current drawn by the output while pulling the signal to a zero volt (ground) level (current flowing in the direction from the load to the element output). \n\n \nCurrent Source Capacity: The maximum current supplied by the output while driving the signal to a voltage level (current flowing in the direction from the element output to the load).",
    "Voltage Levels: The minimum and maximum voltages for each state of the output. The ground point that is to be used as the reference must be identified. \n\n(6) Processor Terms \n\n  \nBackplane Interface: The definition of the electrical signals, buses, timing requirements, and protocols used to communicate among elements installed in a cabinet or rack. \n\n \nInterrupts: The signals to the processor that stops execution of an ongoing process or application.",
    "These announce that a higher priority or asynchronous event is occurring. \n\n \nMemory Management Unit: A specialized control circuitry, sometimes integrated within the microprocessor, which performs predictive reads of instruction (pre-fetch) for use by the processor. It also may perform structured or prioritized control of specific sections of memory internal to or external to the processor memory.",
    "Monitors: Specific circuits which observe the normal operation of the processing system and alert the processor or user of an abnormal condition. Examples are power supply monitors, which reset the processor when a voltage is outside of its tolerance, and activity monitors which reset the processor when the processor is not performing a prescribed sequence.",
    "Reset Structure: The architectural details of the various signals that stops execution of an ongoing process, or software application. They then restart the processor at a known state. \n\n \nCentral Processing Unit (CPU) Throughput: A measure of the number of processor instructions completed by the CPU per unit of time.",
    "(7) Power Supply Terms \n \nHold-up Capacity: The capacity of the power supply to continue supplying output current after the input voltage drops below the minimum level. This is usually expressed as the time from the input voltage drop to the reset generated by the power supply to the processor.",
    "Input Voltage & Current: The input voltage is specified as nominal and acceptable variation values. The input current is specified as maximum steady state current. For peak current see \"inrush current\" below. \n\n \nMaximum Start-up (In-rush) Current Rating: The maximum input current when the power supply is first becoming active as a result of the input voltage increasing to the minimum level.",
    "Output Current Capacity: The continuously operating maximum current supplied for each output voltage. \n\n \nPower Monitors & Status Outputs: Separate circuitry which checks the output voltage levels and current loading of the power supply. This circuitry will generate one or more binary signals that may be connected to the processor to alert it to the \"out of spec\" condition. These binary signals may also force the power supply to shut-down to prevent damage to power supply components.",
    "Power Resets: A binary signal output from the power supply that is asserted when the output voltages are outside acceptable tolerances. \n\n \nRegulation: The percentage of variation of the output voltages when subjected to changes in load, changes in temperature, and all input voltage transients and deviations.",
    "Restart: The ability of the power supply or other circuit to return to the normal operating mode when the input voltage returns to or above the minimum level or when the tripped monitor indicates the \"out-of-spec\" condition has returned to normal. \n\n \nShort Circuit Management: The circuitry that monitors for short circuits or over-current conditions in the power supply outputs. The results from this circuitry may shut down the affected output or the entire power supply.",
    "Transient Immunity: The ability of the power supply to continue operating normally during variations in the input voltage. This is usually expressed as the length of time and the voltage level of the transient. \n\n \nVoltage Outputs & Tolerances: The voltage levels and tolerances of the outputs produced by the power supply. \n\n \n(8) Digital Communication Terms",
    "(8) Digital Communication Terms \n\n  \nData Rates: The number of data bits transmitted in a time period. This is usually expressed in thousands of bits per second (Kbps) or millions of bits per second (Mbps). \n\n \nIntegrity Checks: The process that uses additional data accompanying the message information to validate that the message data was received without corruption or contamination. Examples are parity checks, checksums, data validity checks, and cyclic redundancy checks.",
    "Maximum Bit Error Rates: The largest number of bit errors allowed in a message transmission before the receiver invalidates its ability to receive data from that source. \n\n \nMonitors: Separate circuitry that checks either the continuing operation of a transmitter, or checks that the receiver responds to input data. This circuitry will generate one or more binary signals that may be connected to the processor, alerting it to the \"failed\" condition.",
    "Resets: Conditions that result in the receiver or transmitter stopping operation, clearing all data, and restarting. \n\n \nSignal Levels: The minimum and maximum voltages for each state of the input or output. \n\nTypically, tolerances, thresholds, and reference ground point are also identified.",
    "Typically, tolerances, thresholds, and reference ground point are also identified. \n\n \nSignal Rise and Fall Times: The signal rise time is the time for the output to transition from 10% \nof the amplitude to 90% of the amplitude. The signal fall time is the time for the output to transition from the 90% level to the 10% level. \n\n \nStub Length Limits: The minimum and maximum length requirements of the wiring connector from the main bus to the inputs of the element.",
    "## Verification Requirements",
    "CO.cc) \nEach requirement shall be verified. \nCO.dd) \nEach characterization item of IMA modules and functions, their associated attributes, their \nconfigurability and their performances shall be verified commensurately to the Development Assurance Level. \nCO.ee) \nEach characterization item of the IMA module shall be verified over the usage domain. \nCO.ff) A set of verification procedures to demonstrate compliance of the IMA module with the",
    "CO.ff) A set of verification procedures to demonstrate compliance of the IMA module with the \napplicable MPS shall be developed and proposed as part of the TSOA data package. \nCO.gg) \nThere is a distinction between demonstrating the capability of sharing and demonstrating \nthe performance of that sharing function. When demonstrating the performance of the \nIMA module, a subset of the characterization items that allows guaranteeing the behavior",
    "IMA module, a subset of the characterization items that allows guaranteeing the behavior \nof the complete IMA module over environmental testing shall be defined and submitted together with the Qualification Test Plan.",
    "## Test Software Representativeness\n\nIMA module is authorized without the functional software (Hosted applications) installed and operating. Engineering analysis from the design holder shall determine that the test software (not the target functional software) is representative of the overall usage domain envelope of the module and related to the verification procedures.  \nNote: IMA module is authorized without the functional software (Hosted applications) installed and operating. \n\nCO.hh)",
    "CO.hh) \n \n\n \nThe following table gives verification method for each requirement; nevertheless, an alternative method may be proposed to the certification authority per section 3.h of the TSO.",
    "| Requirement     | Verification             | Test under     | Test Functional     |\n|-----------------|--------------------------|----------------|---------------------|\n| identifier      | method                   | normal         | Subset              |\n| (1)             |                          |                |                     |\n| under           |                          |                |                     |",
    "| under           |                          |                |                     |\n| conditions      | environmental conditions |                |                     |\n| CO.a)           |                          |                |                     |\n| I               |                          |                |                     |\n| CO.b)           |                          |                |                     |",
    "| CO.b)           |                          |                |                     |\n| T               | Y                        |                |                     |\n| CO.c)           |                          |                |                     |\n| A               |                          |                |                     |\n| CO.d)           |                          |                |                     |",
    "| CO.d)           |                          |                |                     |\n| T(A*)           | Y                        | Y              |                     |\n| CO.e)           |                          |                |                     |\n| T(A*)           | Y                        |                |                     |\n| CO.f)           |                          |                |                     |",
    "| CO.f)           |                          |                |                     |\n| A               |                          |                |                     |\n| CO.g)           |                          |                |                     |\n| T               | Y                        |                |                     |\n| CO.h)           |                          |                |                     |",
    "| CO.h)           |                          |                |                     |\n| T(A*)           | Y                        |                |                     |\n| CO.1            |                          |                |                     |\n| A               |                          |                | Reserved            |\n| CO.j)           |                          |                |                     |",
    "| CO.j)           |                          |                |                     |\n| T(A*)           | Y                        |                |                     |\n| CO.k)           |                          |                |                     |\n| I               |                          |                |                     |\n| Requirement     | Verification             | Test under     | Test Functional     |",
    "| Requirement     | Verification             | Test under     | Test Functional     |\n|-----------------|--------------------------|----------------|---------------------|\n| identifier      | method                   | normal         | Subset              |\n| (1)             |                          |                |                     |\n| under           |                          |                |                     |",
    "| under           |                          |                |                     |\n| conditions      | environmental conditions |                |                     |\n| CO.l)           |                          |                |                     |\n| A               |                          |                |                     |\n| CO.m)           |                          |                |                     |",
    "| CO.m)           |                          |                |                     |\n| A               |                          |                |                     |\n| CO.n)           |                          |                |                     |\n| A               |                          |                |                     |\n| CO.o)           |                          |                |                     |",
    "| CO.o)           |                          |                |                     |\n| T(A*)           |                          | Y              |                     |\n| (2)             |                          |                |                     |\n|                 |                          |                |                     |\n| CO.p)           |                          |                |                     |",
    "| CO.p)           |                          |                |                     |\n| A               |                          |                |                     |\n| CO.q)           |                          |                |                     |\n| I               |                          |                |                     |\n| CO.r)           |                          |                |                     |",
    "| CO.r)           |                          |                |                     |\n| I               |                          |                |                     |\n| CO.s)           |                          |                |                     |\n| A               |                          |                |                     |\n| CO.t)           |                          |                |                     |",
    "| CO.t)           |                          |                |                     |\n| A               |                          |                |                     |\n| CO.u)           |                          |                |                     |\n| I+A             |                          |                |                     |\n| CO.v)           |                          |                |                     |",
    "| CO.v)           |                          |                |                     |\n| I+A             |                          |                |                     |\n| CO.w)           |                          |                |                     |\n| I+A             |                          |                |                     |\n| CO.x)           |                          |                |                     |",
    "| CO.x)           |                          |                |                     |\n| A               |                          |                |                     |\n| CO.y)           |                          |                |                     |\n| A               |                          |                |                     |\n| CO.z)           |                          |                |                     |",
    "| CO.z)           |                          |                |                     |\n| A               |                          |                |                     |\n| CO.aa)          |                          |                |                     |\n| A               |                          |                |                     |\n| CO.bb)          |                          |                |                     |",
    "| CO.bb)          |                          |                |                     |\n| A               |                          |                |                     |\n| CO.cc)          |                          |                |                     |\n| I+A             |                          |                |                     |\n| CO.dd)          |                          |                |                     |",
    "| CO.dd)          |                          |                |                     |\n| T(A*)           | Y                        | Y              |                     |\n| CO.ee)          |                          |                |                     |\n| T(A*)           | Y                        | Y              |                     |\n| CO.ff)          |                          |                |                     |",
    "| CO.ff)          |                          |                |                     |\n| A               |                          |                |                     |\n| CO.gg)          |                          |                |                     |\n| A               |                          |                |                     |\n| 0               |                          |                |                     |",
    "| 0               |                          |                |                     |\n| A               |                          |                |                     |",
    "(A*): means that verification by Analysis method is possible for items that cannot be tested. \n\nNote 1:IMA module is authorized without the functional software (Hosted applications) installed and operating. \n\nNote 2: Applicable for a Functional subset as defined in CO.gg). \n\n \nNote 3:  Usage Domain has to be taken into consideration during Environmental Qualification Testing in order to evaluate the robustness of the IMA module over the full Usage Domain (see Appendix 4 - Chapter 1)",
    "## Appendix 2.2 Integrated Modular Avionic Platform And Module Minimum Performance Standard (Mps) Class Rh: Rack Housing Purpose And Scope Introduction\n\n \nThis appendix contains Minimum Performance Standards (MPS) for CLASS RH Intended Function: Rack Housing. These standards specify module characteristics that are useful to designers, manufacturers, installers, and users of the IMA module.",
    "For TSO-C153a CLASS RH, IMA module is a physical package able to contain at least two hardware modules, which may provide partial protection from environmental effects (shielding, etc.) and enable installation and removal of those module(s) from the aircraft without physically altering other aircraft systems or equipment. These IMA modules may be simple mechanical enclosures, or they may incorporate passive communication interfaces, passive interconnection for data and power, active or passive",
    "passive communication interfaces, passive interconnection for data and power, active or passive cooling unit or any combination of these features. The following definitions are used:",
    "o \nMounted: refers to another hardware module, installed and fixed inside the IMA Rack Module, after a human operation. \no \nSlot: a physical space inside the Rack Module, allocated to one hardware module. \n These definitions are independent of the design choices made by the IMA module manufacturer. \n\n## Note:",
    "## Note:\n\n- IMA module compliant to TSO-C153a CLASS RH MPS is only relevant  \nin case of IMA platform architecture using a Cabinet. \n- Hardware modules mounted inside the Rack Housing will be themselves  \nIMA modules (compliant with TSO-C153a MPS other classes than RH)  \nor non-IMA modules (i.e., non-IMA application specific hardware).",
    "For TSO-C153a CLASS RH, the intended function is to provide the capability to share some housing services supplied by one mechanical unit. This intended function can be divided into 4 sub-functions: \n\no \nF1 : Housing (mandatory); \no \nF2 : Shielding (optional); \no \nF3 : Interconnection (optional); \no \nF4: Temperature control (optional). \n The following figure provides an overview of the previously mentioned Rack Housing Module intended functions and definitions.",
    "## Requirements Requirements For Housing (F1)\n\nFor TSO-C153a CLASS RH, IMA module provides shared resources for housing needs of hardware modules. This sub-function merges: \n\no \nThe capacity to host at least two hardware modules inside at least two slots. \no \nThe capacity to mount and dismount a hardware module in its slot directly in the aircraft thanks to a human (potentially tooled) intervention. \n\n## 2.1.1. Functional Requirements For Tso-C153A Class Rh (F1): Housing",
    "RH.a) The Rack Housing shall permit the installation and attachment of at least two hardware \nmodules, one of which (at least) being an IMA module, inside its mechanical structure. \nRH.b) The Rack Housing shall ensure the physical partitioning between the different mounted \nhardware modules. \nRH.c) For each type of slot, a means to avoid installation of unintended hardware module or \ninappropriate installation shall be implemented (e.g., mechanical key).",
    "inappropriate installation shall be implemented (e.g., mechanical key). \nRH.d) If compliance with MPS requires any additional mechanical component, in the case this \ncomponent is separable; it shall be marked with its own unique Part Number. \nRH.e) The external mechanical interface(s) of the Rack Housing module should conform to \ncharacteristics as described by a standard (e.g., ARINC600). Some characteristics of the \nslots may be configurable.",
    "## 2.1.2 Characterization Requirements For Tso-C153A Class Rh (F1): Housing",
    "RH.f) The following housing performances or housing characteristics of the Rack module shall \nbe provided as part of the characterization: \n1. \nSize, mass, and center of gravity; \n2. \nClearance scheme; \n3. \nTop-level drawings and mechanical interfaces; \n4. \nModule mounting scheme; \n5. \nInstallation and extraction mechanisms; \n6. \nTemperature control (e.g., airflow, cooling, etc.) performances if function is \nimplemented; \n7.",
    "Temperature control (e.g., airflow, cooling, etc.) performances if function is \nimplemented; \n7. \nLists of slots and associated performances (physical scheme, temperature profile, connector, etc.). \nNote: These characterization requirements are additional to those applicable in COMMON - Appendix 2.1).",
    "RH.g) The characterization shall include the description of the mounted hardware module \ninstallation and extraction means and methods.  \nRH.h) The characterization shall provide the list of type of slots, the associated attributes, their \nconfigurability (if any) and their sizing dimensions (drawings). This characterization shall include: \n1. \nThe list of authorized or predefined hardware modules (if any). \n2.",
    "1. \nThe list of authorized or predefined hardware modules (if any). \n2. \nThe list of minimum requirements that a hardware module shall comply with for its capacity to be inserted into the rack. \n3. \nSlot mounting scheme (mechanical profile/drawings) and characteristics (torque, max number of insertions, etc.) \n4. \nPower dissipation and airflow profile. \nRH.i) The characterization, including the usage domain, shall be sufficiently accurate to permit",
    "RH.i) The characterization, including the usage domain, shall be sufficiently accurate to permit \nstandard and validation of the expected performance of the mounted hardware module. \nRH.j) The characterization shall include configuration, weight, and geometric data that are \nneeded to evaluate mass and center of gravity for a populated and partly populated rack. \nRH.k) The characterization shall include the installation instructions of the additional mechanical",
    "component necessary to be compliant with MPS.",
    "## Requirements For Shielding (F2)\n\n F2 is an optional sub-function of TSO-C153a CLASS RH. \n\n \nIn this case, IMA module provides shared resources in terms of protection of mounted hardware modules. This sub-function merges: \n\no A level of protection of the mounted hardware modules from aircraft environment (including but \nnot only, High-Intensity Radiated Field (HIRF) , and Lightning effects). \no A level of environmental isolation (shielding) between mounted hardware modules inside the \nrack.",
    "## 2.2.1 **Functional Requirements For Tso-C153A Class Rh (F2):**",
    "RH.l) Shielding A level of environmental protection (shielding) for each mounted hardware \nmodule shall be ensured by the Rack Housing IMA Module. This protection shall take into account level and severity retained for RTCA DO-160 qualification of the IMA module \n(see Appendix 4) (outside the rack) and the interactions between the mounted hardware modules themselves (inside the rack). \nRH.m) Protection performances of the IMA module (Rack module) shall be valued and guaranteed",
    "RH.m) Protection performances of the IMA module (Rack module) shall be valued and guaranteed \nfor each slot and for each RTCA DO-160 section. \nRH.n) Reserved.",
    "## 2.2.2 Characterization Requirements For Tso-C153A Class Rh (F2): Shielding",
    "RH.o) The level of environmental protection (shielding) of each slot provided in Appendix 2.2 \nparagraph 2.2.1 shall be characterized, bounded, and documented in the installation \nmanual. \nRH.p) The characterization shall include the failure modes and rates of protection features (such \nas lightning protections, etc.) to support IMA system Safety Analysis (as per RTCA DO-\n279) at installation.",
    "279) at installation. \nRH.q) The characterization shall include the list of type of slots and the associated characteristics \nin terms of environmental protection (shielding). \nThis shall include:",
    "1. \nThe list of authorized or predefined hardware modules (if any). \n2. \nThe list of minimum requirements that a hardware module shall comply with in order to be mounted into the rack. \n3. \nSlot Mounting Scheme (mechanical profile/isolation/drawings). \n4. \nLevel of isolation and level of shielding per slot for each RTCA DO-160 section. \nRH.r) The characterization shall include the list of environmental tests that can be granted to a",
    "RH.r) The characterization shall include the list of environmental tests that can be granted to a \nhardware module (see Appendix 4 - EQT) mounted into the rack. \nRH.s) The characterization shall include all the possible configurations allowed for the \nconfigurable slot.   \nRH.t) If the RH.l) shielding objective is met thanks to any additional mechanical element, its \ninstallation shall be specified in the installation manual.",
    "## Requirements For Interconnection (F3)\n\n \nF3 is an optional sub-function of TSO-C153a CLASS RH. In this case, an IMA module provides the capacity to interconnect hardware modules together inside the Rack Module. This interconnection allows exchanging data or distributing power supply. \n\n \nNote:  To ensure power supply exchange between mounted hardware modules at least one TSO-C153a CLASS PS module shall be mounted into a slot to deliver electrical energy to other hardware modules.",
    "## 2.3.1 Functional Requirements For Tso-C153A Class Rh (F3): Interconnection",
    "RH.u) The IMA module shall provide the capacity to interconnect mounted hardware modules \nthrough data or power supply buses available through an electrical interface(s) supplied by one or several interconnection unit(s). These buses shall be dedicated to: \na. \ndata exchanges; \nb. \npower supply exchanges. \nRH.v) If the IMA module provides more than one bus, the isolation between buses used by",
    "RH.v) If the IMA module provides more than one bus, the isolation between buses used by \nmounted hardware modules shall be ensured by the IMA module. This isolation shall be substantiated by a Partitioning Analysis and Environmental Qualification Testing. \nRH.w) The interface(s) of the IMA module should conform to characteristics as described by a \nstandard (e.g., ARINC 600 or ARINC 664). \nRH.x) The data and power supply buses shall not degrade the transmitted signals below the",
    "RH.x) The data and power supply buses shall not degrade the transmitted signals below the \ncharacterized performance. \nRH.y) For TSO-C153a CLASS RH, the IMA module shall ensure proper isolation on the \ninterconnection function to prevent interferences between signals (data, discrete, power \nsupply buses, etc.) that would affect data integrity, latency, and control.",
    "## 2.3.2 Characterization Requirements For Tso-C153A Class Rh (F3) Interconnection",
    "RH.z) The characterization shall include attenuation profiles, signal integrity, cross-talk and \ntolerance rates. These shall be valued. \nRH.aa) \nThe performances of each type of buses provided in RH shall be characterized and valued. \nRH.bb) For at least the following failure modes, the failure rate shall be provided for: \na. \nLoss of the interconnection function; \nb. \nErroneous behavior of interconnection function. \nRH.cc)",
    "Loss of the interconnection function; \nb. \nErroneous behavior of interconnection function. \nRH.cc) \nThe characterization shall address the safety aspects of sequencing, delay, corruption, and \nimpersonation. \nRH.dd) The characterization shall include the list of types of buses, the associated attributes, their \nconfigurability, and their sizing and performances.",
    "## 2.4 Requirements For Temperature Control (F4)\n\n \nF4 is an optional sub-function of TSO-C153a CLASS RH (F4): Temperature control In this case, IMA module provides the capacity to control temperature inside the Rack for each mounted module. \n\nThis control may be realized by:",
    "This control may be realized by: \n\n- \nDistributing Airflow between aircraft environment (outside the rack) and the mounted hardware \nmodules inside the IMA module (rack). \n- \nEnforcing Airflow (convection) with cooling generation unit. \n- \nFacilitating conduction between mounted hardware modules and heat sink part of the Rack \nmodule. \n\n## 2.3.3 Functional Requirements For Tso-C153A Class Rh (F4): Temperature Control",
    "## 2.3.3 Functional Requirements For Tso-C153A Class Rh (F4): Temperature Control\n\nRH.ee) \nThe IMA module shall provide a regulated temperature control of the mounted hardware module. This control shall be ensured per slot in a determined temperature range. \nRH.ff) The IMA module may provide an active means - named temperature control unit - to \ncontrol temperature between aircraft environment and the mounted hardware modules.",
    "## 2.3.4 Characterization Requirements For Tso-C153A Class Rh (F4)",
    "RH.gg) The heat exchange performance of each slot provided shall be characterized and valued \nin the installation manual. \nRH.hh) For at least the following failure modes, the failure rate shall be provided: \na. Loss of the active temperature control function; \nb. Erroneous behavior of the active temperature control function. \nRH.ii) Reserved. \nRH.jj) Reserved.",
    "RH.ii) Reserved. \nRH.jj) Reserved. \nThe following table gives the verification method for each MPS; nevertheless, an alternative method may be proposed to the certification authority per section 3 h. of the TSO:",
    "| Requirement    | Verification              | Test under    | Test under                 | Applicable DO-160DO-   |\n|----------------|---------------------------|---------------|----------------------------|------------------------|\n| identifier     | method                    | normal        | environmental              | 160sections            |\n| conditions     | conditions                |               |                            |                        |",
    "| RH.a)          |                           |               |                            |                        |\n| I+T            | Y                         | Y             |                            |                        |\n| (2)            |                           |               |                            |                        |\n|                | no DO-160 section see (2) |               |                            |                        |",
    "| RH.b)          |                           |               |                            |                        |\n| T              | Y                         | Y             | DO-160 sections 4, 5, 7, 8 |                        |\n| RH.c)          |                           |               |                            |                        |\n| I+T            |                           | Y             |                            |                        |",
    "| (2)            |                           |               |                            |                        |\n|                | no DO-160 section see (2) |               |                            |                        |\n| RH.d)          |                           |               |                            |                        |\n| I              |                           |               |                            |                        |",
    "| RH.e)          |                           |               |                            |                        |\n| I/A            |                           |               |                            |                        |\n| RH.f)          |                           |               |                            |                        |\n| I              |                           |               |                            |                        |",
    "| RH.g)          |                           |               |                            |                        |\n| I              |                           |               |                            |                        |\n|                |                           |               |                            |                        |\n| RH.h)          |                           |               |                            |                        |",
    "| I+A            |                           |               |                            |                        |\n|                |                           |               |                            |                        |\n|                |                           |               |                            |                        |\n|                |                           |               |                            |                        |",
    "| Requirement                | Verification                | Test under    | Test under                 | Applicable DO-160DO-   |\n|----------------------------|-----------------------------|---------------|----------------------------|------------------------|\n| identifier                 | method                      | normal        | environmental              | 160sections            |",
    "| conditions                 | conditions                  |               |                            |                        |\n| RH.i)                      |                             |               |                            |                        |\n| A                          |                             |               |                            |                        |",
    "| RH.j)                      |                             |               |                            |                        |\n| I+T                        | Y                           |               |                            |                        |\n| RH.k)                      |                             |               |                            |                        |",
    "| I                          |                             |               |                            |                        |\n| RH.l)                      |                             |               |                            |                        |\n| I                          |                             |               |                            |                        |",
    "| RH.m)                      |                             |               |                            |                        |\n| T                          | Y                           | Y             | Appropriate DO-160         |                        |\n| sections addressing the    |                             |               |                            |                        |",
    "| shielding characteristics, |                             |               |                            |                        |\n| and as a minimum           |                             |               |                            |                        |\n| sections 18, 19, 20, 22    |                             |               |                            |                        |",
    "|                            |                             |               |                            |                        |\n|                            |                             |               |                            |                        |\n| RH.n                       |                             |               |                            |                        |",
    "|                            |                             |               | Reserved                   |                        |\n| RH.o)                      |                             |               |                            |                        |\n| I                          |                             |               |                            |                        |",
    "| RH.p)                      |                             |               |                            |                        |\n| I                          |                             |               |                            |                        |\n|                            |                             |               |                            |                        |",
    "| RH.q)                      |                             |               |                            |                        |\n| I+A                        |                             |               |                            |                        |\n|                            |                             |               |                            |                        |",
    "| RH.r)                      |                             |               |                            |                        |\n| I                          |                             |               |                            |                        |\n| RH.s)                      |                             |               |                            |                        |",
    "| T                          | Y                           | Y             | Appropriate DO-160         |                        |\n| sections addressing the    |                             |               |                            |                        |\n| shielding characteristics  |                             |               |                            |                        |",
    "| and as a minimum           |                             |               |                            |                        |\n| sections 18, 19, 20, 22    |                             |               |                            |                        |\n| RH.t)                      |                             |               |                            |                        |",
    "| I                          |                             |               |                            |                        |\n| RH.u)                      |                             |               |                            |                        |\n| T                          | Y                           | Y             |                            |                        |",
    "| (1)                        |                             |               |                            |                        |\n|                            | DO-160 sections 4, 5, 6, 7, |               |                            |                        |\n| 8, 16, to 22               |                             |               |                            |                        |",
    "| RH.v)                      |                             |               |                            |                        |\n| A+T                        | Y                           | Y             | DO-160 sections 16 to 22   |                        |\n| RH.w)                      |                             |               |                            |                        |",
    "| T                          | Y                           | Y             |                            |                        |\n| (1)                        |                             |               |                            |                        |\n|                            | DO-160 sections 4, 5, 7,    |               |                            |                        |",
    "| 16 to 22                   |                             |               |                            |                        |\n| RH.x)                      |                             |               |                            |                        |\n| T                          | Y                           | Y             | DO-160 sections 4, 5, 7    |                        |",
    "| RH.y)                      |                             |               |                            |                        |\n| A                          |                             |               |                            |                        |\n| RH.z)                      |                             |               |                            |                        |",
    "| T(A*)                      | Y                           |               |                            |                        |\n| RH.aa)                     |                             |               |                            |                        |\n| T(A*)                      | Y                           |               |                            |                        |",
    "| (1)                        |                             |               |                            |                        |\n|                            | Y                           |               |                            |                        |\n| (1)                        |                             |               |                            |                        |",
    "|                            | DO-160 sections 4, 5, 7     |               |                            |                        |\n| RH.bb)                     |                             |               |                            |                        |\n| A                          | Y                           |               |                            |                        |",
    "| RH.cc)                     |                             |               |                            |                        |\n| T(A*)                      | Y                           |               |                            |                        |\n| (1)                        |                             |               |                            |                        |",
    "|                            |                             |               |                            |                        |\n| RH.dd)                     |                             |               |                            |                        |\n| I                          |                             |               |                            |                        |",
    "| RH.ee)                     |                             |               |                            |                        |\n| T                          | Y                           | Y             | DO-160 sections 4 and 5    |                        |\n| RH.ff)                     |                             |               |                            |                        |",
    "| I+T                        | Y                           | Y             | DO-160 sections 4 and 5    |                        |\n| RH.gg)                     |                             |               |                            |                        |\n| I+T                        | Y                           | Y             | DO-160 sections 4, 5, 6, 7 |                        |",
    "| RH.hh)                     |                             |               |                            |                        |\n| A                          |                             |               |                            |                        |\n| RH.ii)                     |                             |               |                            |                        |",
    "|                            |                             |               | Reserved                   |                        |\n| RH.jj)                     |                             |               |                            |                        |\n|                            |                             |               | Reserved                   |                        |",
    "(A*): Means that verification by Analysis method is possible for the item that cannot be tested. \n\n \nNote 1:  Applicable for a functional subset  cf. CO.gg).  \nNote 2:  Test to be completed after environmental testing.  \n\n## Appendix 2.3 Integrated Modular Avionic Platform And Module Minimum Performance Standard (Mps) Class Pr: Processing Purpose And Scope 1.1. Introduction",
    "This Appendix contains Minimum Performance Standards (MPS) for CLASS PR Intended Function: \nProcessing (PR). These standards specify characteristics that should be useful to designers, manufacturers, installers, and users of the IMA module. \n\n## 1.2. Definitions\n\nFor TSO-C153a CLASS PR, IMA module provides shared resources in terms of processing between Hosted applications, modules, and/or components. The following definitions are used:",
    "o \nProcessing Unit: set of physical components (hardware and/or software) in charge of carrying out the instructions of a computer program by performing the basic arithmetical, logical, and input/output operations of the Executable Object Code. \no \nExecutable Object Code [RTCA DO-178C]: a form of code that is directly usable by the processing \nunit of the target computer and is, therefore, a compiled, assembled, and linked binary image that is loaded into the target computing hardware. \no",
    "o \nProcessing Element: well-defined set of instructions which is a primary form of Executable Object Code execution and for which a level of isolation would be guaranteed by the IMA module. \n In the context of PR class, the 'concurrent item' defined in Appendix 2.1 paragraph 1 means 'Processing Element'.",
    "## 1.3. Intended Function\n\nFor TSO-C153a CLASS PR, the intended function is to provide the capacity to share processing supplied by one or several processing unit(s). IMA module may include data storage and interfaces between Hosted applications, modules, and/or components; in this case, this class shall be combined with DS and IF classes. The following figure provides an overview of the intended function of the previously mentioned IMA module and associated definitions:",
    "## 2. Requirements 2.1. Functional Requirements For Tso-C153A Class Pr",
    "PR.a) The IMA module shall provide to Hosted applications a Processing Resource which has \nthe capacity to execute a set of instructions of a computer program by performing the basic arithmetical, logical, and input/output operations of their Executable Object Code(s); \nPR.b) The IMA module shall be able to host applications and/or Executable Object Code(s) \ncomponents. \nPR.c) The IMA module shall provide the Hosted applications the capacity to share Processing",
    "PR.c) The IMA module shall provide the Hosted applications the capacity to share Processing \nResource thanks to the Processing Elements that are managed through a logical interface (such as an API).",
    "## 2.2. Characterization Requirements For Tso-C153A Class Pr",
    "PR.d) All processing performances of the shared Processing Unit of the IMA module shall be \ncharacterized, including but not limited to the following: \n1. \nProcessing Unit Throughput (performance capacities and timings). \n2. \nPerformances of User Software/Software Interface (Core Software) Mechanism(s), Protocol(s), and Service(s). \n3. \nPerformances of User Hardware/Software Interface Mechanism(s), Protocol(s), and Service(s). \n4.",
    "Performances of User Hardware/Software Interface Mechanism(s), Protocol(s), and Service(s). \n4. \nPerformances of supported Processing Element Type (e.g., application, partition, process, thread, etc.). \n5. \nPerformances of Interrupt mechanisms. \n6. \nPerformances of Memory Management, including cache and MMU. \n \nNote:  These performance requirements are additional to those  \napplicable in COMMON - Appendix 2.1).",
    "The following table gives the verification method for each MPS: nevertheless, an alternative method may be proposed to the certification authority per section 3 h. of this TSO:",
    "| Requirement    | Verification    | Test under    | Test under    |\n|----------------|-----------------|---------------|---------------|\n| identifier     | method          | normal        | environmental |\n| conditions     | conditions      |               |               |\n| PR.a)          |                 |               |               |\n| T              | Y               | Y             |               |\n| PR.b)          |                 |               |               |",
    "| PR.b)          |                 |               |               |\n| T              | Y               | Y             |               |\n| PR.c)          |                 |               |               |\n| T              | Y               | Y             |               |\n| PR.d)          |                 |               |               |\n| T (A*)         | Y               | Y             |               |\n| (1)            |                 |               |               |",
    "| (1)            |                 |               |               |\n|                |                 |               |               |\n|                |                 |               |               |",
    "(A*): means that verification by Analysis method is possible for the item that cannot be tested. \n\nNote:  Applicable for a functional subset  cf. CO.gg) \n\n## Appendix 2.4 Integrated Modular Avionic Module Minimum Performance Standard (Mps) Class Gp: Graphical Processing 1. Purpose And Scope Introduction",
    "This Appendix contains Minimum Performance Standard (MPS) for CLASS GP Intended Function: \nGraphical Processing. These standards specify characteristics that should be useful to designers, manufacturers, installers, and users of the IMA module.",
    "For TSO-C153a CLASS GP, the IMA module provides shared resources in terms of graphical conversion and graphical laying out between the Hosted applications, modules, and/or components based on commands coming from these Hosted applications, modules, and/or components. \n\nThe following definitions are used:",
    "o \nGraphical Thread: Set of graphical (displayable) information for which a level of isolation would be guaranteed by the IMA module. \no \nData Thread: Well-defined set of data which is a primary form of drawing directives received as \ninput by the IMA module from Hosted applications (modules and/or components). \no \nCommand Thread: Well-defined set of command directives received as input by the IMA module",
    "o \nCommand Thread: Well-defined set of command directives received as input by the IMA module \nfrom the Hosted applications (modules and/or components) in order to change the conversion and \nlaying out settings. \no \nGraphical conversion: Transformation of a set of data information that is the primary form of \ndrawing directives (data thread) into a set of displayable basic information. \no \nLaying out: Operation consisting of a combination of merging or/and splitting actions on",
    "o \nLaying out: Operation consisting of a combination of merging or/and splitting actions on \ndisplayable basic information in order to build the final Graphical Thread to be rendered. \no \nConversion Unit: Set of physical components (hardware and/or software) in charge of graphical conversion. \no \nLaying out Unit: Set of physical components (hardware and/or software) in charge of laying out.",
    "Laying out Unit: Set of physical components (hardware and/or software) in charge of laying out. \n \nNote:  Both units can be merged into one unit.  The final rendering of the graphical thread(s) is out of the scope of this module (refer to CLASS DH).",
    "In the context of GP class, the 'concurrent item' defined in Appendix 2.1 paragraph 1 means 'Graphical and/or Command Thread'.",
    "For TSO-C153a CLASS GP, the intended function is to provide the capability to share graphical conversion and graphical laying out supplied by one or several graphical conversion and graphical laying out unit(s). The function of the Graphical Processing Module is to receive commands from Hosted applications, modules, and/or components, and optionally receive video from external analog or digital sources, process them, and to generate a display image. This intended function is Graphical",
    "digital sources, process them, and to generate a display image. This intended function is Graphical Conversion and Laying out resource sharing composed of:",
    "o \nInformation acquisition & control, \no \nInformation conversion and laying out, \no \nInformation forwarding & control. \nThe following figure provides an overview of the previously mentioned IMA module intended function and associated definitions: \n\n## Requirements Functional Requirements For Tso-C153A Class Gp:",
    "GP.a) The IMA module shall provide to Hosted applications a Graphical Conversion Resource \nthat has the capability to transform a set of drawing directives into a set of displayable \nbasic information. \nGP.b) The IMA module shall provide to the Hosted applications, a Graphical Laying out Resource \nwhich has the capability to merge and/or split displayable basic information to build the final Graphical Thread(s) to be rendered.",
    "GP.c) The IMA module shall provide to the Hosted applications, modules and/or components the \ncapability to change the graphical conversion and laying out settings through command \nthreads. \nGP.d) The IMA Module shall provide to the Hosted applications, modules and/or components the \ncapability to share a Graphical Conversion Resource and a Graphical Laying out Resource based on command threads managed through logical and/or physical interface(s).",
    "## Characterization Requirements For Tso-C153A Class Gp:\n\nGP.e) Following the Graphical Unit(s) performances that the IMA module shall be valued at:",
    "1. \nGraphical Unit(s) Throughput (performance capacities and timings: response time, graphical update). \n2. \nPerformances of the User Software/Software Interface (Core Software) \nMechanism(s), Protocol(s), and Service(s). \n3. \nPerformances of the User Hardware/Software Interface Mechanism(s), Protocol(s), and Service(s). \n4. \nEstablishment of Worst Case Graphical Elaboration Time \n5. \nPerformances of Interrupt mechanisms. \n6. \nPerformances of supported Data Thread types. \n7.",
    "5. \nPerformances of Interrupt mechanisms. \n6. \nPerformances of supported Data Thread types. \n7. \nPerformances of supported Graphical Thread types. \n8. \nPerformances of supported Command Thread types. \nNote:  These performance requirements are additional to those applicable in COMMON - Appendix 2.1).",
    "GP.f) In addition to Common Requirement(CO.w), particular emphasis shall be given to \nprecluding or mitigating failures which could result in hazardously misleading information. Undetected loss of information, incorrect information, or frozen information could contribute to hazardously misleading information. \n               **Note:**  This is applicable to all GP module functionalities including the \n        \nimplementation of image windowing, superimposition, etc.",
    "implementation of image windowing, superimposition, etc. \n The following table gives the verification method for each MPS; nevertheless, an alternative method may be proposed to the certification authority per section 3 h. of this TSO:",
    "| Requirement    | Verification    | Test under    | Test under     |\n|----------------|-----------------|---------------|----------------|\n| identifier     | method          | normal        | environmental  |\n| conditions     | conditions      |               |                |\n| GP.a)          |                 |               |                |\n| T              | Y               | Y             |                |\n| GP.b)          |                 |               |                |",
    "| GP.b)          |                 |               |                |\n| T              | Y               | Y             |                |\n| GP.c)          |                 |               |                |\n| T              | Y               | Y             |                |\n| GP.d)          |                 |               |                |\n| T              | Y               | Y             |                |\n| GP.e)          |                 |               |                |",
    "| GP.e)          |                 |               |                |\n| T(A*)          | Y               | Y             |                |\n| (1)            |                 |               |                |\n|                |                 |               |                |\n| GP.f)          |                 |               |                |\n| I              |                 |               |                |",
    "(A*): means that verification by Analysis method is possible for the item that cannot be tested. \n\n \nNote: Applicable for a Functional subset  cf. CO.gg). \n\n \n\n## Appendix 2.5 Integrated Modular Avionic Platform Module Minimum Performance Standard (Mps) Class Ds: Data Storage (Ds) Purpose And Scope Introduction",
    "This appendix contains Minimum Performance Standards (MPS) for CLASS DS Intended Function: Data Storage. These standards specify characteristics that should be useful to designers, manufacturers, installers, and users of the IMA module. \n\n For TSO-C153a CLASS DS, IMA module provides shared resources in terms of data storage between the Hosted applications, modules and/or components.",
    "Data Storage refers to the storage of data in a persisting and machine-readable mode. Data Storage module that records data may access both separate portable (removable) recording component and/or permanent component to store and retrieve data. Following definitions are used:",
    "o \nStorage Unit: set of physical components (hardware and/or software) in charge of supplying and managing recorded data resource (e.g., memory components, and associated interfaces, etc.) \no \nData Storage Element: completely defined set of data storage which is a primary form of recorded \ndata for which a level of isolation would be guaranteed by the IMA module. \n In the context of DS class, the 'concurrent item' defined in Appendix 2.1 paragraph 1 means 'Data Storage Element'.",
    "For TSO-C153a CLASS DS, the intended function is to provide the capability to share recorded data or data storage space supplied by one or several storage unit(s). \n\n \n\n## Requirements Functional Requirements For Tso-C153A Class Ds:",
    "DS.a) The IMA module shall provide to the Hosted applications, modules, and/or components \nData Storage Resource which has the capacity to record or to retrieve a set of data on/from a storage unit by performing the data-retaining operations. \nDS.b) The IMA module shall provide the Hosted applications, modules, and/or components the \ncapacity to use shared recorded data resource thanks to data storage elements accessible through a logical and/or physical interface(s).",
    "## Characterization Requirements",
    "DS.c) All Data Storage performances of the shared Storage Unit of the IMA module shall be \ncharacterized including but not limited to the following: \n1. Performances of Memory Management, including cache and Memory Management Unit \n(e.g. storage capacity, cache performances, etc.). \n2. Performances of User Interface Mechanism(s), Protocol(s), and Service(s) (e.g., access \ntimings and throughputs, etc.) \n3. Performances of supported Data Storage Element Type (e.g., namespace, address scheme,",
    "3. Performances of supported Data Storage Element Type (e.g., namespace, address scheme, \narbitrary principles for multiple access, throughputs, timings, data space, etc.). \nNote: These performance requirements are additional to  \nthose applicable in COMMON - Appendix 2.1.",
    "The following table gives the verification method for each MPS; nevertheless, an alternative method may be proposed to the certification authority per section 3 .h of this TSO:",
    "| Requirement    | Verification    | Test under    | Test under     |\n|----------------|-----------------|---------------|----------------|\n| identifier     | method          | normal        | environmental  |\n| conditions     | conditions      |               |                |\n| DS.a)          |                 |               |                |\n| T              | Y               | Y             |                |\n| DS.b)          |                 |               |                |",
    "| DS.b)          |                 |               |                |\n| T              | Y               | Y             |                |\n| DS.c)          |                 |               |                |\n| T(A*)          | Y               | Y             |                |\n| (1)            |                 |               |                |\n|                |                 |               |                |",
    "(A*): Means that verification by Analysis method is possible for the item that cannot be tested. \n\n \nNote:  Applicable for a functional subset  cf. CO.gg). \n\n## Appendix 2.6 Integrated Modular Avionic Module Minimum Performance Standard (Mps) Class If: Interface Purpose And Scope Introduction",
    "This Appendix contains Minimum Performance Standards (MPS) for CLASS IF Intended Function: \nInterface. These standards specify characteristics that should be useful to designers, manufacturers, installers, and users of the IMA module. \n\n For TSO-C153a CLASS IF, IMA module provides shared resources in terms of interfaces between the Hosted applications, modules, and/or components. Following definitions are used:",
    "o \nInterface Unit: set of hardware and/or software components in charge of supplying and managing \na shared information resource. \no \nData Thread: well-defined set of data which is a primary form of information and for which a level \nof isolation would be guaranteed by the IMA module.",
    "of isolation would be guaranteed by the IMA module. \n Each data thread handled by the Interface, if so desired by the applicant, may be bidirectional or symmetrical between interconnected components, modules, or the Hosted applications. In the context of IF class, the 'Concurrent item' defined in Appendix 2.1 paragraph 1 means 'Data Thread'.",
    "For TSO-C153a CLASS IF, the intended function is to provide the capability to share information supplied by one or several interface units. This intended function is Information Sharing composed of:",
    "o \ninformation acquisition & control, \no \ninformation conversion, and \no \ninformation forwarding & control. \n \n \nThe information-forwarding and control function is the means that allows sharing information between components, modules, and/or the Hosted applications. The following figure provides an overview of the previously mentioned intended function and associated definitions: \n \n\n## Requirements",
    "## Requirements\n\nFor TSO-C153a CLASS IF, IMA module provides shared resources for communication needs of the Hosted applications, modules, and/or components. \n\n## Functional Requirements For Tso-C153A Class If:",
    "IF.a) The IMA module shall provide to Hosted applications, modules, and/or components \nInformation Resource which has the capacity to acquire or to forward a set of data from/to an interface unit by performing the information coding and decoding operations. \nIF.b) The IMA module shall provide to the Hosted applications, modules, and/or components \nthe capacity to use shared Information Resource thanks to Data Threads handled through logical and/or physical interface(s).",
    "## 1.1. Characterization Requirements For Tso-C153A Class If:",
    "IF.c) All performances of the shared Interface Unit of the IMA module shall be characterized \nincluding but not limited to the following: \n1. \nPerformances of each Interface, including throughput, acquisition speed, forwarding speed, latency, jitter, coding rate, and decoding rate. \n2. \nPerformances of User Interface Mechanism(s), Protocol(s) and Service(s) (e.g., socket timing, communication port timing, technological time delay, etc.). \n3.",
    "3. \nPerformances of supported Data Thread Type (e.g., virtual link, channel, pipe-andfilter, physical connection pin, etc.). \nNote: These performance requirements are additional to  \nthose applicable in COMMON - Appendix 2.1).",
    "IF.d) In addition to Common Requirement CO.w), the characterization shall address the safety \naspects of frozen data. \n The following table gives the verification method for each MPS; nevertheless, an alternative method may be proposed to the certification authority per section 3 h. of this TSO:",
    "| Requirement    | Verification    | Test under    | Test under     |\n|----------------|-----------------|---------------|----------------|\n| identifier     | method          | normal        | environmental  |\n| conditions     | conditions      |               |                |\n| IF.a)          |                 |               |                |\n| T              | Y               | Y             |                |\n| IF.b)          |                 |               |                |",
    "| IF.b)          |                 |               |                |\n| T              | Y               | Y             |                |\n| IF.c)          |                 |               |                |\n| T(A*)          | Y               | Y             |                |\n| (1)            |                 |               |                |\n|                |                 |               |                |\n| IF.d)          |                 |               |                |",
    "| IF.d)          |                 |               |                |\n| T or A*        |                 |               |                |",
    "(A*): means that verification by Analysis method is possible for the item that cannot be tested. \n\n \nNote: Applicable for a functional subset  cf. CO.gg). \n\n \n\n## Appendix 2.7 Integrated Modular Avionic Platform Module Minimum Performance Standard (Mps) Class Ps: Power Supply (Ps)\n\n \nPurpose and scope \n\n## Introduction",
    "Purpose and scope \n\n## Introduction\n\n \nThis Appendix contains Minimum Performance Standards (MPS) for CLASS PS Intended Function: \nPower Supply (PS) These standards specify module characteristics that should be useful to designers, manufacturers, installers, and users of the module.",
    "For TSO-C153a CLASS PS, IMA module is a module - mounted into a rack or the rack itself - able to supply power received from aircraft electrical network to one or more hardware modules mounted in the same rack. Following definitions are used:",
    "o \nPower supply unit: set of physical components (hardware and or software) in charge of managing a power supply (or a part of the power supply) resource. \no \nPower supply resource: obtained electrical energy from aircraft electrical network to be distributed to electrical loads which are modules mounted into the rack \no \nPower rail: part of supplied electrical energy for which a level of isolation would be guaranteed by the IMA module. \no",
    "o \nMounted: refers to another hardware module, installed and fixed inside the IMA Rack Module, \nafter a human operation. \no \nSlot: a physical space inside the Rack Module, allocated to one hardware module \no \nHold-up Capacity: The capacity of the power supply to continue supplying output current after the \ninput voltage drops below the minimum level. This is usually expressed as the time from the input voltage drop to the reset generated by the power supply to the processor. \no",
    "o \nOutput Current Capacity: The continuously operating maximum current supplied for each output voltage. \no \nPower Monitors & Status Outputs: Separate circuitry which checks the output voltage levels and current loading of the power supply. This circuitry will generate one or more binary signals that may be connected to the processor to alert it to the \"out of spec\" condition. These binary signals may also force the power supply to shut-down to prevent damage to power supply components. \no",
    "o \nPower Resets: A binary signal output from the power supply that is asserted when the output \nvoltages are outside acceptable tolerances. \no \nRegulation: The percentage of variation of the output voltages when subjected to changes in load, changes in temperature, and all input voltage transients and deviations. \no",
    "o \nTransient Immunity: The ability of the power supply to continue operating normally during variations in the input voltage. This is usually expressed as the length of time and the voltage level of the transient. \no \nVoltage Outputs and Tolerances: The voltage levels and tolerances of the outputs produced by the power supply. \n In the context of PS class, the \"concurrent item\" defined in Appendix 2.1 paragraph 1 means 'Power Rail'.",
    "For TSO-C153a CLASS PS, the intended function is to provide the capability to share Power Supply resource(s) supplied by one or more Power Supply unit(s). The following figure provides an overview of the previously mentioned intended function and definitions where A/C is aircraft: \n \n\n## Requirements Functional Requirements For Tso-C153A Class Ps:",
    "PS.a) The IMA module shall provide to hardware modules, mounted into the same rack, Power \nSupply Resource which has the capacity to deliver a quantity of electrical energy from the \npower supply unit(s) to the hardware modules while performing the regulation operations. \nPS.b) The IMA module shall provide to hardware modules, which are mounted into the same \nrack, the capacity to share power supply resource on power rails accessible through \nphysical interface(s).",
    "## Characterization Requirements",
    "PS.c) All Power Supply performances of the shared Power Supply Unit of the IMA module shall \nbe characterized including but not limited to the following:  \n1. \nNeeded input power budget characteristics (e.g., in function of Temperature and \nload) \n2. \nPerformances of Output Current and Tolerances; \n3. \nPerformances of Hold-up Capacity; \n4. \nPerformances of Power Monitors and Status Outputs; \n5. \nPerformances of Power Resets; \n6. \nPerformances of Regulation; \n7.",
    "5. \nPerformances of Power Resets; \n6. \nPerformances of Regulation; \n7. \nPerformances of Transient Immunity; \n8. \nPerformances of Voltage Outputs and Tolerances; \n9. \nPerformances of User Interface Mechanism(s), Protocol(s) and Service(s); \n10. \nPerformances of supported Power rail Type; \n11. \nInput and Output impedance; \n12. \nCapacitive load \nNote: These performance requirements are additional to those",
    "12. \nCapacitive load \nNote: These performance requirements are additional to those  \napplicable and dictated by the design of IMA module itself (according to COMMON Requirement in Appendix 2.1).",
    "PS.d) In addition to Common Requirement CO.w), the characterization shall address the safety \naspects of events such as too low voltage or current, and too high voltage or current. Transient as well as permanent effects shall be characterized if relevant. \nPS.e) The characterization shall provide any data needed to evaluate power profile characteristics \n(e.g., Maximum Value, In-Rush current) of managed power rails and IMA module power \non/power off behavior characteristics.",
    "on/power off behavior characteristics. \n The following table gives the verification method for each MPS; nevertheless, an alternative method may be proposed to the certification authority per section 3 g. of this TSO:",
    "| Requirement    | Verification    | Test under    | Test under     |\n|----------------|-----------------|---------------|----------------|\n| identifier     | method          | normal        | environmental  |\n| conditions     | conditions      |               |                |\n| PS.a)          |                 |               |                |\n| T              | Y               | Y             |                |\n| PS.b)          |                 |               |                |",
    "| PS.b)          |                 |               |                |\n| T              | Y               | Y             |                |\n| PS.c)          |                 |               |                |\n| T(A*)          | Y               | Y             |                |\n| (1)            |                 |               |                |\n|                |                 |               |                |\n| PS.d)          |                 |               |                |",
    "| PS.d)          |                 |               |                |\n| T(A*)          | Y               |               |                |\n| PS.e)          |                 |               |                |\n| A              |                 |               |                |",
    "(A*): Means that verification by Analysis method is possible for the items that cannot be tested. \n\nNote:  Applicable for a functional subset  cf. CO.gg). \n\n \n\n## Appendix 2.8 Integrated Modular Avionic Platform Module Minimum Performance Standard (Mps) Class Dh: Display Head Purpose And Scope Introduction",
    "This Appendix contains Minimum Performance Standards (MPS) for CLASS DH Intended Function: \nDisplay Head. These standards specify characteristics that should be useful to designers, manufacturers, installers, and users of the module. \n\n For TSO-C153a CLASS DH, IMA module provides shared resources in terms of display area between the Hosted applications, components, and/or modules. \n\nThe following definitions are used:",
    "o \nDisplay Unit: Set of physical components (hardware and/or software) in charge of managing a display area (or a part of a display area). \no \nDisplay Area: Surface where some visual information can be depicted by one or several Display Unit(s) based on received Graphical Threads. \no \nGraphical Thread: Set of graphical information received as input by the Display Head from one or \nmore IMA Application(s), component(s) and/or module(s). \no",
    "more IMA Application(s), component(s) and/or module(s). \no \nDisplay Thread: Set of depiction information for which level of isolation would be guaranteed on \nthe Display Area by the Display Head. \nIn the context of DH class, the 'Concurrent item' defined in Appendix 2.1 paragraph 1 means 'Display Thread'.",
    "For TSO-C153a CLASS DH, the intended function is to provide the capability to share one display area supplied by one or several display unit(s). \n\nThe intended function of such IMA module is to offer the capability to depict graphical information received from IMA Application(s), component(s) and/or module(s) on one Display Area. \n\nThe following figure provides an overview of the previously mentioned intended function and associated interfaces:",
    "## Requirements Functional Requirements For Tso-C153A Class Dh:",
    "DH.a) The IMA module shall provide the Hosted applications, modules and/or components \nDisplay Area Resource that has the capability to render visual graphical information. \nDH.b) The IMA module shall be compliant (fully or partially) to MPS from applicable release of \nTSO-C113. \n \nNote 1: These performance requirements are additional to those applicable in \nCOMMON - Appendix 2.1. \nNote 2: For Display Head module without Graphics generation function,",
    "COMMON - Appendix 2.1. \nNote 2: For Display Head module without Graphics generation function, \ncompliance demonstration to some TSO-C113 requirements might not be \npossible.  In such cases the applicant shall submit in the compliance data package the list of requirements that requires further demonstration to TSO-C113 requirements with relevant justification. \nDH.c) The IMA module shall provide to the Hosted applications, modules, and/or components,",
    "DH.c) The IMA module shall provide to the Hosted applications, modules, and/or components, \nthe capability to share a Display Area resource **that is managed** through a logical or \nphysical interface.",
    "## Characterization Requirements For Tso-C153A Class Dh:",
    "DH.d) In addition to Common Requirement CO.w), the characterization shall address the safety \naspects of delay and/or frozen information. \nDH.e) In addition to Common Requirement CO.s), the characterization shall include any data \nneeded to evaluate Worst Case Display Elaboration Time of managed threads and characteristics required by applicable release of SAE AS8034 (per applicable revision of \nTSO-C113).",
    "TSO-C113). \nDH.f) The additional activities performed by the user related to the applicable release of TSO-\nC113 compliance demonstration completeness shall be included in the characterization for \ngap identification. \n \n The following table gives a verification method for each MPS; nevertheless, an alternative method may be proposed to the certification authority per section 3 h. of this TSO:",
    "| Requirement    | Verification    | Test under    | Test under    |\n|----------------|-----------------|---------------|---------------|\n| identifier     | method          | normal        | environmental |\n| conditions     | conditions      |               |               |\n| DH.a)          |                 |               |               |\n| T              | Y               | Y             |               |\n| DH.b)          |                 |               |               |",
    "| DH.b)          |                 |               |               |\n| (2)            | (2)             | (2)           |               |\n| DH.c)          |                 |               |               |\n| T              | Y               | Y             |               |\n| DH.d)          |                 |               |               |\n| T/A*           | Y               |               |               |\n| DH.e)          |                 |               |               |",
    "| DH.e)          |                 |               |               |\n| A              |                 |               |               |\n| DH.f)          |                 |               |               |\n| A              |                 |               |               |",
    "(A*): Means that verification by Analysis method is possible for the item that cannot be tested. \n\n \nNote 1:  For the functional subset see CO.gg). \n\n \nNote 2:  Applicable revision of TSO-C113 is defining  \nthe verification requirements of a display function. \n\n \n\n## Appendix 3 Integrated Modular Avionic Module Data Requirements",
    "For IMA module authorization, as mentioned in paragraph 2.2 of the core document, additional technical data shall be available or submitted. This data will be documented into a set of documents for the TSO authorization (qualification plans, compliance evidences, etc.) and for the IMA module users such as Application developers, Integrator, or Type Certificate applicant (User Guide, Usage domain, etc.) in the following format:",
    "- \nChapter 1 - IMA module DO-297 documentation \n- \nChapter 2 - Specific User Guide and Installation Manual contents \n- \nChapter 3 - Core software \n- \nChapter 4 - Health management and reporting \n- \nChapter 5 - Usage domain \n- \nChapter 6 - Configuration \n- \nChapter 7 - Tools \n- \nChapter 8 - Compatibility & mix ability information \n Chapter 1 - IMA module DO-297 documentation IMA system approval can be made incremental by introducing intermediate acceptance steps. TSO-",
    "C153a authorization is a first intermediate step dedicated to authorize IMA platform or IMA modules (independent of any specific aircraft installation). RTCA DO-297 contains guidance for Integrated Modular Avionics (IMA) developers, application developers, integrators, certification applicants, and those involved in the approval and continued airworthiness of IMA systems in civil certification projects. To prepare the integration of the TSO-C153a IMA module, consider the Task 1 development",
    "projects. To prepare the integration of the TSO-C153a IMA module, consider the Task 1 development objectives that are defined in RTCA DO-297 (Table A-1 objectives). The following data are available (A) or submitted (S) as part of the TSO-C153a authorization data package:",
    "| RTCA DO-297 Life Cycle Data    | RTCA DO-   | Available/Submitted    |\n|--------------------------------|------------|------------------------|\n| 297Life Cycle                  | (A)        |                        |\n|                                |            |                        |\n| / (S)                          |            |                        |\n| Section                        |            |                        |",
    "| Section                        |            |                        |\n| Module Acceptance Plan         | 4.2.3      | S                      |\n| Module Requirements Standards  | 4.2.4      | A                      |\n| Traceability Data              | 4.2.5      | A                      |\n| Module Design Data             | 4.2.4      | A                      |\n| RTCA DO-297 Life Cycle Data                                       | RTCA DO-   | Available/Submitted                |",
    "|-------------------------------------------------------------------|------------|------------------------------------|\n| 297Life Cycle                                                     | (A)        |                                    |\n|                                                                   |            |                                    |\n| / (S)                                                             |            |                                    |",
    "| Section                                                           |            |                                    |\n| 4.2.12b                                                           | S          | Module Failure Analyses and Safety |\n| Analyses                                                          |            |                                    |\n| Module Tool Qualification Data                                    | 4.2.12c    | S                                  |",
    "| Partitioning Analysis Data                                        |            |                                    |\n| (1)                                                               |            |                                    |\n|                                                                   | 4.2.4i     | S                                  |\n| V&V data                                                          | 4.2.5      | A                                  |",
    "| Module Acceptance Data Sheet                                      | 4.2.10     | S                                  |\n| Interface Standards                                               | 4.2.4f     | A                                  |\n| Module User Guide                                                 | 4.2.12e    | S                                  |\n| (2)                                                               |            |                                    |",
    "|                                                                   |            |                                    |\n| Module QA Records                                                 | 4.2.6      | A                                  |\n| Module CM Records                                                 | 4.2.8      | A                                  |\n| 4.2.9                                                             | S          | Module Acceptance Accomplishment   |",
    "| Summary                                                           |            |                                    |\n| Module Acceptance Configuration Index                             | 4.2.7      | S                                  |\n| Module Open Problem Reports                                       | 4.2.11     | S                                  |\n|                                                                   |            |                                    |",
    "| Note 1:                                                           |            |                                    |\n| This Partitioning Analysis shall include the verification         |            |                                    |\n| results obtained for demonstration of compliance of CO.e), CO.f), |            |                                    |\n| CO.g), CO.h).                                                     |            |                                    |",
    "|                                                                   |            |                                    |\n| Note 2:                                                           |            |                                    |\n| Only for User Guide content used for TSO compliance               |            |                                    |\n| demonstration.                                                    |            |                                    |",
    "Chapter 2 - Specific User Guide and Installation Manual contents As provided in DO-297, IMA module User's guide shall be provided by the IMA module manufacturer to both the module users and the FAA. This User Guide includes all information for users, integrators, and certification applicants to successfully interface or integrate the module such:",
    "- \nGuaranteed behavior and characteristics in accordance with CO.k \n- \nSystem Interfaces (including physical mapping of Interface) \n- \nLimitations and Open Problem Reports (OPRs) (1) (including tools) \n- \nWorst Case Execution Time (WCET) analysis elements \n- \nApplicable Failure Mode Effect Analysis / Failure Mode Effect Summary (extracts) necessary \nfor higher level safety analysis \n- \nCore Software (see Appendix 3 - Chapter 3) \n-",
    "for higher level safety analysis \n- \nCore Software (see Appendix 3 - Chapter 3) \n- \nFault management and Health Monitoring (See Appendix 3 - Chapter 4) \n- \nUsage Domain (See Appendix 3 - Chapter 5) \n- \nConfiguration Aspects (See Appendix 3 - Chapter 6) \n- \nTools Aspects (See Appendix 3 - Chapter 7) \n- \nCompatibility and mix ability information (See Appendix 3 - Chapter 8) \n- \n Remaining activities to be conducted by Module user to complete the IMA module qualification (Environment, etc.) \n-",
    "- \nRequirements recommendations for Applications (e.g., data for the qualification of the application, service available for applications, etc.) \n- \nRequirements recommendations for System Integration  \n \nNote: (1) A detailed description of IMA module Open Problem Report (OPR) root cause and effect is necessary to support the IMA Module user and aircraft manufacturer in their assessment of the effect of OPR on the aircraft function.",
    "The Installation Manual includes all data necessary for the proper installation and use of the IMA module (including marking aspects). Each item of the characterization and functional requirements are addressed in the User Guide (or possibly in the Installation Manual, if appropriate).",
    "The User Guide defines the usage domain for which the module acceptance data are valid. The information includes recommendations and may also include examples for correct use. In addition, the guide highlights any warnings or limitations for integrating or interfacing the module to avoid potential incorrect or unintended use. The User Guide may be completed by the IMA module manufacturer with:",
    "- \nInformation on Single Event Upset (SEU) effects; \n- \nA Validation and Integration Kit for application developers and system integrators; \n- \nDevelopment and In-Service support; \n- \nSome training.",
    "- \nDevelopment and In-Service support; \n- \nSome training. \n The Installation Manual includes information as required in MPS appendix or reference subsequent applicable chapter of the User Guide. In this case, the User Guide chapter will be submitted to the Airworthiness Authority (see note (1) above). The User Guide may be included in the Installation Manual of the IMA module (e.g., Annexes) or a separated document referenced by the Installation Manual. Chapter 3 - Core software",
    "As defined in Appendix 1, IMA module may be an association of Hardware and Core Software. The Core Software is constituted by the operating system and the support software that manage resources to provide an environment in which the intended function is performed. Core software is typically comprised of one or more component(s). Core Software may be resident or a Field-Loadable Software Part. If IMA module contains Core Software, Core Software characteristics required by CO.r) in Appendix 2",
    "are documented in the IMA module User Guide.",
    "Chapter 4 - Health management and reporting \n \nData requirement related to Health Management and reporting is listed in CO.x). Chapter 5 - IMA module usage domain \n \nTSO-C153a authorization relies on the concept of Usage Domain (See Appendix 1 - Chapter 2",
    "TSO-C153a authorization relies on the concept of Usage Domain (See Appendix 1 - Chapter 2 \nDefinitions). The usage domain is defined at the IMA module level, and used at the Application and IMA system level.  The definition of the usage domain includes consideration of the module functionality, performance, and safety requirements, and its required environmental performance.",
    "Pursuant to 14 CFR parts 23, 25, 27, and 29, IMA modules manufactured to comply with TSO-C153a may be used to support other TSOs or systems. These TSO authorizations, IMA system approvals, and aircraft-level approvals are not covered by TSO-C153a but will rely on the fact that compliance with Usage Domain documented in the User Guide is correctly implemented. Chapter 6 - Configuration IMA modules may need to be configured before installation in the IMA system (See RTCA DO-297",
    "Task 2, 3, and 4). Data requirement related to configurability are listed in CO.y) in Appendix 2.",
    "Chapter 7 - Tools IMA modules may need to use some tools during installation in the IMA system (See RTCA DO-297 Task 2, 3, and 4). These tools may be used by: \n\n- \nApplication developers,  \n- \nIntegrator(s), \n- \nType Certificate (TC) or Supplemental Type Certificate (STC) Applicant. \n These tools may address:",
    "- \nSoftware development (Hosted applications); \n- \nConfiguration development; \n- \nNetwork architecture and configuration; \n- \nDebug, data-loading; \n- \nWCET analysis and measures; \n \nIn cases where tools are used, the User Guide shall reference each tool and the data listed in Appendix 2 CO.z). Qualification data are considered as data to be submitted to the FAA as part of the TSO C-153a authorization.",
    "## Chapter 8 - Compatibility And Mix Ability Information The Ima Module Manufacturer Provides Compatibility And Mix Ability Information Between Hardware, Software, Tools, And Usage Domain In The User Guide, As Required Per Appendix 2 Co.Aa). Appendix 4 Integrated Modular Avionic Module Environmental Qualification Requirements\n\n \nPerform Environmental testing in accordance with the appropriate revision to RTCA DO-\n160. For TSO-C153a, certain aspects have to be addressed:",
    "- \nThe Test Software representativeness, \n- \nThe Applicable Test Procedures, \n- \nThe Parameters needing monitoring during the Environmental Qualification Test. \n \n\n## Chapter 1: Test Software Representativeness",
    "In the case where an IMA module is qualified without the functional software installed and operating, engineering analysis from the manufacturer must determine that the Test Software (not the target functional software) is representative of the usage domain stress envelope for the environmental tests (i.e. dissipated temperature, power consumption, radiated field radiation, etc.) Develop Test Software to require the Hardware to perform the environmental tests in the worst-case conditions.  The",
    "to require the Hardware to perform the environmental tests in the worst-case conditions.  The Test Software must evaluate the Hardware in its most sensitive configurations in order to evaluate the robustness of the IMA module over the full Usage Domain.  For example, Test Software should exercise all physical interfaces with the maximum number of applications or input, with the filter values, set to the domain boundary which would be the most transparent to input electrical interferences.",
    "Chapter 2: Applicable Test Procedures \n\nFor TSO-C153a authorization, an IMA module may be a single LRU platform or may be a module located into a Rack (Line Replaceable Module). Depending on the IMA module characteristics, consider one of the listed cases:",
    "- \nCase 1: The IMA module is a single LRU platform, \n- \nCase 2: The IMA module is a module designed to be located in a Rack at installation. \n \nNote:  Rack Housing module is not addressed in this generic  \nappendix but is addressed in Appendix 2.2 Class RH - Rack Housing.",
    "Chapter 2.1: The IMA module is a single LRU platform In this case, the environmental sections defined in the Table below are applicable to the IMA module. The usage domain of IMA module must be defined and maintained so that all these environmental qualification tests produce a complete credit for other functional TSOs authorization at the Type-Certificate level.",
    "| Environmental Test                 | DO-160section    | Requirement                    |\n|------------------------------------|------------------|--------------------------------|\n| for TSO-                           |                  |                                |\n| C153a                              |                  |                                |\n| Temperature                        | 4.5              | Mandatory                      |",
    "| Temperature                        | 4.5              | Mandatory                      |\n| Altitude                           | 4.6              | Mandatory                      |\n| Temperature Variation              | 5.0              | Mandatory                      |\n| Humidity                           | 6.0              | Mandatory                      |\n| Shock (operational)                | 7.2              | Mandatory                      |",
    "| Shock (operational)                | 7.2              | Mandatory                      |\n|                                    |                  |                                |\n| Shock (Crash Safety)               | 7.3              | Optional                       |\n|                                    |                  |                                |\n| Vibration                          | 8.0              | Mandatory                      |",
    "| Vibration                          | 8.0              | Mandatory                      |\n| Explosion Atmosphere               | 9.0              | Optional                       |\n| Waterproof                         | 10.0             | Optional                       |\n| Fluids Susceptibility              | 11.0             | Optional                       |\n| Sand and Dust                      | 12.0             | Optional                       |",
    "| Sand and Dust                      | 12.0             | Optional                       |\n| Fungus Resistance                  | 13.0             | Optional                       |\n| Salt Fog                           | 14.0             | Optional                       |\n| Magnetic Effect                    | 15.0             | Mandatory                      |\n| Power Input                        | 16.0             | Mandatory                      |",
    "| Power Input                        | 16.0             | Mandatory                      |\n| Voltage Spike                      | 17.0             | Mandatory                      |\n| 18.0                               | Mandatory        | Audio Frequency Conducted      |\n| Susceptibility—Power Input         |                  |                                |\n| Induced Signal Susceptibility      | 19.0             | Mandatory                      |",
    "| Induced Signal Susceptibility      | 19.0             | Mandatory                      |\n| 20.0                               | Mandatory        | Radio Frequency Susceptibility |\n| (Radiated and conduced)            |                  |                                |\n| Emission of Radio Frequency Energy | 21.0             | Mandatory                      |\n| 22.0                               | Mandatory        | Lightning Induced Transient    |",
    "| 22.0                               | Mandatory        | Lightning Induced Transient    |\n| Susceptibility                     |                  |                                |\n| Lightning Direct Effects           | 23.0             | Optional                       |\n| Icing                              | 24.0             | Optional                       |\n| Electro Static Discharge (ESD)     | 25.0             | Mandatory                      |",
    "| Electro Static Discharge (ESD)     | 25.0             | Mandatory                      |\n| Fire, Flammability                 | 26.0             | Mandatory                      |",
    "Chapter 2.2:  The IMA module is a module designed to be located into a Rack at installation or the rack itself.",
    "In this type of installation, only a minimal subset of environmental conditions is applicable to the IMA module. This minimal subset is defined as mandatory in the table below (See Figure 27.) Test sections identified as optional are not required for TSO-C153a application, but may be subjected to these test conditions on a voluntary basis. When optional sections are not tested, they shall be marked as X. Complete the Environmental Qualification Testing after the cabinet integration in the frame",
    "as X. Complete the Environmental Qualification Testing after the cabinet integration in the frame of other TSO authorizations (functional ones) and during Type Certificate.",
    "Define and maintain the usage domain of the IMA module to allow the subset of qualification tests to provide credit for other TSOs authorization and Type-Certificate programs. It is acceptable to perform the environmental qualification on the intended rack installation equipped with mounted IMA module(s). The TSO-C153a IMA module",
    "should be set in worst-case configurations. Doing so, the set of Qualification documents (Qualification Test Plans, Procedures and Reports) may be common to the rack and  \nmodule TSO-C153a authorizations. These documents should demonstrate that the considered configurations (which may be different depending on RTCA DO-160 section) \nare the worst-cases for the set of authorized configurations of modules within the rack.",
    "Whatever the qualification method, the authorized configuration should be specified in the installation manual(s). Such documented authorized configurations include any installation limitations taken as hypothesis for Environmental Qualification Testing (rack part number(s), slot number(s), blade neighborhood(s), and temperature to be guaranteed) to be specified in the Installation Manual and respected by the integrator to take credit of the Environmental Qualification Testing performed at",
    "respected by the integrator to take credit of the Environmental Qualification Testing performed at module level.",
    "| Environmental Test    | DO-160 section    | Requirement for TSO-C153a     |\n|-----------------------|-------------------|-------------------------------|\n\nTemperature \n4.5 \nMandatory When module performance over environmental conditions is dependent on the host rack, it is the responsibility of the applicant to adapt DO-160DO-160 temperature high and low values and temperature variations cycle to the intended IMA module installation context.",
    "| Environmental Test    | DO-160 section    | Requirement for TSO-C153a     |\n|-----------------------|-------------------|-------------------------------|",
    "For example, in case of temperature testing (RTCA \nDO-160 DO-160 section 4.0), the temperature environment of the module (inside a rack) may be much higher or lower than the equipment level condition expressed in RTCA DO-160 DO-160 section 4.0. The applicant may therefore qualify their IMA module based on a chosen intended environment, and, finally, indicate in the installation manual the temperature range for which the good operation of the IMA module is guaranteed.",
    "| Altitude    | 4.6    | Mandatory    |\n|-------------|--------|--------------|",
    "Temperature Variation \n5.0 \nMandatory As for section 4.5, when module performance over environmental conditions is dependent on the host rack, it is the responsibility of the applicant to adapt DO-",
    "160DO-160 temperature high and low values and temperature variations cycle to the intended IMA module installation context. As for section 4.5, for example, in case of temperature testing (RTCA DO-160 DO-160 section 4.0), the temperature environment of the module (inside a rack) may be much higher or lower than the equipment level condition expressed in RTCA DO-160 DO-160 section 4.0, the applicant can qualify their IMA module based on a chosen intended environment, and, finally, indicate in",
    "can qualify their IMA module based on a chosen intended environment, and, finally, indicate in the installation manual the temperature range for which the good operation of the IMA module is guaranteed.",
    "| Humidity                                           |   6.0  |\n|----------------------------------------------------|--------|\n| Shock (operational)                                |    7.2 |\n| -                                                  |        |\n|                                                    |        |\n| This testing is not performed as part of this TSO. |        |\n| -                                                  |        |",
    "| -                                                  |        |\n|                                                    |        |\n| Mark the TSO environmental qualification form      |        |\n| Category X (not tested) for this section.          |        |\n| -                                                  |        |\n|                                                    |        |\n| Perform these tests as part of a functional TSO    |        |",
    "| Perform these tests as part of a functional TSO    |        |\n| application or as part of a type certification     |        |\n| program.                                           |        |\n| Shock (Crash Safety)                               |    7.3 |\n| To mark the TSO environmental qualification        |        |\n| form for this section:                             |        |\n| -                                                  |        |",
    "| -                                                  |        |\n|                                                    |        |\n| The manufacturer must install equivalent weights   |        |\n| or actual modules in all module positions.         |        |\n| -                                                  |        |\n|                                                    |        |\n| Since applying crash safety tests may damage       |        |",
    "| Since applying crash safety tests may damage       |        |\n| Environmental Test                                 |   DO-160 section  |\n|----------------------------------------------------|-------------------|\n| equipment under test, this test may be conducted   |                   |\n| last.                                              |                   |\n| Vibration                                          |                 8 |",
    "| Vibration                                          |                 8 |\n| -                                                  |                   |\n|                                                    |                   |\n| This testing is not performed as part of this TSO. |                   |\n| -                                                  |                   |\n|                                                    |                   |",
    "|                                                    |                   |\n| Mark the TSO environmental qualification form      |                   |\n| Category X (not tested) for this section.          |                   |\n| -                                                  |                   |\n|                                                    |                   |\n| Perform these tests as part of a functional TSO    |                   |",
    "| Perform these tests as part of a functional TSO    |                   |\n| application or as part of a type certification     |                   |\n| program.                                           |                   |",
    "Note: the IMA module technology should be assessed for further DO-160DO-160 vibration qualification. This preliminary assessment could consider the IMA module components technology diversity, integration density and number of layers of the circuit boards within the IMA module. The assessment could be confirmed with testing on a module representative of the IMA module technology used in the product under certification. This preliminary assessment under vibration of the IMA module technology",
    "under certification. This preliminary assessment under vibration of the IMA module technology doesn't constitute a credit of the qualification testing of the module integrated into the rack.",
    "| Explosion Atmosphere                               |   9.0  |\n|----------------------------------------------------|--------|\n| -                                                  |        |\n|                                                    |        |\n| This testing is not performed as part of this TSO. |        |\n| -                                                  |        |\n|                                                    |        |",
    "|                                                    |        |\n| Mark the TSO environmental qualification form      |        |\n| Category X (not tested) for this section.          |        |\n| -                                                  |        |\n|                                                    |        |\n| Perform these tests as part of a functional TSO    |        |\n| application or as part of a type certification     |        |",
    "| application or as part of a type certification     |        |\n| program                                            |        |\n| Waterproof                                         |     10 |\n| -                                                  |        |\n|                                                    |        |\n| This testing is not performed as part of this TSO. |        |\n| -                                                  |        |",
    "| -                                                  |        |\n|                                                    |        |\n| Mark the TSO environmental qualification form      |        |\n| Category X (not tested) for this section.          |        |\n| -                                                  |        |\n|                                                    |        |\n| Perform these tests as part of a functional TSO    |        |",
    "| Perform these tests as part of a functional TSO    |        |\n| application or as part of a type certification     |        |\n| program                                            |        |\n| Fluids Susceptibility                              |     11 |\n| -                                                  |        |\n|                                                    |        |\n| This testing is not performed as part of this TSO. |        |",
    "| This testing is not performed as part of this TSO. |        |\n| -                                                  |        |\n|                                                    |        |\n| Mark the TSO environmental qualification form      |        |\n| Category X (not tested) for this section.          |        |\n| -                                                  |        |\n|                                                    |        |",
    "|                                                    |        |\n| Perform these tests as part of a functional TSO    |        |\n| application or as part of a type certification     |        |\n| program                                            |        |\n| Sand and Dust                                      |     12 |\n| -                                                  |        |\n|                                                    |        |",
    "|                                                    |        |\n| This testing is not performed as part of this TSO. |        |\n| -                                                  |        |\n|                                                    |        |\n| Mark the TSO environmental qualification form      |        |\n| Category X (not tested) for this section.          |        |\n| -                                                  |        |",
    "| -                                                  |        |\n|                                                    |        |\n| Perform these tests as part of a functional TSO    |        |\n| application or as part of a type certification     |        |\n| program                                            |        |\n| Fungus Resistance                                  |     13 |\n| -                                                  |        |",
    "| -                                                  |        |\n|                                                    |        |\n| This testing is not performed as part of this TSO. |        |\n| -                                                  |        |\n|                                                    |        |\n| Mark the TSO environmental qualification form      |        |\n| Category X (not tested) for this section.          |        |",
    "| Category X (not tested) for this section.          |        |\n| Environmental Test                                       | DO-160 section                                       | Requirement for TSO-C153a                    |\n|----------------------------------------------------------|------------------------------------------------------|----------------------------------------------|",
    "| -                                                        |                                                      |                                              |\n|                                                          |                                                      |                                              |\n| Perform these tests as part of a functional TSO          |                                                      |                                              |",
    "| application or as part of a type certification           |                                                      |                                              |\n| program                                                  |                                                      |                                              |\n| Salt Fog                                                 | 14.0                                                 |                                              |",
    "| -                                                        |                                                      |                                              |\n|                                                          |                                                      |                                              |\n| This testing is not performed as part of this TSO.       |                                                      |                                              |",
    "| -                                                        |                                                      |                                              |\n|                                                          |                                                      |                                              |\n| Mark the TSO environmental qualification form            |                                                      |                                              |",
    "| Category X (not tested) for this section.                |                                                      |                                              |\n| -                                                        |                                                      |                                              |\n|                                                          |                                                      |                                              |",
    "| Perform these tests as part of a functional TSO          |                                                      |                                              |\n| application or as part of a type certification           |                                                      |                                              |\n| program                                                  |                                                      |                                              |",
    "| Magnetic Effect                                          | 15.0                                                 |                                              |\n| -                                                        |                                                      |                                              |\n|                                                          |                                                      |                                              |",
    "| This testing is not performed as part of this TSO.       |                                                      |                                              |\n| -                                                        |                                                      |                                              |\n|                                                          |                                                      |                                              |",
    "| Mark the TSO environmental qualification form            |                                                      |                                              |\n| Category X (not tested) for this section                 |                                                      |                                              |\n| -                                                        |                                                      |                                              |",
    "|                                                          |                                                      |                                              |\n| Perform these tests as part of a functional TSO          |                                                      |                                              |\n| application or as part of a type certification           |                                                      |                                              |",
    "| program                                                  |                                                      |                                              |\n| Power Input                                              | 16.0                                                 | Mandatory for IMA module interfaces directly |\n| connected to aircraft power distribution.                |                                                      |                                              |",
    "|                                                          |                                                      |                                              |\n| Note:                                                    |                                                      |                                              |\n| IMA module interfaces not directly connected to          |                                                      |                                              |",
    "| aircraft power distribution will be tested after cabinet |                                                      |                                              |\n| integration phase as part of another TSO application or  |                                                      |                                              |\n| as part of a Type-Certification program.                 |                                                      |                                              |",
    "| Voltage Spike                                            | 17.0                                                 | Mandatory for IMA module interfaces directly |\n| connected to aircraft power distribution.                |                                                      |                                              |\n|                                                          |                                                      |                                              |",
    "| Note:                                                    |                                                      |                                              |\n| IMA module interfaces not directly connected to          |                                                      |                                              |\n| aircraft power distribution will be tested after cabinet |                                                      |                                              |",
    "| integration phase as part of another TSO application or  |                                                      |                                              |\n| as part of a Type-Certification program.                 |                                                      |                                              |\n| Audio Frequency                                          |                                                      |                                              |",
    "| Conducted                                                |                                                      |                                              |\n| Susceptibility—Power                                     |                                                      |                                              |\n| Input                                                    |                                                      |                                              |",
    "| 18.0                                                     | Mandatory for IMA module interfaces directly         |                                              |\n| connected to aircraft power distribution.                |                                                      |                                              |\n|                                                          |                                                      |                                              |",
    "| Note                                                     |                                                      |                                              |\n| : IMA module interfaces not directly connected to        |                                                      |                                              |\n| aircraft power distribution will be tested after cabinet |                                                      |                                              |",
    "| integration phase as part of another TSO application or  |                                                      |                                              |\n| as part of a Type-Certification program.                 |                                                      |                                              |\n| Induced Signal                                           |                                                      |                                              |",
    "| Susceptibility                                           |                                                      |                                              |\n| 19.0                                                     | Mandatory for IMA module interfaces directly         |                                              |\n| connected to aircraft wiring.                            |                                                      |                                              |",
    "|                                                          |                                                      |                                              |\n| Note:                                                    |                                                      |                                              |\n| IMA module interfaces not directly connected to          |                                                      |                                              |",
    "| aircraft wiring will be tested after cabinet integration |                                                      |                                              |\n| phase as part of another TSO application or as part of a |                                                      |                                              |\n| Type-Certification program.                              |                                                      |                                              |",
    "| Radio Frequency                                          |                                                      |                                              |\n| Susceptibility (Radiated                                 |                                                      |                                              |\n| and conducted)                                           |                                                      |                                              |",
    "| 20.0                                                     | Mandatory for conducted susceptibility of IMA module |                                              |\n| interfaces directly connected to aircraft wiring.        |                                                      |                                              |\n|                                                          |                                                      |                                              |",
    "| Environmental Test                                       | DO-160 section                                   | Requirement for TSO-C153a     |\n|----------------------------------------------------------|--------------------------------------------------|-------------------------------|\n| Note:                                                    |                                                  |                               |",
    "| IMA module interfaces not directly connected to          |                                                  |                               |\n| aircraft wiring will be tested after cabinet integration |                                                  |                               |\n| phase as part of another TSO application or as part of a |                                                  |                               |",
    "| Type-Certification program.                              |                                                  |                               |\n| Emission of Radio                                        |                                                  |                               |\n| Frequency Energy                                         |                                                  |                               |",
    "| 21.0                                                     | Mandatory for conducted emission of IMA module   |                               |\n| interfaces directly connected to aircraft wiring.        |                                                  |                               |\n|                                                          |                                                  |                               |",
    "| Note:                                                    |                                                  |                               |\n| IMA module interfaces not directly connected to          |                                                  |                               |\n| aircraft wiring will be tested after cabinet integration |                                                  |                               |",
    "| phase as part of another TSO application or as part of a |                                                  |                               |\n| Type Certification program.                              |                                                  |                               |\n| Lightning Induced                                        |                                                  |                               |",
    "| Transient Susceptibility                                 |                                                  |                               |\n| 22.0                                                     | Mandatory for IMA module interfaces directly     |                               |\n| connected to aircraft wiring.                            |                                                  |                               |",
    "|                                                          |                                                  |                               |\n| Note:                                                    |                                                  |                               |\n| IMA module interfaces not directly connected to          |                                                  |                               |",
    "| aircraft wiring will be tested after cabinet integration |                                                  |                               |\n| phase as part of another TSO application or as part of a |                                                  |                               |\n| Type Certification program.                              |                                                  |                               |",
    "| Lightning Direct Effects                                 | 23.0                                             |                               |\n| -                                                        |                                                  |                               |\n|                                                          |                                                  |                               |",
    "| This testing is not performed as part of this TSO.       |                                                  |                               |\n| -                                                        |                                                  |                               |\n|                                                          |                                                  |                               |",
    "| Mark the TSO environmental qualification form            |                                                  |                               |\n| Category X (not tested) for this section.                |                                                  |                               |\n| Perform these tests as part of a functional TSO          |                                                  |                               |",
    "| application or as part of a type certification program   |                                                  |                               |\n| Icing                                                    | 24.0                                             |                               |\n| -                                                        |                                                  |                               |",
    "|                                                          |                                                  |                               |\n| This testing is not performed as part of this TSO.       |                                                  |                               |\n| -                                                        |                                                  |                               |",
    "|                                                          |                                                  |                               |\n| Mark the TSO environmental qualification form            |                                                  |                               |\n| Category X (not tested) for this section.                |                                                  |                               |",
    "| -                                                        |                                                  |                               |\n|                                                          |                                                  |                               |\n| Perform these tests as part of a functional TSO          |                                                  |                               |",
    "| application or as part of a type certification           |                                                  |                               |\n| program                                                  |                                                  |                               |\n| Electro Static Discharge                                 |                                                  |                               |",
    "| (ESD)                                                    |                                                  |                               |\n| 25.0                                                     | Mandatory for all areas subject to human contact |                               |\n| during IMA module operation.                             |                                                  |                               |",
    "| Fire, Flammability                                       | 26.0                                             | Mandatory                     |\n|                                                          |                                                  |                               |",
    "## Chapter 3: Mps Compliance During Environmental Qualification Testing\n\nWhen required by the test condition and procedure (by 'DETERMINE COMPLIANCE \nWITH EQUIPEMENT PERFORMANCE STANDARDS' statement), IMA module manufacturers must determine compliance with the MPS as defined in column 'Test under environmental conditions' of each individual class in Appendix 2:",
    "| MPS CLASS                                     | MPS paragraph under Environmental                    |\n|-----------------------------------------------|------------------------------------------------------|\n| Qualification Testing                         |                                                      |\n| All Classes (Common)                          | Appendix 2.1 paragraph 5                             |",
    "| RH (Rack)                                     | This Appendix 4 is not applicable to this class. See |\n| Appendix 2.2 paragraph 3 columns 'Test Under  |                                                      |\n| Environmental conditions' and 'Applicable DO- |                                                      |\n| 160DO-160 sections'.                          |                                                      |",
    "| PR (Processing)                               | Appendix 2.3 paragraph 3                             |\n| GP (Graphical Processing)                     | Appendix 2.4 paragraph 3                             |\n| DS (Data Storage)                             | Appendix 2.5 paragraph 3                             |\n| IF (Interface)                                | Appendix 2.6 paragraph 2                             |",
    "| PS (Power Supply)                             | Appendix 2.7 paragraph 3                             |\n| DH (Display Head)                             | Appendix 2.8 paragraph 6                             |\n|                                               |                                                      |"
  ]
}