{
  "source": "TSO-C119e.md",
  "chunks": [
    "# Department Of Transportation Federal Aviation Administration Aircraft Certification Service\n\nWashington, D.C. \n\n \nEffective  \nDate:  06/30/16 \n \n\n# Technical Standard Order Subject: Traffic Alert And Collision Avoidance System (Tcas) Airborne Equipment, Tcas Ii With Hybrid Surveillance",
    "1. PURPOSE. This technical standard order (TSO) is for manufacturers applying for a TSO \nauthorization (TSOA) or letter of design approval (LODA).  In it, we (the Federal Aviation Administration (FAA)) tell you what minimum performance standards (MPS) your traffic alert and collision avoidance system II (TCAS II) must first meet for approval and identification with the applicable TSO marking. \n\n \n\n## 2. Applicability. This Tso Affects New Applications Submitted After Its Effective Date.",
    "## 2. Applicability. This Tso Affects New Applications Submitted After Its Effective Date.\n\n \na. TSO-C119d will also remain effective until December 31, 2017.  After this date, we will no longer accept applications for TSO-C119d. \n\n \nb. TCAS II approved under a previous TSOA may still be manufactured under the provisions of their original approval.",
    "3. REQUIREMENTS. New models of TCAS II identified and manufactured on or after the effective date of this TSO must meet the MPS qualification and documentation requirements in these RTCA, Inc. documents:  1) RTCA/DO-185B, Minimum Operational Performance Standards for Traffic Alert and Collision Avoidance System II (TCAS II), dated June 19, 2008, Section 2, as modified by Change 1 dated July 1, 2009; Change 2 dated March 20, 2013, and appendix 1 of this TSO; and 2)  RTCA/DO-300A, Minimum",
    "1, 2009; Change 2 dated March 20, 2013, and appendix 1 of this TSO; and 2)  RTCA/DO-300A, Minimum Operational Performance Standards for Traffic Alert and Collision Avoidance System II (TCAS II) Hybrid Surveillance, dated March 20, 2013, section 2, as modified by Change 1 dated December 15, 2015 and appendix 2 of this TSO.",
    "a. **Functionality.**  This TSO's standards apply to equipment intended to be used in transponder equipped aircraft to provide a reliable traffic alert and collision avoidance function. \n\n \nb .  **Failure Condition Classification.**  Failure of the function defined in paragraph **3.a** of this \nTSO is a *hazardous/severe-major* failure condition.  Develop the TCAS II to at least the design assurance level equal to this failure condition classification.",
    "c. Functional Qualification.  Demonstrate the required performance under the test conditions in RTCA/DO-185B, Section 2 as modified by Change 1 and Change 2, and RTCA/DO-300A, Section 2 \nas modified by Change 1.",
    "d. Environmental Qualification. Demonstrate the required performance under the test conditions specified in RTCA/DO-185B Section 2.3 using standard environmental conditions and test procedures appropriate for airborne equipment.  You may use a different standard environmental condition and test procedure than RTCA/DO-160G, Environmental Conditions and Test Procedures for Airborne Equipment, dated December 8, 2010, provided the standard is appropriate for the TCAS \nII airborne equipment.",
    "Note: The use of RTCA/DO-160D (with Changes 1 and 2 only, without change 3 incorporated) or earlier versions is generally not considered appropriate and will require substantiation via the deviation process as discussed in paragraph **3.g** of this TSO.",
    "e.  Software Qualification.  If the article includes software, develop the software according to RTCA, Inc. document RTCA/DO-178C, Software Considerations in Airborne Systems and Equipment Certification, dated December 13, 2011, including referenced supplements as applicable, to at least the software level consistent with the failure condition classification defined in paragraph \n3.b of this TSO. You may also develop the software according to RTCA, Inc. document RTCA/DO-",
    "3.b of this TSO. You may also develop the software according to RTCA, Inc. document RTCA/DO-\n178B, dated December 1, 1992, if you follow the guidance in Advisory Circular (AC) 20-115C, Airborne Software Assurance, dated July 19, 2013.",
    "f.  **Electronic Hardware Qualification.**  If the article includes complex custom airborne electronic hardware, develop the component according to RTCA, Inc. Document RTCA/DO-254, Design Assurance Guidance for Airborne Electronic Hardware, dated April 19, 2000, to at least the design assurance level consistent with the failure condition classification defined in paragraph **3.b** of this TSO.  For custom airborne electronic hardware determined to be simple, RTCA/DO-254, paragraph 1.6 applies.",
    "g.  **Deviations**.  We have provisions for using alternate or equivalent means of compliance to the criteria in the MPS of this TSO.  If you invoke these provisions, you must show that your equipment maintains an equivalent level of safety.  Apply for a deviation under the provisions of 14 CFR § 21.618. \n\n \n\n## 4. Marking.",
    "## 4. Marking.\n\na.  Mark at least one major component permanently and legibly with all the information in \n14 CFR § 45.15(b).  Use serial number in place of optional date of manufacture as stated in  \n14 CFR §45.15(b)(2). \n\n \nb.  Also, mark the following permanently and legibly, with at least the manufacturer's name, subassembly part number, and the TSO number:",
    "(1)  Each component that is easily removable (without hand tools), and, \n \n \n(2)  Each subassembly of the article that you determined may be interchangeable. \n\n \nc.   If the article includes software and/or airborne electronic hardware, then the article part numbering scheme must identify the software and airborne electronic hardware configuration.  The part numbering scheme can use separate, unique part numbers for software, hardware, and airborne electronic hardware.",
    "d.  You may use electronic part marking to identify software or airborne electronic hardware components by embedding the identification within the hardware component itself (using software) rather than marking it on the equipment nameplate.  If electronic marking is used, it must be readily accessible without the use of special tools or equipment.",
    "5. APPLICATION DATA REQUIREMENTS.  You must give the FAA aircraft certification office (ACO) manager responsible for your facilities a statement of conformance, as specified 14 \nCFR § 21.603(a)(1) and one copy each of the following technical data to support your design and production approval.  LODA applicants must submit the same data (excluding paragraph 5.g) \nthrough their civil aviation authority. \n\n \na.  A Manual(s) containing the following:",
    "a.  A Manual(s) containing the following: \n\n \n(1)  Operating instructions and article limitations sufficient to describe the equipment's operational capability. \n\n \n(2)  Describe in detail any deviations.",
    "(2)  Describe in detail any deviations. \n\n \n(3)  Installation procedures and limitations sufficient to ensure that the TCAS II, when installed according to the installation or operational procedures, still meets this TSO's requirements.  \nLimitations must identify any unique aspects of the installation.  The limitations must include a note with the following statement:",
    "\"This article meets the minimum performance and quality control \nstandards required by a technical standard order (TSO).  \nInstallation of this article requires separate approval.\" \n \n(4)  For each unique configuration of software and airborne electronic hardware, reference the following:",
    "(a)  Software part number including revision and design assurance level; \n \n(b)  Airborne electronic hardware part number including revision and design assurance \nlevel; and, \n \n(c) Functional description. \n \n(5)  A summary of the test conditions used for environmental qualifications for each component of the article.  For example, a form as described in RTCA/DO-160G, Environmental Conditions and Test Procedures for Airborne Equipment, Appendix A.",
    "(6)  Schematic drawings, wiring diagrams, and any other documentation necessary for installation of the TCAS II. \n\n \n(7)  List of replaceable components, by part number, that makes up the TCAS II.  Include vendor part number cross-references, when applicable. \n\nb.  Instructions covering periodic maintenance, calibration, and repair, to ensure that the TCAS II continues to meet the TSO approved design.  Include recommended inspection intervals and service life, as appropriate.",
    "c.  If the article includes software: a plan for software aspects of certification (PSAC), software configuration index, and software accomplishment summary.   \n \nd.  If the article includes simple or complex custom airborne electronic hardware, a plan for hardware aspects of certification (PHAC), hardware verification plan, top-level drawing, and hardware accomplishment summary (or similar document, as applicable).",
    "e.  A drawing depicting how the article will be marked with the information required by paragraph 4 of this TSO.",
    "f.  Identify functionality or performance contained in the article not evaluated under paragraph \n3 of this TSO (that is, non-TSO functions).  Non-TSO functions are accepted in parallel with the TSO authorization.  For those non-TSO functions to be accepted, you must declare these functions and include the following information with your TSO application:",
    "(1)  Description of the non-TSO function(s), such as performance specifications, failure condition classifications, software, hardware, and environmental qualification levels.  Include a statement confirming that the non-TSO function(s) don't interfere with the article's compliance with the requirements of paragraph 3.",
    "(2)  Installation procedures and limitations sufficient to ensure that the non-TSO function(s) \nmeets the declared functions and performance specification(s) described in paragraph **5.f.(1)**. \n\n \n(3)  Instructions for continued performance applicable to the non-TSO function(s) described in paragraph **5.f.(1)**. \n\n \n(4)  Interface requirements and applicable installation test procedures to ensure compliance with the performance data defined in paragraph **5.f.(1)**.",
    "(5)  Test plans, analysis and results, as appropriate, to verify that performance of the hosting TSO article is not affected by the non-TSO function(s). \n\n \n(6)  Test plans, analysis and results, as appropriate, to verify the function and performance of the non-TSO function(s) as described in paragraph **5.f.(1)**.",
    "g.  The quality system description required by 14 CFR § 21.608 including functional test specifications.  The quality system should ensure that you will detect any change to the approved design that could adversely affect compliance with the TSO MPS, and reject the item accordingly.  \n(Not required for LODA applicants.)",
    "h.  Material and process specifications list. \n \ni.  List of all drawings and processes (including revision level) that define the article's design. \n \nj.  Manufacturer's TSO qualification report showing results of testing accomplished according to \nparagraph **3.c** of this TSO.",
    "k.  To address failure characteristics associated with the hybrid surveillance functionality, the TCAS installation guidance must include information alerting an installer of the requirement for either a failure annunciation on the flight deck when hybrid surveillance functionality has failed or a scheduled maintenance task to verify hybrid surveillance is (and has been) functional.  For installations that do not annunciate to the pilot on the flight deck when the hybrid functionality has",
    "that do not annunciate to the pilot on the flight deck when the hybrid functionality has failed, the manufacturer must provide:",
    "(1)  The recommended interval for a scheduled maintenance check; and, \n \n(2)  The recommended procedure for performing that task. \n6. MANUFACTURER DATA REQUIREMENTS.  Besides the data given directly to the responsible ACO, have the following technical data available for review by the responsible ACO: \n\n \na.  Functional qualification specifications for qualifying each production article to ensure compliance with this TSO.",
    "b.  Article calibration procedures. \n \nc.  Schematic drawings. \n \nd.  Wiring diagrams. \n \ne.  Material and process specifications. \n \nf.  The results of the environmental qualification tests conducted according to paragraph **3.d** of \nthis TSO.",
    "this TSO. \n \ng.  If the article includes software, the appropriate documentation defined in the version of RTCA/DO-178 specified by paragraph 3.e of this TSO, including all data supporting the applicable objectives in Annex A, Process Objectives and Outputs by Software Level.",
    "h.  If the article includes complex custom airborne electronic hardware, the appropriate hardware life cycle data in combination with design assurance level, as defined in RTCA/DO-254, Appendix A, Table A-l.  For simple custom airborne electronic hardware, the following data:  test cases or procedures, test results, test coverage analysis, tool assessment and qualification data, and configuration management records, including problem reports.",
    "i.  If the article contains non-TSO function(s), the manufacturer must also make available items **6.a** through **6.h** as they pertain to the non-TSO function(s). \n\n \n\n## 7. Furnished Data Requirements.",
    "## 7. Furnished Data Requirements.\n\n \na.  If furnishing one or more articles manufactured under this TSO to one entity (such as an operator or repair station), provide one copy or on-line access to the data in paragraphs **5.a, 5.b** and 5.k of this TSO.  Add any other data needed for the proper installation, certification, use, or for continued compliance with the TSO, of the TCAS II.",
    "b.  If the article contains declared non-TSO function(s), include one copy of the data in paragraphs **5.f(1)** through **5.f(4).** \n \n\n## 8. How To Get Referenced Documents.\n\n \na.  Order RTCA documents from RTCA Inc., 1150 18th Street NW, Suite 910, Washington, D.C. 20036.  Telephone (202) 833-9339, fax (202) 833-9434.  You can also order copies online at www.rtca.org.",
    "b.  Order copies of 14 CFR parts 21 and 45 from the Superintendent of Documents, Government Publishing Office, P.O. Box 979050, St. Louis, MO 63197.  Telephone (202) 512-1800, fax (202) \n512-2104.  You can also order copies online at bookstore.gpo.gov.  \n \nc.  You can find a current list of technical standard orders and advisory circulars on the FAA \nInternet website Regulatory and Guidance Library at rgl.faa.gov.  You will also find the TSO Index of Articles at the same site.",
    "Richard E. Jennings Acting Manager, Design, Manufacturing, & Airworthiness Division Aircraft Certification Service \n \n\n## Appendix 1.  Faa Modifications To Rtca/Do-185B Change 2\n\n1.  This appendix lists FAA modifications to RTCA/DO-185B Change 2, *Minimum Operational* \nPerformance Standards for Traffic Alert and Collision Avoidance System II (TCAS II).",
    "1.1 \nWhen ownship is on the ground, clarification is required to allow the system to limit the output of TCAS intruders to the display to those within 3000 feet of own altitude.  In lieu of section 2.2.2, System Performance, of RTCA/DO-185B Change 2, substitute the following:",
    "2.2.2  \nSystem Performance \n \nNote:  When operating within the maximum aircraft transponder population and \nelectromagnetic interference levels defined in subparagraph 2.2.1.2, TCAS II \nwill provide a level of performance for active surveillance of targets-of-interest \nthat will support the requirements for generation of collision advisory information.",
    "that will support the requirements for generation of collision advisory information. \nSpecifically, TCAS II will generate a surveillance track in range and altitude on a target-of-interest at the range and with the track probability and range \naccuracy specified below.  This is to ensure that a correct resolution advisory can be issued in time for the pilot to maintain adequate vertical separation at closest-point-of-approach.",
    "TCAS II will also generate, whenever possible, a surveillance track in range and altitude on a target-of-interest at the range and with the track probability \nand range accuracy specified below such that a correct traffic advisory can be issued as a precursor to the resolution advisory. \nIn addition to the surveillance requirements to support generation of resolution and traffic advisories, TCAS II will display the range and, if available, the",
    "altitude and bearing position information on targets that generate advisories. The bearing position information will be generated according to the accuracy requirement specified below.",
    "TCAS II will also generate for display, whenever possible, surveillance range, altitude and bearing position information on Mode C and Mode S aircraft that are within the range specified below and within ±10,000 ft altitude relative to TCAS II when airborne, and within ±3,000 ft altitude relative to TCAS II when on the ground.",
    "It is acceptable to limit the output of TCAS intruders to the display to those within 3000 feet of own altitude when own aircraft is on the ground.  This is permitted (but not required) so that the altitude surveillance volume for TCAS Mode C intruders can be consistent with the Mode S surveillance altitude limits modified in RTCA/DO-185B Change 2 (section 2.2.4.6.2.2.1).  This allowance \nto limit the display to ±3000 feet does not modify surveillance altitude volumes",
    "to limit the display to ±3000 feet does not modify surveillance altitude volumes \nwhich are defined in RTCA/DO-185B section 2.2.4.6.",
    "The system shall use the definition of on-ground as defined in RTCA/DO-185B Volume II 2.1.14.  Alternatively, the system may use the definition of \n\"operating on Surface\" in RTCA/DO-300A section 2.2.8 for on-ground. \n\n## Appendix 2.  Faa Modifications To Rtca/Do-300A\n\n1.  This appendix lists FAA modifications to RTCA/DO-300A, *Minimum Operational* \nPerformance Standards for Traffic Alert and Collision Avoidance System II (TCAS II Hybrid Surveillance). \n\n1.1.",
    "1.1. \n\nTo facilitate maintenance personnel with monitoring of the hybrid surveillance functionality, add the following requirement as the fifth paragraph (including the Note) in section 2.2.10, Monitoring Requirements: \n\nTCAS II units shall provide a means for presenting logged hybrid surveillance faults to maintenance personnel to enable on-wing monitoring of hybrid surveillance functionality at periodic intervals.",
    "Note:  This requirement enables implementation of a scheduled maintenance task to ensure hybrid surveillance is functional on aircraft without a centralized warning system and/or an onboard maintenance computer."
  ]
}